#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Заказ", Заказ);
	
	Если Не ЗначениеЗаполнено(Заказ) Тогда
		Отказ = Истина;
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Отгрузка может быть вызвана только из документа ""Заказ на перемещение""'"));
		Возврат;
	КонецЕсли;
		
	Если ОбщегоНазначения.ЭтоМобильныйКлиент() Тогда
		Элементы.ЗапасыКолонки.Группировка = ГруппировкаКолонок.Вертикальная;
	КонецЕсли;
	
	НайтиСоздатьПеремещение();
	ЗаполнитьЗапасыИзДокумента();
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ТипыОборудования.СканерШтрихкода = Истина;
		МенеджерОборудования.ПриСозданииНаСервере(ЭтотОбъект, ТипыОборудования);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда  
			
			Если ТипЗнч(Параметр) <> Тип("Массив") Тогда
				Параметр = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметр);
			КонецЕсли;
			
			Данные = МенеджерОборудованияУНФКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			ПолученШтрихкод(Данные); 
	        
		КонецЕсли;  
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды командной панели табличной части.
&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ОчиститьСообщения();
	
	ТекШтрихкод = "";
	
	ОбработкаЗавершения = Новый ОписаниеОповещения(
		"ПоискПоШтрихкодуЗавершение",
		ЭтотОбъект, 
		Новый Структура("ТекШтрихкод", ТекШтрихкод));

	#Если МобильныйКлиент Тогда
	ОткрытьФорму("ОбщаяФорма.ФормаПоискаПоШтрихкоду", , , , , , ОбработкаЗавершения);
	#Иначе
	ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеДанных

&НаСервере
Процедура НайтиСоздатьПеремещение() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПеремещениеЗапасов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
		|ГДЕ
		|	ПеремещениеЗапасов.ЗаказНаПеремещение = &ЗаказНаПеремещение
		|	И НЕ ПеремещениеЗапасов.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПеремещениеЗапасов.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("ЗаказНаПеремещение", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Перемещение = Выборка.Ссылка;
	Иначе
		НовоеПеремещение = Документы.ПеремещениеЗапасов.СоздатьДокумент();
		НовоеПеремещение.Дата = ТекущаяДатаСеанса();
		НовоеПеремещение.Заполнить(Заказ);
		НовоеПеремещение.Запасы.Очистить();
		НовоеПеремещение.Записать(РежимЗаписиДокумента.Запись);
		Перемещение = НовоеПеремещение.Ссылка;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗапасыИзДокумента() 
	
	Объект.Запасы.Очистить();
	
	НовоеПеремещение = Документы.ПеремещениеЗапасов.СоздатьДокумент();
	
	НовоеПеремещение.Заполнить(Заказ);
	
	ТаблицаЗапасы = НовоеПеремещение.Запасы.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&Товары КАК Товары
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.НомерСтроки КАК НомерСтроки,
		|	ВТ_Запасы.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЕСТЬNULL(спВнешниеКартинкиТовара.ВнешняяСсылка, """")) КАК ВнешняяСсылка
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.спВнешниеКартинкиТовара КАК спВнешниеКартинкиТовара
		|		ПО ВТ_Запасы.Номенклатура.спАртикулПоставщика = спВнешниеКартинкиТовара.АртикулПоставщика
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Запасы.НомерСтроки,
		|	ВТ_Запасы.Номенклатура";
	
	Запрос.УстановитьПараметр("Товары", ТаблицаЗапасы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Для каждого Строка Из ТаблицаЗапасы Цикл
		
		НоваяСтрока = Объект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Выборка.НайтиСледующий(Новый Структура("НомерСтроки", Строка.НомерСтроки)) 
			И ЗначениеЗаполнено(Выборка.ВнешняяСсылка) Тогда
			
			АдресКартинки = спМодификацияКонфигурацииПереопределяемый.СсылкаНаДвоичныеДанныеКартинки(Выборка.ВнешняяСсылка, УникальныйИдентификатор);
			
			Если АдресКартинки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Картинка = Новый Картинка(ПолучитьИзВременногоХранилища(АдресКартинки));
			
			ОбрабатываемаяКартинка = Новый ОбрабатываемаяКартинка(Картинка);
			ОбрабатываемаяКартинка.УстановитьРазмер(60, );
			Картинка = ОбрабатываемаяКартинка.ПолучитьКартинку();
			
			НоваяСтрока.Картинка = ПоместитьВоВременноеХранилище(Картинка, УникальныйИдентификатор);
			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПоискПоШтрихкоду

// Процедура обрабатывает полученные штрихкоды.
//
&НаКлиенте
Процедура ПолученШтрихкод(ДанныеШтрихкодов) Экспорт
	
	Для каждого ДанныеШтрихкода Из ДанныеШтрихкодов Цикл
		
		ДополнительныеДанныеПоШтрихкоду = ШтрихкодированиеУНФКлиент.ДополнительныеДанныеПоШтрихкоду(ДанныеШтрихкода.Штрихкод,
		"");
		Если ДополнительныеДанныеПоШтрихкоду.ЭтоКодМаркировки Тогда
			ДанныеШтрихкода.Штрихкод = ДополнительныеДанныеПоШтрихкоду.EAN;
		ИначеЕсли ДополнительныеДанныеПоШтрихкоду.ЕстьРазделительGS1 Тогда
			ДанныеШтрихкода.Штрихкод = ДополнительныеДанныеПоШтрихкоду.ПредставлениеШтрихкода;
		Иначе
			// Действие не требуется
		КонецЕсли;
		
		ДанныеПоШтрихКодам = ПолучитьДанныеПоШтрихкодамВМассиве(ДанныеШтрихкода);
		
		МассивДанных = ДанныеПоШтрихкодам.Получить(ДанныеШтрихкода.Штрихкод);
		
		Штрихкод = ДанныеШтрихкода.Штрихкод;
		
		Если Не МассивДанных = Неопределено И МассивДанных.Количество() Тогда
			
			Если МассивДанных.Количество() > 1 Тогда
				ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПоДаннымШтрихкодовЗавершение", ЭтотОбъект);
				ПараметрыОткрытия = Новый Структура("МассивНоменклатуры, ТекШтрихкод", МассивДанных, ДанныеШтрихкода);
				ОткрытьФорму("Справочник.Номенклатура.Форма.ДублиНоменклатурыПоШтрихКоду", ПараметрыОткрытия, ЭтаФорма,,,,
				ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				Возврат;
			КонецЕсли;
			
			Номенклатура = МассивДанных[0].Номенклатура;
			
			ВыполнитьДействиеПриСканировании(Номенклатура);
			
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПриСканировании(Номенклатура)
	
	Фильтр = Новый Структура("Номенклатура", Номенклатура);
	НайденныеСтроки = Объект.Запасы.НайтиСтроки(Фильтр);
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		ДобавитьОтсканированныйТоварВПеремещение(Номенклатура, НайденныеСтроки[0].ПолучитьИдентификатор()); 
		ОповеститьОбИзменении(Перемещение);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьОтсканированныйТоварВПеремещение(Номенклатура, ИдентификаторСтроки)
	
	ПеремещениеОбъект = Перемещение.ПолучитьОбъект();

	ДанныеСтроки = Объект.Запасы.НайтиПоИдентификатору(ИдентификаторСтроки);
		
	Фильтр = Новый Структура("Номенклатура", Номенклатура);
	НайденныеСтроки = ПеремещениеОбъект.Запасы.НайтиСтроки(Фильтр);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		Строка = ПеремещениеОбъект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(Строка, ДанныеСтроки);
		Строка.Количество = 1;
		
	Иначе
		
		Строка = НайденныеСтроки[0];
		Строка.Количество = Строка.Количество + 1;
		
	КонецЕсли;
	
	Попытка
		ПеремещениеОбъект.Записать(РежимЗаписиДокумента.Проведение); 
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	ЗаполнитьЗапасыИзДокумента();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураДанныхПоУмолчанию(Номенклатура)
	
	ДанныеНоменклатуры = Новый Структура;
	ДанныеНоменклатуры.Вставить("Номенклатура", Номенклатура);
	ДанныеНоменклатуры.Вставить("ЕдиницаИзмерения", Номенклатура.ЕдиницаИзмерения);
	ДанныеНоменклатуры.Вставить("Цена", 0);
	ДанныеНоменклатуры.Вставить("КоличествоУчет", 0);
	ДанныеНоменклатуры.Вставить("Количество", 1);

	Возврат ДанныеНоменклатуры;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеНоменклатуры(Номенклатура, СтруктурнаяЕдиница)
	
	ДанныеНоменклатуры = СтруктураДанныхПоУмолчанию(Номенклатура);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТ_Товар
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Номенклатура = &Номенклатура) КАК ЗапасыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
		|ПОМЕСТИТЬ ВТ_Цены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&Дата,
		|			ВидЦен = &ВидЦен
		|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_Товар.Ссылка КАК Номенклатура,
		|	ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) КАК КоличествоУчет,
		|	1 КАК Количество,
		|	ЕСТЬNULL(ВТ_Цены.Цена, 0) КАК Цена,
		|	ВТ_Товар.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	ВТ_Товар КАК ВТ_Товар
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО ВТ_Товар.Ссылка = ВТ_Остатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
		|		ПО ВТ_Товар.Ссылка = ВТ_Цены.Номенклатура";
	
	Запрос.УстановитьПараметр("ВидЦен", Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи());
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Организация", Справочники.Организации.ОрганизацияПоУмолчанию());
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеНоменклатуры, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат ДанныеНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоДаннымШтрихкодовЗавершение(СтруктураНоменклатуры, Параметры) Экспорт 
	
	Если СтруктураНоменклатуры = Неопределено Тогда Возврат КонецЕсли;
	
	Номенклатура = СтруктураНоменклатуры.МассивНоменклатуры[0].Номенклатура;
	
	Если НЕ Номенклатура = Неопределено Тогда
		
		ВыполнитьДействиеПриСканировании(Номенклатура);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Результат = Неопределено, СокрЛП(ДополнительныеПараметры.ТекШтрихкод), СокрЛП(Результат));
	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
		ДанныеШтрихкода = Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1);
		ПолученШтрихкод(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеШтрихкода));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоШтрихкодамВМассиве(ДанныеШтрихкода, СтруктурнаяЕдиница = Неопределено)
	
	РегистрыСведений.ШтрихкодыНоменклатуры.ПреобразоватьВесовойШтрихкод(ДанныеШтрихкода);
	
	Штрихкоды = Новый Массив;
	Штрихкоды.Добавить(ДанныеШтрихкода);
	
	ДанныеПоШтрихкодам = Новый Соответствие;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Рег.Штрихкод КАК Штрихкод,
	|	Рег.Номенклатура КАК Номенклатура,
	|	Рег.Характеристика КАК Характеристика,
	|	Рег.Партия КАК Партия,
	|	Рег.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Рег
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (&СерииНоменклатурыИспользуются)
	|			И Рег.Номенклатура = СерииНоменклатуры.Владелец
	|			И (Рег.Номенклатура.ИспользоватьСерииНоменклатуры)
	|			И Рег.Штрихкод = СерииНоменклатуры.Наименование
	|ГДЕ
	|	Рег.Штрихкод В(&МассивШтрихкодов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗДанныеОВесовомТоваре.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ТЗДанныеОВесовомТоваре.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ТЗДанныеОВесовомТоваре.ШтрихКод КАК ШтрихКод
	|ПОМЕСТИТЬ ВременнаяТаблицаВесовойТовар
	|ИЗ
	|	&ТЗДанныеОВесовомТоваре КАК ТЗДанныеОВесовомТоваре
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыТоваровSKU.Номенклатура КАК Номенклатура,
	|	КодыТоваровSKU.Характеристика КАК Характеристика,
	|	КодыТоваровSKU.Партия КАК Партия,
	|	КодыТоваровSKU.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВременнаяТаблицаВесовойТовар.ШтрихКод КАК ШтрихКод,
	|	ВременнаяТаблицаВесовойТовар.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	|	ЕСТЬNULL(КодыТоваровSKU.Номенклатура.ВидАлкогольнойПродукции.Маркируемый, ЛОЖЬ)
	|		ИЛИ КодыТоваровSKU.Номенклатура.УдалитьТабачнаяПродукция КАК МаркируемаяПродукция
	|ИЗ
	|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаВесовойТовар КАК ВременнаяТаблицаВесовойТовар
	|		ПО КодыТоваровSKU.SKU = ВременнаяТаблицаВесовойТовар.КодВесовогоТовара
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (&СерииНоменклатурыИспользуются)
	|			И КодыТоваровSKU.Номенклатура = СерииНоменклатуры.Владелец
	|			И (КодыТоваровSKU.Номенклатура.ИспользоватьСерииНоменклатуры)
	|			И (ВременнаяТаблицаВесовойТовар.ШтрихКод = СерииНоменклатуры.Наименование)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаВесовойТовар.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ШтрихКод КАК ШтрихКод
	|ИЗ
	|	ВременнаяТаблицаВесовойТовар КАК ВременнаяТаблицаВесовойТовар");
	
	МассивШтрихкодов = Новый Массив;
	ТЗДанныеОВесовомТоваре = Новый ТаблицаЗначений;
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("КодВесовогоТовара", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный)));
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("ПрефиксВесовогоТовара", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200)));
	
	Для каждого ТекШтрихкод Из Штрихкоды Цикл
		
		МассивШтрихкодов.Добавить(ТекШтрихкод.ШтрихКод);

		ДанныеПоШтрихкодам.Вставить(ТекШтрихкод.ШтрихКод, Новый Массив);
		
		Если ТекШтрихкод.Свойство("КодВесовогоТовара") Тогда
			НоваяСтрокаОВесовомТоваре = ТЗДанныеОВесовомТоваре.Добавить();
			НоваяСтрокаОВесовомТоваре.КодВесовогоТовара = ТекШтрихкод.КодВесовогоТовара;
			НоваяСтрокаОВесовомТоваре.ПрефиксВесовогоТовара = ТекШтрихкод.ПрефиксВесовогоТовара;
			НоваяСтрокаОВесовомТоваре.Штрихкод = ТекШтрихкод.Штрихкод;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("МассивШтрихкодов", МассивШтрихкодов);
	ИспользоватьСерииНоменклатуры = СерииНоменклатурыУНФ.ИспользоватьСерииНоменклатурыОстатки();
	Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
		Запрос.УстановитьПараметр("СерииНоменклатурыИспользуются", Истина);
	Иначе
	    Запрос.УстановитьПараметр("СерииНоменклатурыИспользуются", Ложь);
	КонецЕсли;
	Запрос.УстановитьПараметр("ТЗДанныеОВесовомТоваре", ТЗДанныеОВесовомТоваре);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МассивДанныхПоШтрихкоду = ДанныеПоШтрихкодам[Выборка.Штрихкод];
		
		ТекДанные = Новый Структура;
		МассивДанныхПоШтрихкоду.Добавить(ТекДанные);
		
		ТекДанные.Вставить("Номенклатура", Выборка.Номенклатура);
		ТекДанные.Вставить("Характеристика", Выборка.Характеристика);
		ТекДанные.Вставить("Партия", Выборка.Партия);
		ТекДанные.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
		ТекДанные.Вставить("КодВесовогоТовара", Выборка.КодВесовогоТовара);
		ТекДанные.Вставить("ПрефиксВесовогоТовара", Выборка.ПрефиксВесовогоТовара);
		ТекДанные.Вставить("МаркируемаяПродукция", Выборка.МаркируемаяПродукция);
		ТекДанные.Вставить("НоменклатураПоставщика", Неопределено);
		
		Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
			ТекДанные.Вставить("Серия", Выборка.Серия);
		КонецЕсли;
	КонецЦикла;
	
	Выборка = МассивРезультатов[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МассивДанныхПоШтрихкоду = ДанныеПоШтрихкодам[Выборка.Штрихкод];
		
		ТекДанные = Новый Структура;
		МассивДанныхПоШтрихкоду.Добавить(ТекДанные);
		
		Если НЕ ТекДанные.Свойство("КодВесовогоТовара") Тогда
			ТекДанные.Вставить("Номенклатура", Выборка.Номенклатура);
			ТекДанные.Вставить("Характеристика", Выборка.Характеристика);
			ТекДанные.Вставить("Партия", Выборка.Партия);
			ТекДанные.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
			ТекДанные.Вставить("НоменклатураПоставщика", Неопределено);
			
			Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
				ТекДанные.Вставить("Серия", Выборка.Серия);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат ДанныеПоШтрихкодам;

КонецФункции

&НаСервереБезКонтекста
Функция ЗалИзНастроек()

	Ключ  = "ОбщиеНастройкиАРМов";
	
	Настройки = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(Ключ, Ключ, Новый Структура,, ИмяПользователя());
	
	Если Настройки.Свойство("Зал") Тогда
		Возврат Настройки.Зал;
	Иначе
		Возврат Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти //ПоискПоШтрихкоду

#КонецОбласти