
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Номенклатуры.Очистить();
	Если Параметры.Свойство("Номенклатура") Тогда 
		Для каждого НайденаяСтрока Из Параметры.Номенклатура Цикл
			НоваяСтрока = Номенклатуры.Добавить();
			НоваяСтрока.СсылкаНаОбъектДокумент                   	= НайденаяСтрока.СсылкаНаОбъектДокумент; 
			НоваяСтрока.ДатаИзмененияСтатусСообщенияНоменклатура    = НайденаяСтрока.ДатаИзмененияСтатусСообщенияНоменклатура;
			НоваяСтрока.СсылкаНаОбъектНоменклатура                  = НайденаяСтрока.СсылкаНаОбъектНоменклатура;
			НоваяСтрока.СтатусСообщенияНоменклатура                 = НайденаяСтрока.СтатусСообщенияНоменклатура;
			НоваяСтрока.Статус                 						= НайденаяСтрока.Статус;
			НоваяСтрока.Информация                                  = НайденаяСтрока.Информация; 
			
			Если ЗначениеЗаполнено(НайденаяСтрока.Информация) И ТипЗнч(НайденаяСтрока.Информация) = Тип("Строка") Тогда 
				НоваяСтрока.ТекстоваяИнформацияОшибки               = ПолучитьИнформациюОшибки(НайденаяСтрока.Информация); 
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьИнформациюОшибки(Информация) 
	СообщенииеОшибки = "";
	СерилизированаяИнформация = ДесериализоватьИзJSON(Информация);  
	Если ТипЗнч(СерилизированаяИнформация) = Тип("Структура") Тогда 	
		СообщенииеОшибки = ПолучитьДанные(СерилизированаяИнформация);
	КонецЕсли; 
	Возврат СообщенииеОшибки;
КонецФункции 

&НаСервере
Функция ПолучитьДанные(ИнформацияСообщения) 
	СообщенииеОшибки = "";
	ОшибкиВФайле = Новый Массив;
	
	Цены = Новый Массив;
	ВалютаЦены = Новый Массив; 
	
	Если ИнформацияСообщения.Цены.Количество() > 0 Тогда  
		
		Для каждого СтрокаЦены Из ИнформацияСообщения.Цены Цикл 
			Если СтрокаЦены.Гуид = Ложь ИЛИ СтрокаЦены.Наименование = Ложь Тогда 
				Цена = Новый Структура("Гуид, Наименование"); 
				Цена.Вставить("Гуид", 			СтрокаЦены.Гуид);
				Цена.Вставить("Наименование", 	СтрокаЦены.Наименование);
				Цены.Добавить(Цена);
			КонецЕсли; 
			
			Если СтрокаЦены.Валюта = Ложь И (СтрокаЦены.Гуид <> Ложь И СтрокаЦены.Наименование <> Ложь) Тогда 
				Валюта = Новый Структура("Валюта, Гуид, Наименование"); 
				Валюта.Вставить("Валюта", 			СтрокаЦены.Валюта);
				Валюта.Вставить("Гуид", 			СтрокаЦены.Гуид);
				Валюта.Вставить("Наименование", 	СтрокаЦены.Наименование);
				ВалютаЦены.Добавить(Валюта);
			КонецЕсли;
			
		КонецЦикла; 
	Иначе
		Цены.Добавить(Новый Структура("ТипыЦенНеЗаполнены", Истина));
	КонецЕсли;
	
	Если Цены.Количество() > 0 Тогда 
		ОбластьОшибкиЦеныНоменклатуры = Истина;
		ОшибкиВФайле.Добавить(СтрШаблон("%1","Не найдено значение «Типы цен номенклатуры"));
	КонецЕсли;
	
	Если ВалютаЦены.Количество() > 0 Тогда 
		Для каждого ЭлементЦены Из Цены  Цикл 	
			ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не найдено значение реквизита «Валюта типа цены номенклатуры"));		
		КонецЦикла; 
	КонецЕсли;

	
	Если ИнформацияСообщения.Товар.Артикл = Ложь Тогда 
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не найдено значение реквизита «Артикул»"));
	КонецЕсли;
	
	Если ИнформацияСообщения.Товар.ГУИД = Ложь Тогда 
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не найдено значение реквизита «ГУИД номенклатуры»"));  
	КонецЕсли;
	
	Если ИнформацияСообщения.Товар.Наименование = Ложь Тогда 
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не найдено значение реквизита «Наименование номенклатуры»")); 
	КонецЕсли;
	
	Если ИнформацияСообщения.Товар.НДС = Ложь Тогда 
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не заполнена ставка НДС")); 
	КонецЕсли;
	
	Если ИнформацияСообщения.Товар.ПометкаУдаления = Ложь Тогда 
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Объект помечен на удаление"));  
	КонецЕсли;
	
	Если ИнформацияСообщения.Товар.Коды.Тнвэд = Ложь
		И ИнформацияСообщения.Товар.Коды.Окпд2 = Ложь Тогда 
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не заполнен код ТН ВЭД/ОКПД2"));
	КонецЕсли;   
	
	РазмерыТовара = Новый Массив;
	Для каждого ЭлементРазмерыТовара Из ИнформацияСообщения.Товар.РазмерыТовара Цикл 
		Ошибка = Ложь;
		Размер = Новый Структура("Гуид, Размер, Штрихкод, ЦеныРазмера");
		
		Если ЭлементРазмерыТовара.Гуид = Ложь ИЛИ ЭлементРазмерыТовара.Размер = Ложь ИЛИ ЭлементРазмерыТовара.Штрихкод = Ложь Тогда 
			Размер.Вставить("Гуид", 		ЭлементРазмерыТовара.Гуид);
			Размер.Вставить("Размер", 		ЭлементРазмерыТовара.Размер); 
			Размер.Вставить("Штрихкод", 	ЭлементРазмерыТовара.Штрихкод);
			Ошибка = Истина;
		КонецЕсли;  
		
		Если Ошибка Тогда 
			РазмерыТовара.Добавить(Размер);
		КонецЕсли;
	КонецЦикла;
	
	
	Если РазмерыТовара.Количество() > 0 Тогда 

		Для каждого ЭлементРазмеры Из РазмерыТовара Цикл 
			Если ЭлементРазмеры.Гуид = Ложь И ЭлементРазмеры.Размер = Ложь Тогда 
				ОшибкиВФайле.Добавить( СтрШаблон("%1","Не найдено значение реквизита «Характеристика»"));
			КонецЕсли; 
			
			Если ЭлементРазмеры.Штрихкод = Ложь Тогда 
				ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не найден штрихкод номенклатуры"));
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
	
	
	ЦенаРазмерыТовара = Новый Массив;
	Для каждого ЭлементРазмерыТовара Из ИнформацияСообщения.Товар.РазмерыТовара Цикл 
		Ошибка = Ложь;
		Размер = Новый Структура;
		Если ЭлементРазмерыТовара.ЦеныРазмера.Количество() > 0 Тогда 	
			Для каждого ЭлементЦеныРазмера Из ЭлементРазмерыТовара.ЦеныРазмера Цикл 
				Если ЭлементЦеныРазмера.Гуид = Ложь ИЛИ ЭлементЦеныРазмера.Цена = Ложь Тогда 
					Ошибка = Истина;
				КонецЕсли; 
			КонецЦикла; 
			Если Ошибка Тогда 
				Размер.Вставить("ОшибкаЦен",    Истина);
				Размер.Вставить("Гуид", 		ЭлементРазмерыТовара.Гуид);
				Размер.Вставить("Размер", 		ЭлементРазмерыТовара.Размер); 
				Размер.Вставить("Штрихкод", 	ЭлементРазмерыТовара.Штрихкод);
				
			КонецЕсли;
		Иначе 	
			Размер.Вставить("ОшибкаЦен",    Истина);
			Размер.Вставить("Гуид", 		ЭлементРазмерыТовара.Гуид);
			Размер.Вставить("Размер", 		ЭлементРазмерыТовара.Размер); 
			Размер.Вставить("Штрихкод", 	ЭлементРазмерыТовара.Штрихкод);
			
			Ошибка = Истина;
		КонецЕсли;
		
		Если Ошибка Тогда 
			ЦенаРазмерыТовара.Добавить(Размер);
		КонецЕсли;
	КонецЦикла;

	
	Если ЦенаРазмерыТовара.Количество() > 0 Тогда 
		Для каждого ЦенаРазмера Из ЦенаРазмерыТовара Цикл
			Если ЦенаРазмера.ОшибкаЦен Тогда 	
				ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Цена»"));
			КонецЕсли; 	
		КонецЦикла;
	КонецЕсли;	

	
	Если ОшибкиВФайле.Количество() > 0 Тогда 
		ОшибкиВФайлеБезДублей = УдалитьПовторяющиесяЭлементыМассива(ОшибкиВФайле);
		СообщенииеОшибки = ВывестиЭлементыМассиваВСтроку(ОшибкиВФайлеБезДублей);
	КонецЕсли; 
	
    Возврат СообщенииеОшибки;
КонецФункции

&НаСервере
Функция УдалитьПовторяющиесяЭлементыМассива(Массив) 
	ТекущийИндекс = 0; 
	ВсегоЭлементов = Массив.Количество(); 
	Пока ТекущийИндекс < ВсегоЭлементов Цикл 
		Индекс2 = ТекущийИндекс + 1; 
		Пока Индекс2 < ВсегоЭлементов Цикл 
			Если Массив[Индекс2] = Массив[ТекущийИндекс] Тогда 
				Массив.Удалить(Индекс2); 
				ВсегоЭлементов = ВсегоЭлементов - 1; 
			Иначе 
				Индекс2 = Индекс2 + 1; 
			КонецЕсли; 
		КонецЦикла; 
		ТекущийИндекс = ТекущийИндекс + 1; 
	КонецЦикла;
	
	Возврат Массив; 
КонецФункции 

Функция ВывестиЭлементыМассиваВСтроку(Массив)
	ВыходнаяСтрока = "";
	Разделитель = "; ";
	Для каждого ЭлементМассива Из Массив Цикл
		ВыходнаяСтрока = ВыходнаяСтрока + ?(ПустаяСтрока(ВыходнаяСтрока), "", Разделитель);
		ВыходнаяСтрока = ВыходнаяСтрока + ЭлементМассива;
	КонецЦикла;
	Возврат ВыходнаяСтрока;
КонецФункции

&НаСервере
Функция ДесериализоватьИзJSON(СтрокаJSON, ПоляДата = "")
    
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
    Значение = ПрочитатьJSON(ЧтениеJSON,, ПоляДата, ФорматДатыJSON.ISO);          
    ЧтениеJSON.Закрыть();
    Возврат Значение;
    
КонецФункции 

&НаКлиенте
Процедура НоменклатурыПередНачаломИзменения(Элемент, Отказ)
	СохраненноеЗначениеЭлементаПередРедактированием = Неопределено;
	
	ИмяРодитель = Элемент.ТекущийЭлемент.Родитель.Имя;
	ИмяЭлемент = Элемент.ТекущийЭлемент.Имя; 
	ИмяЭлемент = СтрЗаменить(ИмяЭлемент, ИмяРодитель, "");
		
	Если ИмяЭлемент = "Статус" ИЛИ ИмяЭлемент = "ДатаИзмененияСтатусСообщенияНоменклатура" Тогда  
		Отказ = Истина;
	КонецЕсли;

	СохраненноеЗначениеЭлементаПередРедактированием = Элемент.ТекущиеДанные[ИмяЭлемент];

КонецПроцедуры 


&НаКлиенте
Процедура НоменклатурыПриАктивизацииЯчейки(Элемент)  
	СохраненноеЗначениеЭлементаПередРедактированием = Неопределено;
	
	ИмяРодитель = Элемент.ТекущийЭлемент.Родитель.Имя;
	ИмяЭлемент = Элемент.ТекущийЭлемент.Имя; 
	ИмяЭлемент = СтрЗаменить(ИмяЭлемент, ИмяРодитель, ""); 
	
	СохраненноеЗначениеЭлементаПередРедактированием = Элемент.ТекущиеДанные[ИмяЭлемент];
КонецПроцедуры


&НаКлиенте
Процедура НоменклатурыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если НоваяСтрока Тогда  
		Возврат;
	КонецЕсли;
	
	ИмяРодитель = Элемент.ТекущийЭлемент.Родитель.Имя;
	ИмяЭлемент = Элемент.ТекущийЭлемент.Имя; 	
	ИмяЭлемент = СтрЗаменить(ИмяЭлемент, ИмяРодитель, "");  

	Элемент.ТекущиеДанные[ИмяЭлемент] = СохраненноеЗначениеЭлементаПередРедактированием; 
    СохраненноеЗначениеЭлементаПередРедактированием = Неопределено;


КонецПроцедуры

&НаКлиенте
Процедура НоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя = "НоменклатурыТекстоваяИнформацияОшибки" Тогда 
		Информация = Элементы.Номенклатуры.ТекущиеДанные.Информация;
		ПараметрыВвода = Новый Структура("Информация, Номенклатура");
		ПараметрыВвода.Вставить("Информация", Информация);
		ПараметрыВвода.Вставить("Номенклатура", Истина);
		ОткрытьФорму("Обработка.спОтправкаСообщений.Форма.ОтображениеИнформации", ПараметрыВвода,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатурыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура НоменклатурыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	 Отказ = Истина;
КонецПроцедуры


