
&После("ПриЗаполненииПараметровСканирования")
Процедура спПриЗаполненииПараметровСканирования(ПараметрыСканирования, КонтекстВызова, ВидПродукции, Сценарий)
	
	Если ТипЗнч(КонтекстВызова) = Тип("Структура") И КонтекстВызова.Свойство("Контекст") Тогда
		Контекст = КонтекстВызова.Контекст;
	Иначе
		Контекст = КонтекстВызова;
	КонецЕсли;
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Контекст, "Документ.спПриемкаТовара") Тогда
		ЗаполнитьПараметрыСканированияПриходнаяНакладная(Контекст, ПараметрыСканирования, ВидПродукции);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьПараметрыСканированияПриходнаяНакладная(Контекст, ПараметрыСканирования, ВидПродукции, ПроверкаКоличества = Неопределено)
	
	#Область Метаданные
	
	ПараметрыСканирования.ИмяТабличнойЧастиШтрихкодыУпаковок = "ШтрихкодыУпаковок";
	ПараметрыСканирования.ИмяКолонкиШтрихкодУпаковки = "ШтрихкодУпаковки";
	
	ШтрихкодированиеИСМПКлиентСервер.ЗаполнитьПараметрыСканированияДокументаЗакупки(ПараметрыСканирования, ВидПродукции);
	
	#КонецОбласти

КонецПроцедуры
