
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Отказ = Истина;
		ТекстСообщения = НСтр("ru = 'Создание ""Приемка товаров (Tnext)"" предусмотрено только на основании документа ""Заказ на перемещение""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	// ИнтеграцияГосИС
	СобытияФормИСУНФ.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	КэшДанныхГОСИС.Вставить("ИмяТабличнойЧасти", "Запасы");
	// Конец ИнтеграцияГосИС
		
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ТипыОборудования.СканерШтрихкода = Истина;
		МенеджерОборудования.ПриСозданииНаСервере(ЭтотОбъект, ТипыОборудования);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьРеквизитыТЧ(Объект.Запасы, "Принято, Количество, КоличествоФакт, Отклонение, Бренд");
	КонецЕсли;
	
	УсловноеОформлениеФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеФормой();
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ИнтеграцияГосИС
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("КэшированныеЗначения",    Неопределено);
	ДополнительныеПараметры.Вставить("СтандартнаяОбработка",    Истина);
	ДополнительныеПараметры.Вставить("ТребуетсяСерверныйВызов", Ложь);
	СобытияФормИСУНФКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник, ДополнительныеПараметры);
	Если Не ДополнительныеПараметры.СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	// Конец ИнтеграцияГосИС
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда  
			
			Если ТипЗнч(Параметр) <> Тип("Массив") Тогда
				Параметр = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметр);
			КонецЕсли;
			
			Данные = МенеджерОборудованияУНФКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			
			ПолученШтрихкод(Данные); 
			
		КонецЕсли;  
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// ИнтеграцияГосИС
	СобытияФормИСУНФ.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец ИнтеграцияГосИС
	
	ЗаполнитьРеквизитыТЧ(Объект.Запасы, "Бренд");
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// ИнтеграцияГосИС
	СобытияФормИСУНФ.ПослеЗаписиНаСервере(ЭтаФорма);
	// Конец ИнтеграцияГосИС
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	// ИнтеграцияГосИС
	СобытияФормИСУНФКлиент.ОбработкаНавигационнойСсылки(ЭтаФорма, НавигационнаяСсылкаФорматированнойСтроки,
		СтандартнаяОбработка);
	// Конец ИнтеграцияГосИС
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ЗаполнитьРеквизитыТЧ(Объект.Запасы, "Бренд");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

&НаКлиенте
Процедура ЗапасыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Не Поле.Имя = "ЗапасыКоличествоФакт" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ДанныеСтроки = Элементы.Запасы.ДанныеСтроки(ВыбраннаяСтрока);
		
		Если ДанныеСтроки = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ПоказатьЗначение(, ДанныеСтроки.Номенклатура);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыКоличествоФактПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.Запасы.ТекущиеДанные;
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПересчитатьОтклонение(ДанныеСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	// ИнтеграцияГосИС
	СобытияФормИСУНФКлиент.ПриИзмененииЭлемента(ЭтотОбъект, "ТабличнаяЧасть", Новый Структура("ПриНачалеРедактирования"));
	// Конец ИнтеграцияГосИС
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// ИнтеграцияГосИС
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПриОкончанииРедактирования");
	ДополнительныеПараметры.Вставить("ОповещениеСерверногоВызова", "ОповещениеПриОкончанииРедактированияТабличнойЧастиИС");
	СобытияФормИСУНФКлиент.ПриИзмененииЭлемента(ЭтотОбъект, "ТабличнаяЧасть", ДополнительныеПараметры);
	// Конец ИнтеграцияГосИС
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПередУдалением(Элемент, Отказ)
	
	// ИнтеграцияГосИС
	СобытияФормИСУНФКлиент.ПриИзмененииЭлемента(ЭтотОбъект, "ТабличнаяЧасть", Новый Структура("ПередУдалением"));
	// Конец ИнтеграцияГосИС
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПослеУдаления(Элемент)
	
	// ИнтеграцияГосИС
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ПослеУдаления");
	ДополнительныеПараметры.Вставить("ОповещениеСерверногоВызова", "ОповещениеПриОкончанииРедактированияТабличнойЧастиИС");
	СобытияФормИСУНФКлиент.ПриИзмененииЭлемента(ЭтотОбъект, "ТабличнаяЧасть", ДополнительныеПараметры);
	// Конец ИнтеграцияГосИС
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды командной панели табличной части.
&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ОчиститьСообщения();
	ТекШтрихкод = "";
	
	ОбработкаЗавершения = Новый ОписаниеОповещения(
		"ПоискПоШтрихкодуЗавершение",
		ЭтотОбъект, 
		Новый Структура("ТекШтрихкод", ТекШтрихкод));

	#Если МобильныйКлиент Тогда
	ОткрытьФорму("ОбщаяФорма.ФормаПоискаПоШтрихкоду", , , , , , ОбработкаЗавершения);
	#Иначе
	ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтклонения(Команда)
	
	ОчиститьСообщения();
	
	Элементы.ЗапасыПоказатьОтклонения.Пометка = Не Элементы.ЗапасыПоказатьОтклонения.Пометка;
	
	УстановитьВидимостьСтрок();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьФактПоПлановомуКоличеству(Команда)
	
	ОчиститьСообщения();
	ЗаполнитьФактПоПлану();
	ЗаполнитьРеквизитыТЧ(Объект.Запасы, "Принято, Отклонение");

КонецПроцедуры

&НаКлиенте
Процедура СоздатьПеремещениеЗапасов(Команда) 
	
	НачатьСозданиеДокументов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеФормой

&НаСервере
Процедура УсловноеОформлениеФормы() 
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Оранжевый);
	
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.Отклонение");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Запасы");
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьСтрок()
	
	Если Элементы.ЗапасыПоказатьОтклонения.Пометка Тогда
		
		Элементы.Запасы.ОтборСтрок = Новый ФиксированнаяСтруктура("ЕстьОтклонение", Истина);

	Иначе
		
		Элементы.Запасы.ОтборСтрок = Новый ФиксированнаяСтруктура;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеФормой() 
	
	ТолькоПросмотр = Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.спСтатусыПриемкиТоваров.Завершен");
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура СтатусДокументаПриИзменении(Элемент)
	
	Если Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.спСтатусыПриемкиТоваров.Завершен") Тогда
		
		ТекстВопроса = НСтр("ru = 'Документ будет заблокирован для изменения. Продолжить?'");
		
		Ответ = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Нет Тогда
			
			Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.спСтатусыПриемкиТоваров.ВРаботе");
			
		Иначе
			
			УправлениеФормой();
			Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьОтклонение(ДанныеСтроки)
	
	ДанныеСтроки.Отклонение = -(ДанныеСтроки.Количество - ДанныеСтроки.Принято - ДанныеСтроки.КоличествоФакт);
	ДанныеСтроки.ЕстьОтклонение = ДанныеСтроки.Отклонение <> 0;
	УстановитьВидимостьСтрок();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеСтроки(ИденитфикаторСтроки, ЗаполняемыеРеквезиты)
	
	Строка = Объект.Запасы.НайтиПоИдентификатору(ИденитфикаторСтроки);
	
	ВыбранныеСтрокиЗапасов = Объект.Запасы.Выгрузить().СкопироватьКолонки();
	
	НоваяСтрока = ВыбранныеСтрокиЗапасов.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	
	ЗаполнитьРеквизитыТЧ(ВыбранныеСтрокиЗапасов, ЗаполняемыеРеквезиты);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыТЧ(Знач ВыбранныеСтрокиЗапасов, ЗаполняемыеРеквезиты)

	РезультатЗапроса = Документы.спПриемкаТовара.ДанныеЗаполненияЗапасов(ВыбранныеСтрокиЗапасов, Объект.ДокументОснование, Объект.Ячейка);
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НайденныеСтроки = Объект.Запасы.НайтиСтроки(Новый Структура("НомерСтроки", Выборка.НомерСтроки));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		НайденнаяСтрока = НайденныеСтроки[0];
		ЗаполнитьЗначенияСвойств(НайденнаяСтрока, Выборка, ЗаполняемыеРеквезиты);
		НайденнаяСтрока.ЕстьОтклонение = НайденнаяСтрока.Отклонение <> 0;
		
	КонецЦикла;
	
	УстановитьВидимостьСтрок();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьФактПоПлану()
	
	ТаблицаЗапасы = Объект.Запасы.Выгрузить();
	
	ЗначенияПлан = ТаблицаЗапасы.ВыгрузитьКолонку("Количество");
	
	ТаблицаЗапасы.ЗагрузитьКолонку(ЗначенияПлан, "КоличествоФакт");
	
	Объект.Запасы.Загрузить(ТаблицаЗапасы);
	
КонецПроцедуры

#КонецОбласти 

#Область ПоискПоШтрихкоду

// Процедура обрабатывает полученные штрихкоды.
//
&НаКлиенте
Процедура ПолученШтрихкод(ДанныеШтрихкодов) Экспорт
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли;
	
	ТипСсылки = ТипЗнч(Объект.Ссылка);
	МассивШтрихкодовБезГОСИС = Новый Массив;
	
	Для Каждого Элемент Из МассивШтрихкодов Цикл
		
		ДополнительныеДанныеПоШтрихкоду = 
			ШтрихкодированиеУНФКлиент.ДополнительныеДанныеПоШтрихкоду(Элемент.Штрихкод, ТипСсылки);
			
		ОбработатьКакМаркировкуТоваров = ДополнительныеДанныеПоШтрихкоду.ЭтоКодМаркировки;
		
		ТребуетсяВопрос = ВариантОбработкиКодаМаркировки.Пустая();
		
		Если ОбработатьКакМаркировкуТоваров И ТребуетсяВопрос Тогда
			ДополнительныеПараметры = Новый Структура();
			ДополнительныеПараметры.Вставить("ИсходныеДанные", Элемент);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ВариантыОбработкиКодаМаркировкиЗавершение",
				ЭтотОбъект, ДополнительныеПараметры);
			
			ПараметрыДиалога = Новый Структура;
			ПараметрыДиалога.Вставить("ИмяНастройкиПользователей",
				"ВариантОбработкиКодаМаркировкиВДокументахПоступления");
			
			ОткрытьФорму("ОбщаяФорма.ФормаВариантыОбработкиКодаМаркировки",
				ПараметрыДиалога, ЭтаФорма, , , , ОписаниеОповещения);
			Прервать;
			
		КонецЕсли;
		
		Если ОбработатьКакМаркировкуТоваров
			И ВариантОбработкиКодаМаркировки =
			ПредопределенноеЗначение("Перечисление.ВариантыОбработкиКодаМаркировки.ДобавитьТоварВДокумент") Тогда
			
			ОбработатьКодМаркировки(Элемент);
		ИначеЕсли ОбработатьКакМаркировкуТоваров
			И ВариантОбработкиКодаМаркировки =
			ПредопределенноеЗначение("Перечисление.ВариантыОбработкиКодаМаркировки.ОткрытьФормуПроверкиИПодбора") Тогда
			
			ОткрытьФормуПроверкиИПодбора(Элемент);
			Прервать;
		ИначеЕсли ДополнительныеДанныеПоШтрихкоду.ЕстьРазделительGS1 Тогда
			Элемент.Штрихкод = ДополнительныеДанныеПоШтрихкоду.ПредставлениеШтрихкода;
			МассивШтрихкодовБезГОСИС.Добавить(Элемент);
		Иначе
			МассивШтрихкодовБезГОСИС.Добавить(Элемент);
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивШтрихкодовБезГОСИС.Количество() Тогда
		ПолученыШтрихкодыБезГОСИС(МассивШтрихкодовБезГОСИС);
	КонецЕсли;   
	

	
	
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ВариантыОбработкиКодаМаркировкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат =
		ПредопределенноеЗначение("Перечисление.ВариантыОбработкиКодаМаркировки.ОткрытьФормуПроверкиИПодбора") Тогда
		
		ВариантОбработкиКодаМаркировки = Результат;
		Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
			И ДополнительныеПараметры.Свойство("ИсходныеДанные") Тогда
			ДанныеШтрихкода = ДополнительныеПараметры.ИсходныеДанные;
		Иначе
			ДанныеШтрихкода = Неопределено;
		КонецЕсли;
		ОткрытьФормуПроверкиИПодбора(ДанныеШтрихкода);
	КонецЕсли;
	
	Если Результат = ПредопределенноеЗначение("Перечисление.ВариантыОбработкиКодаМаркировки.ДобавитьТоварВДокумент")
		И ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("ИсходныеДанные") Тогда
		
		ВариантОбработкиКодаМаркировки = Результат;
		ОбработатьКодМаркировки(ДополнительныеПараметры.ИсходныеДанные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКодМаркировки(ИсходныеДанные, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если ИсходныеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования(ЭтотОбъект);
	
	ШтрихкодКоличество = ОбщегоНазначенияКлиент.СкопироватьРекурсивно(ИсходныеДанные, Ложь);
	ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЗакодироватьШтрихкодДанныхBase64(ШтрихкодКоличество);
	
	РезультатОбработки = ОбработатьВводШтрихкода(ШтрихкодКоличество, Неопределено, ПараметрыСканирования);
	
	ПараметрыЗавершенияВводаШтрихкода = ПараметрыЗавершенияВводаШтрихкода(ИсходныеДанные, РезультатОбработки,
		ПараметрыСканирования);
	ШтрихкодированиеОбщегоНазначенияИСКлиент.ЗавершитьОбработкуШтрихкода(ПараметрыЗавершенияВводаШтрихкода);
	ШтрихкодированиеОбщегоНазначенияИСКлиент.ОбработатьАсинхронноШтрихкод(ПараметрыЗавершенияВводаШтрихкода);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьВводШтрихкода(ШтрихкодКоличество, КэшированныеЗначения, ПараметрыСканирования = Неопределено)
	
	РезультатОбработкиШтрихкода = ШтрихкодированиеОбщегоНазначенияИС.ОбработатьВводШтрихкода(
		ЭтотОбъект, ШтрихкодКоличество, КэшированныеЗначения, ПараметрыСканирования);
		
	ПослеОбработкиШтрихкодовСервер(РезультатОбработкиШтрихкода, КэшированныеЗначения,
		ПараметрыСканирования);
	
	Возврат РезультатОбработкиШтрихкода;
	
КонецФункции

&НаСервере
Процедура ПослеОбработкиШтрихкодовСервер(РезультатОбработкиШтрихкода, КэшированныеЗначения, ПараметрыСканирования)
	
	Если Не РезультатОбработкиШтрихкода.ТребуетсяОбработкаШтрихкода Тогда
		
		СтрокиДляОбработки = Новый Массив;
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокиДляОбработки,
			РезультатОбработкиШтрихкода.ДобавленныеСтроки, Истина);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокиДляОбработки,
			РезультатОбработкиШтрихкода.ИзмененныеСтроки, Истина);
		
		ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(ЭтотОбъект);
		Для Каждого СтрокаДляОбработки Из СтрокиДляОбработки Цикл
			ИнтеграцияИСМПУНФ.ЗаполнитьСлужебныеРеквизитыИСМПВСтрокеТЧ(СтрокаДляОбработки, ПараметрыСканирования, Объект.Дата);
			СерииНоменклатурыУНФКлиентСервер.ОбновитьСтроковоеПредставлениеСерийНоменклатурыСтроки(
				СтрокаДляОбработки, Объект, "КлючСвязи", "СерииНоменклатуры");
		КонецЦикла;
		
	КонецЕсли;
	
	РезультатОбработкиШтрихкода.ИзмененныеСтроки  = Неопределено;
	РезультатОбработкиШтрихкода.ДобавленныеСтроки = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Функция ПараметрыЗавершенияВводаШтрихкода(ИсходныеДанные, РезультатОбработки, ПараметрыСканирования)
	
	ПараметрыЗавершенияВводаШтрихкода = ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыЗавершенияОбработкиШтрихкода();
	ПараметрыЗавершенияВводаШтрихкода.РезультатОбработкиШтрихкода  = РезультатОбработки;
	ПараметрыЗавершенияВводаШтрихкода.Форма                        = ЭтотОбъект;
	ПараметрыЗавершенияВводаШтрихкода.ПараметрыСканирования        = ПараметрыСканирования;
	ПараметрыЗавершенияВводаШтрихкода.ДанныеШтрихкода              = ИсходныеДанные;
	ПараметрыЗавершенияВводаШтрихкода.ВыполнитьДействие            = "ОбработкаКодаМаркировкиВыполнитьДействие";
	ПараметрыЗавершенияВводаШтрихкода.ОбработатьШтрихкод           = "ОбработатьКодМаркировки";
	ПараметрыЗавершенияВводаШтрихкода.ЗавершениеОбработки          = "ОповещениеЗавершениеОбработкиКодаМаркировки";
	
	Возврат ПараметрыЗавершенияВводаШтрихкода;
	
КонецФункции

&НаКлиенте
Процедура ОповещениеЗавершениеОбработкиКодаМаркировки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ТребуетсяОбработкаШтрихкода Тогда
		
		ДанныеШтрихкода = Новый Структура("Штрихкод, Количество");
		Если Результат.Свойство("ИсходныеДанные") И ЗначениеЗаполнено(Результат.ИсходныеДанные) Тогда
			ЗаполнитьЗначенияСвойств(ДанныеШтрихкода, Результат.ИсходныеДанные);
		ИначеЕсли Результат.Свойство("ДанныеШтрихкода") И ЗначениеЗаполнено(Результат.ДанныеШтрихкода) Тогда
			ЗаполнитьЗначенияСвойств(ДанныеШтрихкода, Результат.ДанныеШтрихкода);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ДанныеШтрихкода.Штрихкод) Тогда
			ПолученыШтрихкодыБезГОСИС(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеШтрихкода));
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ОбработкаКодаМаркировкиВыполнитьДействие(ДанныеДляВыполненияДействия, ДополнительныеПараметры) Экспорт
	
	РезультатВыбора             = ДанныеДляВыполненияДействия.РезультатВыбора;
	РезультатОбработкиШтрихкода = ДанныеДляВыполненияДействия.РезультатОбработкиШтрихкода;
	КэшированныеЗначения        = ДанныеДляВыполненияДействия.КэшированныеЗначения;
	ПараметрыСканирования       = ДанныеДляВыполненияДействия.ПараметрыСканирования;
	
	Действие = ДанныеДляВыполненияДействия.Действие;
	РезультатОбработкиШтрихкода = ОбработкаКодаМаркировкиВыполнитьДействиеСервер(Действие, РезультатВыбора,
		РезультатОбработкиШтрихкода, ПараметрыСканирования, КэшированныеЗначения);
	
	ПараметрыЗавершенияВводаШтрихкода = ПараметрыЗавершенияВводаШтрихкода(ДанныеДляВыполненияДействия.ИсходныеДанные,
		РезультатОбработкиШтрихкода, ДанныеДляВыполненияДействия.ПараметрыСканирования);
	ШтрихкодированиеОбщегоНазначенияИСКлиент.ЗавершитьОбработкуШтрихкода(ПараметрыЗавершенияВводаШтрихкода);
	ШтрихкодированиеОбщегоНазначенияИСКлиент.ОбработатьАсинхронноШтрихкод(ПараметрыЗавершенияВводаШтрихкода);
	
КонецФункции

&НаСервере
Функция ОбработкаКодаМаркировкиВыполнитьДействиеСервер(Действие, РезультатВыбора, РезультатОбработкиШтрихкода,
	ПараметрыСканирования, КэшированныеЗначения)
	
	ПараметрыОбработкиВыбора    = ШтрихкодированиеОбщегоНазначенияИС.ИнициализироватьПараметрыОбработкиВыбора(
		РезультатВыбора, РезультатОбработкиШтрихкода, КэшированныеЗначения);
	РезультатОбработкиШтрихкода = ШтрихкодированиеИС.ВыполнитьДействие(ЭтотОбъект, Действие, ПараметрыОбработкиВыбора);
	
	ПослеОбработкиШтрихкодовСервер(РезультатОбработкиШтрихкода, КэшированныеЗначения, ПараметрыСканирования);
	
	Возврат РезультатОбработкиШтрихкода;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуПроверкиИПодбора(Знач ДанныеШтрихкода)
	
	Если ЗначениеЗаполнено(ДанныеШтрихкода) Тогда
		ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИСКлиент.ПараметрыСканирования(ЭтотОбъект);
		ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ЗакодироватьШтрихкодДанныхBase64(ДанныеШтрихкода);
		ВидыПродукции = ПолучитьВидыПродукцииВДанныхПоШтрихкодам(ПараметрыСканирования, ДанныеШтрихкода);
	Иначе
		ВидыПродукции = Новый Массив;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыполнитьПринудительно", Истина);
	ДополнительныеПараметры.Вставить("ВидыПродукции", ВидыПродукции);
	СобытияФормИСУНФКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, "", ДополнительныеПараметры);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьВидыПродукцииВДанныхПоШтрихкодам(ПараметрыСканирования, Знач ДанныеШтрихкода)
	
	СохранитьШтрихкодBase64 = ТипЗнч(ДанныеШтрихкода) = Тип("Структура");
	ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ДекодироватьШтрихкодДанныхBase64(ДанныеШтрихкода,
		СохранитьШтрихкодBase64);
	
	ДанныеШтрихкодаСписок = Новый Массив;
	ДанныеШтрихкодаСписок.Добавить(ДанныеШтрихкода);
	
	ДанныеПоШтрихкодам = ШтрихкодированиеОбщегоНазначенияИС.ИнициализацияДанныхПоШтрихкодам();
	
	ШтрихкодированиеОбщегоНазначенияИС.ПодготовитьДанныеКодовМаркировкиДляОбработки(ДанныеПоШтрихкодам,
		ДанныеШтрихкодаСписок, ПараметрыСканирования);
	ШтрихкодированиеОбщегоНазначенияИС.ЗаполнитьВидыПродукцииВДанныхПоШтрихкодам(ДанныеПоШтрихкодам,
		ПараметрыСканирования);
	
	Возврат ДанныеПоШтрихкодам.ВидыПродукции;
	
КонецФункции
 
&НаКлиенте
Асинх Процедура ПолученыШтрихкодыБезГОСИС(ДанныеШтрихкодов) Экспорт
	
	Модифицированность = Истина;
	
	ПрефиксЯчейки = спРаботаСЯчейкамиВызовСервера.ПрефиксШтрихкодаЯчейки();
	
	Для каждого ДанныеШтрихкода Из ДанныеШтрихкодов Цикл
		
		Если СтрНачинаетсяС(ДанныеШтрихкода.Штрихкод, ПрефиксЯчейки) Тогда
			
			АдресныйПолучатель = спРаботаСЯчейкамиВызовСервера.ЕстьЯчейки(Объект.СтруктурнаяЕдиницаПолучатель);
			
			Если АдресныйПолучатель Тогда
				
				ДанныеСтроки = Элементы.Запасы.ТекущиеДанные;
				
				Если ДанныеСтроки = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ДанныеСтроки.Ячейка) Тогда
					
					Ответ = Ждать ВопросАсинх(НСтр("ru = 'В текущей строке ячейка заполнена. Изменить?'"), РежимДиалогаВопрос.ДаНет);
					
					Если Ответ = КодВозвратаДиалога.Нет Тогда
						Продолжить;
					КонецЕсли;
					
				КонецЕсли;
				
				ДанныеСтроки.Ячейка = спЯчейкаПоШтрихкоду(ДанныеШтрихкода.Штрихкод, Объект.СтруктурнаяЕдиницаПолучатель);
				
			Иначе
				
				ТекстСообщения = НСтр("ru = 'Отсканирован штрихкод ячейки, но выбранный склад не является адресным.'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		ДополнительныеДанныеПоШтрихкоду = ШтрихкодированиеУНФКлиент.ДополнительныеДанныеПоШтрихкоду(ДанныеШтрихкода.Штрихкод,
		"");
		Если ДополнительныеДанныеПоШтрихкоду.ЭтоКодМаркировки Тогда
			ДанныеШтрихкода.Штрихкод = ДополнительныеДанныеПоШтрихкоду.EAN;
		ИначеЕсли ДополнительныеДанныеПоШтрихкоду.ЕстьРазделительGS1 Тогда
			ДанныеШтрихкода.Штрихкод = ДополнительныеДанныеПоШтрихкоду.ПредставлениеШтрихкода;
		Иначе
			// Действие не требуется
		КонецЕсли;
		
		ДанныеПоШтрихКодам = ПолучитьДанныеПоШтрихкодамВМассиве(ДанныеШтрихкода);
		
		МассивДанных = ДанныеПоШтрихкодам.Получить(ДанныеШтрихкода.Штрихкод);
		
		Штрихкод = ДанныеШтрихкода.Штрихкод;
		
		Если Не МассивДанных = Неопределено И МассивДанных.Количество() Тогда
			
			Если МассивДанных.Количество() > 1 Тогда
				ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПоДаннымШтрихкодовЗавершение1", ЭтотОбъект);
				ПараметрыОткрытия = Новый Структура("МассивНоменклатуры, ТекШтрихкод", МассивДанных, ДанныеШтрихкода);
				ОткрытьФорму("Справочник.Номенклатура.Форма.ДублиНоменклатурыПоШтрихКоду", ПараметрыОткрытия, ЭтаФорма,,,,
				ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				Возврат;
			КонецЕсли;
			
			Номенклатура 	= МассивДанных[0].Номенклатура;
			
			ВыполнитьДействие(Номенклатура);
			
		КонецЕсли; 
		
		Прервать;
		
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Функция спЯчейкаПоШтрихкоду(Штрихкод, Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	спШтрихкодыЯчеек.Ячейка КАК Ячейка
		|ИЗ
		|	РегистрСведений.спШтрихкодыЯчеек КАК спШтрихкодыЯчеек
		|ГДЕ
		|	спШтрихкодыЯчеек.Штрихкод = &Штрихкод
		|	И спШтрихкодыЯчеек.Ячейка.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("Владелец", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Ячейка;
		
	Иначе
		
		Возврат Справочники.Ячейки.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоДаннымШтрихкодовЗавершение1(СтруктураНоменклатуры, Параметры) Экспорт 
	
	Если СтруктураНоменклатуры = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Номенклатура = СтруктураНоменклатуры.МассивНоменклатуры[0].Номенклатура;
	
	ВыполнитьДействие(Номенклатура);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействие(Номенклатура)
	
	НайденныеСтроки = Объект.Запасы.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		
		НайденнаяСтрока = НайденныеСтроки[0];
		НайденнаяСтрока.КоличествоФакт = НайденнаяСтрока.КоличествоФакт + 1;
		ПересчитатьОтклонение(НайденнаяСтрока);
		Элементы.Запасы.ТекущаяСтрока = НайденнаяСтрока.ПолучитьИдентификатор();
		
	Иначе
		
		ТекстСообщения = СтрШаблон(НСтр("ru = 'Строка с номенклатурой ""%1"" в документе не найдена'"), Номенклатура); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, Номенклатура);
		
	КонецЕсли;
			
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦенаНоменклатуры(Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.ВидЦен КАК ВидЦен,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&Дата,
		|			Номенклатура = &Номенклатура
		|				И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидЦен", Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи());
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Цена;
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Результат = Неопределено, СокрЛП(ДополнительныеПараметры.ТекШтрихкод), СокрЛП(Результат));
	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда 
		ДанныеШтрихкода = Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1);
		
		ПолученШтрихкод(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеШтрихкода));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоШтрихкодамВМассиве(ДанныеШтрихкода, СтруктурнаяЕдиница = Неопределено)
	
	РегистрыСведений.ШтрихкодыНоменклатуры.ПреобразоватьВесовойШтрихкод(ДанныеШтрихкода);
	
	Штрихкоды = Новый Массив;
	Штрихкоды.Добавить(ДанныеШтрихкода);
	
	ДанныеПоШтрихкодам = Новый Соответствие;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ Цены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ВидЦен = &ВидЦеныПродажи) КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рег.Штрихкод КАК Штрихкод,
	|	Рег.Номенклатура КАК Номенклатура,
	|	Рег.Характеристика КАК Характеристика,
	|	Рег.Партия КАК Партия,
	|	Рег.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	|	ЕСТЬNULL(Цены.Цена, 0) КАК Цена
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Рег
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (&СерииНоменклатурыИспользуются)
	|			И Рег.Номенклатура = СерииНоменклатуры.Владелец
	|			И (Рег.Номенклатура.ИспользоватьСерииНоменклатуры)
	|			И Рег.Штрихкод = СерииНоменклатуры.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	|		ПО Рег.Номенклатура = Цены.Номенклатура
	|			И Рег.Характеристика = Цены.Характеристика
	|ГДЕ
	|	Рег.Штрихкод В(&МассивШтрихкодов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗДанныеОВесовомТоваре.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ТЗДанныеОВесовомТоваре.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ТЗДанныеОВесовомТоваре.ШтрихКод КАК ШтрихКод
	|ПОМЕСТИТЬ ВременнаяТаблицаВесовойТовар
	|ИЗ
	|	&ТЗДанныеОВесовомТоваре КАК ТЗДанныеОВесовомТоваре
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыТоваровSKU.Номенклатура КАК Номенклатура,
	|	КодыТоваровSKU.Характеристика КАК Характеристика,
	|	КодыТоваровSKU.Партия КАК Партия,
	|	КодыТоваровSKU.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВременнаяТаблицаВесовойТовар.ШтрихКод КАК ШтрихКод,
	|	ВременнаяТаблицаВесовойТовар.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	|	ЕСТЬNULL(КодыТоваровSKU.Номенклатура.ВидАлкогольнойПродукции.Маркируемый, ЛОЖЬ)
	|		ИЛИ КодыТоваровSKU.Номенклатура.УдалитьТабачнаяПродукция КАК МаркируемаяПродукция
	|ИЗ
	|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаВесовойТовар КАК ВременнаяТаблицаВесовойТовар
	|		ПО КодыТоваровSKU.SKU = ВременнаяТаблицаВесовойТовар.КодВесовогоТовара
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (&СерииНоменклатурыИспользуются)
	|			И КодыТоваровSKU.Номенклатура = СерииНоменклатуры.Владелец
	|			И (КодыТоваровSKU.Номенклатура.ИспользоватьСерииНоменклатуры)
	|			И (ВременнаяТаблицаВесовойТовар.ШтрихКод = СерииНоменклатуры.Наименование)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаВесовойТовар.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ШтрихКод КАК ШтрихКод
	|ИЗ
	|	ВременнаяТаблицаВесовойТовар КАК ВременнаяТаблицаВесовойТовар");
	
	МассивШтрихкодов = Новый Массив;
	ТЗДанныеОВесовомТоваре = Новый ТаблицаЗначений;
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("КодВесовогоТовара", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный)));
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("ПрефиксВесовогоТовара", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200)));
	
	Для каждого ТекШтрихкод Из Штрихкоды Цикл
		
		МассивШтрихкодов.Добавить(ТекШтрихкод.ШтрихКод);

		ДанныеПоШтрихкодам.Вставить(ТекШтрихкод.ШтрихКод, Новый Массив);
		
		Если ТекШтрихкод.Свойство("КодВесовогоТовара") Тогда
			НоваяСтрокаОВесовомТоваре = ТЗДанныеОВесовомТоваре.Добавить();
			НоваяСтрокаОВесовомТоваре.КодВесовогоТовара = ТекШтрихкод.КодВесовогоТовара;
			НоваяСтрокаОВесовомТоваре.ПрефиксВесовогоТовара = ТекШтрихкод.ПрефиксВесовогоТовара;
			НоваяСтрокаОВесовомТоваре.Штрихкод = ТекШтрихкод.Штрихкод;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("МассивШтрихкодов", МассивШтрихкодов);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ВидЦеныПродажи", Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи());
	ИспользоватьСерииНоменклатуры = СерииНоменклатурыУНФ.ИспользоватьСерииНоменклатурыОстатки();
	Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
		Запрос.УстановитьПараметр("СерииНоменклатурыИспользуются", Истина);
	Иначе
	    Запрос.УстановитьПараметр("СерииНоменклатурыИспользуются", Ложь);
	КонецЕсли;
	Запрос.УстановитьПараметр("ТЗДанныеОВесовомТоваре", ТЗДанныеОВесовомТоваре);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МассивДанныхПоШтрихкоду = ДанныеПоШтрихкодам[Выборка.Штрихкод];
		
		ТекДанные = Новый Структура;
		МассивДанныхПоШтрихкоду.Добавить(ТекДанные);
		
		ТекДанные.Вставить("Номенклатура", Выборка.Номенклатура);
		ТекДанные.Вставить("Характеристика", Выборка.Характеристика);
		ТекДанные.Вставить("Партия", Выборка.Партия);
		ТекДанные.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
		ТекДанные.Вставить("КодВесовогоТовара", Выборка.КодВесовогоТовара);
		ТекДанные.Вставить("ПрефиксВесовогоТовара", Выборка.ПрефиксВесовогоТовара);
		ТекДанные.Вставить("МаркируемаяПродукция", Выборка.МаркируемаяПродукция);
		ТекДанные.Вставить("НоменклатураПоставщика", Неопределено);
		ТекДанные.Вставить("Цена", Выборка.Цена);
		
		Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
			ТекДанные.Вставить("Серия", Выборка.Серия);
		КонецЕсли;
	КонецЦикла;
	
	Выборка = МассивРезультатов[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МассивДанныхПоШтрихкоду = ДанныеПоШтрихкодам[Выборка.Штрихкод];
		
		ТекДанные = Новый Структура;
		МассивДанныхПоШтрихкоду.Добавить(ТекДанные);
		
		Если НЕ ТекДанные.Свойство("КодВесовогоТовара") Тогда
			ТекДанные.Вставить("Номенклатура", Выборка.Номенклатура);
			ТекДанные.Вставить("Характеристика", Выборка.Характеристика);
			ТекДанные.Вставить("Партия", Выборка.Партия);
			ТекДанные.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
			ТекДанные.Вставить("НоменклатураПоставщика", Неопределено);
			
			Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
				ТекДанные.Вставить("Серия", Выборка.Серия);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат ДанныеПоШтрихкодам;

КонецФункции

#КонецОбласти //ПоискПоШтрихкоду

#Область ФормированиеДокументов

&НаКлиенте
Асинх Процедура НачатьСозданиеДокументов()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Или Модифицированность Тогда
		
		Ответ = Ждать ВопросАсинх(НСтр("ru = 'Перед формированием документ будет записан. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Записать();
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Результат = ДокументыСформированыУспешно(Объект.Ссылка);
	
	Если Результат.Успех Тогда
		
		Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.спСтатусыПриемкиТоваров.Завершен");
			
	Иначе
		
		Объект.СтатусДокумента = ПредопределенноеЗначение("Перечисление.спСтатусыПриемкиТоваров.ВРаботе");
		
	КонецЕсли;  
	
	Записать();
	УправлениеФормой();
		
	Если ЗначениеЗаполнено(Результат.Перемещение) Тогда
		ПоказатьЗначение(, Результат.Перемещение);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Результат.Акт) Тогда
		ПоказатьЗначение(, Результат.Акт);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДокументыСформированыУспешно(ПриемкаТовара)
	
	РезультатФункции = Новый Структура("Перемещение, Акт, Успех");
	РезультатФункции.Успех = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спПриемкаТовараЗапасы.Номенклатура КАК Номенклатура,
		|	спПриемкаТовараЗапасы.Ячейка КАК ЯчейкаПолучатель,
		|	спПриемкаТовараЗапасы.КоличествоФакт КАК Количество,
		|	спПриемкаТовараЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Документ.спПриемкаТовара.Запасы КАК спПриемкаТовараЗапасы
		|ГДЕ
		|	спПриемкаТовараЗапасы.Ссылка = &ПриемкаТовара
		|	И спПриемкаТовараЗапасы.КоличествоФакт > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	спПриемкаТовараЗапасы.Номенклатура КАК Номенклатура,
		|	спПриемкаТовараЗапасы.Количество КАК КоличествоПлан,
		|	спПриемкаТовараЗапасы.КоличествоФакт КАК КоличествоФакт,
		|	ВЫБОР
		|		КОГДА спПриемкаТовараЗапасы.Отклонение > 0
		|			ТОГДА спПриемкаТовараЗапасы.Отклонение
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Излишек,
		|	ВЫБОР
		|		КОГДА спПриемкаТовараЗапасы.Отклонение < 0
		|			ТОГДА -спПриемкаТовараЗапасы.Отклонение
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Недостача,
		|	спПриемкаТовараЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Документ.спПриемкаТовара.Запасы КАК спПриемкаТовараЗапасы
		|ГДЕ
		|	спПриемкаТовараЗапасы.Ссылка = &ПриемкаТовара
		|	И спПриемкаТовараЗапасы.Отклонение <> 0";
	
	Запрос.УстановитьПараметр("ПриемкаТовара", ПриемкаТовара);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	РезультатПеремещение = РезультатыЗапроса[0];
	РезультатАкт		 = РезультатыЗапроса[1];
	ШаблонОшибки = НСтр("ru = 'При проведении %1 произошла ошибка. Подробнее см. Журнал Регистрации'");
			
	ОбщиеДанныеДокументов = ОбщиеДанныеДокументов(ПриемкаТовара);
	
	// Создание перемещения запасов
	Если Не РезультатПеремещение.Пустой() Тогда
		
		Перемещение = Документы.ПеремещениеЗапасов.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(Перемещение, ПриемкаТовара,, "Номер, Дата");
		ЗаполнитьЗначенияСвойств(Перемещение, ОбщиеДанныеДокументов);
		
		ТаблицаЗапасы = РезультатПеремещение.Выгрузить();
		
		Если спРаботаСЯчейкамиВызовСервера.ЕстьЯчейки(Перемещение.СтруктурнаяЕдиницаПолучатель) Тогда
			Перемещение.ПоложениеЯчейкиПолучателя = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти; 
		КонецЕсли;
		
		Перемещение.Запасы.Загрузить(ТаблицаЗапасы);

		Попытка 
			
			Если Перемещение.ПроверитьЗаполнение() Тогда
				Перемещение.Записать(РежимЗаписиДокумента.Проведение);
			Иначе
				Перемещение.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли;
			
		Исключение
			
			РезультатФункции.Успех = Ложь;
			Перемещение.Записать(РежимЗаписиДокумента.Запись); 
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			спЛогированиеСобытийИБ.ЛогироватьСобытиеИБ("ПриемкаТоваров", "Ошибка",,Перемещение.Ссылка, Ошибка);
			
			КраткаяОшибка = СтрШаблон(ШаблонОшибки, Перемещение.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(КраткаяОшибка, Перемещение.Ссылка);                      
			
		КонецПопытки;
		
		РезультатФункции.Перемещение = Перемещение.Ссылка;
	
	КонецЕсли;
	
	// Создание акта о расхождениях
	Если Не РезультатАкт.Пустой() Тогда
		
		АктОРасхождениях = Документы.спАктОРасхожденияхПриПеремещении.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(АктОРасхождениях, ПриемкаТовара,, "Номер, Дата");
		ЗаполнитьЗначенияСвойств(АктОРасхождениях, ОбщиеДанныеДокументов);
		
		ТаблицаЗапасы = РезультатАкт.Выгрузить();
		
		АктОРасхождениях.Товары.Загрузить(ТаблицаЗапасы);
		
		АктОРасхождениях.ЗаказНаПеремещение = ПриемкаТовара.ДокументОснование;
		АктОРасхождениях.ИтогоИзлишек		= ТаблицаЗапасы.Итог("Излишек");
		АктОРасхождениях.ИтогоНедостача		= ТаблицаЗапасы.Итог("Недостача");
		
		Попытка 
			
			АктОРасхождениях.Записать(РежимЗаписиДокумента.Проведение); 
			
		Исключение
			
			РезультатФункции.Успех = Ложь;
			АктОРасхождениях.Записать(РежимЗаписиДокумента.Запись);
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
			спЛогированиеСобытийИБ.ЛогироватьСобытиеИБ("ПриемкаТоваров", "Ошибка",, АктОРасхождениях.Ссылка, Ошибка);
			
			КраткаяОшибка = СтрШаблон(ШаблонОшибки, АктОРасхождениях.Ссылка);
			ОбщегоНазначения.СообщитьПользователю(КраткаяОшибка, АктОРасхождениях.Ссылка);                      
			
		КонецПопытки;
		
		РезультатФункции.Акт = АктОРасхождениях.Ссылка;
	
	КонецЕсли;
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбщиеДанныеДокументов(ПриемкаТовара) 
	
	ОбщиеДанныеДокументов = Новый Структура;
	ОбщиеДанныеДокументов.Вставить("Дата", ТекущаяДатаСеанса());
	ОбщиеДанныеДокументов.Вставить("Автор", Пользователи.ТекущийПользователь());
	ОбщиеДанныеДокументов.Вставить("ВидОперации", Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение);
	ОбщиеДанныеДокументов.Вставить("Организация", ПриемкаТовара.Организация);
	ОбщиеДанныеДокументов.Вставить("СтруктурнаяЕдиница", ПриемкаТовара.СтруктурнаяЕдиницаРезерв);
	ОбщиеДанныеДокументов.Вставить("ЗаказНаПеремещение", ПриемкаТовара.ДокументОснование);
	
	Возврат ОбщиеДанныеДокументов;
	
КонецФункции

#КонецОбласти

#Область ИнтеграцияГосИС

&НаКлиенте
Процедура ОповещениеПриОкончанииРедактированияТабличнойЧастиИС(Результат, ДополнительныеПараметры) Экспорт
	ПриОкончанииРедактированияТабличнойЧастиИСНаСервере(ДополнительныеПараметры);
КонецПроцедуры

&НаСервере
Процедура ПриОкончанииРедактированияТабличнойЧастиИСНаСервере(ДополнительныеПараметры)
	СобытияФормИСУНФ.ПриИзмененииЭлемента(ЭтотОбъект, "ТабличнаяЧасть", ДополнительныеПараметры);
КонецПроцедуры

//@skip-check module-unused-method
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормИСУНФКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти