#Область ПрограммныйИнтерфейс

// Возвращает постоянные параметры для отправки приходной накладной по ЭДО
// 
// Параметры:
//  Основание - ДокументСсылка.ПриходнаяНакладная - ссылка на приходную накладную 
// 
// Возвращаемое значение:
//   - Структура - параметры отпрвка ПН по ЭДО:
//		* Организация 	- СправочникСсылка.Организации - отправитель для ПН по ЭДО
//      * Контрагент 	- СправочникСсылка.Контрагенты - получатель для ПН по ЭДО 
//		* Договор 		- СправочникСсылка.ДоговорыКонтрагентов - договор с покупателем для ПН по ЭДО
//                    
Функция Т_ПараметрыОтправкиПриходнойЭДО() Экспорт

	КлючОбъекта = "Обработка.Т_ОтправкаПриходнойНакладнойЭДО";
	ПараметрыОтправки = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить(КлючОбъекта, КлючОбъекта, Новый Структура,, ИмяПользователя());
	
	Возврат ПараметрыОтправки;
	
КонецФункции 

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&ИзменениеИКонтроль("ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_2019")
Процедура спЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_2019(СсылкаНаОбъект, Настройки, ДеревоДанных, Отказ)

	Если Не ИнтеграцияМОТПУНФ.ПроверитьМаркируемуюПродукциюДокумента(СсылкаНаОбъект) Тогда
		ВидОперации          = НСтр("ru = 'Формирование ЭД';
		|en = 'ED generation'");
		ПодробныйТекстОшибки = НСтр("ru = 'Ошибка при формирование ЭД: Неверное указание маркированной продукции.';
		|en = 'An error occurred when generating an electronic document: Marked manufactured products are specified incorrectly.'");
		ТекстСообщения       = НСтр("ru = 'Проверьте указание кодов маркировки.';
		|en = 'Check labeling codes.'");
		ЭлектронноеВзаимодействие.ОбработатьОшибку(ВидОперации, ПодробныйТекстОшибки, ТекстСообщения,, СсылкаНаОбъект);
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.РасходнаяНакладная")
		ИЛИ ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.КорректировкаРеализации")
		ИЛИ (ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ЗаказПокупателя")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "ВидОперации") = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд) Тогда
		ДанныеДляФормированияЭД = ПолучитьДанныеРеализацииТоваровИУслуг(СсылкаНаОбъект);
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда
		ДанныеДляФормированияЭД = ПолучитьДанныеПередачаТоваровМеждуОрганизациями(СсылкаНаОбъект);
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ОтчетОПереработке") Тогда
		ДанныеДляФормированияЭД = ПолучитьДанныеОтчетОПереработке(СсылкаНаОбъект);
	#Вставка
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ПриходнаяНакладная") 
	    ИЛИ ТипЗнч(СсылкаНаОбъект) = Тип("ДокументОбъект.ПриходнаяНакладная") Тогда
		ДанныеДляФормированияЭД = Т_ДанныеДляФормированияЭД_ЭмуляцияРасходной(СсылкаНаОбъект, Настройки);
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ПеремещениеЗапасов") 
	    ИЛИ ТипЗнч(СсылкаНаОбъект) = Тип("ДокументОбъект.ПеремещениеЗапасов") Тогда
		ДанныеДляФормированияЭД = Т_ДанныеДляФормированияЭД_ЭмуляцияРасходной(СсылкаНаОбъект, Настройки);
	#КонецВставки
	Иначе
		ДанныеДляФормированияЭД = ПолучитьДанныеАктВыполненныхРабот(СсылкаНаОбъект);
		ДанныеДляФормированияЭД.Вставить("ТаблицаТоваров", ДанныеДляФормированияЭД.ТаблицаРабот);
	КонецЕсли;

	ДокументыОснования = Новый Массив;
	ДокументыОснования.Добавить(СсылкаНаОбъект);
	ДанныеДляФормированияЭД.Вставить("ДокументыОснования", ДокументыОснования);


	ЗаполнитьДанныеПервичногоДокументаУПД_2019(ДанныеДляФормированияЭД, Настройки, ДеревоДанных, Отказ);

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_5_02")
Процедура спЗаполнитьДанныеДляДОПИнформацияПродавцаФНС_5_02(СсылкаНаОбъект, Настройки, ДеревоДанных, Отказ)

	Если Не ИнтеграцияМОТПУНФ.ПроверитьМаркируемуюПродукциюДокумента(СсылкаНаОбъект) Тогда
		ВидОперации          = НСтр("ru = 'Формирование ЭД';
		|en = 'ED generation'");
		ПодробныйТекстОшибки = НСтр("ru = 'Ошибка при формирование ЭД: Неверное указание маркированной продукции.';
		|en = 'An error occurred when generating an electronic document: Marked manufactured products are specified incorrectly.'");
		ТекстСообщения       = НСтр("ru = 'Проверьте указание кодов маркировки.';
		|en = 'Check labeling codes.'");
		ЭлектронноеВзаимодействие.ОбработатьОшибку(ВидОперации, ПодробныйТекстОшибки, ТекстСообщения,, СсылкаНаОбъект);
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.РасходнаяНакладная")
		ИЛИ ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.КорректировкаРеализации")
		ИЛИ (ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ЗаказПокупателя")
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаНаОбъект, "ВидОперации") = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд) Тогда
		ДанныеДляФормированияЭД = ПолучитьДанныеРеализацииТоваровИУслуг(СсылкаНаОбъект);
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями") Тогда
		ДанныеДляФормированияЭД = ПолучитьДанныеПередачаТоваровМеждуОрганизациями(СсылкаНаОбъект);
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ОтчетОПереработке") Тогда
		ДанныеДляФормированияЭД = ПолучитьДанныеОтчетОПереработке(СсылкаНаОбъект);
	#Вставка
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ПриходнаяНакладная") 
	    ИЛИ ТипЗнч(СсылкаНаОбъект) = Тип("ДокументОбъект.ПриходнаяНакладная") Тогда
		ДанныеДляФормированияЭД = Т_ДанныеДляФормированияЭД_ЭмуляцияРасходной(СсылкаНаОбъект, Настройки);
	ИначеЕсли ТипЗнч(СсылкаНаОбъект) = Тип("ДокументСсылка.ПеремещениеЗапасов") 
	    ИЛИ ТипЗнч(СсылкаНаОбъект) = Тип("ДокументОбъект.ПеремещениеЗапасов") Тогда
		ДанныеДляФормированияЭД = Т_ДанныеДляФормированияЭД_ЭмуляцияРасходной(СсылкаНаОбъект, Настройки);
	#КонецВставки
	Иначе
		ДанныеДляФормированияЭД = ПолучитьДанныеАктВыполненныхРабот(СсылкаНаОбъект);
		ДанныеДляФормированияЭД.Вставить("ТаблицаТоваров", ДанныеДляФормированияЭД.ТаблицаРабот);
	КонецЕсли;

	ДокументыОснования = Новый Массив;
	ДокументыОснования.Добавить(СсылкаНаОбъект);
	ДанныеДляФормированияЭД.Вставить("ДокументыОснования", ДокументыОснования);

	ДанныеДляФормированияЭД.Вставить("ЭтоФормат502", Истина);

	ЗаполнитьОсновнуюЧастьУПД_5_02(ДанныеДляФормированияЭД, Настройки, ДеревоДанных, Отказ);
	ЗаполнитьРасширеннуюЧастьУПД_5_02(ДанныеДляФормированияЭД, Настройки, ДеревоДанных); 

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область НетиповыеПроцедурыИФункции

// Возвращает данные для формирования электронного документа,
// Эмулируя создание Расходной накладной на основании Приходной накладной
//
// Параметры:
//  СсылкаНаОбъект	 - ДокументСсылка.ПриходнаяНакладная - приходная накладная
// 
// Возвращаемое значение:
//   - Струткура - данные для формирования элемктронного документа.
//
Функция Т_ДанныеДляФормированияЭД_ЭмуляцияРасходной(СсылкаНаОбъект, Настройки)
	
	ДанныеДляФормированияЭД = Новый Структура;
	
	НачатьТранзакцию();
	
	Попытка
		
		// Создаем на основании Приходной Расходную
		РасходнаяНакладная = Документы.РасходнаяНакладная.СоздатьДокумент();
		
		// Заполняем Расходную
		//РасходнаяНакладная.Заполнить(СсылкаНаОбъект); 
		Т_ЗаполнитьОбязательныеРеквизиты(РасходнаяНакладная, СсылкаНаОбъект);
		
		// При эмуляции учет остатков не нужен.	Возврат контроля произойдет при отмене транзации.
		Константы.КонтролироватьОстаткиПриПроведении.Установить(Ложь);
		
		// Записываем Расходную накладную
		РасходнаяНакладная.Записать(РежимЗаписиДокумента.Проведение); 
		
		// Создаем счет-фактуру 
		ДанныеСчетФактуры = СчетаФактурыУНФ.СоздатьСчетФактуру(РасходнаяНакладная.Ссылка, РасходнаяНакладная.Дата);
		//
		
		// Вызывываем исключение
		ВызватьИсключение "Эмуляция прошла успешно."; 
		
		// До этого места не дойдет никогда, но фиксирующая скобка нужна
		ЗафиксироватьТранзакцию();
		
	Исключение     
		
		Если ЗначениеЗаполнено(РасходнаяНакладная.Ссылка) Тогда
			
			// Если эмуляция прошла успешно.
			ДанныеДляФормированияЭД = ПолучитьДанныеРеализацииТоваровИУслуг(РасходнаяНакладная.Ссылка);
			Т_РедактироватьДанные(ДанныеДляФормированияЭД, Настройки);
			ОтменитьТранзакцию();
			
		Иначе                           
			
			// Если при эмуляции возникли ошибки
			ОтменитьТранзакцию();         
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке); 
			
		КонецЕсли;

	КонецПопытки;

	Возврат ДанныеДляФормированияЭД;
	
КонецФункции 

Процедура Т_РедактироватьДанные(ДанныеДляФормированияЭД, Настройки)

	Настройки.Вставить("ВидОперацииЭД", 	Перечисления.ВидыОперацийЭД.ПустаяСсылка());
	Настройки.Вставить("ОснованиеПечати", 	"Договор № ПФС-012/2024 от 18.09.2024");
	
КонецПроцедуры

// Заполняет Расходную накладную необходимыми данными
//
// Параметры:
//  ДокументОбъект	 - ДокументОбъект.РасходнаяНакладная - объект заполняемого документа 
//  Основание		 - ДокументСсылка.ПриходнаяНакладная - ссылка на приходную накладную
//
Процедура Т_ЗаполнитьОбязательныеРеквизиты(ДокументОбъект, Основание) Экспорт // добавлен Экспорт  Разумов А.А. (TNEXT) 30.08.2025 Задача № 3950 Передача документов на склад Просто
	
	НеЗаполняемыеСвойства = "Номер";
    ДанныеЗаполнения = Новый Структура;
	
	ПараметрыОтправкиПН = Т_ПараметрыОтправкиПриходнойЭДО();
	
	ДанныеЗаполнения.Вставить("ЭтоУниверсальныйДокумент", 	Истина);
	ДанныеЗаполнения.Вставить("Грузоотправитель", 			ПараметрыОтправкиПН.Организация);
	ДанныеЗаполнения.Вставить("Организация", 				ПараметрыОтправкиПН.Организация);
	ДанныеЗаполнения.Вставить("Грузополучатель",  			ПараметрыОтправкиПН.Контрагент);
	ДанныеЗаполнения.Вставить("Контрагент",  	  			ПараметрыОтправкиПН.Контрагент);
	ДанныеЗаполнения.Вставить("Договор",  	  	  			ПараметрыОтправкиПН.ДоговорКонтрагента);
	ДанныеЗаполнения.Вставить("АдресДоставки",  	  	  	ПараметрыОтправкиПН.АдресДоставки);
	ДанныеЗаполнения.Вставить("ВалютаДокумента",  	  	  	ПараметрыОтправкиПН.ВалютаДокумента);
	ДанныеЗаполнения.Вставить("Кратность",  	  	  		1);
	
    ЗаполнитьЗначенияСвойств(ДокументОбъект, Основание,, НеЗаполняемыеСвойства);
	ЗаполнитьЗначенияСвойств(ДокументОбъект, ДанныеЗаполнения);
	
	// Заполнение ТЧ   
	// Запасы        
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		
		Если ЗначениеЗаполнено(Основание.ДокументОснование) И ТипЗнч(Основание.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			
			Запасы = Т_ЗапасыСЦенамиОснования(Основание, Основание.ДокументОснование);
			
		Иначе
			
			Запасы = Т_ЗапасыСЦенамиПродажи(Основание);
			
		КонецЕсли;
		
	Иначе
		
		Запасы = Основание.Запасы.Выгрузить();
		
	КонецЕсли;
	
	Для Каждого Строка Из Запасы Цикл
		
		НоваяСтрока = ДокументОбъект.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
	// Штрихкоды упаковок 
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		
		Если ЗначениеЗаполнено(Основание.ДокументОснование) И ТипЗнч(Основание.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
			
			ШтрихкодыУпаковок = Т_ШтрихкодыУпаковокИзДокументаОснования(Запасы, Основание.ДокументОснование);
			
		Иначе
			
			ВызватьИсключение 
			НСтр("ru = 'Предусмотрена отправка ""Товарной накладной"" по документу ""Перемещение запасов"", созданному только на основании ""Приходной накладной""'");
			
		КонецЕсли;
		
	Иначе   
		
		ШтрихкодыУпаковок = Основание.ШтрихкодыУпаковок.Выгрузить();
		
	КонецЕсли;	
	
	Для Каждого Строка Из ШтрихкодыУпаковок Цикл
		
		Если ЗначениеЗаполнено(Строка.ШтрихкодУпаковки) Тогда
			НоваяСтрока = ДокументОбъект.ШтрихкодыУпаковок.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЕсли;
		
	КонецЦикла; 

	// Серии
	Для Каждого Строка Из Основание.СерииНоменклатуры Цикл
		
		НоваяСтрока = ДокументОбъект.СерииНоменклатуры.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;
	
КонецПроцедуры

Функция Т_ЗапасыСЦенамиОснования(Основание, Приходная)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеЗапасовЗапасы.Ссылка КАК Ссылка,
		|	ПеремещениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
		|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
		|	ПеремещениеЗапасовЗапасы.Характеристика КАК Характеристика,
		|	ПеремещениеЗапасовЗапасы.Партия КАК Партия,
		|	ПеремещениеЗапасовЗапасы.СерииНоменклатуры КАК СерииНоменклатуры,
		|	ПеремещениеЗапасовЗапасы.Количество КАК Количество,
		|	ПеремещениеЗапасовЗапасы.Резерв КАК Резерв,
		|	ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ПеремещениеЗапасовЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ПеремещениеЗапасовЗапасы.Себестоимость КАК Себестоимость,
		|	ПеремещениеЗапасовЗапасы.Сумма КАК Сумма,
		|	ПеремещениеЗапасовЗапасы.КлючСвязи КАК КлючСвязи,
		|	ПеремещениеЗапасовЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ПеремещениеЗапасовЗапасы.НомерГТД КАК НомерГТД,
		|	ПеремещениеЗапасовЗапасы.Проект КАК Проект,
		|	ПеремещениеЗапасовЗапасы.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ПеремещениеЗапасовЗапасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
		|	ПеремещениеЗапасовЗапасы.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
		|	ПеремещениеЗапасовЗапасы.УчитыватьВНУ КАК УчитыватьВНУ,
		|	ПеремещениеЗапасовЗапасы.Ячейка КАК Ячейка,
		|	ПеремещениеЗапасовЗапасы.ЯчейкаПолучатель КАК ЯчейкаПолучатель,
		|	ПеремещениеЗапасовЗапасы.Вес КАК Вес,
		|	ПеремещениеЗапасовЗапасы.Объем КАК Объем,
		|	МАКСИМУМ(ЕСТЬNULL(СтавкиНДС.Ссылка, """")) КАК СтавкаНДС
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
		|		ПО ПеремещениеЗапасовЗапасы.Номенклатура.ВидСтавкиНДС = СтавкиНДС.ВидСтавкиНДС
		|ГДЕ
		|	ПеремещениеЗапасовЗапасы.Ссылка = &Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеЗапасовЗапасы.Характеристика,
		|	ПеремещениеЗапасовЗапасы.ЗаказПокупателя,
		|	ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения,
		|	ПеремещениеЗапасовЗапасы.Номенклатура,
		|	ПеремещениеЗапасовЗапасы.Партия,
		|	ПеремещениеЗапасовЗапасы.СерииНоменклатуры,
		|	ПеремещениеЗапасовЗапасы.СтранаПроисхождения,
		|	ПеремещениеЗапасовЗапасы.НомерГТД,
		|	ПеремещениеЗапасовЗапасы.Проект,
		|	ПеремещениеЗапасовЗапасы.ИдентификаторСтроки,
		|	ПеремещениеЗапасовЗапасы.ПрослеживаемыйТовар,
		|	ПеремещениеЗапасовЗапасы.ПрослеживаемыйКомплект,
		|	ПеремещениеЗапасовЗапасы.УчитыватьВНУ,
		|	ПеремещениеЗапасовЗапасы.Ячейка,
		|	ПеремещениеЗапасовЗапасы.ЯчейкаПолучатель,
		|	ПеремещениеЗапасовЗапасы.Вес,
		|	ПеремещениеЗапасовЗапасы.Объем,
		|	ПеремещениеЗапасовЗапасы.НомерСтроки,
		|	ПеремещениеЗапасовЗапасы.Количество,
		|	ПеремещениеЗапасовЗапасы.Резерв,
		|	ПеремещениеЗапасовЗапасы.Себестоимость,
		|	ПеремещениеЗапасовЗапасы.Сумма,
		|	ПеремещениеЗапасовЗапасы.КлючСвязи,
		|	ПеремещениеЗапасовЗапасы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
		|	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ПриходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
		|	ПриходнаяНакладнаяЗапасы.СерииНоменклатуры КАК СерииНоменклатуры,
		|	ПриходнаяНакладнаяЗапасы.Цена КАК Цена,
		|	СУММА(ПриходнаяНакладнаяЗапасы.СуммаСкидкиНаценки) КАК СуммаСкидкиНаценки,
		|	СУММА(ПриходнаяНакладнаяЗапасы.Сумма) КАК Сумма,
		|	ПриходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
		|	СУММА(ПриходнаяНакладнаяЗапасы.СуммаНДС) КАК СуммаНДС,
		|	СУММА(ПриходнаяНакладнаяЗапасы.Всего) КАК Всего,
		|	ПриходнаяНакладнаяЗапасы.Себестоимость КАК Себестоимость,
		|	СУММА(ПриходнаяНакладнаяЗапасы.СуммаРасходов) КАК СуммаРасходов,
		|	ПриходнаяНакладнаяЗапасы.НеобходимостьВводаАкцизнойМарки КАК НеобходимостьВводаАкцизнойМарки,
		|	ПриходнаяНакладнаяЗапасы.Партия КАК Партия,
		|	СУММА(ПриходнаяНакладнаяЗапасы.Количество) КАК Количество,
		|	ПриходнаяНакладнаяЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ПриходнаяНакладнаяЗапасы.НомерГТД КАК НомерГТД,
		|	ПриходнаяНакладнаяЗапасы.ТоварыДляПроизводства КАК ТоварыДляПроизводства,
		|	ПриходнаяНакладнаяЗапасы.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
		|	ПриходнаяНакладнаяЗапасы.Ячейка КАК Ячейка,
		|	ПриходнаяНакладнаяЗапасы.НоменклатураНабора КАК НоменклатураНабора,
		|	ПриходнаяНакладнаяЗапасы.ХарактеристикаНабора КАК ХарактеристикаНабора,
		|	ПриходнаяНакладнаяЗапасы.Штрихкод КАК Штрихкод,
		|	ПриходнаяНакладнаяЗапасы.НоменклатураЕГАИС КАК НоменклатураЕГАИС,
		|	ПриходнаяНакладнаяЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
		|	СУММА(ПриходнаяНакладнаяЗапасы.КоличествоСправочно) КАК КоличествоСправочно,
		|	ПриходнаяНакладнаяЗапасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
		|	ПриходнаяНакладнаяЗапасы.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
		|	СУММА(ПриходнаяНакладнаяЗапасы.СуммаРасходовБезНДС) КАК СуммаРасходовБезНДС,
		|	ПриходнаяНакладнаяЗапасы.ДокументПоступления КАК ДокументПоступления,
		|	СУММА(ПриходнаяНакладнаяЗапасы.СуммаПередачи) КАК СуммаПередачи,
		|	СУММА(ПриходнаяНакладнаяЗапасы.СуммаНДСПередачи) КАК СуммаНДСПередачи,
		|	ПриходнаяНакладнаяЗапасы.НоменклатураПоставщика КАК НоменклатураПоставщика,
		|	ПриходнаяНакладнаяЗапасы.ПодакцизныйТовар КАК ПодакцизныйТовар,
		|	СУММА(ПриходнаяНакладнаяЗапасы.СуммаАкциза) КАК СуммаАкциза,
		|	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмеренияАкциза КАК ЕдиницаИзмеренияАкциза,
		|	ПриходнаяНакладнаяЗапасы.ОкруглятьДоЦелого КАК ОкруглятьДоЦелого
		|ПОМЕСТИТЬ ВТ_ЗапасыОснования
		|ИЗ
		|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		|ГДЕ
		|	ПриходнаяНакладнаяЗапасы.Ссылка = &Приходная
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриходнаяНакладнаяЗапасы.Номенклатура,
		|	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмерения,
		|	ПриходнаяНакладнаяЗапасы.СерииНоменклатуры,
		|	ПриходнаяНакладнаяЗапасы.Характеристика,
		|	ПриходнаяНакладнаяЗапасы.СтавкаНДС,
		|	ПриходнаяНакладнаяЗапасы.НеобходимостьВводаАкцизнойМарки,
		|	ПриходнаяНакладнаяЗапасы.Партия,
		|	ПриходнаяНакладнаяЗапасы.СтранаПроисхождения,
		|	ПриходнаяНакладнаяЗапасы.НомерГТД,
		|	ПриходнаяНакладнаяЗапасы.ТоварыДляПроизводства,
		|	ПриходнаяНакладнаяЗапасы.СтруктурнаяЕдиница,
		|	ПриходнаяНакладнаяЗапасы.Ячейка,
		|	ПриходнаяНакладнаяЗапасы.НоменклатураНабора,
		|	ПриходнаяНакладнаяЗапасы.ХарактеристикаНабора,
		|	ПриходнаяНакладнаяЗапасы.Штрихкод,
		|	ПриходнаяНакладнаяЗапасы.НоменклатураЕГАИС,
		|	ПриходнаяНакладнаяЗапасы.ЗаказПокупателя,
		|	ПриходнаяНакладнаяЗапасы.ПрослеживаемыйТовар,
		|	ПриходнаяНакладнаяЗапасы.ПрослеживаемыйКомплект,
		|	ПриходнаяНакладнаяЗапасы.ДокументПоступления,
		|	ПриходнаяНакладнаяЗапасы.НоменклатураПоставщика,
		|	ПриходнаяНакладнаяЗапасы.ПодакцизныйТовар,
		|	ПриходнаяНакладнаяЗапасы.ЕдиницаИзмеренияАкциза,
		|	ПриходнаяНакладнаяЗапасы.ОкруглятьДоЦелого,
		|	ПриходнаяНакладнаяЗапасы.Цена,
		|	ПриходнаяНакладнаяЗапасы.Себестоимость
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Количество КАК Количество,
		|	ВТ_Запасы.Номенклатура КАК Номенклатура,
		|	ВТ_Запасы.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.ЕдиницаИзмерения, ВТ_Запасы.ЕдиницаИзмерения)  КАК ЕдиницаИзмерения,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.СерииНоменклатуры, ВТ_Запасы.СерииНоменклатуры) КАК СерииНоменклатуры,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.СуммаСкидкиНаценки, 0) КАК СуммаСкидкиНаценки,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.Сумма, 0) * ЕСТЬNULL(ВТ_Запасы.Количество, 0) / ВТ_ЗапасыОснования.Количество КАК Сумма,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.СтавкаНДС, ВТ_Запасы.СтавкаНДС) КАК СтавкаНДС,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.СуммаНДС, 0) * ЕСТЬNULL(ВТ_Запасы.Количество, 0) / ВТ_ЗапасыОснования.Количество КАК СуммаНДС,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.Всего, 0) * ЕСТЬNULL(ВТ_Запасы.Количество, 0) / ВТ_ЗапасыОснования.Количество КАК Всего,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.Себестоимость, ВТ_Запасы.Себестоимость) КАК Себестоимость,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.СуммаРасходов, 0) КАК СуммаРасходов,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.НеобходимостьВводаАкцизнойМарки, Неопределено) КАК НеобходимостьВводаАкцизнойМарки,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.Партия, Неопределено) КАК Партия,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.СтранаПроисхождения, ВТ_Запасы.СтранаПроисхождения) КАК СтранаПроисхождения,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.НомерГТД, Неопределено) КАК НомерГТД,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.ТоварыДляПроизводства, Неопределено) КАК ТоварыДляПроизводства,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.СтруктурнаяЕдиница, Неопределено) КАК СтруктурнаяЕдиница,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.Ячейка, Неопределено) КАК Ячейка,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.НоменклатураНабора, Неопределено) КАК НоменклатураНабора,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.ХарактеристикаНабора, Неопределено) КАК ХарактеристикаНабора,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.Штрихкод, Неопределено) КАК Штрихкод,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.НоменклатураЕГАИС, Неопределено) КАК НоменклатураЕГАИС,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.ЗаказПокупателя, Неопределено) КАК ЗаказПокупателя,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.КоличествоСправочно, Неопределено) КАК КоличествоСправочно,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.ПрослеживаемыйТовар, Неопределено) КАК ПрослеживаемыйТовар,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.ПрослеживаемыйКомплект, Неопределено) КАК ПрослеживаемыйКомплект,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.СуммаРасходовБезНДС, Неопределено) КАК СуммаРасходовБезНДС,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.ДокументПоступления, Неопределено) КАК ДокументПоступления,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.СуммаПередачи, Неопределено) КАК СуммаПередачи,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.СуммаНДСПередачи, Неопределено) КАК СуммаНДСПередачи,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.НоменклатураПоставщика, Неопределено) КАК НоменклатураПоставщика,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.ПодакцизныйТовар, Неопределено) КАК ПодакцизныйТовар,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.СуммаАкциза, Неопределено) КАК СуммаАкциза,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.ЕдиницаИзмеренияАкциза, Неопределено) КАК ЕдиницаИзмеренияАкциза,
		|	ЕСТЬNULL(ВТ_ЗапасыОснования.ОкруглятьДоЦелого, Неопределено) КАК ОкруглятьДоЦелого
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗапасыОснования КАК ВТ_ЗапасыОснования
		|		ПО ВТ_Запасы.Номенклатура = ВТ_ЗапасыОснования.Номенклатура
		|			И ВТ_Запасы.Характеристика = ВТ_ЗапасыОснования.Характеристика";
	
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("Приходная", 	Приходная);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ЗапасыСЦенами = РезультатЗапроса.Выгрузить();
	
	Возврат ЗапасыСЦенами;

КонецФункции

Функция Т_ШтрихкодыУпаковокИзДокументаОснования(Запасы, Приходная)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫРАЗИТЬ(Запасы.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	Запасы.Характеристика КАК Характеристика,
		|	Запасы.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&Запасы КАК Запасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Номенклатура КАК Номенклатура,
		|	ВТ_Запасы.Характеристика КАК Характеристика,
		|	СУММА(ВТ_Запасы.Количество) КАК Количество
		|ПОМЕСТИТЬ ВТ_СгруппированныеЗапасы
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Запасы.Номенклатура,
		|	ВТ_Запасы.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ПриходнаяНакладнаяШтрихкодыУпаковок.ШтрихкодУпаковки, НЕОПРЕДЕЛЕНО) КАК ШтрихкодУпаковки,
		|	ВТ_СгруппированныеЗапасы.Количество КАК Количество,
		|	ВТ_СгруппированныеЗапасы.Номенклатура КАК Номенклатура,
		|	ВТ_СгруппированныеЗапасы.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_КодыМаркироки
		|ИЗ
		|	ВТ_СгруппированныеЗапасы КАК ВТ_СгруппированныеЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.ШтрихкодыУпаковок КАК ПриходнаяНакладнаяШтрихкодыУпаковок
		|		ПО ВТ_СгруппированныеЗапасы.Номенклатура = ПриходнаяНакладнаяШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура
		|			И ВТ_СгруппированныеЗапасы.Характеристика = ПриходнаяНакладнаяШтрихкодыУпаковок.ШтрихкодУпаковки.Характеристика
		|			И (ПриходнаяНакладнаяШтрихкодыУпаковок.Ссылка = &Приходная)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КодыМаркироки.ШтрихкодУпаковки КАК ШтрихкодУпаковки
		|ИЗ
		|	ВТ_КодыМаркироки КАК ВТ_КодыМаркироки
		|ГДЕ
		|	ВТ_КодыМаркироки.ШтрихкодУпаковки <> НЕОПРЕДЕЛЕНО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_КодыМаркироки.Номенклатура.Представление КАК Номенклатура,
		|	ВТ_КодыМаркироки.Номенклатура.Артикул КАК Артикул,
		|	ВТ_КодыМаркироки.Характеристика КАК Характеристика,
		|	ВЫБОР
		|		КОГДА МИНИМУМ(ВТ_КодыМаркироки.ШтрихкодУпаковки) = НЕОПРЕДЕЛЕНО
		|			ТОГДА МАКСИМУМ(ВТ_КодыМаркироки.Количество)
		|		ИНАЧЕ МАКСИМУМ(ВТ_КодыМаркироки.Количество) - КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_КодыМаркироки.ШтрихкодУпаковки)
		|	КОНЕЦ КАК НедостающееКоличество
		|ИЗ
		|	ВТ_КодыМаркироки КАК ВТ_КодыМаркироки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_КодыМаркироки.Номенклатура.Представление,
		|	ВТ_КодыМаркироки.Номенклатура.Артикул,
		|	ВТ_КодыМаркироки.Характеристика
		|
		|ИМЕЮЩИЕ
		|	НЕ(МИНИМУМ(ВТ_КодыМаркироки.ШтрихкодУпаковки) <> НЕОПРЕДЕЛЕНО
		|			И НЕ КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_КодыМаркироки.ШтрихкодУпаковки) < МАКСИМУМ(ВТ_КодыМаркироки.Количество))";
	
	Запрос.УстановитьПараметр("Запасы", 	Запасы);
	Запрос.УстановитьПараметр("Приходная", 	Приходная);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	// Проверка нахождения в приходной всех кодов маркировки
	НенайденныеКодыМаркировки = РезультатыЗапроса[РезультатыЗапроса.ВГраница()];
	Если Не НенайденныеКодыМаркировки.Пустой() Тогда 
		
		ВыборкаНенайденных = НенайденныеКодыМаркировки.Выбрать();
		МассивНеНайденныхКодов = Новый Массив;
		
		Пока ВыборкаНенайденных.Следующий() Цикл
			
			Шаблон = НСтр("ru = 'Для товара %1, %2, %3 недостаточно кодов маркировки для отправки: %4 шт.'");
			
			ТекстОшибкиПоСтроке = СтрШаблон(Шаблон, ВыборкаНенайденных.Номенклатура, ВыборкаНенайденных.Артикул, 
									ВыборкаНенайденных.Характеристика, ВыборкаНенайденных.НедостающееКоличество);
			
			МассивНеНайденныхКодов.Добавить(ТекстОшибкиПоСтроке);
			
		КонецЦикла; 
		
		ТекстИсключения = СтрСоединить(МассивНеНайденныхКодов, Символы.ПС);
		
		ВызватьИсключение ТекстИсключения; 
	// Конец проверки	
	Иначе
	
		ШтрихкодыУпаковок = РезультатыЗапроса[РезультатыЗапроса.ВГраница() - 1].Выгрузить();
		
		Возврат ШтрихкодыУпаковок;
		
	КонецЕсли;

КонецФункции

Функция Т_ЗапасыСЦенамиПродажи(Основание)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеЗапасовЗапасы.Ссылка КАК Ссылка,
		|	ПеремещениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
		|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
		|	ПеремещениеЗапасовЗапасы.Характеристика КАК Характеристика,
		|	ПеремещениеЗапасовЗапасы.Партия КАК Партия,
		|	ПеремещениеЗапасовЗапасы.СерииНоменклатуры КАК СерииНоменклатуры,
		|	ПеремещениеЗапасовЗапасы.Количество КАК Количество,
		|	ПеремещениеЗапасовЗапасы.Резерв КАК Резерв,
		|	ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ПеремещениеЗапасовЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ПеремещениеЗапасовЗапасы.Себестоимость КАК Себестоимость,
		|	ПеремещениеЗапасовЗапасы.Сумма КАК Сумма,
		|	ПеремещениеЗапасовЗапасы.КлючСвязи КАК КлючСвязи,
		|	ПеремещениеЗапасовЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ПеремещениеЗапасовЗапасы.НомерГТД КАК НомерГТД,
		|	ПеремещениеЗапасовЗапасы.Проект КАК Проект,
		|	ПеремещениеЗапасовЗапасы.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ПеремещениеЗапасовЗапасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
		|	ПеремещениеЗапасовЗапасы.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
		|	ПеремещениеЗапасовЗапасы.УчитыватьВНУ КАК УчитыватьВНУ,
		|	ПеремещениеЗапасовЗапасы.Ячейка КАК Ячейка,
		|	ПеремещениеЗапасовЗапасы.ЯчейкаПолучатель КАК ЯчейкаПолучатель,
		|	ПеремещениеЗапасовЗапасы.Вес КАК Вес,
		|	ПеремещениеЗапасовЗапасы.Объем КАК Объем,
		|	МАКСИМУМ(ЕСТЬNULL(СтавкиНДС.Ссылка, """")) КАК СтавкаНДС
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтавкиНДС КАК СтавкиНДС
		|		ПО ПеремещениеЗапасовЗапасы.Номенклатура.ВидСтавкиНДС = СтавкиНДС.ВидСтавкиНДС
		|ГДЕ
		|	ПеремещениеЗапасовЗапасы.Ссылка = &Основание
		|
		|СГРУППИРОВАТЬ ПО
		|	ПеремещениеЗапасовЗапасы.Характеристика,
		|	ПеремещениеЗапасовЗапасы.ЗаказПокупателя,
		|	ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения,
		|	ПеремещениеЗапасовЗапасы.Номенклатура,
		|	ПеремещениеЗапасовЗапасы.Партия,
		|	ПеремещениеЗапасовЗапасы.СерииНоменклатуры,
		|	ПеремещениеЗапасовЗапасы.СтранаПроисхождения,
		|	ПеремещениеЗапасовЗапасы.НомерГТД,
		|	ПеремещениеЗапасовЗапасы.Проект,
		|	ПеремещениеЗапасовЗапасы.ИдентификаторСтроки,
		|	ПеремещениеЗапасовЗапасы.ПрослеживаемыйТовар,
		|	ПеремещениеЗапасовЗапасы.ПрослеживаемыйКомплект,
		|	ПеремещениеЗапасовЗапасы.УчитыватьВНУ,
		|	ПеремещениеЗапасовЗапасы.Ячейка,
		|	ПеремещениеЗапасовЗапасы.ЯчейкаПолучатель,
		|	ПеремещениеЗапасовЗапасы.Вес,
		|	ПеремещениеЗапасовЗапасы.Объем,
		|	ПеремещениеЗапасовЗапасы.НомерСтроки,
		|	ПеремещениеЗапасовЗапасы.Количество,
		|	ПеремещениеЗапасовЗапасы.Резерв,
		|	ПеремещениеЗапасовЗапасы.Себестоимость,
		|	ПеремещениеЗапасовЗапасы.Сумма,
		|	ПеремещениеЗапасовЗапасы.КлючСвязи,
		|	ПеремещениеЗапасовЗапасы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Период КАК Период,
		|	ЦеныНоменклатурыСрезПоследних.ВидЦен КАК ВидЦен,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Актуальность КАК Актуальность,
		|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЦеныНоменклатурыСрезПоследних.ВалютаЦены КАК ВалютаЦены,
		|	ЦеныНоменклатурыСрезПоследних.ВключаяХарактеристики КАК ВключаяХарактеристики,
		|	ЦеныНоменклатурыСрезПоследних.Автор КАК Автор,
		|	ЦеныНоменклатурыСрезПоследних.ДокументУстановки КАК ДокументУстановки
		|ПОМЕСТИТЬ ВТ_Цены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ТекДата,
		|			ВидЦен = &ВидЦен
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						ВТ_Запасы.Номенклатура КАК Номенклатура,
		|						ВТ_Запасы.Характеристика КАК Характеристика
		|					ИЗ
		|						ВТ_Запасы КАК ВТ_Запасы)) КАК ЦеныНоменклатурыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Ссылка КАК Ссылка,
		|	ВТ_Запасы.НомерСтроки КАК НомерСтроки,
		|	ВТ_Запасы.Номенклатура КАК Номенклатура,
		|	ВТ_Запасы.Характеристика КАК Характеристика,
		|	ВТ_Запасы.Партия КАК Партия,
		|	ВТ_Запасы.СерииНоменклатуры КАК СерииНоменклатуры,
		|	ВТ_Запасы.Количество КАК Количество,
		|	ВТ_Запасы.Резерв КАК Резерв,
		|	ВТ_Запасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ВТ_Запасы.Себестоимость КАК Себестоимость,
		|	ВТ_Запасы.КлючСвязи КАК КлючСвязи,
		|	ВТ_Запасы.СтранаПроисхождения КАК СтранаПроисхождения,
		|	ВТ_Запасы.НомерГТД КАК НомерГТД,
		|	ВТ_Запасы.Проект КАК Проект,
		|	ВТ_Запасы.ИдентификаторСтроки КАК ИдентификаторСтроки,
		|	ВТ_Запасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
		|	ВТ_Запасы.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
		|	ВТ_Запасы.УчитыватьВНУ КАК УчитыватьВНУ,
		|	ВТ_Запасы.Ячейка КАК Ячейка,
		|	ВТ_Запасы.ЯчейкаПолучатель КАК ЯчейкаПолучатель,
		|	ВТ_Запасы.Вес КАК Вес,
		|	ВТ_Запасы.Объем КАК Объем,
		|	ЕСТЬNULL(ВТ_Цены.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ВТ_Цены.Цена, 0) * ВТ_Запасы.Количество КАК Сумма,
		|	ВТ_Запасы.СтавкаНДС КАК СтавкаНДС,
		|	ЕСТЬNULL(ВТ_Цены.Цена, 0) * ВТ_Запасы.Количество * ВТ_Запасы.СтавкаНДС.Ставка / (100 + ВТ_Запасы.СтавкаНДС.Ставка) КАК СуммаНДС,
		|	ЕСТЬNULL(ВТ_Цены.Цена, 0) * ВТ_Запасы.Количество + ЕСТЬNULL(ВТ_Цены.Цена, 0) * ВТ_Запасы.Количество * ВТ_Запасы.СтавкаНДС.Ставка / (100 + ВТ_Запасы.СтавкаНДС.Ставка) КАК Всего
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
		|		ПО ВТ_Запасы.Номенклатура = ВТ_Цены.Номенклатура
		|			И ВТ_Запасы.Характеристика = ВТ_Цены.Характеристика";
	
	Запрос.УстановитьПараметр("ВидЦен", Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи());
	Запрос.УстановитьПараметр("Основание", Основание);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Запасы = РезультатЗапроса.Выгрузить();
	
	Возврат Запасы;
	
КонецФункции

// Поиск в системе договора по заданным параметрам поиска
//
// Параметры:
//  Организация	 - СправочникСсылка.Организации - организация для поиска договора
//  Контрагент	 - СправочникСсылка.Контрагенты	- владелец договора
//  Основание	 - ДокументСсылка.ПриходнаяНакладная - используется для получения валюты поиска договора
// 
// Возвращаемое значение:
//   - СправчоникСсылка.ДоговорыКонтрагентов - ссылка на договор
//
Функция Т_ДоговорПродажи(Организация, Контрагент, Основание)
	
	Договор = Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Организация = &Организация
		|	И ДоговорыКонтрагентов.Владелец = &Контрагент
		|	И ДоговорыКонтрагентов.ВалютаРасчетов = &ВалютаРасчетов
		|	И ДоговорыКонтрагентов.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.СПокупателем)";
	
	Запрос.УстановитьПараметр("ВалютаРасчетов", Основание.ВалютаДокумента);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Договор = Выборка.Ссылка;

	КонецЕсли;
	
	Возврат Договор;
	
КонецФункции

Процедура Т_ЗаполнитьДокументПеремещенияЗапасов(Документ, ДанныеДляЗагрузки) Экспорт
	
	Если ДанныеДляЗагрузки.Свойство("Шапка") Тогда 
		ДанныеЗаполнения = ДанныеДляЗагрузки.Шапка;
	КонецЕсли; 
	
	РежимЗаписи = РежимЗаписиДокумента.Запись;
	
	Попытка
		
		Если ЗначениеЗаполнено(Документ) Тогда // получены изменения по существующему документу
			
			Если Документ.Проведен Тогда 
				ВызватьИсключение НСтр("ru = 'Заполнение на основании ЭД возможно только для непроведенного документа'");
			КонецЕсли;
			
			ДокументОбъект = Документ.ПолучитьОбъект();
			
		Иначе // создаем новый
			
			УстановитьПривилегированныйРежим(Истина);
			ДокументОбъект = Документы.ПеремещениеЗапасов.СоздатьДокумент();
			
			ДокументОбъект.Заполнить(ДанныеЗаполнения);
			
			ДокументОбъект.Дата = ТекущаяДатаСеанса();
			
			ДокументОбъект.ОбменДанными.Загрузка = Истина;
			
		КонецЕсли;
		
		// Заполним реквизиты шапки на основании структуры данных заполнения
		ПерезаполнениеЗначенийРеквизитовШапки(ДокументОбъект, ДанныеЗаполнения);
		
		// Загрузим табличные части
		ДокументОбъект.Запасы.Загрузить(ДанныеДляЗагрузки.Запасы);
		Если ДанныеДляЗагрузки.Свойство("ШтрихкодыУпаковок") Тогда
			//ДокументОбъект.ШтрихкодыУпаковок.Загрузить(ДанныеДляЗагрузки.ШтрихкодыУпаковок);
		КонецЕсли;
		
		Если ДокументОбъект.ЭтоНовый() Тогда
			ДокументОбъект.УстановитьНовыйНомер();
		КонецЕсли;
		
		ДокументОбъект.ОбменДанными.Загрузка = Истина;
		ДокументОбъект.Записать(РежимЗаписи);
		
		Документ = ДокументОбъект.Ссылка;
	Исключение
		
		ЗаписьЖурналаРегистрации(НСтр("ru = 'Заполнение на основании ЭД'"),
			УровеньЖурналаРегистрации.Ошибка, 
			Метаданные.Документы.ПеремещениеЗапасов, 
			Документ, 
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

Функция Т_ПодготовитьСтруктуруПеремещенияЗапасов(ДеревоДанных) Экспорт
	
	ДанныеЭД = ДанныеВходящегоЭД(ДеревоДанных);
	
	ДанныеОбъекта  = Новый Структура;
	Запасы = Документы.ПеремещениеЗапасов.ПустаяСсылка().Запасы.ВыгрузитьКолонки();
	
	ДанныеОбъекта.Вставить("ВидОперации", Перечисления.ВидыОперацийПеремещениеЗапасов.Перемещение);
	
	СведенияОбУчастнике = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОПокупателе");
	Если ТипЗнч(СведенияОбУчастнике) = Тип("Число") Тогда
		ОпределитьУчастниковПоДаннымЭД_2019(ДеревоДанных, ДанныеОбъекта);
	Иначе
		ДанныеОбъекта.Вставить("Организация", ОрганизацияПоДаннымЭД(ДеревоДанных, "СведенияОПокупателе"));
		ДанныеОбъекта.Вставить("Контрагент",  КонтрагентПоДаннымЭД(ДеревоДанных, "СведенияОПродавце"));
	КонецЕсли;
	
	ДанныеОбъекта.Вставить("СтруктурнаяЕдиница", УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("спСкладОтправитель"));
	ДанныеОбъекта.Вставить("СтруктурнаяЕдиницаПолучатель", УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("спСкладПолучатель"));
		
	ДанныеОбъекта.Вставить("ХозяйственнаяОперация", Справочники.ХозяйственныеОперации.Перемещение);
	
	Пользователь = Пользователи.ТекущийПользователь();
	
	ДанныеОбъекта.Вставить("Автор", Пользователь);

	// Товары
	СведенияОТоварах = ДеревоДанных.Строки.Найти("СведенияОТоварах", "ПолныйПуть");
	Для Каждого СведенияОТоваре Из СведенияОТоварах.Строки Цикл
		
		Номенклатура = НоменклатураИБ(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.Сопоставление");
		Характеристика = ХарактеристикаИБ(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.Сопоставление");
		Упаковка = УпаковкаИБ(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.Сопоставление");
		
		НоваяСтрока = Запасы.Добавить();
		НоваяСтрока.ЕдиницаИзмерения = НайтиСсылкуНаОбъект("ЕдиницыИзмерения",
		ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.ЕдиницаИзмеренияКод"));
		
		НоваяСтрока.Количество = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.Количество");
		НоваяСтрока.Себестоимость = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.ЦенаЗаЕдиницуИзмерения");
		НоваяСтрока.Сумма = ЭлектронноеВзаимодействие.ЗначениеРеквизитаВДереве(СведенияОТоваре, "СведенияОТоварах.НомерСтроки.СтоимостьТоваровБезНалога");
		
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Количество) Тогда
			НоваяСтрока.Количество = 1;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Сумма) Тогда
			НоваяСтрока.Сумма = ?(ЗначениеЗаполнено(НоваяСтрока.Всего), НоваяСтрока.Всего, НоваяСтрока.Цена);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.Себестоимость) Тогда
			НоваяСтрока.Себестоимость = НоваяСтрока.Сумма / НоваяСтрока.Количество;
		КонецЕсли;
		
		НоваяСтрока.Номенклатура = Номенклатура;
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ЕдиницаИзмерения) Тогда
			НоваяСтрока.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрока.Номенклатура, "ЕдиницаИзмерения");
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеДляЗаполнения = Новый Структура();
	ДанныеДляЗаполнения.Вставить("Шапка", ДанныеОбъекта);
	ДанныеДляЗаполнения.Вставить("Запасы", Запасы);
	
	Возврат ДанныеДляЗаполнения;
	
КонецФункции

Функция Т_ЭтоПеремещениеЗапасов(СпособОбработки) Экспорт
	
	Результат = Ложь;
	СпособОбработкиПоступлениеДопРасходов = ВРег("ПеремещениеЗапасов");
	Если ТипЗнч(СпособОбработки) = Тип("Структура") Тогда
		Результат = (ВРег(СпособОбработки.ПервичныйДокумент) = СпособОбработкиПоступлениеДопРасходов);
	Иначе
		Результат = (ВРег(СпособОбработки) = СпособОбработкиПоступлениеДопРасходов);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ЗаимствованныеТиповыеПроцедурыИФункции

//<<<--- Tnext Козык К.А. 16.06.2026 - доработка неактуальна
//&ИзменениеИКонтроль("КомандыЭДО_ФормаСписка")
//Процедура T_КомандыЭДО_ФормаСписка(Форма, Входящий) Экспорт

//	Элементы = Форма.Элементы;

//	Попытка

//		ПараметрыПриСозданииНаСервере = ОбменСКонтрагентами.ПараметрыПриСозданииНаСервере_ФормаСписка();
//		ПараметрыПриСозданииНаСервере.Форма                 = Форма;
//		ПараметрыПриСозданииНаСервере.МестоРазмещенияКоманд = Элементы.ГруппаКомандыЭДО;
//		ПараметрыПриСозданииНаСервере.КолонкаСостоянияЭДО = Элементы.СостояниеВерсииЭД;
//		Если Входящий <> Неопределено Тогда

//			Если Входящий Тогда
//				ПараметрыПриСозданииНаСервере.Направление = ОбменСКонтрагентами.НаправленияДокументов().Входящий;
//			Иначе
//				ПараметрыПриСозданииНаСервере.Направление = ОбменСКонтрагентами.НаправленияДокументов().Исходящий;
//			КонецЕсли;
//			
//			#Вставка
//			//Если Форма.ИмяФормы = "Документ.ПриходнаяНакладная.Форма.ФормаСписка" Тогда
//			//	ПараметрыПриСозданииНаСервере.Направление = ОбменСКонтрагентами.НаправленияДокументов().Исходящий;
//			//КонецЕсли;
//			#КонецВставки
//		КонецЕсли;
//		ОбменСКонтрагентами.ПриСозданииНаСервере_ФормаСписка(ПараметрыПриСозданииНаСервере);

//	Исключение
//		Сообщить(ОписаниеОшибки());
//	КонецПопытки;

//КонецПроцедуры
//--->>> Tnext Козык К.А. 16.06.2026

&ИзменениеИКонтроль("ВидЭлектронногоДокументаРеализации")
Функция T_ВидЭлектронногоДокументаРеализации(Источник)

	Если ТипЗнч(Источник) = Тип("ДокументСсылка.РасходнаяНакладная")
		ИЛИ ТипЗнч(Источник) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ВидЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ВидЭлектронногоДокумента");
		Если Не ЗначениеЗаполнено(ВидЭД) Тогда
			ВидЭД = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
		КонецЕсли;
		Возврат ВидЭД;
	#Вставка
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ПриходнаяНакладная") 
		Или ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходнаяНакладная") Тогда
		ВидЭД = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
		Возврат ВидЭД;
	#КонецВставки
	Иначе
		ВидЭД = Источник.ВидЭлектронногоДокумента;
		Если Не ЗначениеЗаполнено(ВидЭД) Тогда
			ВидЭД = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
		КонецЕсли;
		Возврат ВидЭД;
	КонецЕсли;

КонецФункции

&ИзменениеИКонтроль("ЗаполнитьДанныеПервичногоДокументаУПД_2019")
Процедура спЗаполнитьДанныеПервичногоДокументаУПД_2019(ДанныеДляФормированияЭД, Настройки, ДеревоДанных, Отказ)

	ДанныеШапки = ДанныеДляФормированияЭД.РеквизитыШапки;

	Если ДанныеШапки.Исправление = Истина Тогда
		ВидОперацииЭД = Перечисления.ВидыОперацийЭД.Исправление;
	ИначеЕсли Настройки.Свойство("ВидОперацииЭД") Тогда
		ВидОперацииЭД = Настройки.ВидОперацииЭД;
	Иначе
		ВидОперацииЭД = Перечисления.ВидыОперацийЭД.ПродажаКомиссия;
	КонецЕсли;

	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ВидОперации", ВидОперацииЭД);

	ЕстьТовары = Ложь;
	ЕстьУслуги = Ложь;
	Для Каждого Строка Из ДанныеДляФормированияЭД.ТаблицаТоваров Цикл
		ПризнакТовара = ПризнакТовара(Строка.Номенклатура);
		Если ПризнакТовара = "1" Тогда
			ЕстьТовары = Истина;
		Иначе
			ЕстьУслуги = Истина;
		КонецЕсли;
	КонецЦикла;

	СоставСодержания = Новый Массив;
	Если ЕстьТовары Тогда
		СоставСодержания.Добавить(НСтр("ru = 'Товары переданы.'"));
	КонецЕсли;
	Если ЕстьУслуги Тогда
		СоставСодержания.Добавить(НСтр("ru = 'Услуги оказаны в полном объеме.'"));
	КонецЕсли;
	СодержаниеОперации = СтрСоединить(СоставСодержания, " ");
	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "СодержаниеОперации", СодержаниеОперации);

	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаОтгрузкиТоваров", ДанныеШапки.Дата);
	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ДокументыОснованияДокументаОтгрузки", ДанныеДляФормированияЭД.ДокументыОснования);

	Если ДанныеШапки.Исправление = Истина Тогда
		Если ДанныеДляФормированияЭД.Свойство("ТаблицаДанныхДокумента") 
			И ДанныеДляФормированияЭД.ТаблицаДанныхДокумента <> Неопределено
			И ДанныеДляФормированияЭД.ТаблицаДанныхДокумента.Количество() > 0 Тогда

			Если ЗначениеЗаполнено(ДанныеДляФормированияЭД.ТаблицаДанныхДокумента[0].ДатаДокумента) Тогда
				ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаОтгрузкиТоваров", ДанныеДляФормированияЭД.ТаблицаДанныхДокумента[0].ДатаДокумента);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ОснованиеПечати = "";
	Если ДанныеШапки.Ссылка.Метаданные().Реквизиты.Найти("ОснованиеПечати") <> Неопределено Тогда
		ОснованиеПечати = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеШапки.Ссылка, "ОснованиеПечати");
	КонецЕсли;
     #Вставка
	Если Настройки.Свойство("ОснованиеПечати") Тогда
		ОснованиеПечати = Настройки.ОснованиеПечати;
	КонецЕсли;
	#КонецВставки
	
	ОснованиеОтгрузкиТоваров = Новый ТаблицаЗначений;
	ОснованиеОтгрузкиТоваров.Колонки.Добавить("ДокументНаименование");
	ОснованиеОтгрузкиТоваров.Колонки.Добавить("ДокументНомер");
	ОснованиеОтгрузкиТоваров.Колонки.Добавить("ДокументДата", Новый ОписаниеТипов("Дата"));
	ОснованиеОтгрузкиТоваров.Колонки.Добавить("ДокументДопСведения");

	Если ЗначениеЗаполнено(ОснованиеПечати) Тогда

		СтрокаНаименование = "";
		НомерОснования = "";
		ДатаОснования = Дата(1,1,1);

		Если СтрНайти(ОснованиеПечати, "№") > 0 
			И СтрНайти(ОснованиеПечати, "от") > 0 Тогда

			Поз = СтрНайти(ОснованиеПечати, "№");
			СтрокаНаименование = Сред(ОснованиеПечати, 1, Поз-1);
			СтрокаНаименование = СокрЛП(СтрокаНаименование);

			Поз2 = СтрНайти(ОснованиеПечати, "от");
			Поз2 = Поз2-1;

			СтрокаНомер = Сред(ОснованиеПечати, Поз+1, Поз2-Поз);
			СтрокаНомер = СокрЛП(СтрокаНомер);

			СтрокаДата = Сред(ОснованиеПечати, Поз2+3);
			Если СтрНайти(СтрокаДата, ",") > 0 Тогда
				Поз = СтрНайти(СтрокаДата, ",");
				СтрокаДата = Сред(СтрокаДата, 1, Поз-1);
			КонецЕсли;
			СтрокаДата = СокрЛП(СтрокаДата);

			НомерОснования = СтрокаНомер;
			Попытка
				ДатаОснования = СтроковыеФункцииКлиентСервер.СтрокаВДату(СтрокаДата);
			Исключение
			КонецПопытки;

		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(НомерОснования)
			И НЕ ЗначениеЗаполнено(ДатаОснования) Тогда

			Если СтрНайти(ОснованиеПечати, "№") > 0 Тогда
				Поз = СтрНайти(ОснованиеПечати, "№");
				СтрокаНаименование = Сред(ОснованиеПечати, 1, Поз-1);
				СтрокаНаименование = СокрЛП(СтрокаНаименование);

				Если ПустаяСтрока(СтрокаНаименование) Тогда
					СтрокаНаименование = НСтр("ru = 'Договор'");
				КонецЕсли;
			КонецЕсли;

			НомерОснования = ДанныеШапки.НомерДоговора;
			ДатаОснования = НачалоДня(ДанныеШапки.ДатаДоговора);

		КонецЕсли; 

		Если НЕ ЗначениеЗаполнено(СтрокаНаименование) Тогда
			СтрокаНаименование = НСтр("ru = 'Договор'");
		КонецЕсли;

		Если ЗначениеЗаполнено(ДатаОснования) Тогда

			НоваяСтрока = ОснованиеОтгрузкиТоваров.Добавить();

			НоваяСтрока.ДокументНаименование = СтрокаНаименование;
			НоваяСтрока.ДокументНомер = НомерОснования;
			НоваяСтрока.ДокументДата = ДатаОснования;

			Если СтрНайти(ОснованиеПечати, ",") > 0 Тогда
				Поз = СтрНайти(ОснованиеПечати, ",");
				СтрокаДопСведения = Сред(ОснованиеПечати, Поз+1);
				СтрокаДопСведения = СокрЛП(СтрокаДопСведения);

				Если НЕ ПустаяСтрока(СтрокаДопСведения) Тогда
					НоваяСтрока.ДокументДопСведения = СтрокаДопСведения;
				КонецЕсли;
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	// Дополним таблицу оснований параметрами обработки ошибок.
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ОснованиеОтгрузкиТоваров, "ДокументДата",,,
	НСтр("ru = 'Необходимо указать дату в реквизитах печати для основания.'"));

	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ОснованиеОтгрузкиТоваров, "ОснованиеОтгрузкиТоваров");


	ТранспортнаяНакладная = Новый ТаблицаЗначений;
	ТранспортнаяНакладная.Колонки.Добавить("ТранспортнаяНакладнаяНомер");
	ТранспортнаяНакладная.Колонки.Добавить("ТранспортнаяНакладнаяДата");

	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТранспортнаяНакладная, "ТранспортнаяНакладная");

	Если ЗначениеЗаполнено(ДанныеШапки.Перевозчик) Тогда
		СведенияОПеревозчике = ПолучитьДанныеЮрФизЛица(ДанныеШапки.Перевозчик);
		ЗаполнитьДанныеУчастникаУПД(ДеревоДанных, СведенияОПеревозчике, "СведенияОПеревозчике");
	КонецЕсли;

	ДокументОснование = Неопределено;
	Если ТипЗнч(ДанныеШапки.Ссылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		ДокументОснование = ДанныеШапки.Ссылка;
	Иначе
		Для каждого Эл Из ДанныеДляФормированияЭД.ДокументыОснования Цикл
			Если ЗначениеЗаполнено(Эл) Тогда
				ДокументОснование = Эл;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Если ЗначениеЗаполнено(ДокументОснование) Тогда

		МетаданныеОснования = ДокументОснование.Метаданные();
		Если МетаданныеОснования.Реквизиты.Найти("ДанныеОТранспортировке") <> Неопределено
			И МетаданныеОснования.Реквизиты.Найти("СопроводительныеДокументы") <> Неопределено Тогда

			РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "ДанныеОТранспортировке,СопроводительныеДокументы", Истина);
			Если ЗначениеЗаполнено(РеквизитыОснования.ДанныеОТранспортировке) Тогда
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "СведенияОТранспортировке", СокрЛП(РеквизитыОснования.ДанныеОТранспортировке));
			КонецЕсли;
			Если ЗначениеЗаполнено(РеквизитыОснования.СопроводительныеДокументы) Тогда
				ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ИныеСведенияОбОтгрузке", СокрЛП(РеквизитыОснования.СопроводительныеДокументы));
			КонецЕсли;

		КонецЕсли;

	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеШапки.РасшифровкаПодписиКладовщика) Тогда

		КладовщикФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(ДанныеШапки.РасшифровкаПодписиКладовщика);

		Если ЗначениеЗаполнено(ДанныеШапки.ДолжностьКладовщика) Тогда
			// Кладовщик работает в организации
			ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
			"СведенияОЛицеПередавшемТовары.РаботникОрганизацииПродавца.Должность", Строка(ДанныеШапки.ДолжностьКладовщика));

			ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
			"СведенияОЛицеПередавшемТовары.РаботникОрганизацииПродавца.Фамилия", КладовщикФИО.Фамилия);
			ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
			"СведенияОЛицеПередавшемТовары.РаботникОрганизацииПродавца.Имя", КладовщикФИО.Имя);
			ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
			"СведенияОЛицеПередавшемТовары.РаботникОрганизацииПродавца.Отчество", КладовщикФИО.Отчество);
		Иначе
			// Кладовщик не работает в организации
			ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
			"СведенияОЛицеПередавшемТовары.ИноеЛицо.ФЛ.Фамилия", КладовщикФИО.Фамилия);
			ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
			"СведенияОЛицеПередавшемТовары.ИноеЛицо.ФЛ.Имя", КладовщикФИО.Имя);
			ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
			"СведенияОЛицеПередавшемТовары.ИноеЛицо.ФЛ.Отчество", КладовщикФИО.Отчество);
		КонецЕсли;
	КонецЕсли;

	Если Настройки.Функция = "ДОП" // УПД первичка
		ИЛИ ВидОперацииЭД = Перечисления.ВидыОперацийЭД.Комиссия Тогда // передача товаров комиссионеру

		ЗаполнитьДеревоДанныхУПД_2019(ДанныеДляФормированияЭД, Настройки, ДеревоДанных, Отказ);

	КонецЕсли;

КонецПроцедуры

// Сохраняет данные из электронного документа в объекты ИБ (УПД-ДОП версии 2019).
//
// Параметры:
//  ДеревоДанных - ДеревоЗначений - структура параметров документа ИБ.
//  СсылкаНаВладельца - Ссылка - ссылка на объект ИБ, владельца электронного документа.
//  Записывать - Булево - признак необходимости записывать объект ИБ.
//  СпособОбработки - Строка - способ сохранения данных в информационной базе.
//  ОписаниеОшибки - Строка - описание ошибки создания учетного документа.
//
&ИзменениеИКонтроль("НайтиСоздатьУПДДокументОПередаче_2019")
Процедура T_НайтиСоздатьУПДДокументОПередаче_2019(ДеревоДанных, СсылкаНаВладельца, Записывать, СпособОбработки, ОписаниеОшибки) Экспорт

	УстановитьПривилегированныйРежим(Истина);

	Если ЭтоПоступлениеДопРасходов(СпособОбработки) Тогда

		ДанныеУПД = ПодготовитьСтруктуруДляПоступленияДопРасходовУПД_2019(ДеревоДанных);

		ЗаполнитьДокументПоступленияДопРасходов(СсылкаНаВладельца, ДанныеУПД);

	ИначеЕсли ЭтоПоступлениеИзПереработки(СпособОбработки, ДеревоДанных, "УПД") Тогда

		ДанныеУПД = ПодготовитьСтруктуруДляПоступленияИзПереработкиУПД_2019(ДеревоДанных);

		ЗаполнитьДокументПоступленияИзПереработки(СсылкаНаВладельца, ДанныеУПД);

	#Вставка
	ИначеЕсли Т_ЭтоПеремещениеЗапасов(СпособОбработки) Тогда

		ДанныеУПД = Т_ПодготовитьСтруктуруПеремещенияЗапасов(ДеревоДанных);

		Т_ЗаполнитьДокументПеремещенияЗапасов(СсылкаНаВладельца, ДанныеУПД);
		
	#КонецВставки
	Иначе

		ДанныеУПД = ПодготовитьСтруктуруДляУПД(ДеревоДанных, Истина);

		Если ДанныеУПД.Шапка.Исправление Тогда
			ЗаполнитьДокументКорректировкиПоступления(СсылкаНаВладельца, ДанныеУПД);
		Иначе
			ЗаполнитьДокументПоступленияТоваровУслуг(СсылкаНаВладельца, ДанныеУПД);
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьДеревоДанныхУПД_2019")
Процедура спЗаполнитьДеревоДанныхУПД_2019(ДанныеДляФормированияЭД, Настройки, ДеревоДанных, Отказ)

	ДанныеШапки 	   = ДанныеДляФормированияЭД.РеквизитыШапки;

	ЭтоСчетФактураНаАванс = Настройки.Свойство("ЭтоСчетФактураНаАванс")
	И Настройки.ЭтоСчетФактураНаАванс;

	Если ЭтоСчетФактураНаАванс Тогда
		ВидСчетаФактуры = "Авансовый";
	Иначе
		ВидСчетаФактуры = "Реализация";
	КонецЕсли;

	ОбстоятельстваФормированияСФ = "1";
	ВариантВыбытияМаркируемойПродукции = Неопределено;
	ВидОборота = "";

	Если Настройки.Функция <> "СЧФ" Тогда
		ОбстоятельстваФормированияСФ = "";
		Если ТипЗнч(ДанныеШапки.Ссылка) = Тип("ДокументСсылка.СчетФактура") Тогда
			Для Каждого ДокументОснование Из ДанныеДляФормированияЭД.ДокументыОснования Цикл

				Если ЗначениеЗаполнено(ДокументОснование) Тогда
					ДокументОснованиеВидОперации = Неопределено;
					Если ДокументОснование.Метаданные().Реквизиты.Найти("ВидОперации") <> Неопределено Тогда
						ДокументОснованиеВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ВидОперации");
					КонецЕсли;
					Если ДокументОснование.Метаданные().Реквизиты.Найти("ВариантВыбытияМаркируемойПродукции") <> Неопределено Тогда
						ВариантВыбытияМаркируемойПродукции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ВариантВыбытияМаркируемойПродукции");
					КонецЕсли;
					Если ДокументОснованиеВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда
						ОбстоятельстваФормированияСФ = ""; // Возврат
						Прервать;
					ИначеЕсли ДокументОснованиеВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию Тогда
						ОбстоятельстваФормированияСФ = "4"; // Комиссия
						Прервать;
					ИначеЕсли ДокументОснованиеВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту Тогда
						ОбстоятельстваФормированияСФ = "5";
						Прервать;
					ИначеЕсли ДокументОснованиеВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
						ЕстьТоварыОСУ = ЕстьТоварыОСУ(ДокументОснование);
						Если ЕстьТоварыОСУ Тогда
							НомерПробитогоЧекаККМ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "НомерЧекаККМ");
							Если ЗначениеЗаполнено(НомерПробитогоЧекаККМ) Тогда
								ВидОборота = "10";
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Если ДанныеШапки.Ссылка.Метаданные().Реквизиты.Найти("ВариантВыбытияМаркируемойПродукции") <> Неопределено Тогда
				ВариантВыбытияМаркируемойПродукции = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеШапки.Ссылка, "ВариантВыбытияМаркируемойПродукции");
			КонецЕсли;
			Если ДанныеШапки.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратПоставщику Тогда
				ОбстоятельстваФормированияСФ = ""; // Возврат
			ИначеЕсли ДанныеШапки.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию Тогда
				ОбстоятельстваФормированияСФ = "4"; // Комиссия
			ИначеЕсли ДанныеШапки.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту Тогда
				ОбстоятельстваФормированияСФ = "5";
			ИначеЕсли ДанныеШапки.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю Тогда
				ЕстьТоварыОСУ = ЕстьТоварыОСУ(ДанныеШапки.Ссылка);
				Если ЕстьТоварыОСУ Тогда
					НомерПробитогоЧекаККМ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеШапки.Ссылка, "НомерЧекаККМ");
					Если ЗначениеЗаполнено(НомерПробитогоЧекаККМ) Тогда
						ВидОборота = "10";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(ВидОборота) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ВидОборота", ВидОборота);
	КонецЕсли;

	Если ЭтоСчетФактураНаАванс Тогда
		ОбстоятельстваФормированияСФ = "2";
	КонецЕсли;

	Если ОбстоятельстваФормированияСФ = "4"
		ИЛИ ОбстоятельстваФормированияСФ = "5" Тогда
		Если Не Настройки.Свойство("ВидОперацииЭД") Тогда
			Настройки.Вставить("ВидОперацииЭД", Перечисления.ВидыОперацийЭД.Комиссия);
		КонецЕсли;
	КонецЕсли;

	ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ВидСчетаФактуры", ВидСчетаФактуры);

	Если ЗначениеЗаполнено(ОбстоятельстваФормированияСФ) Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
		"ДополнительныеСведенияОбУчастниках.ОбстоятельстваФормированияСФ", ОбстоятельстваФормированияСФ);
	КонецЕсли;

	ВнестиСведенияОВыбытииМаркированныхТоваровВДеревоУПДУКД(ДеревоДанных, ВариантВыбытияМаркируемойПродукции);

	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "СсылкаСчетаФактуры", ДанныеШапки.Ссылка);

	НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(ДанныеШапки.Дата, ДанныеШапки.Номер, ДанныеШапки.Организация.Префикс);

	Если ЗначениеЗаполнено(ДанныеШапки.Организация.ГоловнаяОрганизация)
		И ЗначениеЗаполнено(ДанныеШапки.Организация.ЦифровойИндексОбособленногоПодразделения) Тогда
		НомерДокумента = НомерДокумента + "/" + СокрЛП(ДанныеШапки.Организация.ЦифровойИндексОбособленногоПодразделения);
	ИначеЕсли ДанныеДляФормированияЭД.Свойство("ТаблицаДанныхДокумента") И ДанныеДляФормированияЭД.ТаблицаДанныхДокумента <> Неопределено Тогда
		Если ДанныеДляФормированияЭД.ТаблицаДанныхДокумента.Количество() > 0 Тогда
			ЦифровойИндексОбособленногоПодразделения = ДанныеДляФормированияЭД.ТаблицаДанныхДокумента[0].ЦифровойИндексОбособленногоПодразделения;
			Если ЗначениеЗаполнено(ЦифровойИндексОбособленногоПодразделения) Тогда
				НомерДокумента = НомерДокумента + "/" + СокрЛП(ЦифровойИндексОбособленногоПодразделения);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "НомерДокумента", НомерДокумента);
	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаДокумента",  ДанныеШапки.Дата);

	Если ТипЗнч(ДанныеШапки.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") 
		И ДанныеШапки.ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда

		ДатаФиниша = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеШапки.Ссылка, "Финиш");
		Если ЗначениеЗаполнено(ДатаФиниша) Тогда
			ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаДокумента", ДатаФиниша);
		КонецЕсли;
	КонецЕсли;	

	Если ДанныеШапки.Исправление = Истина
		ИЛИ ТипЗнч(ДанныеШапки.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации") И ЗначениеЗаполнено(ДанныеШапки.НомерИсправления) Тогда

		ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "НомерИсправления", ДанныеШапки.НомерИсправления);
		ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаИсправления",  ДанныеШапки.ДатаИсправления);

		Если ДанныеДляФормированияЭД.Свойство("ТаблицаДанныхДокумента") И ДанныеДляФормированияЭД.ТаблицаДанныхДокумента <> Неопределено Тогда

			Если ДанныеДляФормированияЭД.ТаблицаДанныхДокумента.Количество() > 0 Тогда

				НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(
				ДанныеДляФормированияЭД.ТаблицаДанныхДокумента[0].ДатаДокумента, ДанныеДляФормированияЭД.ТаблицаДанныхДокумента[0].Номер, ДанныеШапки.Организация.Префикс);

				ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "НомерДокумента", НомерДокумента);
				ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаДокумента",  ДанныеДляФормированияЭД.ТаблицаДанныхДокумента[0].ДатаДокумента);
				ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "НомерИсправления", ДанныеДляФормированияЭД.ТаблицаДанныхДокумента[0].НомерИсправления);
				ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаИсправления",  ДанныеДляФормированияЭД.ТаблицаДанныхДокумента[0].ДатаИсправления);

			КонецЕсли;

		ИначеЕсли ЗначениеЗаполнено(ДанныеШапки.ДокументОснование) Тогда
			РеквизитыОснованияКорректировки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеШапки.ДокументОснование, "Номер,Дата", Истина);
			НомерДокумента = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(РеквизитыОснованияКорректировки.Дата, РеквизитыОснованияКорректировки.Номер, ДанныеШапки.Организация.Префикс);

			ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "НомерДокумента", НомерДокумента);
			ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ДатаДокумента",  РеквизитыОснованияКорректировки.Дата);
		КонецЕсли;

	КонецЕсли;

	Если ДанныеШапки.ВидОперации = Перечисления.ВидыОперацийСчетФактура.Аванс
		ИЛИ ДанныеШапки.ВидОперации = Перечисления.ВидыОперацийСчетФактура.НаАвансКомитента Тогда
		ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ВидСчетаФактуры", "Авансовый");
	Иначе
		ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ВидСчетаФактуры", "Реализация");
	КонецЕсли;

	Если ЗначениеЗаполнено(ДанныеШапки.Покупатель.ГоловнойКонтрагент) Тогда
		СведенияОПокупателе = ПолучитьДанныеЮрФизЛица(ДанныеШапки.Покупатель.ГоловнойКонтрагент, ДанныеШапки.Дата);
	Иначе
		СведенияОПокупателе = ПолучитьДанныеЮрФизЛица(ДанныеШапки.Покупатель, ДанныеШапки.Дата);
	КонецЕсли;

	СведенияОПоставщике  = ПолучитьДанныеЮрФизЛица(ДанныеШапки.Поставщик, ДанныеШапки.Дата);
	СведенияОПокупателе.ИНН = ДанныеШапки.ИННпокупателя;
	СведенияОПокупателе.КПП = ДанныеШапки.КППпокупателя;
	СведенияОПоставщике.ИНН = ДанныеШапки.ИННпоставщика;
	СведенияОПоставщике.КПП = ДанныеШапки.КППпоставщика;

	Если ДанныеДляФормированияЭД.Свойство("ТаблицаДанныхДокумента") 
		И ДанныеДляФормированияЭД.ТаблицаДанныхДокумента <> Неопределено
		И ДанныеДляФормированияЭД.ТаблицаДанныхДокумента.Количество() > 0 Тогда

		Грузоотправитель = ДанныеДляФормированияЭД.ТаблицаДанныхДокумента[0].Грузоотправитель;
		Грузополучатель = ДанныеДляФормированияЭД.ТаблицаДанныхДокумента[0].Грузополучатель;
	Иначе
		Грузоотправитель = ДанныеШапки.Грузоотправитель;
		Грузополучатель = ДанныеШапки.Грузополучатель;
	КонецЕсли;

	Если ЗначениеЗаполнено(Грузоотправитель) И ТипЗнч(Грузоотправитель) = Тип("СправочникСсылка.СтруктурныеЕдиницы") Тогда
		ДанныеГрузоотправителя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Грузоотправитель, "ГоловнаяОрганизация, КПП");
		Если ЗначениеЗаполнено(ДанныеГрузоотправителя.ГоловнаяОрганизация) И ДанныеГрузоотправителя.ГоловнаяОрганизация = ДанныеШапки.Поставщик Тогда
			СведенияОПоставщике.КПП = ДанныеГрузоотправителя.КПП;
		КонецЕсли;
	КонецЕсли;

	Если ЗначениеЗаполнено(Грузополучатель) И ТипЗнч(Грузополучатель) = Тип("СправочникСсылка.Контрагенты") Тогда
		ДанныеГрузополучателя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Грузополучатель, "ГоловнойКонтрагент, КПП");
		Если ЗначениеЗаполнено(ДанныеГрузополучателя.ГоловнойКонтрагент) И ДанныеГрузополучателя.ГоловнойКонтрагент = ДанныеШапки.Покупатель Тогда
			СведенияОПокупателе.КПП = ДанныеГрузополучателя.КПП;
		КонецЕсли;
	КонецЕсли;

	ЗаполнитьДанныеУчастниковУПД_2019(
	ДеревоДанных,
	ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СведенияОПоставщике),
	"СведенияОПродавце",
	"Юр",
	ДанныеШапки.Дата);

	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
	"СоставительДокументаНаименование", СведенияОПоставщике.ПолноеНаименование);

	ЗаполнитьДанныеУчастниковУПД_2019(
	ДеревоДанных,
	ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СведенияОПокупателе),
	"СведенияОПокупателе",
	"Юр",
	ДанныеШапки.Дата);

	Если ДанныеШапки.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах Тогда
		ВалютаРегламентированногоУчета = Константы.НациональнаяВалюта.Получить();
		КодВалюты = ВалютаРегламентированногоУчета.Код;
	Иначе
		КодВалюты = ДанныеШапки.КодВалюты;
	КонецЕсли;

	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ВалютаКод", КодВалюты);
	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
	"ДополнительныеСведенияОбУчастниках.ВалютаНаименование", ДанныеШапки.НаименованиеПолноеВалюты);
	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
	"ДополнительныеСведенияОбУчастниках.ВалютаКурс", ДанныеШапки.Курс);

	Если ТипЗнч(ДанныеШапки.Ссылка) = Тип("ДокументСсылка.СчетФактура") Тогда
		ИдентификаторГосКонтракта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеШапки.Ссылка, "ИдентификаторГосКонтракта");
		Если ЗначениеЗаполнено(ИдентификаторГосКонтракта) Тогда
			ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
			"ДополнительныеСведенияОбУчастниках.ИдентификаторГосКонтракта", ИдентификаторГосКонтракта);
		КонецЕсли;
	КонецЕсли;

	ДокументыОснования = Новый Массив;
	Для Каждого ДокументОснование Из ДанныеДляФормированияЭД.ДокументыОснования Цикл
		ДокументыОснования.Добавить(ДокументОснование);
	КонецЦикла;

	Если ДанныеШапки.Исправление = Истина
		И ЗначениеЗаполнено(ДанныеШапки.Ссылка) Тогда

		ИсправляемыйСчетФактура = ИсправляемыйСчетФактураВыданный(ДанныеШапки.Ссылка);
		Если ЗначениеЗаполнено(ИсправляемыйСчетФактура) Тогда
			ДокументыОснования.Добавить(ИсправляемыйСчетФактура);
		КонецЕсли;

	КонецЕсли;
	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ДокументыОснованияСчетаФактуры", ДокументыОснования);

	Если ДанныеДляФормированияЭД.Свойство("ПлатежныеДокументы")
		И ДанныеДляФормированияЭД.ПлатежныеДокументы.Количество() > 0
		И ЗначениеЗаполнено(ДанныеДляФормированияЭД.ПлатежныеДокументы[0].НомерПРД) Тогда

		ПлатежныеДокументы = Новый ТаблицаЗначений();
		ПлатежныеДокументы.Колонки.Добавить("ДатаПРД");
		ПлатежныеДокументы.Колонки.Добавить("НомерПРД");

		Для Каждого ПлатежныйДокумент Из ДанныеДляФормированияЭД.ПлатежныеДокументы Цикл
			НовыйПлатежныйДокумент = ПлатежныеДокументы.Добавить();
			НовыйПлатежныйДокумент.ДатаПРД  = ПлатежныйДокумент.ДатаПРД;
			НовыйПлатежныйДокумент.НомерПРД = ПлатежныйДокумент.НомерПРД;
		КонецЦикла;
		ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ПлатежныеДокументы, "ПлатежноРасчетныеДокументы");
	КонецЕсли;

	Если ЭтоСчетФактураНаАванс Тогда
		ЭлектронноеВзаимодействие.ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "СодержаниеОперации", 
		НСтр("ru = 'Регистрация счет-фактуры на аванс'"));
	КонецЕсли;

	Если ТипЗнч(ДанныеШапки.Ссылка) = Тип("ДокументСсылка.СчетФактура") Тогда
		Если ДанныеДляФормированияЭД.ДокументыОснования.Количество() > 0 Тогда
			СсылкаНаОснование = ДанныеДляФормированияЭД.ДокументыОснования[0];
		Иначе
			СсылкаНаОснование = ДанныеШапки.Ссылка; 
		КонецЕсли;
	Иначе
		СсылкаНаОснование = ДанныеШапки.Ссылка; 
	КонецЕсли;

	ШтрихкодыКомбинаций   = Неопределено;
	ШтрихкодыНоменклатуры = Неопределено;
	Если НЕ ДанныеДляФормированияЭД.Свойство("ШтрихкодыНоменклатуры", ШтрихкодыНоменклатуры)
		ИЛИ НЕ ДанныеДляФормированияЭД.Свойство("ШтрихкодыКомбинаций", ШтрихкодыКомбинаций) Тогда
		ШтрихкодыПоТоварам(ДанныеДляФормированияЭД.ТаблицаТоваров, ШтрихкодыКомбинаций, ШтрихкодыНоменклатуры);
	КонецЕсли;

	ТаблицаТоваров = Новый ТаблицаЗначений;
	ТаблицаТоваров.Колонки.Добавить("НомерСтроки");
	ТаблицаТоваров.Колонки.Добавить("НомерСтрокиИсходногоДокумента");
	ТаблицаТоваров.Колонки.Добавить("ТоварНаименование");
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмеренияКод");
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмеренияНаименование");
	ТаблицаТоваров.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(26,11)));
	ТаблицаТоваров.Колонки.Добавить("ЦенаЗаЕдиницуИзмерения", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(26,11)));
	ТаблицаТоваров.Колонки.Добавить("СтоимостьТоваровБезНалога", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19,2)));
	ТаблицаТоваров.Колонки.Добавить("НалоговаяСтавка");
	ТаблицаТоваров.Колонки.Добавить("СтоимостьТоваровСНалогом", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19,2)));
	ТаблицаТоваров.Колонки.Добавить("СуммаАкциза", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19,2)));
	ТаблицаТоваров.Колонки.Добавить("СуммаНалога", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(19,2)));
	ТаблицаТоваров.Колонки.Добавить("СведенияОТаможеннойДекларации", Новый ОписаниеТипов("ТаблицаЗначений"));
	ТаблицаТоваров.Колонки.Добавить("СтранаПроисхожденияНаименование", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255)));
	ТаблицаТоваров.Колонки.Добавить("Признак", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(1)));
	ТаблицаТоваров.Колонки.Добавить("ТоварКод", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255)));
	ТаблицаТоваров.Колонки.Добавить("ТоварИдентификатор", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255)));
	ТаблицаТоваров.Колонки.Добавить("Номенклатура");
	ТаблицаТоваров.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаТоваров.Колонки.Добавить("Содержание");
	ТаблицаТоваров.Колонки.Добавить("СведенияОМаркировке");
	ТаблицаТоваров.Колонки.Добавить("КодВидаТовара", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(255)));
	ТаблицаТоваров.Колонки.Добавить("Сопоставление");
	ТаблицаТоваров.Колонки.Добавить("СведенияОПрослеживаемости", Новый ОписаниеТипов("ТаблицаЗначений"));

	НомерСтроки = 1;
	ТолькоУслуги = Истина;

	ТаблицаКодовМаркировки = Неопределено;
	ДанныеДляФормированияЭД.Свойство("Маркировка", ТаблицаКодовМаркировки);

	СтавкаНДС0 = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();

	ЗаполнениеКодаТовара = Настройки.ВариантыЗаполненияПолей.ТоварКод;
	Для каждого Строка Из ДанныеДляФормированияЭД.ТаблицаТоваров Цикл
		Если НЕ ЗначениеЗаполнено(Строка.Номенклатура) 
			И НЕ ЭтоСчетФактураНаАванс Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ЭтоСчетФактураНаАванс И ЗначениеЗаполнено(Строка.Номенклатура) 
			И Строка.Номенклатура.ЭтоНабор
			И НЕ ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
			Строка.Номенклатура, "ВариантПечатиНабора") = Перечисления.ВариантыПечатиНаборов.ТолькоНабор Тогда
			Продолжить;
		КонецЕсли;

		НоваяСтрока = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);

		НоваяСтрока.НомерСтроки         = НомерСтроки;
		НоваяСтрока.НомерСтрокиИсходногоДокумента = НомерСтроки;

		Если ЭтоСчетФактураНаАванс Тогда

			НоваяСтрока.ТоварНаименование = Строка.НаименованиеНоменклатуры;
			НоваяСтрока.Признак = "3";
			НоваяСтрока.Количество                = Строка.Количество;
			НоваяСтрока.ЦенаЗаЕдиницуИзмерения    = Строка.Цена;
			НоваяСтрока.СтоимостьТоваровБезНалога = Строка.СуммаБезНДС;
			НоваяСтрока.НалоговаяСтавка           = Строка.СтавкаНДС;
			НоваяСтрока.СуммаНалога               = Строка.СуммаНДС;
			НоваяСтрока.СтоимостьТоваровСНалогом  = Строка.СуммаСНДС;
			НоваяСтрока.ТоварИдентификатор  = "00000000-0000-0000-0000-000000000000";

			НомерСтроки = НомерСтроки + 1;
			Продолжить;

		КонецЕсли;

		СтруктураДопДанных = Новый Структура;
		СтруктураДопДанных = ПолучитьСтруктуруДопДанныхНоменклатуры(Строка.Номенклатура, 
		Строка.Характеристика, 
		Строка.НаименованиеНоменклатуры);

		НоваяСтрока.ТоварНаименование			 = СтруктураДопДанных.Наименование;
		НоваяСтрока.ЕдиницаИзмеренияКод          = СокрЛП(Строка.ЕдиницаИзмеренияКод);
		НоваяСтрока.ЕдиницаИзмеренияНаименование = СокрЛП(Строка.ЕдиницаИзмеренияНаименование);

		Если ЗначениеЗаполнено(НоваяСтрока.Содержание) Тогда
			НоваяСтрока.ТоварНаименование = НоваяСтрока.Содержание;
		КонецЕсли;

		НоваяСтрока.Количество                = Строка.Количество;
		НоваяСтрока.ЦенаЗаЕдиницуИзмерения    = Строка.Цена;
		НоваяСтрока.СтоимостьТоваровБезНалога = Строка.СуммаБезНДС;
		НоваяСтрока.НалоговаяСтавка           = Строка.СтавкаНДС;
		НоваяСтрока.СуммаНалога               = Строка.СуммаНДС;
		НоваяСтрока.СтоимостьТоваровСНалогом  = Строка.СуммаСНДС;

		Если ЗначениеЗаполнено(Строка.Акциз) Тогда
			НоваяСтрока.СуммаАкциза = Строка.Акциз;
		КонецЕсли;

		ВариантПересчета = Константы.ПечатьПользовательскихЕдиницИзмерения.Получить();
		Если ВариантПересчета <> Перечисления.ПечатьПользовательскихЕдиницИзмерения.ФормироватьПечатныйДокументВПользовательскойЕдинице Тогда

			Если ТипЗнч(НоваяСтрока.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
				Если Строка.Владелец().Колонки.Найти("БазоваяЕдиницаКод") <> Неопределено Тогда
					НоваяСтрока.ЕдиницаИзмеренияКод = СокрЛП(Строка.БазоваяЕдиницаКод);
					НоваяСтрока.ЕдиницаИзмеренияНаименование = СокрЛП(Строка.БазоваяЕдиницаНаименование);
				Иначе
					НоваяСтрока.ЕдиницаИзмеренияКод = СокрЛП(Строка.Номенклатура.ЕдиницаИзмерения.Код);
					НоваяСтрока.ЕдиницаИзмеренияНаименование = СокрЛП(Строка.Номенклатура.ЕдиницаИзмерения.Наименование);
				КонецЕсли;
				Если Строка.ЕдиницаИзмерения.Коэффициент <> 0 Тогда
					НоваяСтрока.Количество = Строка.Количество * Строка.ЕдиницаИзмерения.Коэффициент;
					НоваяСтрока.ЦенаЗаЕдиницуИзмерения = Окр(Строка.СуммаБезНДС / (Строка.Количество * Строка.ЕдиницаИзмерения.Коэффициент), 2);
				КонецЕсли;
			ИначеЕсли ДанныеДляФормированияЭД.ТаблицаТоваров.Колонки.Найти("КоэффициентЕдиницыИзмерения") <> Неопределено
				И Строка.КоэффициентЕдиницыИзмерения <> 0 Тогда
				НоваяСтрока.Количество = Строка.Количество * Строка.КоэффициентЕдиницыИзмерения;
				НоваяСтрока.ЦенаЗаЕдиницуИзмерения = Окр(Строка.СуммаБезНДС / (Строка.Количество * Строка.КоэффициентЕдиницыИзмерения), 2);
			Иначе
				НоваяСтрока.ЦенаЗаЕдиницуИзмерения = Окр(Строка.СуммаБезНДС / Строка.Количество, 2);
			КонецЕсли;

		КонецЕсли;

		Если ЗначениеЗаполнено(Строка.КодСтраныПроисхождения)
			И Строка.КодСтраныПроисхождения <> "643" Тогда

			СведенияОТаможеннойДекларации = Новый ТаблицаЗначений;
			СведенияОТаможеннойДекларации.Колонки.Добавить("СтранаПроисхожденияКод");
			СведенияОТаможеннойДекларации.Колонки.Добавить("ТаможеннаяДекларацияНомер");

			НоваяСтрока.СведенияОТаможеннойДекларации = СведенияОТаможеннойДекларации;
			Декларация = НоваяСтрока.СведенияОТаможеннойДекларации.Добавить();
			Декларация.СтранаПроисхожденияКод    = ПолучитьКорректныйКодСтраны(Строка.КодСтраныПроисхождения);
			Декларация.ТаможеннаяДекларацияНомер = ?(ЗначениеЗаполнено(Строка.НомерТаможеннойДекларации), СокрЛП(Строка.НомерТаможеннойДекларации), "");
			НоваяСтрока.СтранаПроисхожденияНаименование = Строка.НаименованиеСтраныПроисхождения;

			ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(НоваяСтрока.СведенияОТаможеннойДекларации, "СтранаПроисхожденияКод",,,
			НСтр("ru = 'Не заполнен код страны происхождения'"));

		КонецЕсли;

		НоваяСтрока.Признак = ПризнакТовара(Строка.Номенклатура, СсылкаНаОснование);
		НоваяСтрока.ТоварКод           = СокрЛП(Строка.КодНоменклатуры);
		НоваяСтрока.ТоварИдентификатор = СтруктураДопДанных.ИД;

		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		НоваяСтрока.ЕдиницаИзмерения = Строка.ЕдиницаИзмерения;

		ЗаполнитьСведенияОПрослеживаемостиВЭлектронномДокументе(НоваяСтрока, Строка);

		Если ТолькоУслуги
			И НоваяСтрока.Признак = "1" Тогда
			ТолькоУслуги = Ложь;
		КонецЕсли;

		Строка.Количество = НоваяСтрока.Количество;
		ЭлектронноеВзаимодействиеИСМП.ЗаполнитьСведенияОМаркировке_2019(НоваяСтрока, Строка, ТаблицаКодовМаркировки);

		Сопоставление = СтруктураДляСопоставленияНоменклатурыЭД(Строка.Номенклатура, Строка.Характеристика, Строка.ЕдиницаИзмерения);

		Сопоставление.Вставить("Наименование", Строка.НаименованиеНоменклатуры);
		Если ЗначениеЗаполнено(Строка.НаименованиеХарактеристики) Тогда
			Сопоставление.Вставить("Характеристика", Строка.НаименованиеХарактеристики);
		КонецЕсли;
		Сопоставление.Вставить("ЕдиницаИзмерения"   , Строка.ЕдиницаИзмеренияНаименование);
		Сопоставление.Вставить("ЕдиницаИзмеренияКод", Строка.ЕдиницаИзмеренияКод);
		Сопоставление.Вставить("СтавкаНДС", Строка.СтавкаНДС);
		Сопоставление.Вставить("Артикул"  , Строка.Артикул);

		ЗаполнитьШтрихкодыТоваровВСопоставление(Сопоставление, ШтрихкодыНоменклатуры, ШтрихкодыКомбинаций,
		Строка.Номенклатура, Строка.Характеристика, Строка.ЕдиницаИзмерения);

		НоваяСтрока.Сопоставление = Сопоставление;

		Если ЗаполнениеКодаТовара = "Артикул" Тогда
			НоваяСтрока.ТоварКод = СокрЛП(Строка.Артикул);
		ИначеЕсли ЗаполнениеКодаТовара = "Штрихкод"
			И НоваяСтрока.Сопоставление.Свойство("ШтрихкодКомбинации") Тогда
			НоваяСтрока.ТоварКод = НоваяСтрока.Сопоставление.ШтрихкодКомбинации;
		КонецЕсли;

		Если ЗначениеЗаполнено(Строка.СтавкаНДС) И Строка.СтавкаНДС = СтавкаНДС0 Тогда

			КодТНВЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Строка.Номенклатура, "ТоварнаяНоменклатураВЭД.Код");
			Если ЗначениеЗаполнено(КодТНВЭД) Тогда
				НоваяСтрока.КодВидаТовара = КодТНВЭД;
			КонецЕсли;

		КонецЕсли;

		НомерСтроки = НомерСтроки + 1;

	КонецЦикла;

	ЭлектронноеВзаимодействиеИСМП.ПроверитьСведенияОМаркировке_2019(ТаблицаКодовМаркировки, Отказ);

	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров, "ЕдиницаИзмеренияНаименование",,,
	НСтр("ru = 'Не заполнена наименование единицы измерения в справочнике ""Номенклатура"".'"));
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров, "ЕдиницаИзмеренияКод",,,
	НСтр("ru = 'Не заполнен код единицы измерения в справочнике ""Номенклатура"".'"));
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров, "Количество",,,
	НСтр("ru = 'Не указано количество товара в табличной части'"));

	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
	"ВсегоКОплате.ВсегоСтоимостьТоваровБезНалога", ТаблицаТоваров.Итог("СтоимостьТоваровБезНалога"));
	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
	"ВсегоКОплате.ВсегоСтоимостьТоваровСНалогом", ТаблицаТоваров.Итог("СтоимостьТоваровСНалогом"));
	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
	"ВсегоКОплате.ВсегоСуммаНалога", ТаблицаТоваров.Итог("СуммаНалога"));
	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных,
	"ВсегоКОплате.ВсегоКоличество", ТаблицаТоваров.Итог("Количество"));

	// Обработка ошибки через механизм сообщений пользователю.
	СсылкаНаДокумент = ДанныеДляФормированияЭД.РеквизитыШапки.Ссылка;

	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
	"ТоварКод", "Номенклатура", "Объект.Код");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
	"ТоварНаименование", "Номенклатура", "Объект.НаименованиеПолное");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
	"Количество", СсылкаНаДокумент, "Объект.Товары.Количество",, "НомерСтрокиИсходногоДокумента");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
	"ЕдиницаИзмеренияНаименование", "ЕдиницаИзмерения", "Объект.Наименование");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
	"ЕдиницаИзмеренияКод", "ЕдиницаИзмерения", "Объект.Код");
	ЭлектронноеВзаимодействие.ДобавитьВТаблицуОбработкуОшибкиЧерезСообщениеПользователю(ТаблицаТоваров,
	"Признак", "Номенклатура", "Объект.ТипНоменклатуры");

	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТаблицаТоваров, "СведенияОТоварах");

	// Данные документа подтверждения отгрузки (данные документа "Реализация товаров и услуг")
	ДокументыПодтвержденияОтгрузки = Новый ТаблицаЗначений;
	ДокументыПодтвержденияОтгрузки.Колонки.Добавить("Наименование");
	ДокументыПодтвержденияОтгрузки.Колонки.Добавить("Номер");
	ДокументыПодтвержденияОтгрузки.Колонки.Добавить("Дата");

	НомерДокументаПодтвержденияОтгрузки = НомерДокумента;
	ДатаДокументаПодтвержденияОтгрузки = ДанныеШапки.Дата;

	Если ДанныеШапки.Исправление = Истина Тогда
		Если ДанныеДляФормированияЭД.Свойство("ТаблицаДанныхДокумента") 
			И ДанныеДляФормированияЭД.ТаблицаДанныхДокумента <> Неопределено
			И ДанныеДляФормированияЭД.ТаблицаДанныхДокумента.Количество() > 0 Тогда

			РеквизитыДокументаПодтвержденияОтгрузки = ДанныеДляФормированияЭД.ТаблицаДанныхДокумента[0];
			Если ЗначениеЗаполнено(РеквизитыДокументаПодтвержденияОтгрузки.Номер) Тогда
				НомерДокументаПодтвержденияОтгрузки = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(
				РеквизитыДокументаПодтвержденияОтгрузки.ДатаДокумента, РеквизитыДокументаПодтвержденияОтгрузки.Номер, РеквизитыДокументаПодтвержденияОтгрузки.Организация.Префикс);
				ДатаДокументаПодтвержденияОтгрузки = РеквизитыДокументаПодтвержденияОтгрузки.ДатаДокумента;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Настройки.Функция = "СЧФ" Тогда
		Если ДанныеДляФормированияЭД.ДокументыОснования.Количество() > 0
			И ЗначениеЗаполнено(ДанныеДляФормированияЭД.ДокументыОснования[0]) Тогда

			РеквизитыДокументаПодтвержденияОтгрузки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеДляФормированияЭД.ДокументыОснования[0], "Номер,Дата,Организация");
			НомерДокументаПодтвержденияОтгрузки = ПечатьДокументовУНФ.ПолучитьНомерНаПечатьСУчетомДатыДокумента(
			РеквизитыДокументаПодтвержденияОтгрузки.Дата, РеквизитыДокументаПодтвержденияОтгрузки.Номер, РеквизитыДокументаПодтвержденияОтгрузки.Организация.Префикс);
			ДатаДокументаПодтвержденияОтгрузки = РеквизитыДокументаПодтвержденияОтгрузки.Дата;
		КонецЕсли;
	КонецЕсли;

	СтрокаДокументыПодтвержденияОтгрузки = ДокументыПодтвержденияОтгрузки.Добавить();
	СтрокаДокументыПодтвержденияОтгрузки.Номер = НомерДокументаПодтвержденияОтгрузки;
	СтрокаДокументыПодтвержденияОтгрузки.Дата  = ДатаДокументаПодтвержденияОтгрузки;

	Если Настройки.Функция = "СЧФДОП" ИЛИ Настройки.Функция = "ДОП" Тогда
		СтрокаДокументыПодтвержденияОтгрузки.Наименование = НСтр("ru = 'Универсальный передаточный документ'");
	Иначе
		СтрокаДокументыПодтвержденияОтгрузки.Наименование = ?(ТолькоУслуги, НСтр("ru = 'Акт'"), НСтр("ru = 'Товарная накладная'"));;
	КонецЕсли;

	ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(
	ДеревоДанных, ДокументыПодтвержденияОтгрузки, "ДокументыПодтвержденияОтгрузки");

	ШаблонПодстрокиДокументаОбОтгрузке = "№ п/п %1 № %2 от %3 г.";

	ДиапазонСтрок = ?(ТаблицаТоваров.Количество() > 1, "1-" + Формат(ТаблицаТоваров.Количество(), "ЧГ=0"), "1");

	ДокументОбОтгрузке = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонПодстрокиДокументаОбОтгрузке,
	ДиапазонСтрок,
	НомерДокументаПодтвержденияОтгрузки,
	Формат(ДатаДокументаПодтвержденияОтгрузки, "ДЛФ=DD"));

	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ДокументОбОтгрузке", ДокументОбОтгрузке);

	ЗаполнитьЗначениеРеквизитаВДереве(ДеревоДанных, "ТолькоУслуги", ТолькоУслуги);

	// Не выводим данные Грузоотправителя и Грузополучателя, если в документе только услуги или это счет-фактура на аванс.
	Если Не ТолькоУслуги Тогда

		// Сведения о грузоотправителе
		Если Не ЗначениеЗаполнено(Грузоотправитель)ИЛИ (Грузоотправитель = "он же") Тогда
			ТаблицаГрузоотправителей = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(
			ДеревоДанных, "СведенияОГрузоотправителе");
			ТаблицаГрузоотправителей.Колонки.Добавить("СведенияОбУчастнике");
			ТаблицаГрузоотправителей.Добавить().ОнЖе = Истина;
			ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТаблицаГрузоотправителей, "СведенияОГрузоотправителе");
		Иначе
			СведенияОГрузоотправителе = ПолучитьДанныеЮрФизЛица(Грузоотправитель, ДанныеШапки.Дата);
			ЗаполнитьДанныеУчастниковУПД_2019(
			ДеревоДанных,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СведенияОГрузоотправителе),
			"СведенияОГрузоотправителе",
			"Факт",
			ДанныеШапки.Дата);
		КонецЕсли;

		// Сведения о грузополучателе
		Грузополучатель = ?(НЕ ЗначениеЗаполнено(Грузополучатель) ИЛИ (Грузополучатель = "он же"),
		ДанныеШапки.Покупатель, Грузополучатель);
		СведенияОГрузополучателе = ПолучитьДанныеЮрФизЛица(Грузополучатель, ДанныеШапки.Дата);

		// Получаем адрес доставки из документа реализации
		ДокументРеализации = Неопределено;
		Если ТипЗнч(ДанныеДляФормированияЭД.ДокументыОснования) = Тип("Массив") Тогда
			Для Каждого Документ Из ДанныеДляФормированияЭД.ДокументыОснования Цикл
				Если ТипЗнч(Документ) = Тип("ДокументСсылка.РасходнаяНакладная")
					Или ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда

					ДокументРеализации = Документ;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		АдресДоставки = Неопределено;
		Если ЗначениеЗаполнено(ДокументРеализации) Тогда
			АдресДоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРеализации, "АдресДоставки");
		КонецЕсли;
		Если ЗначениеЗаполнено(АдресДоставки) Тогда
			СведенияОГрузополучателе.Вставить("АдресДоставки", АдресДоставки);
		КонецЕсли;
        #Вставка     
		
		ллл_ПараметрыОтправки = Т_ПараметрыОтправкиПриходнойЭДО();
		
		Если ллл_ПараметрыОтправки.Свойство("АдресДоставки") 
			И ЗначениеЗаполнено(ллл_ПараметрыОтправки.АдресДоставки) 
			И ллл_ПараметрыОтправки.ЭтоОбработка Тогда
			
			ллл_ЮрАдресПереопределяемый = ллл_ПараметрыОтправки.АдресДоставки; 
			
			Если ЗначениеЗаполнено(ллл_ЮрАдресПереопределяемый) Тогда
				СведенияОГрузополучателе.Вставить("ФактическийАдрес", 	ллл_ЮрАдресПереопределяемый);
				СведенияОГрузополучателе.Вставить("ЮридическийАдрес", 	ллл_ЮрАдресПереопределяемый);
				СведенияОГрузополучателе.Вставить("ПочтовыйАдрес", 		ллл_ЮрАдресПереопределяемый);  
				СведенияОГрузополучателе.Вставить("АдресДоставки", 		ллл_ЮрАдресПереопределяемый);
			КонецЕсли;                             
			
		КонецЕсли; 
		
		#КонецВставки
	
		ЗаполнитьДанныеУчастниковУПД_2019(
		ДеревоДанных,
		ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СведенияОГрузополучателе),
		"СведенияОГрузополучателе",
		"Факт",               
		ДанныеШапки.Дата);
	КонецЕсли;

	ПутьВДереве = "ДопДанныеДокументаОтгрузки.ТекстоваяИнформация";

	Если РеализацияУслугПоПереработкеОснованиеЭД(СсылкаНаОснование) Тогда
		ДобавитьДопополнительныеДанныеВДерево(ДеревоДанных, "РеализацияУслугПоПереработке", "Истина", ПутьВДереве);
	КонецЕсли;

КонецПроцедуры

//<<<--- Tnext Козык К.А. 16.06.2026 - адаптация под новый релиз релиз 3.0.13.357
&ИзменениеИКонтроль("ЗаполнитьСведенияОГрузоотправителяхИГрузополучателяхУПД")
Процедура спЗаполнитьСведенияОГрузоотправителяхИГрузополучателяхУПД(ДеревоДанных, ДанныеДляФормированияЭД)

	ДанныеШапки = ДанныеДляФормированияЭД.РеквизитыШапки;
		
	// Сведения о грузоотправителях.
	
	Если ДанныеДляФормированияЭД.Свойство("ТаблицаДанныхДокумента") 
		И ДанныеДляФормированияЭД.ТаблицаДанныхДокумента <> Неопределено
		И ДанныеДляФормированияЭД.ТаблицаДанныхДокумента.Количество() > 0 Тогда
		
		Организация = ДанныеДляФормированияЭД.ТаблицаДанныхДокумента[0].Организация;
		Грузоотправитель = ДанныеДляФормированияЭД.ТаблицаДанныхДокумента[0].Грузоотправитель;
		Грузополучатель = ДанныеДляФормированияЭД.ТаблицаДанныхДокумента[0].Грузополучатель;
	Иначе
		Организация = ДанныеШапки.Организация;
		Грузоотправитель = ДанныеШапки.Грузоотправитель;
		Грузополучатель = ДанныеШапки.Грузополучатель;
	КонецЕсли;
	
	СведенияОГрузоотправителях = Новый Массив;
	Если НЕ ЗначениеЗаполнено(Грузоотправитель)
			ИЛИ (Грузоотправитель = Организация)
			ИЛИ (Грузоотправитель = "он же") Тогда
		ПутьВДереве = ?(ДанныеДляФормированияЭД.ЭтоФормат502, "СведенияОСчетеФактуре.СведенияОГрузоотправителях",
			"СведенияОГрузоотправителе");
		ТаблицаГрузоотправителей = ЭлектронноеВзаимодействие.ДанныеЭлементаДереваЭлектронногоДокумента(
			ДеревоДанных, ПутьВДереве);
		ТаблицаГрузоотправителей.Добавить().ОнЖе = Истина;
		ЭлектронноеВзаимодействие.ЗагрузитьТаблицуВДерево(ДеревоДанных, ТаблицаГрузоотправителей, ПутьВДереве);
	Иначе
		СведенияОГрузоотправителе = ПолучитьДанныеЮрФизЛица(Грузоотправитель, ДанныеШапки.Дата);
		СведенияОГрузоотправителях.Добавить(СведенияОГрузоотправителе);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СведенияОГрузоотправителях) Тогда
		ПараметрыУчастников = НовыйПараметрыУчастников();
		ПараметрыУчастников.СведенияОбУчастниках = СведенияОГрузоотправителях;
		ПараметрыУчастников.ЭтоФормат502 = ДанныеДляФормированияЭД.ЭтоФормат502;
		ПараметрыУчастников.ВидУчастника = ВидыУчастниковЭД().Грузоотправитель;
		ПараметрыУчастников.ПутьВДеревеУчастники = ?(ДанныеДляФормированияЭД.ЭтоФормат502,
			"СведенияОСчетеФактуре.СведенияОГрузоотправителях", "СведенияОГрузоотправителе");
		ПараметрыУчастников.ПутьВДеревеУчастник = ?(ДанныеДляФормированияЭД.ЭтоФормат502,
			"СведенияОСчетеФактуре.СведенияОГрузоотправителях.НомерСтроки.Грузоотправитель", "");
		ПараметрыУчастников.ВидАдреса = ВидыАдресовЭД().Почтовый;
		ПараметрыУчастников.ДатаСведений = ДанныеШапки.Дата;
		
		ЗаполнитьДанныеУчастниковУПД(ДеревоДанных, ПараметрыУчастников);
	КонецЕсли;
	
	//Сведения о грузополучателях.
	
	СведенияОГрузополучателях = Новый Массив;
	
	Грузополучатель = ?(НЕ ЗначениеЗаполнено(Грузополучатель) ИЛИ (Грузополучатель = "он же"),
				ДанныеШапки.Покупатель, Грузополучатель);
	СведенияОГрузополучателе = ПолучитьДанныеЮрФизЛица(Грузополучатель, ДанныеШапки.Дата);
	
	// Получаем адрес доставки из документа реализации
	ДокументРеализации = Неопределено;
	Если ТипЗнч(ДанныеДляФормированияЭД.ДокументыОснования) = Тип("Массив") Тогда
		Для Каждого Документ Из ДанныеДляФормированияЭД.ДокументыОснования Цикл
			Если ТипЗнч(Документ) = Тип("ДокументСсылка.РасходнаяНакладная")
				Или ТипЗнч(Документ) = Тип("ДокументСсылка.КорректировкаРеализации") Тогда
				
				ДокументРеализации = Документ;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	АдресДоставки = Неопределено;
	Если ЗначениеЗаполнено(ДокументРеализации) Тогда
		АдресДоставки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументРеализации, "АдресДоставки");
	КонецЕсли;
	Если ЗначениеЗаполнено(АдресДоставки) Тогда
		СведенияОГрузополучателе.Вставить("АдресДоставки", АдресДоставки);
	КонецЕсли;
	
	#Вставка     
	ллл_ПараметрыОтправки = Т_ПараметрыОтправкиПриходнойЭДО();
	
	Если ллл_ПараметрыОтправки.Свойство("АдресДоставки") 
		И ЗначениеЗаполнено(ллл_ПараметрыОтправки.АдресДоставки) 
		И ллл_ПараметрыОтправки.ЭтоОбработка Тогда
		
		ллл_ЮрАдресПереопределяемый = ллл_ПараметрыОтправки.АдресДоставки; 
		
		Если ЗначениеЗаполнено(ллл_ЮрАдресПереопределяемый) Тогда
			СведенияОГрузополучателе.Вставить("ФактическийАдрес", 	ллл_ЮрАдресПереопределяемый);
			СведенияОГрузополучателе.Вставить("ЮридическийАдрес", 	ллл_ЮрАдресПереопределяемый);
			СведенияОГрузополучателе.Вставить("ПочтовыйАдрес", 		ллл_ЮрАдресПереопределяемый);  
			СведенияОГрузополучателе.Вставить("АдресДоставки", 		ллл_ЮрАдресПереопределяемый);
		КонецЕсли;                             
		
	КонецЕсли;
	#КонецВставки
	
	СведенияОГрузополучателях.Добавить(СведенияОГрузополучателе);
	
	Если ЗначениеЗаполнено(СведенияОГрузополучателях) Тогда
		ПараметрыУчастников = НовыйПараметрыУчастников();
		ПараметрыУчастников.СведенияОбУчастниках = СведенияОГрузополучателях;
		ПараметрыУчастников.ЭтоФормат502 = ДанныеДляФормированияЭД.ЭтоФормат502;
		ПараметрыУчастников.ВидУчастника = ВидыУчастниковЭД().Грузополучатель;
		ПараметрыУчастников.ПутьВДеревеУчастники = ?(ДанныеДляФормированияЭД.ЭтоФормат502,
			"СведенияОСчетеФактуре.СведенияОГрузополучателях", "СведенияОГрузополучателе");
		ПараметрыУчастников.ПутьВДеревеУчастник = ?(ДанныеДляФормированияЭД.ЭтоФормат502,
			"СведенияОСчетеФактуре.СведенияОГрузополучателях.НомерСтроки.Грузополучатель", "");
		ПараметрыУчастников.ВидАдреса = ВидыАдресовЭД().Почтовый;
		ПараметрыУчастников.ДатаСведений = ДанныеШапки.Дата;
		
		ЗаполнитьДанныеУчастниковУПД(ДеревоДанных, ПараметрыУчастников);
	КонецЕсли;

КонецПроцедуры //--->>> Tnext Козык К.А. 16.06.2026

#КонецОбласти

#КонецОбласти
