#Область ПрограммныйИнтерфейс

// Функция - ДлительностьОжиданияПриАвтоматическомСтарте
//
// Возвращаемое значение:
//	Число - длительность ожидания
//
функция ДлительностьОжиданияПриАвтоматическомСтарте() Экспорт
	 
	Возврат 15;
	
КонецФункции

// Функция - Получить список рабочих статусов
//
// Возвращаемое значение:
//  Массив - массив, сождержащий элементы перечисления "Статусы сообщений" (См. Перечисления.спСтатусыСообщений)
//
Функция ПоучитьСписокРабочихСтатусов() Экспорт
	
	МассивСтатусы = Новый Массив;
	МассивСтатусы.Добавить(Перечисления.спСтатусыСообщений.Новое);
	МассивСтатусы.Добавить(Перечисления.спСтатусыСообщений.ОжиданиеОбработки); 
	
	Возврат МассивСтатусы;
	
КонецФункции

// Функция - Получить список статусов очереди исходящих сообщений
//
// Возвращаемое значение:
//  Массив - массив, сождержащий элементы перечисления "Статусы сообщений" (См. Перечисления.спСтатусыСообщений)
//
Функция ПоучитьСписокСтатусовОчередиИсходящихСообщений() Экспорт
	
	МассивСтатусы = Новый Массив;
	МассивСтатусы.Добавить(Перечисления.спСтатусыСообщений.Отправлено);
	МассивСтатусы.Добавить(Перечисления.спСтатусыСообщений.ОтправкаПодтверждена);
	Возврат МассивСтатусы;
	
КонецФункции  

// Функция - Получить список статусов для избежания повторной отправки
//
// Возвращаемое значение:
//  Массив - массив, сождержащий элементы перечисления "Статусы сообщений" (См. Перечисления.спСтатусыСообщений)
//
Функция ПоучитьСписокСтатусовДляОтправки() Экспорт
	
	МассивСтатусы = Новый Массив;
	МассивСтатусы.Добавить(Перечисления.спСтатусыСообщений.Новое);
	МассивСтатусы.Добавить(Перечисления.спСтатусыСообщений.ОжиданиеОбработки);
	МассивСтатусы.Добавить(Перечисления.спСтатусыСообщений.ВОбработке);
	МассивСтатусы.Добавить(Перечисления.спСтатусыСообщений.ОшибкаОтправки);
	Возврат МассивСтатусы;	
КонецФункции

// ++ Терлецкий АВ 25.01.15

// Функция - Получить список статусов ошибка
//
// Возвращаемое значение:
//  Массив - массив, сождержащий элементы перечисления "Статусы сообщений" (См. Перечисления.спСтатусыСообщений)
//
Функция ПоучитьСписокСтатусовОшибкаОтправки() Экспорт
	
	МассивСтатусы = Новый Массив;
	МассивСтатусы.Добавить(Перечисления.спСтатусыСообщений.ОшибкаОтправки);
	МассивСтатусы.Добавить(Перечисления.спСтатусыСообщений.ОшибкаОбработки);
	МассивСтатусы.Добавить(Перечисления.спСтатусыСообщений.ОшибкаПодтверждения); 
	МассивСтатусы.Добавить(Перечисления.спСтатусыСообщений.НеВалидно);
	Возврат МассивСтатусы;	
КонецФункции
// -- Терлецкий АВ 25.01.15

// Функция - ПолучитьКомпоненту
// Используется для Windows x64/x86 и Linux x64
// 
// Параметры:
//  ИмяЭкземпляра - Строка - Имя экземпляра компоненты
// 
// Возвращаемое значение:
//  Неопределено - Получить компоненту
Функция ПолучитьКомпоненту(ИмяЭкземпляра = "") Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	Если СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86_64 Тогда 
		
		ИмяКомпоненты = "ОбщийМакет.спКомпонентаWin64";
	
	ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Windows_x86 Тогда
		
		ИмяКомпоненты = "ОбщийМакет.спКомпонентаWin86";
	
	//ИначеЕсли СистемнаяИнформация.ТипПлатформы = ТипПлатформы.Linux_x86_64 Тогда 
	//	
	//	ИмяКомпоненты = "ОбщийМакет.сшпКомпонентаLinux64";
	
	Иначе
		
		ЗаписьЖурналаРегистрации("Datareon.ПолучитьВнешнююКомпоненту", УровеньЖурналаРегистрации.Примечание, Метаданные.ОбщиеМодули.спКэшируемыеФункцииВызовСервера, , НСтр("ru = 'Для платформы " + СистемнаяИнформация.ТипПлатформы + " использование внешней компоненты не поддерживается.'"));
		
		Возврат Неопределено;
	
	КонецЕсли;

		
	Попытка  
		
		РезультатПодключения = ПодключитьВнешнююКомпоненту(ИмяКомпоненты,"datareon", ТипВнешнейКомпоненты.Native); 	
				
	Исключение
		РезультатПодключения = Ложь;
		
		ЗаписьЖурналаРегистрации("Datareon.ПолучитьВнешнююКомпоненту", УровеньЖурналаРегистрации.Примечание, Метаданные.ОбщиеМодули.спОбщегоНазначения, 
		, НСтр("ru = 'Ошибка получения внешней компоненты.'"));
		
	КонецПопытки;  
	
	Если Не РезультатПодключения Тогда
				
		ЗаписьЖурналаРегистрации("Datareon.ПолучитьВнешнююКомпоненту", УровеньЖурналаРегистрации.Ошибка, Метаданные.ОбщиеМодули.спКэшируемыеФункцииВызовСервера, , НСтр("ru = 'Для платформы " + СистемнаяИнформация.ТипПлатформы + " не удалось загрузить внешнюю компоненту.'"));
		
		Возврат Неопределено;
	
	КонецЕсли;

	Возврат Новый("AddIn.datareon.AddInNativeExtension");	

КонецФункции

// Функция - Получить тип объекта
//
// Параметры:
//  ТипОбъекта - Строка - Представление типа объекта метаданных
// 
// Возвращаемое значение:
//  Строка - тип объекта.
//
Функция ПолучитьТипОбъекта(ТипОбъекта) Экспорт
	
	ТипОбъектаМетаданных = Лев(ТипОбъекта, Найти(ТипОбъекта, ".") - 1); // Для старых версий платформы.
	
	Возврат ТипОбъектаМетаданных;
	
КонецФункции

// Функция - Получить имя объекта
//
// Параметры:
//  типобъекта - Строка - возвращает имя объекта по переданному типу.
// 
// Возвращаемое значение:
//  Строка - имя объекта.
//
Функция ПолучитьИмяОбъекта(ТипОбъекта) Экспорт
	
	ИмяОбъекта = Прав(ТипОбъекта, СтрДлина(ТипОбъекта) - Найти(ТипОбъекта, ".")); // Для старых версий платформы.
	
	Возврат ИмяОбъекта;
	
КонецФункции

// Функция - ПолучитьОбъектНабораЗаписейСостоянияСообщений
//
// Возвращаемое значение:
//	 РегистрСведенийНаборЗаписей - набор записей регистра сшпСостояниеСообщений
//
Функция ПолучитьОбъектНабораЗаписейСостоянияСообщений() Экспорт
	
	Набор = РегистрыСведений.РасшОСШ_СостояниеСообщений.СоздатьНаборЗаписей();
	Набор.ДополнительныеСвойства.Вставить("СШПНеобрабатывать", Истина);
	
	Возврат Набор;
	
КонецФункции

#КонецОбласти
