//<<<--- Tnext Козык К.А. 16.06.2026 - перенос доработки из формы ФормаРМК обработки РабочееМестоКассира после обновления на релиз 3.0.13.357
&Вместо("ПолучитьПредставлениеКодАртикул")
Функция спПолучитьПредставлениеКодАртикул(ТекущаяСтрока, ИспользоватьКод, ИспользоватьАртикул, ЭтоИнфоЗаголовок)
	
	Результат = ПродолжитьВызов(ТекущаяСтрока, ИспользоватьКод, ИспользоватьАртикул, ЭтоИнфоЗаголовок);
	Результат = спВистерияРМКСервер.спНайтиБрендНоменклатуры(ТекущаяСтрока.Номенклатура, Результат);
	Возврат Результат;
	
КонецФункции //--->>> Tnext Козык К.А. 16.06.2026

