
// ++ Терлецкий АВ 25.02.25
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("ЗначениеЗаполнения", ПараметрКоманды);
	ОткрытьФорму("Документ.ЗаказНаПеремещение.Форма.ФормаДокумента", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, 
					ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры  
// -- Терлецкий АВ 25.02.25
