//<<<--- Tnext Козык К.А. 16.06.2026 - адаптация под новый релиз 3.0.13.357
&После("ПриОпределенииПараметровИнтеграцииФормыПроверкиИПодбора")
Процедура спПриОпределенииПараметровИнтеграцииФормыПроверкиИПодбора(Форма, ПараметрыИнтеграции)
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.спПриемкаТовара") Тогда
		
		ЭлементНастроек = ПараметрыИнтеграции[ПараметрыИнтеграции.Количество() - 1];
		
		ЭлементНастроек.ИмяПоследующегоЭлементаФормы               = "Запасы";
		ЭлементНастроек.ИмяСледующейКолонки                        = "ЗапасыКоличество";
		ЭлементНастроек.ИмяТабличнойЧастиТовары                    = "Запасы";
		ЭлементНастроек.ИмяРодительскойГруппыФормы                 = "ГруппаЗапасы";
		ЭлементНастроек.ИмяЭлементаФормыТовары                     = "Запасы";
		ЭлементНастроек.ИмяТабличнойЧастиСерии                     = "";
		ЭлементНастроек.РазмещатьЭлементыИнтерфейса                = Истина;
		ЭлементНастроек.ЕстьПравоИзменение                         = ПравоДоступа("Изменение", Форма.Объект.Ссылка.Метаданные());
		ЭлементНастроек.ЭтоДокументПриобретения                    = Истина;
		ЭлементНастроек.ЕстьЭлектронныйДокумент                    = Ложь;
		ЭлементНастроек.ИспользоватьКолонкуСтатусаПроверкиПодбора  = Истина;
		ЭлементНастроек.БлокироватьТабличнуюЧастьТоварыПриПроверке = ЭлементНастроек.ЕстьЭлектронныйДокумент;
		ЭлементНастроек.ИспользоватьСтатусПроверкаЗавершена        = ЭлементНастроек.ЕстьЭлектронныйДокумент;
		ЭлементНастроек.ДоступноЧастичноеВыбытие                   = Истина;
		ЭлементНастроек.Вставить("ИмяКолонкиКоличество", "Количество");
		
	КонецЕсли;
	
КонецПроцедуры //--->>> Tnext Козык К.А. 16.06.2026