#Область ПрограммныйИнтерфейс

Процедура ЛогироватьСобытиеИБ(ИмяСобытия, УровеньСтрокой = "", 
			ПолноеИмяОбъектаМетаданных = "", Данные = Неопределено, 
			Комментарий = "", РежимТранзакцииСтрокой = "") Экспорт
	
	Уровень = ?(ЗначениеЗаполнено(УровеньСтрокой), УровеньЖурналаРегистрации[УровеньСтрокой], Неопределено);
	
	ОбъектМетаданных = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени(ПолноеИмяОбъектаМетаданных);
	
	РежимТранзакции = ?(ЗначениеЗаполнено(РежимТранзакцииСтрокой), РежимТранзакцииЗаписиЖурналаРегистрации[РежимТранзакцииСтрокой], Неопределено);
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, Уровень, ОбъектМетаданных, Данные, Комментарий, РежимТранзакции);
	
КонецПроцедуры

#КонецОбласти