//<<<--- Tnext Козык К.А. 16.06.2026 - перенос доработок из общего модуля ПроверкаИПодборПродукцииИСМПКлиентПереопределяемый после обновления на релиз 3.0.13.357
// т.к. он был удален
&После("ПриУстановкеПараметровОткрытияФормыПроверкиИПодбора")
Процедура спПриУстановкеПараметровОткрытияФормыПроверкиИПодбора(Форма, Параметры)
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.спПриемкаТовара") Тогда
		
		Параметры.ИмяРеквизитаДокументОснование = "";
		Параметры.ИмяРеквизитаСклад             = "СтруктурнаяЕдиницаРезерв";
		Параметры.ИмяРеквизитаКонтрагент        = "";
		
	КонецЕсли;

КонецПроцедуры

&После("ПередОткрытиемФормыПроверкиПодбора")
Процедура спПередОткрытиемФормыПроверкиПодбора(Форма, ПараметрыОткрытияФормыПроверки, ПараметрыФормыПроверки, Отказ)
	
	Если ШтрихкодированиеИСКлиентСервер.ЭтоКонтекстОбъекта(Форма, "Документ.спПриемкаТовара") Тогда
		
		ПараметрыФормыПроверки.Вставить("ПриЗавершенииСохранятьРезультатыПроверки", Истина);
		ПараметрыФормыПроверки.Вставить("ИспользоватьСтатусПроверкаЗавершена", Истина);
		
	КонецЕсли;
	
КонецПроцедуры //--->>> Tnext Козык К.А. 16.06.2026



                               