#Область ПрограммныйИнтерфейс

#Область Константы

// Получение значения константы.
//
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт
    УстановитьПривилегированныйРежим(Истина);
	Возврат Константы[ИмяКонстанты].Получить();
    УстановитьПривилегированныйРежим(Ложь);
КонецФункции

// Установка значения константы.
//
Процедура УстановитьЗначениеКонстанты(ИмяКонстанты, Значение) Экспорт
    УстановитьПривилегированныйРежим(Истина);
	Константы[ИмяКонстанты].Установить(Значение);
    УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Функция СсылкаНаДвоичныеДанныеКартинки(ВнешняяСсылка, Размер = 0, УникальныйИдентификатор = Неопределено, Напрямую = Ложь) Экспорт

	 Возврат спМодификацияКонфигурацииПереопределяемый.СсылкаНаДвоичныеДанныеКартинки(ВнешняяСсылка, Размер, УникальныйИдентификатор, Напрямую);

КонецФункции

#КонецОбласти

#КонецОбласти
