
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ТипыОборудования.СканерШтрихкода = Истина;
		МенеджерОборудования.ПриСозданииНаСервере(ЭтотОбъект, ТипыОборудования);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда  
			
			Если ТипЗнч(Параметр) <> Тип("Массив") Тогда
				Параметр = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметр);
			КонецЕсли;
			
			Данные = МенеджерОборудованияУНФКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			
			ПолученШтрихкод(Данные); 
			
		КонецЕсли;  
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РаспечататьЦенник(Команда)
	
    ОчиститьСообщения();
	ВыполнитьПечатьЦенника();

КонецПроцедуры

// Процедура - обработчик команды командной панели табличной части.
&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ОчиститьСообщения();
	ТекШтрихкод = "";
	
	ОбработкаЗавершения = Новый ОписаниеОповещения(
		"ПоискПоШтрихкодуЗавершение",
		ЭтотОбъект, 
		Новый Структура("ТекШтрихкод", ТекШтрихкод));

	#Если МобильныйКлиент Тогда
	ОткрытьФорму("ОбщаяФорма.ФормаПоискаПоШтрихкоду", , , , , , ОбработкаЗавершения);
	#Иначе
	ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПоискПоШтрихкоду

// Процедура обрабатывает полученные штрихкоды.
//
&НаКлиенте
Процедура ПолученШтрихкод(ДанныеШтрихкодов) Экспорт

	Для каждого ДанныеШтрихкода Из ДанныеШтрихкодов Цикл
		
		ДополнительныеДанныеПоШтрихкоду = ШтрихкодированиеУНФКлиент.ДополнительныеДанныеПоШтрихкоду(ДанныеШтрихкода.Штрихкод,
		"");
		Если ДополнительныеДанныеПоШтрихкоду.ЭтоКодМаркировки Тогда
			ДанныеШтрихкода.Штрихкод = ДополнительныеДанныеПоШтрихкоду.EAN;
		ИначеЕсли ДополнительныеДанныеПоШтрихкоду.ЕстьРазделительGS1 Тогда
			ДанныеШтрихкода.Штрихкод = ДополнительныеДанныеПоШтрихкоду.ПредставлениеШтрихкода;
		Иначе
			// Действие не требуется
		КонецЕсли;
		
		ДанныеПоШтрихКодам = ПолучитьДанныеПоШтрихкодамВМассиве(ДанныеШтрихкода);
		
		МассивДанных = ДанныеПоШтрихкодам.Получить(ДанныеШтрихкода.Штрихкод);
		
		Штрихкод = ДанныеШтрихкода.Штрихкод;
		
		Если Не МассивДанных = Неопределено И МассивДанных.Количество() Тогда
			
			Если МассивДанных.Количество() > 1 Тогда
				ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПоДаннымШтрихкодовЗавершение", ЭтотОбъект);
				ПараметрыОткрытия = Новый Структура("МассивНоменклатуры, ТекШтрихкод", МассивДанных, ДанныеШтрихкода);
				ОткрытьФорму("Справочник.Номенклатура.Форма.ДублиНоменклатурыПоШтрихКоду", ПараметрыОткрытия, ЭтаФорма,,,,
				ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				Возврат;
			КонецЕсли;
			
			Номенклатура 	= МассивДанных[0].Номенклатура;
			Цена 			= ЦенаНоменклатуры(Номенклатура);
			
		КонецЕсли; 
		
		Прервать;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымШтрихкодовЗавершение(СтруктураНоменклатуры, Параметры) Экспорт 
	
	Если СтруктураНоменклатуры = Неопределено Тогда Возврат КонецЕсли;
	
	Номенклатура = СтруктураНоменклатуры.МассивНоменклатуры[0].Номенклатура;
	Цена 		 = ЦенаНоменклатуры(Номенклатура);

КонецПроцедуры

&НаСервереБезКонтекста
Функция ЦенаНоменклатуры(Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.ВидЦен КАК ВидЦен,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&Дата,
		|			Номенклатура = &Номенклатура
		|				И ВидЦен = &ВидЦен) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидЦен", Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи());
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Цена;
		
	Иначе
		
		Возврат 0;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Результат = Неопределено, СокрЛП(ДополнительныеПараметры.ТекШтрихкод), СокрЛП(Результат));
	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда 
		ДанныеШтрихкода = Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1);
		
		ПолученШтрихкод(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеШтрихкода));
	КонецЕсли;
	
КонецПроцедуры // ПоискПоШтрихкодуЗавершение()

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоШтрихкодамВМассиве(ДанныеШтрихкода, СтруктурнаяЕдиница = Неопределено)
	
	РегистрыСведений.ШтрихкодыНоменклатуры.ПреобразоватьВесовойШтрихкод(ДанныеШтрихкода);
	
	Штрихкоды = Новый Массив;
	Штрихкоды.Добавить(ДанныеШтрихкода);
	
	ДанныеПоШтрихкодам = Новый Соответствие;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ Цены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ВидЦен = &ВидЦеныПродажи) КАК ЦеныНоменклатурыСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Рег.Штрихкод КАК Штрихкод,
	|	Рег.Номенклатура КАК Номенклатура,
	|	Рег.Характеристика КАК Характеристика,
	|	Рег.Партия КАК Партия,
	|	Рег.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	|	ЕСТЬNULL(Цены.Цена, 0) КАК Цена
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Рег
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (&СерииНоменклатурыИспользуются)
	|			И Рег.Номенклатура = СерииНоменклатуры.Владелец
	|			И (Рег.Номенклатура.ИспользоватьСерииНоменклатуры)
	|			И Рег.Штрихкод = СерииНоменклатуры.Наименование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цены КАК Цены
	|		ПО Рег.Номенклатура = Цены.Номенклатура
	|			И Рег.Характеристика = Цены.Характеристика
	|ГДЕ
	|	Рег.Штрихкод В(&МассивШтрихкодов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗДанныеОВесовомТоваре.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ТЗДанныеОВесовомТоваре.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ТЗДанныеОВесовомТоваре.ШтрихКод КАК ШтрихКод
	|ПОМЕСТИТЬ ВременнаяТаблицаВесовойТовар
	|ИЗ
	|	&ТЗДанныеОВесовомТоваре КАК ТЗДанныеОВесовомТоваре
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыТоваровSKU.Номенклатура КАК Номенклатура,
	|	КодыТоваровSKU.Характеристика КАК Характеристика,
	|	КодыТоваровSKU.Партия КАК Партия,
	|	КодыТоваровSKU.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВременнаяТаблицаВесовойТовар.ШтрихКод КАК ШтрихКод,
	|	ВременнаяТаблицаВесовойТовар.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	|	ЕСТЬNULL(КодыТоваровSKU.Номенклатура.ВидАлкогольнойПродукции.Маркируемый, ЛОЖЬ)
	|		ИЛИ КодыТоваровSKU.Номенклатура.УдалитьТабачнаяПродукция КАК МаркируемаяПродукция
	|ИЗ
	|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаВесовойТовар КАК ВременнаяТаблицаВесовойТовар
	|		ПО КодыТоваровSKU.SKU = ВременнаяТаблицаВесовойТовар.КодВесовогоТовара
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (&СерииНоменклатурыИспользуются)
	|			И КодыТоваровSKU.Номенклатура = СерииНоменклатуры.Владелец
	|			И (КодыТоваровSKU.Номенклатура.ИспользоватьСерииНоменклатуры)
	|			И (ВременнаяТаблицаВесовойТовар.ШтрихКод = СерииНоменклатуры.Наименование)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаВесовойТовар.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ШтрихКод КАК ШтрихКод
	|ИЗ
	|	ВременнаяТаблицаВесовойТовар КАК ВременнаяТаблицаВесовойТовар");
	
	МассивШтрихкодов = Новый Массив;
	ТЗДанныеОВесовомТоваре = Новый ТаблицаЗначений;
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("КодВесовогоТовара", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный)));
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("ПрефиксВесовогоТовара", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200)));
	
	Для каждого ТекШтрихкод Из Штрихкоды Цикл
		
		МассивШтрихкодов.Добавить(ТекШтрихкод.ШтрихКод);

		ДанныеПоШтрихкодам.Вставить(ТекШтрихкод.ШтрихКод, Новый Массив);
		
		Если ТекШтрихкод.Свойство("КодВесовогоТовара") Тогда
			НоваяСтрокаОВесовомТоваре = ТЗДанныеОВесовомТоваре.Добавить();
			НоваяСтрокаОВесовомТоваре.КодВесовогоТовара = ТекШтрихкод.КодВесовогоТовара;
			НоваяСтрокаОВесовомТоваре.ПрефиксВесовогоТовара = ТекШтрихкод.ПрефиксВесовогоТовара;
			НоваяСтрокаОВесовомТоваре.Штрихкод = ТекШтрихкод.Штрихкод;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("МассивШтрихкодов", МассивШтрихкодов);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ВидЦеныПродажи", Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи());
	ИспользоватьСерииНоменклатуры = СерииНоменклатурыУНФ.ИспользоватьСерииНоменклатурыОстатки();
	Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
		Запрос.УстановитьПараметр("СерииНоменклатурыИспользуются", Истина);
	Иначе
	    Запрос.УстановитьПараметр("СерииНоменклатурыИспользуются", Ложь);
	КонецЕсли;
	Запрос.УстановитьПараметр("ТЗДанныеОВесовомТоваре", ТЗДанныеОВесовомТоваре);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МассивДанныхПоШтрихкоду = ДанныеПоШтрихкодам[Выборка.Штрихкод];
		
		ТекДанные = Новый Структура;
		МассивДанныхПоШтрихкоду.Добавить(ТекДанные);
		
		ТекДанные.Вставить("Номенклатура", Выборка.Номенклатура);
		ТекДанные.Вставить("Характеристика", Выборка.Характеристика);
		ТекДанные.Вставить("Партия", Выборка.Партия);
		ТекДанные.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
		ТекДанные.Вставить("КодВесовогоТовара", Выборка.КодВесовогоТовара);
		ТекДанные.Вставить("ПрефиксВесовогоТовара", Выборка.ПрефиксВесовогоТовара);
		ТекДанные.Вставить("МаркируемаяПродукция", Выборка.МаркируемаяПродукция);
		ТекДанные.Вставить("НоменклатураПоставщика", Неопределено);
		ТекДанные.Вставить("Цена", Выборка.Цена);
		
		Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
			ТекДанные.Вставить("Серия", Выборка.Серия);
		КонецЕсли;
	КонецЦикла;
	
	Выборка = МассивРезультатов[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МассивДанныхПоШтрихкоду = ДанныеПоШтрихкодам[Выборка.Штрихкод];
		
		ТекДанные = Новый Структура;
		МассивДанныхПоШтрихкоду.Добавить(ТекДанные);
		
		Если НЕ ТекДанные.Свойство("КодВесовогоТовара") Тогда
			ТекДанные.Вставить("Номенклатура", Выборка.Номенклатура);
			ТекДанные.Вставить("Характеристика", Выборка.Характеристика);
			ТекДанные.Вставить("Партия", Выборка.Партия);
			ТекДанные.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
			ТекДанные.Вставить("НоменклатураПоставщика", Неопределено);
			
			Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
				ТекДанные.Вставить("Серия", Выборка.Серия);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат ДанныеПоШтрихкодам;

КонецФункции

#КонецОбласти //ПоискПоШтрихкоду

#Область ПечатьЦенника

&НаКлиенте
Процедура ВыполнитьПечатьЦенника()
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Склад", Склад);
	ПараметрыПечати.Вставить("Номенклатура", Номенклатура);
	ПараметрыПечати.Вставить("Штрихкод", Штрихкод);
	
	ДанныеПечати = ДанныеПечатиЦенников(ПараметрыПечати);
	
	Ошибка = ДанныеПечати.Ошибка;
	
	Если ПустаяСтрока(Ошибка) Тогда
		                       
		Попытка
			УправлениеПечатьюКлиент.РаспечататьТабличныеДокументы(ДанныеПечати.ТабличныеДокументы, Новый СписокЗначений, Ложь);
		Исключение  
			
			Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			                  
		КонецПопытки;
		
	Иначе
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Ошибка печати ценников. Подробности см. в Журнале регистрации.'"));
		
		спЛогированиеСобытийИБВызовСервера.ЛогироватьСобытиеИБ("спПроверкаЦенника.ПечатьЦенника", "Ошибка",,, Ошибка);
		                                  
	КонецЕсли;
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ДанныеПечатиЦенников(Параметры, ПечатьНаОбычномПринтере = Истина)
	
	ДанныеПечати = Новый Структура("ПараметрыПечати, ТабличныеДокументы, ОбъектыПечати, Ошибка");
	
	Попытка
		
		// Проверка наличия шаблона ценника
		ШаблонЦенника = спУправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("спШаблонЦенникаПоУмолчанию");
		
		Если Не ЗначениеЗаполнено(ШаблонЦенника) Тогда
			
			ДанныеПечати.Ошибка = НСтр("ru = 'Не установлен шаблон ценника по умолчанию.'");
			Возврат ДанныеПечати;
			
		КонецЕсли; 
		// Конец проверки
		
		ТоварыДляПечати = Новый ТаблицаЗначений;
		
		Для каждого Колонка Из Метаданные.Обработки.ПечатьЭтикетокИЦенниковБПО.ТабличныеЧасти.Товары.Реквизиты Цикл
			
			Если ТоварыДляПечати.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
				ТоварыДляПечати.Колонки.Добавить(Колонка.Имя, Колонка.Тип);
			КонецЕсли;
			
		КонецЦикла;
		
		ТоварыДляПечати.Колонки.Добавить("Партия");
		ТоварыДляПечати.Колонки.Добавить("Серия");
		ТоварыДляПечати.Колонки.Добавить("ШтрихАвтопроверки");
		
		НоваяСтрока = ТоварыДляПечати.Добавить();
		НоваяСтрока.Выбран = Истина;
		НоваяСтрока.НоменклатураБПО = Параметры.Номенклатура;
		НоваяСтрока.ХарактеристикаБПО = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		НоваяСтрока.УпаковкаБПО = Параметры.Номенклатура.ЕдиницаИзмерения;
		НоваяСтрока.ОрганизацияБПО = Справочники.Организации.ПустаяСсылка();
		НоваяСтрока.Цена = 0;
		НоваяСтрока.Штрихкод = Параметры.Штрихкод;
		НоваяСтрока.ШаблонЦенникаЭтикетки = ШаблонЦенника;
		НоваяСтрока.Количество = 1;
		
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("Режим", "ПечатьЦенников");
		ПараметрыПечати.Вставить("ВидЦены", Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи());
		ПараметрыПечати.Вставить("ВидЦенАкционный", Справочники.ВидыЦен.ПустаяСсылка());
		ПараметрыПечати.Вставить("КаждаяЭтикеткаНаНовомЛисте", Ложь);
		ПараметрыПечати.Вставить("ПечатьНаОбычномПринтере", ПечатьНаОбычномПринтере);
		ПараметрыПечати.Вставить("ТорговыйОбъектБПО", Неопределено);
		
		Обработка = Обработки.ПечатьЭтикетокИЦенниковБПО.Создать();
		ЗаполнитьЗначенияСвойств(Обработка, ПараметрыПечати);
		Обработка.Товары.Загрузить(ТоварыДляПечати);
		
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ТорговыйОбъект", Параметры.Склад);
		Если ПечатьНаОбычномПринтере Тогда
			ПараметрыПечати.Вставить("Товары", ОбщегоНазначенияБПО.ТаблицаЗначенийВМассив(ТоварыДляПечати));
		Иначе
			ПараметрыПечати.Вставить("Товары", Обработка.Товары);
		КонецЕсли;
		ПараметрыПечати.Вставить("ВидЦены", Обработка.ВидЦены);
		ПараметрыПечати.Вставить("ВидЦеныАкционный", Обработка.ВидЦеныАкционный);
		ПараметрыПечати.Вставить("ЦеныНаДату", ТекущаяДатаСеанса());
		ПараметрыПечати.Вставить("КаждаяЭтикеткаНаНовомЛисте", Обработка.КаждаяЭтикеткаНаНовомЛисте);
		
		МассивОбъектов = ТоварыДляПечати.ВыгрузитьКолонку("НоменклатураБПО");
		
		КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(Новый Массив);
		
		ОбъектыПечати = Новый СписокЗначений;
		ОбъектыПечати.ЗагрузитьЗначения(МассивОбъектов);
		
		ПараметрыВывода = Новый Структура;
		
		Обработки.ПечатьЭтикетокИЦенниковБПО.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
		
		ТабличныеДокументы = Новый СписокЗначений;
		ТабличныеДокументы.ЗагрузитьЗначения(КоллекцияПечатныхФорм.ВыгрузитьКолонку("ТабличныйДокумент"));
		
		Ошибка = "";
		
	Исключение
		
		Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;

	ДанныеПечати = Новый Структура("ПараметрыПечати, ТабличныеДокументы, ОбъектыПечати, Ошибка", ПараметрыПечати, ТабличныеДокументы, ОбъектыПечати, Ошибка);
	
	Возврат ДанныеПечати;

КонецФункции

#КонецОбласти

#КонецОбласти
