
&После("ПередЗаписью")
Процедура спПередЗаписью(Отказ)
	
	//++ Tnext ivai 15.09.2025 Задача _3720_
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//-- Tnext ivai
	
	//++ Tnext ivai 09.10.2025
	//Решено вернуть доп.реквизиты и не использовать основные.
	//// ++ Tnext Михеев С.В. 11.09.2025
	//Если ЗначениеЗаполнено(спАтрибутРаздела) Тогда 
	//	
	//	ЗначениеСвойства = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Строка(спАтрибутРаздела), Истина);
	//	
	//	ДанныеРеквизита = Новый Структура;
	//	ДанныеРеквизита.Вставить("ИдентификаторДляФормул", 	"АтрибутРаздела");
	//	ДанныеРеквизита.Вставить("Значение", 			  	ЗначениеСвойства);	

	//	спОбщегоНазначения.ДобавитьДополнительныйРеквизит(ЭтотОбъект, ДанныеРеквизита);
	//	
	//КонецЕсли;
	//// -- Tnext Михеев С.В.
	//
	////++ Tnext ivai 15.09.2025 Задача _3720_
	//Если ЗначениеЗаполнено(ЭтотОбъект.спПодборка) Тогда
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	ЗначенияСвойствОбъектов.Ссылка КАК ЗначениеСвойства,
	//		|	спПодборкиНоменклатуры.Наименование КАК Наименование,
	//		|	ДополнительныеРеквизитыИСведения.Ссылка КАК Владелец
	//		|ИЗ
	//		|	Справочник.спПодборкиНоменклатуры КАК спПодборкиНоменклатуры
	//		|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	//		|		ПО ДополнительныеРеквизитыИСведения.ИдентификаторДляФормул = &ИдентификаторДляФормул
	//		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	//		|			ПО ДополнительныеРеквизитыИСведения.Ссылка = ЗначенияСвойствОбъектов.Владелец
	//		|			И спПодборкиНоменклатуры.Наименование = ЗначенияСвойствОбъектов.Наименование
	//		|ГДЕ
	//		|	спПодборкиНоменклатуры.Ссылка = &спПодборка";
	//	
	//	Запрос.УстановитьПараметр("ИдентификаторДляФормул", "спПодборка");
	//	Запрос.УстановитьПараметр("спПодборка", ЭтотОбъект.спПодборка);
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Если Выборка.Следующий() И Не Выборка.Владелец = Null Тогда
	//		Если Выборка.ЗначениеСвойства = Null Тогда
	//			СпрОбъект = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
	//			ЗаполнитьЗначенияСвойств(СпрОбъект, Выборка);
	//			СпрОбъект.Записать();
	//			ЗначениеСвойства = СпрОбъект.Ссылка;
	//		Иначе
	//			ЗначениеСвойства = Выборка.ЗначениеСвойства;
	//		КонецЕсли;
	//		
	//		мСтр = ЭтотОбъект.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", Выборка.Владелец));
	//		Если мСтр.Количество() > 0 Тогда
	//			мСтр[0].Значение = ЗначениеСвойства;
	//		Иначе
	//			НовСтр = ЭтотОбъект.ДополнительныеРеквизиты.Добавить();
	//			НовСтр.Свойство = Выборка.Владелец;
	//			НовСтр.Значение = ЗначениеСвойства;
	//		КонецЕсли;
	//	КонецЕсли;
	//Иначе
	//	Запрос = Новый Запрос;
	//	Запрос.Текст = 
	//		"ВЫБРАТЬ
	//		|	ДопРеквизиты.НомерСтроки КАК НомерСтроки,
	//		|	ДопРеквизиты.Свойство КАК Свойство
	//		|ПОМЕСТИТЬ ВТДопСвойства
	//		|ИЗ
	//		|	&ДопРеквизиты КАК ДопРеквизиты
	//		|;
	//		|
	//		|////////////////////////////////////////////////////////////////////////////////
	//		|ВЫБРАТЬ
	//		|	ВТДопСвойства.НомерСтроки КАК НомерСтроки
	//		|ИЗ
	//		|	ВТДопСвойства КАК ВТДопСвойства
	//		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК ДополнительныеРеквизитыИСведения
	//		|		ПО ВТДопСвойства.Свойство = ДополнительныеРеквизитыИСведения.Ссылка
	//		|ГДЕ
	//		|	ДополнительныеРеквизитыИСведения.ИдентификаторДляФормул = &ИдентификаторДляФормул";
	//	
	//	Запрос.УстановитьПараметр("ДопРеквизиты", ЭтотОбъект.ДополнительныеРеквизиты.Выгрузить());
	//	Запрос.УстановитьПараметр("ИдентификаторДляФормул", "спПодборка");
	//	
	//	РезультатЗапроса = Запрос.Выполнить();
	//	
	//	кУдалению = Новый Массив;
	//	
	//	Выборка = РезультатЗапроса.Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		кУдалению.Добавить(ЭтотОбъект.ДополнительныеРеквизиты[Выборка.НомерСтроки - 1]);
	//	КонецЦикла;
	//	
	//	Для каждого Стр Из кУдалению Цикл
	//		ЭтотОбъект.ДополнительныеРеквизиты.Удалить(Стр);
	//	КонецЦикла;
	//КонецЕсли;
	////-- Tnext ivai
	//-- Tnext ivai
	
КонецПроцедуры

