
#Область ПрограммныйИнтерфейс

// Выполняется при запуске приложения после завершения действий ПриНачалеРаботыСистемы.
// Используется для подключения обработчиков ожидания, которые не должны вызываться
// перед и при начале работы системы.
//
// Начальная страница (рабочий стол) в этот момент еще не открыта, поэтому запрещено открывать
// формы напрямую, а следует использовать для этих целей обработчик ожидания.
// Запрещено использовать это событие для интерактивного взаимодействия с пользователем
// (ПоказатьВопрос и аналогичные действия). Для этих целей следует размещать код в процедуре ПриНачалеРаботыСистемы.
//
&После("ПослеНачалаРаботыСистемы")
Процедура спПослеНачалаРаботыСистемы() Экспорт
	
	//<<<--- Tnext Козык К.А. 01.07.2026
	Если спЭтоПользовательАРМСклад() Тогда
		ПодключитьОбработчикОжидания("спОткрытьАРМРаботникаСкладаПриНачалеРаботы", 1, Истина);
		Возврат;
	КонецЕсли;
//--->>> Tnext Козык К.А. 01.07.2026
		
	ПараметрыРаботыКлиента = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	// ++ Разумов А.А. 27.08.2025  TNEXT  Обновление перенесено из ОбщегоНазначенияКлиентПереопределяемый, теперь там нет
	//Если НачалоРаботыСПрограммойКлиент.ПоказатьОкноНачалоРаботыСПрограммой(ПараметрыРаботыКлиента) Тогда
	//	Возврат;
	//КонецЕсли;
	Если спПоказатьОкноНачалоРаботыСПрограммой(ПараметрыРаботыКлиента) Тогда
		Возврат;
	КонецЕсли;
// -- Разумов А.А. 27.08.2025  TNEXT 
		
	Если Не ПараметрыРаботыКлиента.ДоступноИспользованиеРазделенныхДанных Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("спОповещениеОЗаказахНаПеремещение", 60, Ложь);
                                  
КонецПроцедуры
// ++ Разумов А.А. 27.08.2025  TNEXT  Обновление перенесено из ОбщегоНазначенияКлиентПереопределяемый, теперь там нет
// Показать окно начало работы с программой при начале работы системы
//
// Параметры:
//  ПараметрыРаботыКлиента - См. СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске
// 
// Возвращаемое значение:
//  Булево - значение параметра "ПоказатьОкноНачалоРаботыСПрограммой"
//
Функция спПоказатьОкноНачалоРаботыСПрограммой(ПараметрыРаботыКлиента) Экспорт
	
	Если Не ПараметрыРаботыКлиента.Свойство("ПоказатьОкноНачалоРаботыСПрограммой") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыРаботыКлиента.ПоказатьОкноНачалоРаботыСПрограммой) <> Тип("Булево") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ПараметрыРаботыКлиента.ПоказатьОкноНачалоРаботыСПрограммой;
	
КонецФункции
// -- Разумов А.А. 27.08.2025  TNEXT 
   
#КонецОбласти


//<<<--- Tnext Козык К.А. 01.07.2026
Функция спЭтоПользовательАРМСклад() Экспорт
	
	Возврат НРег(СокрЛП(ИмяПользователя())) = НРег("АРМСклад");
	
КонецФункции
//--->>> Tnext Козык К.А. 01.07.2026