#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗавершениеРаботы Тогда
		СохранитьНастройкиЭДО(Ложь);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДокументПриИзменении(Элемент)
	
	ДокументПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	ОпределитьСписокВыбораДоговора();
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	ОпределитьСписокВыбораДоговора();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

 &НаКлиенте
Процедура ОтправитьЭДО(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьНастройкиЭДО(Истина);
	
	ОписаниеКоманды = Новый Структура;
	ОписаниеКоманды.Вставить("ДополнительныеПараметры", Новый Структура);
	ОписаниеКоманды.Вставить("Идентификатор", "СформироватьПодписатьОтправитьЭД");
	ОписаниеКоманды.Вставить("ИмяКомандыНаФорме", "ФормаКоманднаяПанельКомандыЭДОСформироватьПодписатьОтправитьЭД1");
	ОписаниеКоманды.Вставить("МестоРазмещения", "КомандыЭДОВажное");
	ОписаниеКоманды.Вставить("НеВыполнятьЗаписьВФорме", Ложь);
	ОписаниеКоманды.Вставить("Недоступна", Ложь);
	ОписаниеКоманды.Вставить("Обработчик", "ЭлектронныеДокументыЭДОКлиент.СформироватьПодписатьОтправитьЭД");
	ОписаниеКоманды.Вставить("Отключена", Ложь);
	ОписаниеКоманды.Вставить("Отображение", ОтображениеКнопки.Текст);
	ОписаниеКоманды.Вставить("Порядок", 20);
	ОписаниеКоманды.Вставить("Представление", "Отправить электронный документ");
	ОписаниеКоманды.Вставить("РежимИспользованияПараметра", РежимИспользованияПараметраКоманды.Множественный);
	ОписаниеКоманды.Вставить("СкрытаФункциональнымиОпциями", Ложь);
	ОписаниеКоманды.Вставить("СписокФорм", "");
	ОписаниеКоманды.Вставить("ТолькоВоВсехДействиях", Ложь);
	ОписаниеКоманды.Вставить("УникальныйИдентификатор", "");
	ОписаниеКоманды.Вставить("УправлениеВидимостью", Новый Структура);
	ОписаниеКоманды.Вставить("ФункциональныеОпции", "");
	// { Разумов А.А. (TNEXT) 29.08.2025 Задача № 3950 Передача документов на склад Простор
	ОписаниеКоманды.Вставить("Оповещение", "");
	// } Разумов А.А. (TNEXT) 29.08.2025 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОписаниеКоманды", ОписаниеКоманды);
	ДополнительныеПараметры.Вставить("Форма", ЭтотОбъект);
	ДополнительныеПараметры.Вставить("Источник", Новый Структура("Ссылка", Документ));
	
	ПодключаемыеКомандыЭДОСлужебныйКлиент.ВыполнитьПодключаемуюКомандуЭДОПодтверждениеЗаписи(
		Неопределено, ДополнительныеПараметры);
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройкиЭДО(ЭтоОбработка)
	
	Номер = ?(ЗначениеЗаполнено(Документ), Документ.Номер, 0);
	Номер = ПрефиксацияОбъектовКлиентСервер.УдалитьПрефиксыИзНомераОбъекта(Номер, Истина, Истина);
	Номер = ПрефиксацияОбъектовКлиентСервер.УдалитьЛидирующиеНулиИзНомераОбъекта(Номер);
	
	Дата = ?(ЗначениеЗаполнено(Документ), Документ.Дата, ТекущаяДатаСеанса()); 
	
	ПредставлениеАдреса = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, 
			Справочники.ВидыКонтактнойИнформации.АдресДоставкиКонтрагента, Дата, Истина); 
	
	Настройки = Новый Структура;
	Настройки.Вставить("Организация", 			Организация);
	Настройки.Вставить("Контрагент", 			Контрагент);
	Настройки.Вставить("ДоговорКонтрагента", 	Договор);              
	Настройки.Вставить("НомерДокумента", 		Номер); 
	Настройки.Вставить("АдресДоставки", 		ПредставлениеАдреса);
	Настройки.Вставить("ЭтоОбработка", 			ЭтоОбработка);
	Настройки.Вставить("ВалютаДокумента", 		Валюта);
	
	КлючОбъекта = "Обработка.Т_ОтправкаПриходнойНакладнойЭДО";
    ОбщегоНазначения.ХранилищеОбщихНастроекСохранить(КлючОбъекта, КлючОбъекта, Настройки,, ИмяПользователя());

КонецПроцедуры

&НаСервере
Процедура ОпределитьСписокВыбораДоговора()
	
	МассивПараметров = Новый Массив;
	
	Если ЗначениеЗаполнено(Организация) Тогда
		
		ДобавитьСвязьПараметраВыбора(МассивПараметров, "Организация"); 
		
	КонецЕсли;

	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		ДобавитьСвязьПараметраВыбора(МассивПараметров, "Владелец", "Контрагент"); 
		
	КонецЕсли;

    Если ЗначениеЗаполнено(Валюта) Тогда
		
		ДобавитьСвязьПараметраВыбора(МассивПараметров, "ВалютаРасчетов", "Валюта"); 
		
	КонецЕсли;
	
	Элементы.Договор.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивПараметров);
	
КонецПроцедуры
 
&НаСервере
Процедура ДобавитьСвязьПараметраВыбора(МассивПараметров, ИмяПараметра, ИмяРеквизита = "")
	
	Если ИмяРеквизита = "" Тогда
		ИмяРеквизита = ИмяПараметра;
	КонецЕсли;

	Отбор = СтрШаблон(НСтр("ru='Отбор.%1'"), ИмяПараметра);
	Связь = СтрШаблон(НСтр("ru='%1'"), ИмяРеквизита);
	
	НоваяСвязь = Новый СвязьПараметраВыбора(Отбор, Связь);
	МассивПараметров.Добавить(НоваяСвязь);
	
КонецПроцедуры   

&НаСервере
Процедура ДокументПриИзмененииНаСервере()
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		Валюта = УправлениеНебольшойФирмойПовтИсп.ПолучитьВалютуУчета();
	Иначе
		Валюта = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ВалютаДокумента");
	КонецЕсли;
	
	//ДокументОбъект = Документ.ПолучитьОбъект();
	//ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ПроверитьМаркировку(Документ)
	
	Если Документ.ШтрихкодыУпаковок.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МИНИМУМ(ПриходнаяНакладнаяШтрихкодыУпаковок.ШтрихкодУпаковки = НЕОПРЕДЕЛЕНО) КАК КодНесопоставлен,
		|	ПриходнаяНакладнаяШтрихкодыУпаковок.ЗначениеШтрихкода КАК КодМаркировки
		|ПОМЕСТИТЬ ВТ_НеСопоставленныеКоды
		|ИЗ
		|	Документ.ПриходнаяНакладная.ШтрихкодыУпаковок КАК ПриходнаяНакладнаяШтрихкодыУпаковок
		|ГДЕ
		|	ПриходнаяНакладнаяШтрихкодыУпаковок.Ссылка = &Документ
		|
		|СГРУППИРОВАТЬ ПО
		|	ПриходнаяНакладнаяШтрихкодыУпаковок.ЗначениеШтрихкода
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НеСопоставленныеКоды.КодМаркировки КАК КодМаркировки
		|ИЗ
		|	ВТ_НеСопоставленныеКоды КАК ВТ_НеСопоставленныеКоды
		|ГДЕ
		|	ВТ_НеСопоставленныеКоды.КодНесопоставлен";
	
	Запрос.УстановитьПараметр("Документ", Документ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Истина;
	Иначе 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
		КонецЦикла;
	
		Возврат Ложь; 
		
	КонецЕсли;

КонецФункции

#КонецОбласти
