
// ++ Терлецкий АВ 25.02.25 // 
&НаСервере
Процедура спПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// {  Иванов С.С. (TNext) - 09.04.2025
	// если это так реализовано создание на основании, то переделать.
	// }
	Если Параметры.Свойство("ЗначениеЗаполнения") Тогда 
		Объект.СтруктурнаяЕдиницаРезерв = Параметры.ЗначениеЗаполнения.СтруктурнаяЕдиница;
		Если ЗначениеЗаполнено(Параметры.ЗначениеЗаполнения.Заказ) Тогда 
			Объект.ЗаказПокупателя =  Параметры.ЗначениеЗаполнения.Заказ.ЗаказПокупателя;
		КонецЕсли;
		Для каждого СтрокаЗапасы Из Параметры.ЗначениеЗаполнения.Запасы Цикл
		       СтрокаОбъектЗапасы = Объект.Запасы.Добавить();
			   ЗаполнитьЗначенияСвойств(СтрокаОбъектЗапасы, СтрокаЗапасы); 
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
// -- Терлецкий АВ 25.02.25