#Область ОписаниеПеременных

&НаКлиенте
Перем МассивОтсканированныхШтрихкодов; // используется для хранения отсканированных штрихкодов на мобильном устройстве

&НаКлиенте
Перем ПечатьЦенниковЗапущена; // признак ожидания печати 

&НаКлиенте
Перем МассивОшибокПриПечати; // используется для хранения сообщений об ошибках 

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьЦветаТаблицы();
	
	ПеремещениеЗапасов = Параметры.Основание;
	ВидОперации = Параметры.Основание.ВидОперации;
	Организация = Параметры.Основание.Организация;
	
	ЗаполнитьШтрихкодыПоДаннымИБ();
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ТипыОборудования.СканерШтрихкода = Истина;
		МенеджерОборудования.ПриСозданииНаСервере(ЭтотОбъект, ТипыОборудования);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	КоманднаяПанель.ПодчиненныеЭлементы.ПоменюПечать.Видимость = Не ОбщегоНазначения.ЭтоМобильныйКлиент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
	ПечатьЦенниковЗапущена = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда  
			
			Если ТипЗнч(Параметр) <> Тип("Массив") Тогда
				Параметр = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметр);
			КонецЕсли;
			
			Данные = МенеджерОборудованияУНФКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			ПолученыШтрихкоды(Данные); 
			
		КонецЕсли;  
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
	Если Не ЗавершениеРаботы Тогда
		СохранитьДанныеПриемки();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.Товары.ТекущиеДанные;
	
	ЗаписатьИзмененияСтрокиСПечатью(ДанныеСтроки,, Ложь)	
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВПеремещение(Команда)
	
	ПеренестиСразу = Истина;
	
	Для Каждого Строка Из Товары Цикл
		
		Если Не Строка.КПоступлению = Строка.Количество Тогда
			
			Режим = РежимДиалогаВопрос.ДаНет;
			Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);
			ПоказатьВопрос(Оповещение, НСтр("ru = 'Найдены расхождения между столбцами К поступлению и Количество. Создать Акт о расхождениях?'"), Режим);
			ПеренестиСразу = Ложь;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПеренестиСразу Тогда
		ПеренестиВПеремещениеНаСервере();
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	МаркерПодбора = "Товары";
	
	ПоискПоШтрихкодуНачало();
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЦенников(Команда)
	
	ЗапуститьПечатьЦенников(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПечатьЦенников(Команда)
	
	ПечатьЦенниковЗапущена = Истина;            
	
	ПослеЗакрытияФормыОжидания = Новый ОписаниеОповещения("ПослеЗакрытияФормыОжидания", ЭтотОбъект);
	ОткрытьФорму("Обработка.спПриемкаТоваровПриПеремещенииЗапасов.Форма.ОжиданиеПечатиЦенников",, ЭтотОбъект,,,, ПослеЗакрытияФормыОжидания);
	ПодключитьОбработчикОжидания("ПечатьЦенниковОбработчикОжидания", 1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьНовыхЦенников(Команда)
	
	ЗапуститьПечатьЦенников(Ложь);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьШтрихкодыПоДаннымИБ()
	
	ТоварыИБ = ТоварыИБ();
	Товары.Загрузить(ТоварыИБ);
	
КонецПроцедуры 

&НаСервере
Функция ТоварыИБ()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПеремещениеЗапасовЗапасы.Ссылка КАК Ссылка,
	|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	ПеремещениеЗапасовЗапасы.Характеристика КАК Характеристика,
	|	ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПеремещениеЗапасовЗапасы.Количество КАК КПоступлению
	|ПОМЕСТИТЬ ВТ_ЗапасыДокумента
	|ИЗ
	|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
	|ГДЕ
	|	ПеремещениеЗапасовЗапасы.Ссылка = &Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	спОтсканированныеШтрихкоды.Объект КАК Объект,
	|	спОтсканированныеШтрихкоды.Номенклатура КАК Номенклатура,
	|	спОтсканированныеШтрихкоды.Характеристика КАК Характеристика,
	|	спОтсканированныеШтрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	спОтсканированныеШтрихкоды.Штрихкод КАК Штрихкод,
	|	спОтсканированныеШтрихкоды.Количество КАК Количество,
	|	спОтсканированныеШтрихкоды.ДатаСканирования КАК ДатаСканирования,
	|	спОтсканированныеШтрихкоды.Пользователь КАК Пользователь,
	|	спОтсканированныеШтрихкоды.РабочееМесто КАК РабочееМесто,
	|	спОтсканированныеШтрихкоды.Напечатан КАК Напечатан
	|ПОМЕСТИТЬ ВТ_ОтсканированныеШтрихкоды
	|ИЗ
	|	РегистрСведений.спОтсканированныеШтрихкоды КАК спОтсканированныеШтрихкоды
	|ГДЕ
	|	спОтсканированныеШтрихкоды.Объект = &Объект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ОтсканированныеШтрихкоды.Номенклатура, ВТ_ЗапасыДокумента.Номенклатура) КАК Номенклатура,
	|	ЕСТЬNULL(ВТ_ОтсканированныеШтрихкоды.Характеристика, ВТ_ЗапасыДокумента.Характеристика) КАК Характеристика,
	|	ЕСТЬNULL(ВТ_ОтсканированныеШтрихкоды.ЕдиницаИзмерения, ВТ_ЗапасыДокумента.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(ВТ_ОтсканированныеШтрихкоды.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(ВТ_ЗапасыДокумента.КПоступлению, 0) КАК КПоступлению
	|ИЗ
	|	ВТ_ЗапасыДокумента КАК ВТ_ЗапасыДокумента
	|		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ОтсканированныеШтрихкоды КАК ВТ_ОтсканированныеШтрихкоды
	|		ПО ВТ_ЗапасыДокумента.Ссылка = ВТ_ОтсканированныеШтрихкоды.Объект
	|			И ВТ_ЗапасыДокумента.Номенклатура = ВТ_ОтсканированныеШтрихкоды.Номенклатура
	|			И ВТ_ЗапасыДокумента.Характеристика = ВТ_ОтсканированныеШтрихкоды.Характеристика
	|			И ВТ_ЗапасыДокумента.ЕдиницаИзмерения = ВТ_ОтсканированныеШтрихкоды.ЕдиницаИзмерения";
	
	Запрос.УстановитьПараметр("Объект", ПеремещениеЗапасов);
	
	ТоварыИБ = Запрос.Выполнить().Выгрузить(); 
	
	Возврат ТоварыИБ;
	
КонецФункции

&НаСервере
Процедура ОбновитьЦветаТаблицы()
	
	МассивИменКолонокДляПодсветки = Новый Массив;	
	МассивИменКолонокДляПодсветки.Добавить("ТоварыНоменклатура");	
	МассивИменКолонокДляПодсветки.Добавить("ТоварыХарактеристика");
	МассивИменКолонокДляПодсветки.Добавить("ТоварыКоличество");
	МассивИменКолонокДляПодсветки.Добавить("ТоварыЕдиницаИзмерения");
	МассивИменКолонокДляПодсветки.Добавить("ТоварыКПоступлению");
	
	ЦветОформление = УсловноеОформление.Элементы.Добавить();
	ЦветОформление.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Роса);
	
	ЭлементОформления = ЦветОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОформления.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.КПоступлению");
	ЭлементОформления.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОформления.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Количество");
	ЭлементОформления.Использование  = Истина;
	
	Для каждого ТекЭлемент из МассивИменКолонокДляПодсветки Цикл
		ЦветПоле = ЦветОформление.Поля.Элементы.Добавить();
		ЦветПоле.Поле = Новый ПолеКомпоновкиДанных(ТекЭлемент);		
	КонецЦикла;
	
	ЦветОформление = УсловноеОформление.Элементы.Добавить();
	ЦветОформление.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лимонный);
	
	ЭлементОформления = ЦветОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОформления.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.КПоступлению");
	ЭлементОформления.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОформления.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Количество");
	ЭлементОформления.Использование  = Истина;
	
	Для каждого ТекЭлемент из МассивИменКолонокДляПодсветки Цикл
		ЦветПоле = ЦветОформление.Поля.Элементы.Добавить();
		ЦветПоле.Поле = Новый ПолеКомпоновкиДанных(ТекЭлемент);		
	КонецЦикла;
	
	ЦветОформление = УсловноеОформление.Элементы.Добавить();
	ЦветОформление.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Персиковый);
	
	ЭлементОформления = ЦветОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОформления.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Товары.КПоступлению");
	ЭлементОформления.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОформления.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Товары.Количество");
	ЭлементОформления.Использование  = Истина;
	
	Для каждого ТекЭлемент из МассивИменКолонокДляПодсветки Цикл
		ЦветПоле = ЦветОформление.Поля.Элементы.Добавить();
		ЦветПоле.Поле = Новый ПолеКомпоновкиДанных(ТекЭлемент);		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуНачало()
	
	ТекШтрихкод = "";
	
	#Если МобильныйКлиент Тогда
		
		Если СредстваМультимедиа.ПоддерживаетсяСканированиеШтрихКодов() Тогда       
			МассивОтсканированныхШтрихкодов = Новый Массив;
			ОбработчикСканирования = Новый ОписаниеОповещения("ЗаписатьШтрихкод", ЭтотОбъект);
			ОбработкаЗавершения = Новый ОписаниеОповещения("ОбработатьШтрихкоды", ЭтотОбъект);
			СредстваМультимедиа.ПоказатьСканированиеШтрихКодов(НСтр("ru='Отсканируйте штрихкод'"), ОбработчикСканирования, ОбработкаЗавершения);
		Иначе
			Предупреждение(НСтр("ru='На этом устройстве сканирование штрихкодов с камеры не поддерживаются.'"));
		КонецЕсли;
		
	#Иначе
		
		ОбработкаЗавершения = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект,
		Новый Структура("ТекШтрихкод", ТекШтрихкод));
		ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьШтрихкод(Штрихкод, Результат, Сообщение = "", ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Результат Тогда 
		МассивОтсканированныхШтрихкодов.Добавить(Новый Структура("Штрихкод, Количество", Штрихкод, 1));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШтрихкоды(ДополнительныеПараметры) Экспорт
	
	#Если МобильныйКлиент Тогда
		СредстваМультимедиа.ЗакрытьСканированиеШтрихКодов();
		Если ТипЗнч(МассивОтсканированныхШтрихкодов) = Тип("Массив") И МассивОтсканированныхШтрихкодов.Количество() > 0 Тогда
			ПолученыШтрихкоды(МассивОтсканированныхШтрихкодов);
		КонецЕсли;
		МассивОтсканированныхШтрихкодов = Новый Массив;
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрихкодов)
	
	ИмяТабличнойЧасти = "Товары";
	
	НеизвестныеШтрихкоды = Новый Массив;
	ШтрихкодыНекорректногоТипа = Новый Массив;
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли;
	
	СтруктураДанные = Новый Структура();
	СтруктураДанные.Вставить("ВидОперации", ВидОперации);
	СтруктураДанные.Вставить("МассивШтрихкодов", МассивШтрихкодов);
	СтруктураДанные.Вставить("Организация", Организация);
	ПолучитьДанныеПоШтрихКодам(СтруктураДанные);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		ДанныеШтрихкода = СтруктураДанные.ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если ДанныеШтрихкода.Количество() > 1 Тогда
			
			ПараметрыОткрытия = Новый Структура("МассивНоменклатуры, ТекШтрихкод", ДанныеШтрихкода, ТекШтрихкод);
			ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПоДаннымШтрихкодовЗавершение", ЭтотОбъект,
			Новый Структура("СтруктураДанные, ИмяТабличнойЧасти", СтруктураДанные, ИмяТабличнойЧасти));
			
			ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.Форма.ДублиНоменклатурыПоШтрихКодам",
			ПараметрыОткрытия, ЭтотОбъект, , , , ОповещениеОЗакрытии,
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
			Продолжить;
		КонецЕсли;
		
		Если ДанныеШтрихкода <> Неопределено И ДанныеШтрихкода.Количество() = 0 Тогда
			НеизвестныеШтрихкоды.Добавить(ТекШтрихкод);
		ИначеЕсли СтруктураДанные.ОтборТипНоменклатуры.Найти(ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ТипНоменклатуры) = Неопределено 
			ИЛИ ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ЭтоНабор Тогда
			ОписаниеШтрихкода = Новый Структура;
			ОписаниеШтрихкода.Вставить("Штрихкод", ТекШтрихкод.Штрихкод);
			ОписаниеШтрихкода.Вставить("Номенклатура", ДанныеШтрихкода[0].Номенклатура);
			ОписаниеШтрихкода.Вставить("ТипНоменклатуры",
			ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ТипНоменклатуры);
			ОписаниеШтрихкода.Вставить("ЭтоНабор", ДанныеШтрихкода[0].СтруктураДанныеНоменклатуры.ЭтоНабор);
			ШтрихкодыНекорректногоТипа.Добавить(ОписаниеШтрихкода);
		Иначе
			
			ДанныеШтрихкода = ДанныеШтрихкода[0];
			
			ПараметрыОтбора = Новый Структура;
			ПараметрыОтбора.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
			ПараметрыОтбора.Вставить("Характеристика", ДанныеШтрихкода.Характеристика);
			ПараметрыОтбора.Вставить("ЕдиницаИзмерения", ДанныеШтрихкода.ЕдиницаИзмерения);
			
			МассивСтрокТЧ = Товары.НайтиСтроки(ПараметрыОтбора);
			
			Если МассивСтрокТЧ.Количество() = 0 Тогда
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = ДанныеШтрихкода.Номенклатура;
				НоваяСтрока.Характеристика = ДанныеШтрихкода.Характеристика;
				НоваяСтрока.Количество = ТекШтрихкод.Количество;
				НоваяСтрока.ЕдиницаИзмерения = ?(ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения),
				ДанныеШтрихкода.ЕдиницаИзмерения, ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЕдиницаИзмерения);
			Иначе
				НоваяСтрока = МассивСтрокТЧ[0];
				НоваяСтрока.Количество = НоваяСтрока.Количество + ТекШтрихкод.Количество;
			КонецЕсли;
			
			Элементы[ИмяТабличнойЧасти].ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
			
			// {  Иванов С.С. (TNext) - 03.02.2025
			// Записываем отсканированный штрихкод
			ЗаписатьИзмененияСтрокиСПечатью(НоваяСтрока, ТекШтрихкод, Истина);
			// }	
			
			Если ИмяТабличнойЧасти = "Товары" И ДанныеШтрихкода.Свойство("Серия") И ЗначениеЗаполнено(ДанныеШтрихкода.Серия) Тогда
				СерииНоменклатурыУНФКлиентСервер.ДобавитьСерияВСтроку(НоваяСтрока, ДанныеШтрихкода.Серия, Объект);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Результат = Новый Структура("НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа", НеизвестныеШтрихкоды,
	ШтрихкодыНекорректногоТипа);
	
	Возврат Результат;
	
КонецФункции  

&НаСервереБезКонтекста
Процедура ПолучитьДанныеПоШтрихКодам(СтруктураДанные)
	
	// Преобразование весовых штрихкодов.
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		РегистрыСведений.ШтрихкодыНоменклатуры.ПреобразоватьВесовойШтрихкод(ТекШтрихкод);
		
	КонецЦикла;
	
	ДанныеПоШтрихКодам = РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодамВМассиве(
	СтруктураДанные.МассивШтрихкодов);
	
	Для каждого ТекШтрихкод Из СтруктураДанные.МассивШтрихкодов Цикл
		
		МассивДанныхШтрихкода = ДанныеПоШтрихкодам[ТекШтрихкод.Штрихкод];
		
		Если МассивДанныхШтрихкода <> Неопределено
			И МассивДанныхШтрихкода.Количество() <> 0 Тогда
			
			Для Каждого ДанныеШтрихкода Из МассивДанныхШтрихкода Цикл 
				
				СтруктураДанныеНоменклатуры = Новый Структура;
				СтруктураДанныеНоменклатуры.Вставить("ВидОперации", СтруктураДанные.ВидОперации);
				СтруктураДанныеНоменклатуры.Вставить("Номенклатура", ДанныеШтрихкода.Номенклатура);
				СтруктураДанныеНоменклатуры.Вставить("Организация", СтруктураДанные.Организация);
				ДанныеШтрихкода.Вставить("СтруктураДанныеНоменклатуры", ПолучитьДанныеНоменклатураПриИзменении(
				СтруктураДанныеНоменклатуры));
				
				Если НЕ ЗначениеЗаполнено(ДанныеШтрихкода.ЕдиницаИзмерения) Тогда
					ДанныеШтрихкода.ЕдиницаИзмерения  = ДанныеШтрихкода.СтруктураДанныеНоменклатуры.ЕдиницаИзмерения;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли; 
		
	КонецЦикла;
	
	СтруктураДанные.Вставить("ДанныеПоШтрихКодам", ДанныеПоШтрихКодам);
	
	НоменклатураПараметрыВыбора = Метаданные.Документы.ПеремещениеЗапасов.ТабличныеЧасти.Запасы.Реквизиты.Номенклатура.ПараметрыВыбора;
	Для Каждого ПараметрВыбора Из НоменклатураПараметрыВыбора Цикл
		Если ПараметрВыбора.Имя = "Отбор.ТипНоменклатуры" Тогда
			Если ТипЗнч(ПараметрВыбора.Значение) = Тип("ФиксированныйМассив") Тогда
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", ПараметрВыбора.Значение);
			Иначе
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(ПараметрВыбора.Значение);
				СтруктураДанные.Вставить("ОтборТипНоменклатуры", МассивТипов);
			КонецЕсли;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПолучитьДанныеПоШтрихКодам()

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные)
	
	Реквизиты = Новый Массив;
	Реквизиты.Добавить("ЕдиницаИзмерения");
	Реквизиты.Добавить("СтранаПроисхождения");
	Реквизиты.Добавить("СчетУчетаЗатрат");
	Реквизиты.Добавить("ЭтоНабор");
	Реквизиты.Добавить("ИспользоватьХарактеристики");
	Реквизиты.Добавить("ПроверятьЗаполнениеХарактеристики");
	Реквизиты.Добавить("ИспользоватьПартии");
	Реквизиты.Добавить("ПроверятьЗаполнениеПартий");
	Реквизиты.Добавить("ИспользоватьСерииНоменклатуры");
	Реквизиты.Добавить("ПрослеживаемыйТовар");
	Реквизиты.Добавить("ПрослеживаемыйКомплект");
	Реквизиты.Добавить("ТипНоменклатуры");
	Реквизиты.Добавить("Вес");
	Реквизиты.Добавить("Объем");
	Реквизиты.Добавить("ЗапретитьВводДробногоКоличества");
	ЗначенияРеквизитовНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанные.Номенклатура, Реквизиты);
	
	СтруктураДанные.Вставить("ЕдиницаИзмерения", ЗначенияРеквизитовНоменклатуры.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("СтранаПроисхождения", ЗначенияРеквизитовНоменклатуры.СтранаПроисхождения);
	ТипСчетаЗатрат = Перечисления.ТипыСчетов.ПустаяСсылка();
	Если ЗначениеЗаполнено(ЗначенияРеквизитовНоменклатуры.СчетУчетаЗатрат) Тогда
		ТипСчетаЗатрат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЗначенияРеквизитовНоменклатуры.СчетУчетаЗатрат,
		"ТипСчета");
	КонецЕсли;
	
	СтруктураДанные.Вставить("ТипСчетаЗатрат", ТипСчетаЗатрат);
	СтруктураДанные.Вставить("НомерГТД", Неопределено);
	
	// Наборы
	СтруктураДанные.Вставить("ЭтоНабор", ЗначенияРеквизитовНоменклатуры.ЭтоНабор);
	
	// Характеристики
	СтруктураДанные.Вставить("ИспользоватьХарактеристики", Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики", Ложь);
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) Тогда
		СтруктураДанные.ИспользоватьХарактеристики = ЗначенияРеквизитовНоменклатуры.ИспользоватьХарактеристики;
		СтруктураДанные.ПроверятьЗаполнениеХарактеристики = ЗначенияРеквизитовНоменклатуры.ПроверятьЗаполнениеХарактеристики;
	КонецЕсли;
	
	Если СтруктураДанные.ИспользоватьХарактеристики Тогда
		ЗначенияПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияНоменклатурыПоУмолчанию(
		СтруктураДанные.Номенклатура);
		
		Если Не ЗначенияПоУмолчанию = Неопределено Тогда
			ХарактеристикаПоУмолчанию = ЗначенияПоУмолчанию;
		КонецЕсли;
		
		Если Не СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика", ХарактеристикаПоУмолчанию);
		Иначе
			СтруктураДанные.Характеристика = ?(ЗначениеЗаполнено(СтруктураДанные.Характеристика),
			СтруктураДанные.Характеристика, ХарактеристикаПоУмолчанию);
		КонецЕсли;
		
	КонецЕсли; 
	// Конец Характеристики
	
	//Партии
	СтруктураДанные.Вставить("ИспользоватьПартии", Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеПартий", Ложь);
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура) Тогда
		СтруктураДанные.ИспользоватьПартии = ЗначенияРеквизитовНоменклатуры.ИспользоватьПартии;
		СтруктураДанные.ПроверятьЗаполнениеПартий = ЗначенияРеквизитовНоменклатуры.ПроверятьЗаполнениеПартий;
	КонецЕсли;
	
	Если НЕ СтруктураДанные.Свойство("Партия") Тогда
		СтруктураДанные.Вставить("Партия", Неопределено);
	КонецЕсли;
	
	Если СтруктураДанные.ИспользоватьПартии Тогда
		
		Если СтруктураДанные.Свойство("СтатусПартии")
			Тогда
			ЗначенияПартииПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияПартийНоменклатурыПоУмолчанию(
			СтруктураДанные.Номенклатура, СтруктураДанные.СтатусПартии);
		Иначе
			Если Не СтруктураДанные.Свойство("ВидОперации")
				Тогда
				ВидОперации = Неопределено
			Иначе
				ВидОперации = СтруктураДанные.ВидОперации
			КонецЕсли;
			
			СтатусПартии = НоменклатураВДокументахСервер.СоответствиеВидаОперацииИлиХозОперацииСтатусуПартии( ,
			ВидОперации);
			ЗначенияПартииПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияПартийНоменклатурыПоУмолчанию(
			СтруктураДанные.Номенклатура, СтатусПартии);
		КонецЕсли;
		
		ПартияПоУмолчанию = Справочники.ПартииНоменклатуры.ПустаяСсылка();
		
		Если Не ЗначенияПартииПоУмолчанию = Неопределено
			Тогда
			ПартияПоУмолчанию = ЗначенияПартииПоУмолчанию;
		КонецЕсли;
		
		СтруктураДанные.Партия = ?(ЗначениеЗаполнено(СтруктураДанные.Партия), СтруктураДанные.Партия, ПартияПоУмолчанию);
		
	КонецЕсли;
	// Конец Партии
	
	Если ЗначениеЗаполнено(СтруктураДанные.Номенклатура)
		И ЗначенияРеквизитовНоменклатуры.ИспользоватьСерииНоменклатуры Тогда
		
		СтатусПодбораСерий = СерииНоменклатурыУНФ.СтатусСерийНоменклатурыПриИзменении(СтруктураДанные);
		
		Если СтатусПодбораСерий = 0 И СтруктураДанные.Свойство("ПараметрыПодбораСтатуса") Тогда
			СтруктураДанные.ПараметрыПодбораСтатуса.СтруктурнаяЕдиница = СтруктураДанные.ПараметрыПодбораСтатуса.СтруктурнаяЕдиницаПолучатель;
			СтатусПодбораСерий = СерииНоменклатурыУНФ.СтатусСерийНоменклатурыПриИзменении(СтруктураДанные);
		КонецЕсли;
		
		СтруктураДанные.Вставить("СтатусыСерийНоменклатуры", СтатусПодбораСерий);
		
	Иначе
		СтруктураДанные.Вставить("СтатусыСерийНоменклатуры", 0);
	КонецЕсли;
	
	Если СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.СписаниеНаРасходы
		ИЛИ СтруктураДанные.ВидОперации = Перечисления.ВидыОперацийПеремещениеЗапасов.ВозвратИзЭксплуатации Тогда
		
		ГрузовыеТаможенныеДекларацииСервер.АвтоматическийПодборВРеализацииНомераГТД(СтруктураДанные);
		
	КонецЕсли;
	
	СтруктураДанные.Вставить("ТипНоменклатуры", ЗначенияРеквизитовНоменклатуры.ТипНоменклатуры);
	
	// Прослеживаемость
	ЭтоПрослеживаемыйТовар = Ложь;
	Если ТипЗнч(ЗначенияРеквизитовНоменклатуры.ПрослеживаемыйТовар) = Тип("Булево") Тогда
		ЭтоПрослеживаемыйТовар = ЗначенияРеквизитовНоменклатуры.ПрослеживаемыйТовар;
	КонецЕсли;
	СтруктураДанные.Вставить("ПрослеживаемыйТовар", ЭтоПрослеживаемыйТовар
	И ЗначенияРеквизитовНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
	ЭтоПрослеживаемыйКомплект = Ложь;
	Если ТипЗнч(ЗначенияРеквизитовНоменклатуры.ПрослеживаемыйКомплект) = Тип("Булево") Тогда
		ЭтоПрослеживаемыйКомплект = ЗначенияРеквизитовНоменклатуры.ПрослеживаемыйКомплект;
	КонецЕсли;
	СтруктураДанные.Вставить("ПрослеживаемыйКомплект", ЭтоПрослеживаемыйКомплект
	И ЗначенияРеквизитовНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас);
	Если СтруктураДанные.ПрослеживаемыйТовар 
		И ПолучитьФункциональнуюОпцию("ВестиУчетПрослеживаемыхТоваров") Тогда
		СтруктураДанные.Вставить("НомерГТД", Неопределено);
	КонецЕсли; 
	// Конец Прослеживаемость
	
	СтруктураДанные.Вставить("ВесЕдиницыТовара", ЗначенияРеквизитовНоменклатуры.Вес);
	СтруктураДанные.Вставить("ОбъемЕдиницыТовара", ЗначенияРеквизитовНоменклатуры.Объем);
	
	СтруктураДанные.Вставить("ЗапретитьВводДробногоКоличества",
	ЗначенияРеквизитовНоменклатуры.ЗапретитьВводДробногоКоличества);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Результат = Неопределено, СокрЛП(ДополнительныеПараметры.ТекШтрихкод), СокрЛП(Результат));
	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
		ПолученыШтрихкоды(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1));
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкоды(ДанныеШтрихкодов) Экспорт
	
	Модифицированность = Истина;
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли; 
	Для Каждого ТекШтрихкод Из МассивШтрихкодов Цикл
		ДополнительныеДанныеПоШтрихкоду = ШтрихкодированиеУНФКлиент.ДополнительныеДанныеПоШтрихкоду(ТекШтрихкод.Штрихкод, ТипЗнч(ПеремещениеЗапасов));
		Если ДополнительныеДанныеПоШтрихкоду.ЭтоКодМаркировки Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(ДополнительныеДанныеПоШтрихкоду.ТекстСообщения);
			Возврат;
		КонецЕсли; 
		Если ДополнительныеДанныеПоШтрихкоду.ЕстьРазделительGS1 Тогда 
			ТекШтрихкод.Штрихкод = ДополнительныеДанныеПоШтрихкоду.ПредставлениеШтрихкода;		
		КонецЕсли;
	КонецЦикла;
	
	НеДобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрихкодов);
	НеизвестныеШтрихкоды		= НеДобавленныеШтрихкоды.НеизвестныеШтрихкоды;
	ШтрихкодыНекорректногоТипа	= НеДобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
	
	ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	
	Если НеизвестныеШтрихкоды.Количество() > 0 Тогда
		
		Форма = ПолучитьФорму("Документ.ПеремещениеЗапасов.Форма.ФормаДокумента", Новый Структура("Ключ", ПеремещениеЗапасов));
		Оповещение = Новый ОписаниеОповещения("ПолученыШтрихкодыЗавершение", Форма, НеизвестныеШтрихкоды);
		
		ПараметрыФормы = Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды);
		ОткрытьФорму("РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры", ПараметрыФормы,
		ЭтотОбъект, , , , Оповещение);
		
		Возврат;
		
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыЗавершение(ВозвращаемыеПараметры, Параметры) Экспорт
	
	НеизвестныеШтрихкоды = Параметры;
	
	Если ВозвращаемыеПараметры <> Неопределено Тогда
		
		МассивШтрихкодов = Новый Массив;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ЗарегистрированныеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ПолученыНовыеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		НеДобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(МассивШтрихкодов);
		НеизвестныеШтрихкоды		= НеДобавленныеШтрихкоды.НеизвестныеШтрихкоды;
		ШтрихкодыНекорректногоТипа	= НеДобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
		ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа) Экспорт
	
	Для каждого ТекНекорректныйШтрихкод Из ШтрихкодыНекорректногоТипа Цикл
		
		СтрокаСообщения = НСтр("ru = 'Найденная по штрихкоду %1% номенклатура -%2%- имеет тип %3%, который не подходит для этой табличной части'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНекорректныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНекорректныйШтрихкод.Номенклатура);
		Если ТекНекорректныйШтрихкод.Свойство("ЭтоНабор") И ТекНекорректныйШтрихкод.ЭтоНабор Тогда
			// Наборы
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3%", НСтр("ru = 'Набор'"));
		Иначе
			СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%3%", ТекНекорректныйШтрихкод.ТипНоменклатуры);
		КонецЕсли; 
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды) Экспорт
	
	Для каждого ТекНеизвестныйШтрихкод Из НеизвестныеШтрихкоды Цикл
		
		СтрокаСообщения = НСтр("ru = 'Данные по штрихкоду не найдены: %1%; количество: %2%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНеизвестныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНеизвестныйШтрихкод.Количество);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиВПеремещениеНаСервере()
	
	Перемещение = ПеремещениеЗапасов.ПолучитьОбъект();
	Перемещение.Запасы.Очистить();
	
	Для Каждого Строка Из ТоварыИБ() Цикл
		
		Если Не Строка.Количество = 0 И Не Строка.КПоступлению = 0 Тогда
			
			НоваяСтрока = Перемещение.Запасы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка); 
			НоваяСтрока.Количество = Мин(Строка.Количество, Строка.КПоступлению);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Перемещение.Записать(РежимЗаписиДокумента.Проведение);
	ПеремещениеЗапасов = Перемещение.Ссылка;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПослеЗакрытияВопроса(РезультатВопроса, ПараметрыЗаписи) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		
		ПеренестиВПеремещениеНаСервере();
		
		СсылкаНаДокумент = СоздатьАктНаСервере();
		ПоказатьЗначение(,СсылкаНаДокумент);
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СоздатьАктНаСервере()
	
	НовыйДокумент = Документы.спАктОРасхожденияхПриПеремещении.СоздатьДокумент();
	НовыйДокумент.ЗаказНаПеремещение = ПеремещениеЗапасов.ЗаказНаПеремещение;
	НовыйДокумент.ПеремещениеЗапасов = ПеремещениеЗапасов;	
	НовыйДокумент.Дата = ТекущаяДатаСеанса();	
	ИтогоИзлишек = 0;
	ИтогоНедостача= 0;
	
	Для Каждого Строка Из ТоварыИБ() Цикл
		
		Если Не Строка.Количество = Строка.КПоступлению Тогда
			
			НоваяСтрока = НовыйДокумент.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			НоваяСтрока.КоличествоПлан = Строка.КПоступлению;
			НоваяСтрока.КоличествоФакт = Строка.Количество;
			
			Если Строка.КПоступлению - Строка.Количество > 0 Тогда  
				
				НоваяСтрока.Недостача = Строка.КПоступлению - Строка.Количество;
				ИтогоНедостача = ИтогоНедостача + Строка.КПоступлению - Строка.Количество;
				
			Иначе
				
				НоваяСтрока.Излишек = Строка.Количество - Строка.КПоступлению;
				ИтогоИзлишек = ИтогоИзлишек + Строка.Количество - Строка.КПоступлению;
				
			КонецЕсли;	
			
		КонецЕсли;	
		
	КонецЦикла;	
	
	НовыйДокумент.ИтогоИзлишек = ИтогоИзлишек;
	НовыйДокумент.ИтогоНедостача = ИтогоНедостача;
	НовыйДокумент.Записать();
	
	Возврат НовыйДокумент.Ссылка; 
	
КонецФункции

#Область ПечатьЦенников

&НаКлиенте
Процедура ЗаписатьИзмененияСтрокиСПечатью(ДанныеСтроки, ДанныеШтрихкода = Неопределено, ПечататьСразу = Ложь)

	// {  Иванов С.С. (TNext) - 03.02.2025
	// Записываем отсканированный штрихкод
	ПараметрЗаписи = Новый Структура;
	ПараметрЗаписи.Вставить("Объект", ПеремещениеЗапасов);
	ПараметрЗаписи.Вставить("Номенклатура", ДанныеСтроки.Номенклатура);
	ПараметрЗаписи.Вставить("Характеристика", ДанныеСтроки.Характеристика);
	ПараметрЗаписи.Вставить("ЕдиницаИзмерения", ДанныеСтроки.ЕдиницаИзмерения);
	
	#Если ВебКлиент Тогда
        ПараметрЗаписи.Вставить("РабочееМесто", "Веб-клиент");
	#Иначе
		ПараметрЗаписи.Вставить("РабочееМесто", ИмяКомпьютера());
	#КонецЕсли
	
	Если ДанныеШтрихкода <> Неопределено Тогда
		ПараметрЗаписи.Вставить("Штрихкод", ДанныеШтрихкода.Штрихкод);
		ПараметрЗаписи.Вставить("КоличествоЦенников", ДанныеШтрихкода.Количество); 
	КонецЕсли;
	
	ПараметрЗаписи.Вставить("Количество", ДанныеСтроки.Количество);
	ПараметрЗаписи.Вставить("ДатаСканирования", ОбщегоНазначенияКлиент.ДатаСеанса());
	ПараметрЗаписи.Вставить("Напечатан", Ложь);
	
	// Отправка на печать ценника 
	#Если Не МобильныйКлиент Тогда 
		Если ДанныеШтрихкода <> Неопределено И ПечататьСразу Тогда
			ЦенаУстановлена = ЦенаУстановлена(ПараметрЗаписи);
			ПараметрЗаписи.Вставить("Напечатан", ЦенаУстановлена);
			Если ЦенаУстановлена Тогда
				ВыполнитьПечатьЦенников(ПараметрЗаписи); 
			КонецЕсли; 
		КонецЕсли;
	#КонецЕсли 
	
	Если ТипЗнч(ПараметрЗаписи) <> Тип("Массив") Тогда
		ПараметрЗаписи = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрЗаписи);
	КонецЕсли;
	
	ЗаписатьОтсканированныеШтрихкоды(ПараметрЗаписи);
	// }
			
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПечатьЦенников(ПараметрыПечати)
	
	Если ТипЗнч(ПараметрыПечати) <> Тип("Массив") Тогда
		ПараметрыПечати = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ПараметрыПечати);
	КонецЕсли;
		
	Если ПараметрыПечати.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеПечати = ДанныеПечатиЦенников(ПеремещениеЗапасов, ПараметрыПечати);
	
	Ошибка = ДанныеПечати.Ошибка;
	
	Если ПустаяСтрока(Ошибка) Тогда
		                       
		Попытка
			УправлениеПечатьюКлиент.РаспечататьТабличныеДокументы(ДанныеПечати.ТабличныеДокументы, Новый СписокЗначений, ПараметрыПечати.Количество() > 1);
		Исключение  
			
			Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			                  
		КонецПопытки;
		
	КонецЕсли; 
	
	Если Не ПустаяСтрока(Ошибка) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Ошибка печати ценников. Подробности см. в Журнале регистрации.'"));
		
		спЛогированиеСобытийИБВызовСервера.ЛогироватьСобытиеИБ("спПриемкаТоваровПриПеремещенииЗапасов.ПечатьЦенников", "Ошибка",,, Ошибка);
		                                  
		Для каждого Строка Из ПараметрыПечати Цикл
			
			Строка.Напечатан = Ложь;
			
		КонецЦикла;
			
	КонецЕсли;
	
КонецПроцедуры  

&НаСервереБезКонтекста
Функция ДанныеПечатиЦенников(ПеремещениеЗапасов, Строки, ПечатьНаОбычномПринтере = Истина)
	
	ДанныеПечати = Новый Структура("ПараметрыПечати, ТабличныеДокументы, ОбъектыПечати, Ошибка");
	
	Попытка
		
		// Проверка наличия шаблона ценника
		ШаблонЦенника = спУправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("спШаблонЦенникаПоУмолчанию");
		
		Если Не ЗначениеЗаполнено(ШаблонЦенника) Тогда
			
			ДанныеПечати.Ошибка = НСтр("ru = 'Не установлен шаблон ценника по умолчанию.'");
			Возврат ДанныеПечати;
			
		КонецЕсли; 
		// Конец проверки
		
		ТоварыДляПечати = Новый ТаблицаЗначений;
		
		Для каждого Колонка Из Метаданные.Обработки.ПечатьЭтикетокИЦенниковБПО.ТабличныеЧасти.Товары.Реквизиты Цикл
			
			Если ТоварыДляПечати.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
				ТоварыДляПечати.Колонки.Добавить(Колонка.Имя, Колонка.Тип);
			КонецЕсли;
			
		КонецЦикла;
		
		ТоварыДляПечати.Колонки.Добавить("Партия");
		ТоварыДляПечати.Колонки.Добавить("Серия");
		ТоварыДляПечати.Колонки.Добавить("ШтрихАвтопроверки");
		
		НаборЗаписей = РегистрыСведений.спОтсканированныеШтрихкоды.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Объект.Установить(ПеремещениеЗапасов);
		НаборЗаписей.Прочитать();
		
		Для каждого Строка Из Строки Цикл
			
			НоваяСтрока = ТоварыДляПечати.Добавить();
			НоваяСтрока.Выбран = Истина;
			НоваяСтрока.НоменклатураБПО = Строка.Номенклатура;
			НоваяСтрока.ХарактеристикаБПО = Строка.Характеристика;
			НоваяСтрока.УпаковкаБПО = Строка.ЕдиницаИзмерения;
			НоваяСтрока.ОрганизацияБПО = Справочники.Организации.ПустаяСсылка();
			НоваяСтрока.Цена = 0;
			НоваяСтрока.Штрихкод = Строка.Штрихкод;
			НоваяСтрока.ШаблонЦенникаЭтикетки = ШаблонЦенника;
			НоваяСтрока.Количество = Строка.КоличествоЦенников;
			
		КонецЦикла;
		
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("Режим", "ПечатьЦенников");
		ПараметрыПечати.Вставить("ВидЦены", Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи());
		ПараметрыПечати.Вставить("ВидЦенАкционный", Справочники.ВидыЦен.ПустаяСсылка());
		ПараметрыПечати.Вставить("КаждаяЭтикеткаНаНовомЛисте", Ложь);
		ПараметрыПечати.Вставить("ПечатьНаОбычномПринтере", ПечатьНаОбычномПринтере);
		ПараметрыПечати.Вставить("ТорговыйОбъектБПО", Неопределено);
		
		Обработка = Обработки.ПечатьЭтикетокИЦенниковБПО.Создать();
		ЗаполнитьЗначенияСвойств(Обработка, ПараметрыПечати);
		Обработка.Товары.Загрузить(ТоварыДляПечати);
		
		ПараметрыПечати = Новый Структура;
		ПараметрыПечати.Вставить("ТорговыйОбъект", ПеремещениеЗапасов.СтруктурнаяЕдиница);
		Если ПечатьНаОбычномПринтере Тогда
			ПараметрыПечати.Вставить("Товары", ОбщегоНазначенияБПО.ТаблицаЗначенийВМассив(ТоварыДляПечати));
		Иначе
			ПараметрыПечати.Вставить("Товары", Обработка.Товары);
		КонецЕсли;
		ПараметрыПечати.Вставить("ВидЦены", Обработка.ВидЦены);
		ПараметрыПечати.Вставить("ВидЦеныАкционный", Обработка.ВидЦеныАкционный);
		ПараметрыПечати.Вставить("ЦеныНаДату", ТекущаяДатаСеанса());
		ПараметрыПечати.Вставить("КаждаяЭтикеткаНаНовомЛисте", Обработка.КаждаяЭтикеткаНаНовомЛисте);
		
		МассивОбъектов = ТоварыДляПечати.ВыгрузитьКолонку("НоменклатураБПО");
		
		КоллекцияПечатныхФорм = УправлениеПечатью.ПодготовитьКоллекциюПечатныхФорм(Новый Массив);
		
		ОбъектыПечати = Новый СписокЗначений;
		ОбъектыПечати.ЗагрузитьЗначения(МассивОбъектов);
		
		ПараметрыВывода = Новый Структура;
		
		Обработки.ПечатьЭтикетокИЦенниковБПО.Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);
		
		ТабличныеДокументы = Новый СписокЗначений;
		ТабличныеДокументы.ЗагрузитьЗначения(КоллекцияПечатныхФорм.ВыгрузитьКолонку("ТабличныйДокумент"));
		
		Ошибка = "";
		
	Исключение
		
		Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		
	КонецПопытки;

	ДанныеПечати = Новый Структура("ПараметрыПечати, ТабличныеДокументы, ОбъектыПечати, Ошибка", ПараметрыПечати, ТабличныеДокументы, ОбъектыПечати, Ошибка);
	
	Возврат ДанныеПечати;

КонецФункции

&НаСервере
Процедура СохранитьДанныеПриемки()
	
	ТаблицаТоваров = Товары.Выгрузить();
	ТаблицаТоваров.Колонки.Добавить("Объект");
	ТаблицаТоваров.ЗаполнитьЗначения(ПеремещениеЗапасов, "Объект");
	
	ВсеСтроки			= ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТоваров);
	Фильтр 				= Новый Структура("Количество", 0); 
	СтрокиНеПринятые	= ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаТоваров.Скопировать(Фильтр));
	ПринятыеСтроки		= ОбщегоНазначенияКлиентСервер.РазностьМассивов(ВсеСтроки, СтрокиНеПринятые);
	
	ЗаписатьОтсканированныеШтрихкоды(ПринятыеСтроки);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьОтсканированныеШтрихкоды(ПараметрыЗаписи)
	
	// {  Иванов С.С. (TNext) - 03.02.2025
	УстановитьПривилегированныйРежим(Истина);
	
	Для каждого ПараметрЗаписи Из ПараметрыЗаписи Цикл
		
		МенеджерЗаписи = РегистрыСведений.спОтсканированныеШтрихкоды.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрЗаписи, "Объект, Номенклатура, Характеристика, ЕдиницаИзмерения");
		МенеджерЗаписи.Прочитать();
		
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрЗаписи, "Объект, Номенклатура, Характеристика, ЕдиницаИзмерения");
		
		МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
		
		РеквизитыСтрокой = "Штрихкод, Количество, ДатаСканирования, РабочееМесто, Напечатан";
		
		Реквизиты = СтрРазделить(РеквизитыСтрокой, ", ", Ложь);
		
		Для Каждого Реквизит Из Реквизиты Цикл
			
			Если ПараметрЗаписи.Свойство(Реквизит) И ЗначениеЗаполнено(ПараметрЗаписи[Реквизит]) Тогда
				МенеджерЗаписи[Реквизит] = ПараметрЗаписи[Реквизит];
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(МенеджерЗаписи.Штрихкод) Тогда
			МенеджерЗаписи.Записать();   
		КонецЕсли;
		
	КонецЦикла;
	// }	
				
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыОжидания(Результат, ДополнительныеПараметры) Экспорт
	
	ПечатьЦенниковЗапущена = Ложь;
	
	Если МассивОшибокПриПечати.Количество() > 0 Тогда
		
		ТекстОшибки = СтрСоединить(МассивОшибокПриПечати, Символы.ПС);
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
		
		спЛогированиеСобытийИБВызовСервера.ЛогироватьСобытиеИБ("спПриемкаТоваровПриПеремещенииЗапасов.ПечатьЦенников", "Ошибка",,, ТекстОшибки);
		
		МассивОшибокПриПечати = Новый Массив;
		
	КонецЕсли;
	
	ОтключитьОбработчикОжидания("ПечатьЦенниковОбработчикОжидания");
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЦенниковОбработчикОжидания()
	
	ЗапуститьПечатьЦенников(Ложь);
	
	ЗаполнитьШтрихкодыПоДаннымИБ();
	
	Если ПечатьЦенниковЗапущена Тогда
		ПодключитьОбработчикОжидания("ПечатьЦенниковОбработчикОжидания", 1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтсканированныеШтрихкоды(ПеремещениеЗапасов, ПечатьЦенниковЗапущена, МассивОшибок = Неопределено, ПечататьВсе = Ложь)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	
	#Область ТекстЗапроса
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	спОтсканированныеШтрихкоды.Объект КАК Объект,
		|	спОтсканированныеШтрихкоды.Номенклатура КАК Номенклатура,
		|	спОтсканированныеШтрихкоды.Характеристика КАК Характеристика,
		|	спОтсканированныеШтрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	спОтсканированныеШтрихкоды.Штрихкод КАК Штрихкод,
		|	СУММА(спОтсканированныеШтрихкоды.Количество) КАК Количество,
		|	спОтсканированныеШтрихкоды.ДатаСканирования КАК ДатаСканирования,
		|	спОтсканированныеШтрихкоды.Пользователь КАК Пользователь,
		|	спОтсканированныеШтрихкоды.РабочееМесто КАК РабочееМесто,
		|	ИСТИНА КАК Напечатан
		|ПОМЕСТИТЬ ВТ_ДанныеШтрихкодов
		|ИЗ
		|	РегистрСведений.спОтсканированныеШтрихкоды КАК спОтсканированныеШтрихкоды
		|ГДЕ
		|	спОтсканированныеШтрихкоды.Объект = &Объект
		|	И НЕ(НЕ &ПечататьВсе
		|				И спОтсканированныеШтрихкоды.Напечатан)
		|
		|СГРУППИРОВАТЬ ПО
		|	спОтсканированныеШтрихкоды.ЕдиницаИзмерения,
		|	спОтсканированныеШтрихкоды.Характеристика,
		|	спОтсканированныеШтрихкоды.Номенклатура,
		|	спОтсканированныеШтрихкоды.Объект,
		|	спОтсканированныеШтрихкоды.Штрихкод,
		|	спОтсканированныеШтрихкоды.ДатаСканирования,
		|	спОтсканированныеШтрихкоды.Пользователь,
		|	спОтсканированныеШтрихкоды.РабочееМесто
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК Характеристика,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ПОМЕСТИТЬ ВТ_РозничныеЦены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ТекущаяДата,
		|			ВидЦен = &ВидЦенПродажи
		|				И (Номенклатура, Характеристика) В
		|					(ВЫБРАТЬ
		|						ВТ_ДанныеШтрихкодов.Номенклатура КАК Номенклатура,
		|						ВТ_ДанныеШтрихкодов.Характеристика КАК Характеристика
		|					ИЗ
		|						ВТ_ДанныеШтрихкодов КАК ВТ_ДанныеШтрихкодов)) КАК ЦеныНоменклатурыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеШтрихкодов.Объект КАК Объект,
		|	ВТ_ДанныеШтрихкодов.Номенклатура КАК Номенклатура,
		|	ВТ_ДанныеШтрихкодов.Характеристика КАК Характеристика,
		|	ВТ_ДанныеШтрихкодов.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_ДанныеШтрихкодов.Штрихкод КАК Штрихкод,
		|	ВТ_ДанныеШтрихкодов.Количество КАК Количество,
		|	ВТ_ДанныеШтрихкодов.ДатаСканирования КАК ДатаСканирования,
		|	ВТ_ДанныеШтрихкодов.Пользователь КАК Пользователь,
		|	ВТ_ДанныеШтрихкодов.РабочееМесто КАК РабочееМесто,
		|	ВТ_ДанныеШтрихкодов.Напечатан КАК Напечатан,
		|	ЕСТЬNULL(ВТ_РозничныеЦены.Цена, 0) КАК РозничнаяЦена
		|ПОМЕСТИТЬ ВТ_ДанныеШтрихкодовСЦенами
		|ИЗ
		|	ВТ_ДанныеШтрихкодов КАК ВТ_ДанныеШтрихкодов
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РозничныеЦены КАК ВТ_РозничныеЦены
		|		ПО ВТ_ДанныеШтрихкодов.Номенклатура = ВТ_РозничныеЦены.Номенклатура
		|			И ВТ_ДанныеШтрихкодов.Характеристика = ВТ_РозничныеЦены.Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеШтрихкодовСЦенами.Объект КАК Объект,
		|	ВТ_ДанныеШтрихкодовСЦенами.Номенклатура.Представление КАК Номенклатура,
		|	ВТ_ДанныеШтрихкодовСЦенами.Номенклатура.Артикул КАК Артикул,
		|	ВТ_ДанныеШтрихкодовСЦенами.Характеристика.Представление КАК Характеристика,
		|	ВТ_ДанныеШтрихкодовСЦенами.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_ДанныеШтрихкодовСЦенами.Штрихкод КАК Штрихкод,
		|	ВТ_ДанныеШтрихкодовСЦенами.Количество КАК Количество,
		|	ВТ_ДанныеШтрихкодовСЦенами.ДатаСканирования КАК ДатаСканирования,
		|	ВТ_ДанныеШтрихкодовСЦенами.Пользователь КАК Пользователь,
		|	ВТ_ДанныеШтрихкодовСЦенами.РабочееМесто КАК РабочееМесто,
		|	ЛОЖЬ КАК Напечатан,
		|	ВТ_ДанныеШтрихкодовСЦенами.Номенклатура КАК НоменклатураСсылка,
		|	ВТ_ДанныеШтрихкодовСЦенами.Характеристика КАК ХарактеристикаСсылка
		|ИЗ
		|	ВТ_ДанныеШтрихкодовСЦенами КАК ВТ_ДанныеШтрихкодовСЦенами
		|ГДЕ
		|	ВТ_ДанныеШтрихкодовСЦенами.РозничнаяЦена = 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеШтрихкодовСЦенами.Объект КАК Объект,
		|	ВТ_ДанныеШтрихкодовСЦенами.Номенклатура КАК Номенклатура,
		|	ВТ_ДанныеШтрихкодовСЦенами.Характеристика КАК Характеристика,
		|	ВТ_ДанныеШтрихкодовСЦенами.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ВТ_ДанныеШтрихкодовСЦенами.Штрихкод КАК Штрихкод,
		|	ВТ_ДанныеШтрихкодовСЦенами.Количество КАК Количество,
		|	ВТ_ДанныеШтрихкодовСЦенами.Количество КАК КоличествоЦенников,
		|	ВТ_ДанныеШтрихкодовСЦенами.ДатаСканирования КАК ДатаСканирования,
		|	ВТ_ДанныеШтрихкодовСЦенами.Пользователь КАК Пользователь,
		|	ВТ_ДанныеШтрихкодовСЦенами.РабочееМесто КАК РабочееМесто,
		|	ВТ_ДанныеШтрихкодовСЦенами.Напечатан КАК Напечатан,
		|	ВТ_ДанныеШтрихкодовСЦенами.РозничнаяЦена КАК РозничнаяЦена
		|ИЗ
		|	ВТ_ДанныеШтрихкодовСЦенами КАК ВТ_ДанныеШтрихкодовСЦенами
		|ГДЕ
		|	ВТ_ДанныеШтрихкодовСЦенами.РозничнаяЦена <> 0";
	#КонецОбласти
	
	Запрос.УстановитьПараметр("Объект", ПеремещениеЗапасов);
	Запрос.УстановитьПараметр("ПечататьВсе", ПечататьВсе);  
	ВидЦенПродажи = Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи(); 
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("ВидЦенПродажи", ВидЦенПродажи);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ШтрихкодыБезЦеныПродажи = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1];
	
	Если Не ШтрихкодыБезЦеныПродажи.Пустой() Тогда
		
		ВыборкаБезЦены = ШтрихкодыБезЦеныПродажи.Выбрать();
		
		НаименованиеВидаЦенПродажи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидЦенПродажи, "Наименование");
		
		Пока ВыборкаБезЦены.Следующий() Цикл
			
			СообщитьОбОшибкеЦены(ВыборкаБезЦены, НаименованиеВидаЦенПродажи, ПечатьЦенниковЗапущена, МассивОшибок);
			 
		КонецЦикла;
		
	КонецЕсли;
	
	ОтсканированныеШтрихкоды = РезультатыЗапроса[РезультатыЗапроса.ВГраница()].Выгрузить();
	
	МассивСтрок = ОбщегоНазначения.ТаблицаЗначенийВМассив(ОтсканированныеШтрихкоды);
	
	Возврат МассивСтрок;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СообщитьОбОшибкеЦены(ДанныеСтроки, НаименованиеВидаЦенПродажи, ПечатьЦенниковЗапущена = Ложь, МассивОшибок = Неопределено)
	
	Шаблон = НСтр("ru = 'Ценник товара %1, %2, %3 не распечатан, так как цена ""%4"" не установлена.'");
	
	ТекстОшибки = СтрШаблон(Шаблон, ДанныеСтроки.Номенклатура, ДанныеСтроки.Артикул, ДанныеСтроки.Характеристика, НаименованиеВидаЦенПродажи);
	
	Если ПечатьЦенниковЗапущена Тогда
		
		Если МассивОшибок = Неопределено Тогда
			МассивОшибок = Новый Массив;
		КонецЕсли;
		
		Если МассивОшибок.Найти(ТекстОшибки) = Неопределено Тогда
			МассивОшибок.Добавить(ТекстОшибки);
		КонецЕсли;
		
	Иначе
		
		ОбщегоНазначения.СообщитьПользователю(ТекстОшибки, ДанныеСтроки.НоменклатураСсылка);
		
		спЛогированиеСобытийИБ.ЛогироватьСобытиеИБ("спПриемкаТоваровПриПеремещенииЗапасов.ПечатьЦенников", "Ошибка",,, ТекстОшибки);
		
	КонецЕсли;

КонецПроцедуры     

&НаСервереБезКонтекста
Функция ЦенаУстановлена(Знач ПараметрыЗаписи)
	
	ВидЦенПродажи = Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи(); 
	НаименованиеВидаЦенПродажи = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидЦенПродажи, "Наименование");
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК НоменклатураСсылка,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика КАК ХарактеристикаССылка,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Артикул КАК Артикул,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура.Представление КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Характеристика.Представление КАК Характеристика
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ТекущаяДата,
		|			ВидЦен = &ВидЦен
		|				И Номенклатура = &Номенклатура
		|				И Характеристика = &Характеристика) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("ВидЦен", ВидЦенПродажи);
	Запрос.УстановитьПараметр("Номенклатура", ПараметрыЗаписи.Номенклатура);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Характеристика", ПараметрыЗаписи.Характеристика);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ПараметрыЗаписи.Вставить("НоменклатураСсылка", ПараметрыЗаписи.Номенклатура);
		ПараметрыЗаписи.Вставить("Артикул", ПараметрыЗаписи.Номенклатура.Артикул);
		СообщитьОбОшибкеЦены(ПараметрыЗаписи, НаименованиеВидаЦенПродажи);
		Возврат Ложь;
	Иначе               
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ЗапуститьПечатьЦенников(ПечататьВсе = Ложь)
	
	Если МассивОшибокПриПечати = Неопределено Тогда
		МассивОшибокПриПечати = Новый Массив;
	КонецЕсли;
	
	Строки = ОтсканированныеШтрихкоды(ПеремещениеЗапасов, ПечатьЦенниковЗапущена, МассивОшибокПриПечати, ПечататьВсе);
	
	ВыполнитьПечатьЦенников(Строки);
	
	ЗаписатьОтсканированныеШтрихкоды(Строки);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти