
&После("ВыполнитьПереопределяемуюКомандуИС")
Процедура спВыполнитьПереопределяемуюКомандуИС(Форма, Команда, ДополнительныеПараметры) Экспорт
	
	спВыполнитьПереопределяемуюКомандуИСПриемкаТоваров(Форма, Команда, ДополнительныеПараметры);
	
КонецПроцедуры

// Выполняет переопределяемую команду
//
// Параметры:
//  Форма                   - УправляемаяФорма - форма, в которой расположена команда
//  Команда                 - КомандаФормы     - команда формы
//  ДополнительныеПараметры - Структура        - дополнительные параметры.
//
Процедура спВыполнитьПереопределяемуюКомандуИСПриемкаТоваров(Форма, Команда, ДополнительныеПараметры) 
	
	//#Удаление
	//ВыполнитьПринудительно = Ложь;
	//ВидыПродукцииПереданы  = Ложь;
	//ВидПродукцииИС = Неопределено;
	//Если ТипЗнч(ДополнительныеПараметры) = Тип("Структура") Тогда
	//	Если ДополнительныеПараметры.Свойство("ВыполнитьПринудительно") Тогда
	//		ВыполнитьПринудительно = ДополнительныеПараметры.ВыполнитьПринудительно
	//			И Форма.ИмяФормы = "Документ.спПриемкаТовара.Форма.ФормаДокумента";
	//	КонецЕсли;
	//	Если ДополнительныеПараметры.Свойство("ВидыПродукции") Тогда
	//		ВидыПродукцииПереданы = ДополнительныеПараметры.ВидыПродукции.Количество() <> 0;
	//	КонецЕсли;
	//	ДополнительныеПараметры.Свойство("ВидПродукцииИС", ВидПродукцииИС);
	//КонецЕсли;
	//#КонецУдаления
	
	Если Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокумента_РМК"
		Или Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокумента"
		Или Форма.ИмяФормы = "Документ.ЧекККМВозврат.Форма.ФормаДокумента"
		//#Удаление
		//Или ВыполнитьПринудительно
		//#КонецУдаления
		Тогда
		
		//#Удаление
		//Если ВыполнитьПринудительно И ВидыПродукцииПереданы Тогда
		//	ДобавленныеВидыПродукции = Новый СписокЗначений;
		//	ДобавленныеВидыПродукции.ЗагрузитьЗначения(ДополнительныеПараметры.ВидыПродукции);
		//ИначеЕсли ЗначениеЗаполнено(ВидПродукцииИС) Тогда
		//	ДобавленныеВидыПродукции = Новый СписокЗначений;
		//	ДобавленныеВидыПродукции.Добавить(ВидПродукцииИС);
		//ИначеЕсли Форма.Объект.Запасы.Количество() И НЕ ВыполнитьПринудительно Тогда
		//	ДобавленныеВидыПродукции = ИнтеграцияИСУНФВызовСервера.ВидыПродукцииВЗапасах(Форма.Объект.Запасы);
		//Иначе
		//	ДобавленныеВидыПродукции = Новый СписокЗначений;
		//КонецЕсли;
		//
		//АлкогольнаяПродукция = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Алкогольная");
		//
		//Если ДобавленныеВидыПродукции.Количество() = 0 Тогда
		//	Если Форма.ПараметрыИнтеграцииГосИС.Получить("ЕГАИС")<>Неопределено Тогда
		//		ДобавленныеВидыПродукции.Добавить(АлкогольнаяПродукция);
		//	КонецЕсли;
		//	Если Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП")<>Неопределено Тогда
		//		Для Каждого ВидПродукции Из Форма.ПараметрыИнтеграцииГосИС.Получить("ИСМП").ВидыПродукции Цикл
		//			ДобавленныеВидыПродукции.Добавить(ВидПродукции);
		//		КонецЦикла;
		//	КонецЕсли;
		//КонецЕсли;
		//
		//Если ДобавленныеВидыПродукции.Количество() = 1 Тогда
		//	
		//	ВидПродукции = ДобавленныеВидыПродукции[0].Значение;
		//	Если ВидПродукции = АлкогольнаяПродукция Тогда
		//		Команда = Новый Структура("Имя", "ПроверитьАкцизныеМаркиЕГАИС");
		//	Иначе
		//		Команда = Новый Структура("Имя", 
		//			СтрШаблон("ПроверитьАкцизныеМаркиГосИС%1",
		//				ОбщегоНазначенияИСКлиентСервер.ИндексВидаПродукцииИС(ВидПродукции)));
		//	КонецЕсли;
		//	
		//Иначе
		//	
		//	Команда = Новый Структура("Имя", "");
		//	
		//	Если ДобавленныеВидыПродукции.Количество() Тогда
		//		
		//		СписокВыбора = Новый СписокЗначений;
		//		
		//		Если ДобавленныеВидыПродукции.НайтиПоЗначению(АлкогольнаяПродукция) <> Неопределено Тогда
		//			СписокВыбора.Добавить(АлкогольнаяПродукция, НСтр("ru = 'Алкогольная продукция'"));
		//		КонецЕсли;
		//		
		//		Для Каждого ВидПродукцииИС Из ОбщегоНазначенияИСКлиентСервер.ВидыПродукцииИСМП(Истина) Цикл
		//			Если ДобавленныеВидыПродукции.НайтиПоЗначению(ВидПродукцииИС) <> Неопределено Тогда
		//				СписокВыбора.Добавить(ВидПродукцииИС, "" + ВидПродукцииИС);
		//			КонецЕсли;
		//		КонецЦикла;
		//		
		//		ПараметрыФормы = Новый Структура("СписокВыбора", СписокВыбора);
		//		
		//		ДополнительныеПараметры = Новый Структура("Форма", Форма);
		//		ОповещениеОВыборе = Новый ОписаниеОповещения("ОбработатьВыборФормыСканирования", ИнтеграцияИСУНФКлиент, ДополнительныеПараметры);
		//		ОткрытьФорму("ОбщаяФорма.ФормаВыбораВидовПродукцииГосИС",
		//			ПараметрыФормы,
		//			Форма,,,,
		//			ОповещениеОВыборе,
		//			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		//		
		//	КонецЕсли;
		//	
		//КонецЕсли;
		//#КонецУдаления
		
		//#Вставка
		ЕстьАлкоголь = Ложь;
		Если Форма.Объект.Запасы.Количество() Тогда
			МассивКлючейВидовПродукции = ИнтеграцияИСУНФВызовСервера.ВидыПродукцииВЗапасах(Форма.Объект.Запасы);
			Для Каждого КлючВидаПродукции Из МассивКлючейВидовПродукции Цикл
				ВидПродукцииЕГАИС = КонструкторИСОбщегоНазначенияКлиентСервер.ВидПродукцииКлючаПоПодсистеме(КлючВидаПродукции, "ЕГАИС");
				Если ЗначениеЗаполнено(ВидПродукцииЕГАИС) Тогда
					ЕстьАлкоголь = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Не ЕстьАлкоголь
			И Форма.ПараметрыИнтеграцииГосИС.Получить("ЕГАИС")<>Неопределено Тогда
			ЕстьАлкоголь = Истина;
		КонецЕсли;
		
		Если ЕстьАлкоголь Тогда
			Команда = Новый Структура("Имя", "ПроверитьАкцизныеМаркиЕГАИС");
		Иначе
			Команда = Новый Структура("Имя", "ПроверитьАкцизныеМарки");
		КонецЕсли;
		//#КонецВставки
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьВыборФормыСканирования(Выбор, ДополнительныеПараметры) Экспорт
	
	Если Выбор = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Форма = ДополнительныеПараметры.Форма;
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "ПараметрыУказанияСерий") Тогда
		ПараметрыУказанияСерий = Форма.ПараметрыУказанияСерий;
	Иначе
		ПараметрыУказанияСерий = Неопределено;
	КонецЕсли;
	
	ВыбранныйВидПродукции = Выбор.Значение;
	Если ВыбранныйВидПродукции = ПредопределенноеЗначение("Перечисление.ВидыПродукцииИС.Алкогольная") Тогда
		ПроверкаИПодборПродукцииЕГАИСКлиент.ОткрытьФормуСканированияАлкогольнойПродукции(ДополнительныеПараметры.Форма);
	Иначе
		ПроверкаИПодборПродукцииИСМПКлиент.ОткрытьФормуПроверкиИПодбора(ДополнительныеПараметры.Форма, ВыбранныйВидПродукции, ПараметрыУказанияСерий);
	КонецЕсли;
	
КонецПроцедуры
