#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Контрагент", Контрагент);
	Параметры.Свойство("ИсточникРекламы", ИсточникПривлеченияПокупателя);
	
	Если Не ЗначениеЗаполнено(ИсточникПривлеченияПокупателя) Тогда
		ИсточникПривлеченияПокупателя = Контрагент.ИсточникПривлеченияПокупателя;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		ЗаписатьИсточникВКонтрагента(Контрагент, ИсточникПривлеченияПокупателя);
		
	КонецЕсли;
	
	Закрыть(ИсточникПривлеченияПокупателя);
	
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаписатьИсточникВКонтрагента(Контрагент, ИсточникПривлеченияПокупателя) 
	
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	КонтрагентОбъект.ИсточникПривлеченияПокупателя = ИсточникПривлеченияПокупателя;
	КонтрагентОбъект.ОбменДанными.Загрузка = Истина;
	КонтрагентОбъект.Записать();

КонецПроцедуры

#КонецОбласти