//<<<--- Tnext Козык К.А. 16.06.2026 - перенос доработок из общего модуля ПроверкаИПодборПродукцииИСМППереопределяемый
// в общие модули ПроверкаИПодборПродукцииИСПереопределяемый и ИнтеграцияМОТПУНФ после обновления на релиз 3.0.13.357
//&После("ПриОпределенииПараметровИнтеграцииФормыПроверкиИПодбора")
//Процедура спПриОпределенииПараметровИнтеграцииФормыПроверкиИПодбора(Форма, ПараметрыИнтеграции, ВидПродукции)
//	
//	Если ИнтеграцияИСМПУНФКлиентСервер.ЭтоДокументПоНаименованию(Форма, "спПриемкаТовара") Тогда
//		
//		ПараметрыИнтеграции.ИмяРодительскойГруппыФормы                 = "ГруппаЗапасы";
//		ПараметрыИнтеграции.РазмещатьЭлементыИнтерфейса                = Истина;
//		ПараметрыИнтеграции.ЕстьПравоИзменение                         = ПравоДоступа("Изменение", Форма.Объект.Ссылка.Метаданные());
//		ПараметрыИнтеграции.ЭтоДокументПриобретения                    = Истина;
//		ПараметрыИнтеграции.ЕстьЭлектронныйДокумент                    = Ложь; //ЭлектронноеВзаимодействиеИСМП.ДокументСвязанСЭлектронным(Форма.Объект.Ссылка);
//		ПараметрыИнтеграции.ИспользоватьКолонкуСтатусаПроверкиПодбора  = Истина;
//		ПараметрыИнтеграции.БлокироватьТабличнуюЧастьТоварыПриПроверке = ПараметрыИнтеграции.ЕстьЭлектронныйДокумент;
//		ПараметрыИнтеграции.ИспользоватьСтатусПроверкаЗавершена        = ПараметрыИнтеграции.ЕстьЭлектронныйДокумент;
//		ПараметрыИнтеграции.ДоступноЧастичноеВыбытие                   = Истина;
//		ПараметрыИнтеграции.Вставить("ИмяКолонкиКоличество", 		   "Количество");
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//&После("ОтразитьРезультатыСканированияВДокументе")
//Процедура спОтразитьРезультатыСканированияВДокументе(ПараметрыОкончанияСканирования)
//	
//	ТипПроверяемогоДокумента = ТипЗнч(ПараметрыОкончанияСканирования.ПроверяемыйДокумент);
//	
//	Если ТипПроверяемогоДокумента = Тип("ДокументСсылка.спПриемкаТовара") Тогда
//		
//		спОтразитьРезультатыПроверкиИПодбораВДокументеПоступления(ПараметрыОкончанияСканирования);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//// Переносит результат проверки и подбора продукции ИС МП во входящий документ.
////   Общая схема:
////    * Заполняет серии номенклатуры в документе, при необходимости создавая их,
////    * При использовании актов расхождений - создает акт, иначе
////    * Обновляет табличные части "Запасы" и "Штрихкоды упаковок" актуальной табачной продукцией,
////    * Перезаписывает документ.
////
//// Параметры:
////   ПараметрыОкончанияСканирования - Структура - (См. ПроверкаИПодборМОТП.ЗафиксироватьРезультатПроверкиИПодбора)
////
//Процедура спОтразитьРезультатыПроверкиИПодбораВДокументеПоступления(ПараметрыОкончанияСканирования)
//	
//	ТипОбъекта = ТипЗнч(ПараметрыОкончанияСканирования.ПроверяемыйДокумент);
//	Если ТипОбъекта = Тип("ДокументСсылка.ОтчетПереработчика") Тогда
//		ИмяТЧЗапасы = "Продукция";
//	Иначе
//		ИмяТЧЗапасы = "Запасы";
//	КонецЕсли;
//	
//	ДокументОбъект = ПараметрыОкончанияСканирования.ПроверяемыйДокумент.ПолучитьОбъект();
//	
//	Если Не ПараметрыОкончанияСканирования.СоздаватьАктОРасхождениях Тогда
//		
//		ОтразитьИзмененияТабличнойЧастиШтрихкодыУпаковок(
//			ДокументОбъект,
//			ПараметрыОкончанияСканирования.ТаблицаШтрихкодовВерхнегоУровня,
//			ПараметрыОкончанияСканирования.ВидПродукцииИС);
//			
//		ОтразитьИзменениеКоличестваВТабличныхЧастяхТоварыСерии(ДокументОбъект, ПараметрыОкончанияСканирования, ИмяТЧЗапасы);
//		
//	КонецЕсли;
//	
//	Если ДокументОбъект.Проведен Тогда
//		
//		Попытка
//			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
//		Исключение
//			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
//		КонецПопытки;
//		
//	Иначе
//		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись)
//	КонецЕсли;
//	
//	Если ПараметрыОкончанияСканирования.СоздаватьАктОРасхождениях Тогда
//		
//		СоздатьАктОРасхожденияхПоРезультатамПроверкиИПодбораИСМП(
//			ПараметрыОкончанияСканирования, ДокументОбъект.Проведен);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

//// Переносит таблицу штрихкодов верхнего уровня в документ
////   Удаляет из табличной части "ШтрихкодыУпаковок" документа отсутствующие табачные (содержащие внутри хотя бы 1 шт 
////   табачной продукции) штрихкоды верхнего уровня
////   Добавляет в табличную часть "ШтрихкодыУпаковок" документа отсутствующие там фактические штрихкоды
////   Не меняет прочие (например алкогольные) штрихкоды
//// 
//// Параметры:
////  ДокументОбъект                  - ДокументОбъект  - документ для изменения
////  ТаблицаШтрихкодовВерхнегоУровня - ТаблицаЗначений - таблица с колонкой "ШтрихкодУпаковки" (фактические)
//Процедура ОтразитьИзмененияТабличнойЧастиШтрихкодыУпаковок(ДокументОбъект, ТаблицаШтрихкодовВерхнегоУровня, ВидПродукцииИС) Экспорт
//	
//	ШтрихкодыДляПроверки = ДокументОбъект.ШтрихкодыУпаковок.Выгрузить().ВыгрузитьКолонку("ШтрихкодУпаковки");
//	ТаблицаШтрихкодовВерхнегоУровня.Колонки.Штрихкод.Имя = "ЗначениеШтрихкода";
//	Для Каждого ЭлементВНаличии Из ТаблицаШтрихкодовВерхнегоУровня Цикл
//		СтруктураПоиска = Новый Структура("ШтрихкодУпаковки", ЭлементВНаличии.ШтрихкодУпаковки);
//		ПоискСтрок = ДокументОбъект.ШтрихкодыУпаковок.НайтиСтроки(СтруктураПоиска);
//		Если ПоискСтрок.Количество() = 0 Тогда
//			СтрокаШтрихкодДокумента = ДокументОбъект.ШтрихкодыУпаковок.Добавить();
//		Иначе
//			СтрокаШтрихкодДокумента = ПоискСтрок[0];
//			ЭлементМассива = ШтрихкодыДляПроверки.Найти(ЭлементВНаличии.ШтрихкодУпаковки);
//			Если Не ЭлементМассива = Неопределено Тогда
//				ШтрихкодыДляПроверки.Удалить(ЭлементМассива);
//			КонецЕсли;
//		КонецЕсли;
//		ЗаполнитьЗначенияСвойств(СтрокаШтрихкодДокумента, ЭлементВНаличии);
//	КонецЦикла;
//	
//	ШтрихкодыСодержащиеМаркируемуюПродукцию = ИнтеграцияИСУНФ.ШтрихкодыСодержащиеВидыПродукции(ШтрихкодыДляПроверки, ВидПродукцииИС);
//	
//	Для Каждого ЭлементОтсутствует Из ШтрихкодыСодержащиеМаркируемуюПродукцию Цикл
//		ДокументОбъект.ШтрихкодыУпаковок.Удалить(ДокументОбъект.ШтрихкодыУпаковок.Найти(ЭлементОтсутствует, "ШтрихкодУпаковки"));
//	КонецЦикла;
//	
//КонецПроцедуры

//// Переносит маркируемую продукцию из формы проверки и подбора в документ
////   * Удаляет из табличных частей Запасы, Серии отсутствующую в данных проверки маркируемую продукцию.
////   * Не меняет прочие товарные строки.
//// 
//// Параметры:
////  ДокументОбъект  - документ к изменению;
////  ПараметрыОкончанияПроверки - Структура - (См. ПроверкаИПодборИСМП.ЗафиксироватьРезультатПроверкиИПодбора).
////
//Процедура ОтразитьИзменениеКоличестваВТабличныхЧастяхТоварыСерии(ДокументОбъект, ПараметрыОкончанияСканирования, ИмяТЧЗапасы = "Запасы", ИмяТЧСерии = "СерииНоменклатуры")
//	
//	ТаблицаПодобраннойПровереннойПродукции = ПараметрыОкончанияСканирования.ТаблицаПодобраннойПровереннойПродукции;
//	
//	Запрос = Новый Запрос;
//	
//	ТаблицаТовары = ДокументОбъект[ИмяТЧЗапасы].Выгрузить();
//	ТаблицаСерии = ДокументОбъект[ИмяТЧСерии].Выгрузить();
//	
//	Запрос.УстановитьПараметр("Товары", ТаблицаТовары);
//	Запрос.УстановитьПараметр("Серии", ТаблицаСерии);
//	Запрос.УстановитьПараметр("Подобрано", ТаблицаПодобраннойПровереннойПродукции);
//	Запрос.УстановитьПараметр("ВидПродукцииИС", ПараметрыОкончанияСканирования.ВидПродукцииИС);
//	
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.КлючСвязи КАК КлючСвязи,
//	|	Товары.Количество КАК Количество,
//	|	Товары.ЕдиницаИзмерения КАК ЕдиницаИзмерения
//	|ПОМЕСТИТЬ ВТ_Товары
//	|ИЗ
//	|	&Товары КАК Товары
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Серии.Серия КАК Серия,
//	|	Серии.КлючСвязи КАК КлючСвязи,
//	|	Серии.Количество КАК Количество
//	|ПОМЕСТИТЬ ВТ_Серии
//	|ИЗ
//	|	&Серии КАК Серии
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ВТ_Товары.Номенклатура КАК Номенклатура,
//	|	ВТ_Товары.Характеристика КАК Характеристика,
//	|	ВЫБОР
//	|		КОГДА ВТ_Серии.Серия ЕСТЬ NULL
//	|			ТОГДА НЕОПРЕДЕЛЕНО
//	|		ИНАЧЕ ВТ_Серии.Серия
//	|	КОНЕЦ КАК Серия,
//	|	ВЫБОР
//	|		КОГДА ВТ_Серии.Серия ЕСТЬ NULL
//	|			ТОГДА ВТ_Товары.Количество * ВЫБОР
//	|					КОГДА ЕдиницыИзмерения.Ссылка ЕСТЬ NULL
//	|						ТОГДА 1
//	|					ИНАЧЕ ЕдиницыИзмерения.Коэффициент
//	|				КОНЕЦ
//	|		ИНАЧЕ ВТ_Серии.Количество
//	|	КОНЕЦ КАК Количество
//	|ПОМЕСТИТЬ ВТ_ТоварыСерии
//	|ИЗ
//	|	ВТ_Товары КАК ВТ_Товары
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Серии КАК ВТ_Серии
//	|		ПО ВТ_Товары.КлючСвязи = ВТ_Серии.КлючСвязи
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
//	|		ПО ВТ_Товары.ЕдиницаИзмерения = ЕдиницыИзмерения.Ссылка
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Подобрано.Номенклатура КАК Номенклатура,
//	|	Подобрано.Характеристика КАК Характеристика,
//	|	Подобрано.Серия КАК Серия,
//	|	Подобрано.КоличествоПодобрано КАК Количество
//	|ПОМЕСТИТЬ ВТ_Подобрано
//	|ИЗ
//	|	&Подобрано КАК Подобрано
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	ТоварыСерии.Номенклатура КАК Номенклатура,
//	|	ТоварыСерии.Характеристика КАК Характеристика,
//	|	ТоварыСерии.Серия КАК Серия,
//	|	ТоварыСерии.Количество КАК Количество
//	|ПОМЕСТИТЬ ВТ_ПродукцияИС_ПодобраннаяПродукция
//	|ИЗ
//	|	ВТ_ТоварыСерии КАК ТоварыСерии
//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СправочникНоменклатура
//	|		ПО (СправочникНоменклатура.Ссылка = ТоварыСерии.Номенклатура)
//	|			И (СправочникНоменклатура.ВидПродукцииИС = &ВидПродукцииИС)
//	|
//	|ОБЪЕДИНИТЬ ВСЕ
//	|
//	|ВЫБРАТЬ
//	|	Подобрано.Номенклатура,
//	|	Подобрано.Характеристика,
//	|	ВЫБОР
//	|		КОГДА ТИПЗНАЧЕНИЯ(Подобрано.Серия) = ТИП(Справочник.СерииНоменклатуры)
//	|				И НЕ Подобрано.Серия = ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)
//	|			ТОГДА Подобрано.Серия
//	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
//	|	КОНЕЦ,
//	|	-Подобрано.Количество
//	|ИЗ
//	|	ВТ_Подобрано КАК Подобрано
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ
//	|	Товары.Номенклатура КАК Номенклатура,
//	|	Товары.Характеристика КАК Характеристика,
//	|	Товары.Серия КАК Серия,
//	|	СУММА(Товары.Количество) КАК Недостача
//	|ИЗ
//	|	ВТ_ПродукцияИС_ПодобраннаяПродукция КАК Товары
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	Товары.Номенклатура,
//	|	Товары.Характеристика,
//	|	Товары.Серия
//	|
//	|ИМЕЮЩИЕ
//	|	СУММА(Товары.Количество) <> 0
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Недостача УБЫВ";
//	
//	ВыборкаРасхождения = Запрос.Выполнить().Выбрать();
//	Если ВыборкаРасхождения.Количество() = 0 Тогда
//		Возврат;
//	КонецЕсли;
//	
//	КлючПоиска = "Номенклатура, Характеристика";

//	ТаблицаТовары.Колонки.Добавить("Удалить", Новый ОписаниеТипов("Булево"));
//	ТаблицаТовары.Индексы.Добавить(КлючПоиска);
//	
//	ТаблицаСерии.Колонки.Добавить("Удалить", Новый ОписаниеТипов("Булево"));
//	
//	СтруктураПоиска = Новый Структура(КлючПоиска);
//	ИзмененныеСтроки = Новый Соответствие;
//	
//	Пока ВыборкаРасхождения.Следующий() Цикл
//		
//		Недостача = ВыборкаРасхождения.Недостача;
//		
//		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаРасхождения);
//		
//		СтрокиТовары = ТаблицаТовары.НайтиСтроки(СтруктураПоиска);
//		
//		Если Недостача > 0 Тогда
//			Для Каждого СтрокаТаблицыТовары Из СтрокиТовары Цикл
//				
//				Списать = СтрокаТаблицыТовары.Количество;
//				Списать = Мин(Списать, Недостача);
//				
//				СтрокаТаблицыТовары.Количество = СтрокаТаблицыТовары.Количество - Списать;
//				Недостача = Недостача - Списать;
//				
//				ИзмененныеСтроки.Вставить(СтрокаТаблицыТовары);
//				
//				Если ЗначениеЗаполнено(ВыборкаРасхождения.Серия) Тогда
//					СтруктураПоискаСерии = Новый Структура("КлючСвязи, Серия", СтрокаТаблицыТовары.КлючСвязи, ВыборкаРасхождения.Серия);
//					НайденныеСтрокиСерии = ТаблицаСерии.НайтиСтроки(СтруктураПоискаСерии);
//					Если НайденныеСтрокиСерии.Количество() Тогда
//						НайденнаяСтрокаСерии = НайденныеСтрокиСерии[0];
//						НайденнаяСтрокаСерии.Количество = НайденнаяСтрокаСерии.Количество - Списать;
//						НайденнаяСтрокаСерии.Удалить = НайденнаяСтрокаСерии.Количество <= 0;
//					КонецЕсли;
//				КонецЕсли;
//				
//			КонецЦикла;
//		Иначе
//			Если СтрокиТовары.Количество() > 0 Тогда
//				
//				СтрокаТаблицыТовары = СтрокиТовары[0];
//				СтрокаТаблицыТовары.Количество = СтрокаТаблицыТовары.Количество - Недостача;
//				ИзмененныеСтроки.Вставить(СтрокаТаблицыТовары);
//				
//				Если ЗначениеЗаполнено(ВыборкаРасхождения.Серия) Тогда
//					СтруктураПоискаСерии = Новый Структура("КлючСвязи, Серия", СтрокаТаблицыТовары.КлючСвязи, ВыборкаРасхождения.Серия);
//					НайденныеСтрокиСерии = ТаблицаСерии.НайтиСтроки(СтруктураПоискаСерии);
//					Если НайденныеСтрокиСерии.Количество() Тогда
//						НайденнаяСтрокаСерии = НайденныеСтрокиСерии[0];
//						НайденнаяСтрокаСерии.Количество = НайденнаяСтрокаСерии.Количество - Недостача;
//					Иначе
//						Если НЕ ЗначениеЗаполнено(СтрокаТаблицыТовары.КлючСвязи) Тогда
//							ТабличныеЧастиУНФКлиентСервер.ЗаполнитьКлючСвязи(ТаблицаТовары, СтрокаТаблицыТовары, "КлючСвязи");
//						КонецЕсли;
//						НоваяСтрокаСерии = ТаблицаСерии.Добавить();
//						НоваяСтрокаСерии.Серия = ВыборкаРасхождения.Серия;
//						НоваяСтрокаСерии.КлючСвязи = СтрокаТаблицыТовары.КлючСвязи;
//						НоваяСтрокаСерии.Количество = - Недостача;
//					КонецЕсли;
//				КонецЕсли;
//				
//			Иначе
//				
//				НоваяСтрокаТовары = ТаблицаТовары.Добавить();
//				ЗаполнитьЗначенияСвойств(НоваяСтрокаТовары, СтруктураПоиска);
//				НоваяСтрокаТовары.Количество = - Недостача;
//				НоменклатураВДокументахСервер.ЗаполнитьДанныеВСтрокеТабличнойЧасти(ДокументОбъект, ИмяТЧЗапасы, НоваяСтрокаТовары);
//				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(НоваяСтрокаТовары, "ЕдиницаИзмерения")
//					И ЗначениеЗаполнено(НоваяСтрокаТовары.Номенклатура) Тогда
//					НоваяСтрокаТовары.ЕдиницаИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НоваяСтрокаТовары.Номенклатура, "ЕдиницаИзмерения");
//				КонецЕсли;
//				
//				Если ЗначениеЗаполнено(ВыборкаРасхождения.Серия) Тогда
//					ТабличныеЧастиУНФКлиентСервер.ЗаполнитьКлючСвязи(ТаблицаТовары, НоваяСтрокаТовары, "КлючСвязи");
//					НоваяСтрокаСерии = ТаблицаСерии.Добавить();
//					НоваяСтрокаСерии.Серия = ВыборкаРасхождения.Серия;
//					НоваяСтрокаСерии.КлючСвязи = НоваяСтрокаТовары.КлючСвязи;
//					НоваяСтрокаСерии.Количество = - Недостача;
//					
//					НоваяСтрокаТовары.СерииНоменклатуры = СерииНоменклатурыУНФ.ПредставлениеСерийНоменклатуры(ТаблицаСерии,
//						НоваяСтрокаТовары.КлючСвязи);
//				КонецЕсли;
//				
//			КонецЕсли;
//		КонецЕсли;
//	КонецЦикла;
//	
//	ТаблицаСерии = ТаблицаСерии.Скопировать(Новый Структура("Удалить", Ложь));
//	ДокументОбъект[ИмяТЧСерии].Загрузить(ТаблицаСерии);
//	
//	Для Каждого КлючИЗначение Из ИзмененныеСтроки Цикл
//		
//		СтрокаТаблицыТовары = КлючИЗначение.Ключ;
//		Если СтрокаТаблицыТовары.Количество = 0 Тогда
//			СтрокаТаблицыТовары.Удалить = Истина;
//		Иначе
//			//РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТаблицыТовары, Новый Структура("СуммаВключаетНДС", ДокументОбъект.СуммаВключаетНДС));
//			СтрокаТаблицыТовары.СерииНоменклатуры = СерииНоменклатурыУНФ.ПредставлениеСерийНоменклатуры(ТаблицаСерии, СтрокаТаблицыТовары.КлючСвязи);
//		КонецЕсли;
//		
//	КонецЦикла;
//	
//	ТаблицаТовары = ТаблицаТовары.Скопировать(Новый Структура("Удалить", Ложь));
//	
//	ДокументОбъект[ИмяТЧЗапасы].Загрузить(ТаблицаТовары);
//	
//КонецПроцедуры

//Процедура СоздатьАктОРасхожденияхПоРезультатамПроверкиИПодбораИСМП(ПараметрыОкончанияСканирования, Проводить)
//	
//	Возврат;
//	
//	СформированныйАкт = ИнтеграцияИСМПУНФ.СформированныйАктОРасхождениях(ПараметрыОкончанияСканирования.ПроверяемыйДокумент);
//	Если ЭлектронноеВзаимодействиеИСМП.ЗавершенОбменПоЭДО(СформированныйАкт) Тогда
//		СформированныйАкт = Неопределено;
//	КонецЕсли;
//	
//	Если СформированныйАкт = Неопределено Тогда
//		ДокументОбъект = Документы.АктОРасхождениях.СоздатьДокумент();
//		ДокументОбъект.Заполнить(ПараметрыОкончанияСканирования.ПроверяемыйДокумент);
//	Иначе
//		ДокументОбъект = СформированныйАкт.ПолучитьОбъект();
//	КонецЕсли;
//	
//	ДокументОбъект.Дата = ТекущаяДатаСеанса();
//	
//	//ОтразитьИзменениеКоличестваВТабличнойЧастиТоварыСерииДокументаКорректировки(ДокументОбъект, ПараметрыОкончанияСканирования);
//	
//	ОтразитьИзмененияТабличнойЧастиШтрихкодыУпаковок(
//		ДокументОбъект,
//		ПараметрыОкончанияСканирования.ТаблицаШтрихкодовВерхнегоУровня,
//		ПараметрыОкончанияСканирования.ВидПродукцииИС);
//	
//	//ЗаполнитьТаблицуРасхожденийШтриховыхКодов(ДокументОбъект, ПараметрыОкончанияСканирования);
//	
//	Если Проводить Тогда
//		Попытка
//			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
//		Исключение
//			ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
//		КонецПопытки;
//	Иначе
//		ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
//	КонецЕсли;
//	
//	ПараметрыОкончанияСканирования.СозданныйАктОРасхождениях = ДокументОбъект.Ссылка;
//	
//КонецПроцедуры 
//--->>> Tnext Козык К.А. 16.06.2026
