#Область ПрограммныйИнтерфейс

Процедура ОбъединитьОбластьЯчеекШаблонаСервер(ПолеТабличногоДокумента, ИмяОбласти) Экспорт
	
	Область = ПолеТабличногоДокумента.Область(ИмяОбласти);
	Область.Объединить();
	
КонецПроцедуры

Процедура ВставитьВШаблонРисунокЗнакиУхода(ПолеТабличногоДокумента, ИмяТекущейОбласти, ИмяПоляВШаблоне) Экспорт
	
	// Получим рисунок штрихкода из общего макета.
	МакетШтрихкода = Новый Картинка(ПолучитьОбщийМакет("спЗнакиУхода"));
	
	РисунокШтрихкода = ПолеТабличногоДокумента.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	Индекс = ПолеТабличногоДокумента.Рисунки.Индекс(РисунокШтрихкода);
	ПолеТабличногоДокумента.Рисунки[Индекс].Картинка = МакетШтрихкода;
	ПолеТабличногоДокумента.Рисунки[Индекс].Имя = ИмяПоляВШаблоне+СтрЗаменить(Новый УникальныйИдентификатор,"-","_");  
	ПолеТабличногоДокумента.Рисунки[Индекс].Расположить(ПолеТабличногоДокумента.Область(ИмяТекущейОбласти)); 
	
КонецПроцедуры

Функция ЗаполнитьНоменклатураПоставщика(Знач Запасы) Экспорт
	
	НоменклатураХарактеристика = Запасы.Выгрузить(, "Номенклатура, Характеристика");
	Номенклатура = Запасы.Выгрузить(, "Номенклатура").ВыгрузитьКолонку("Номенклатура");
	СоответствиеНоменклатураХарактеристика = Новый Соответствие;
	Для каждого Значение Из Номенклатура Цикл
		НайденныеСтроки = НоменклатураХарактеристика.НайтиСтроки(Новый Структура("Номенклатура", Значение));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Характеристика = Новый Массив;
			Для каждого Строка Из НайденныеСтроки Цикл 
				Если ЗначениеЗаполнено(Строка.Характеристика) Тогда 
					Характеристика.Добавить(Строка.Характеристика);
				КонецЕсли;
			КонецЦикла;
			Если Характеристика.Количество() > 0 Тогда 
				СоответствиеНоменклатураХарактеристика.Вставить(Значение, Характеристика);
			КонецЕсли;
		КонецЕсли;
		
	КонецЦикла;   
	СтруктураЗаполнения =  Новый Структура("Номенклатура, СоответствиеНоменклатураХарактеристика", Номенклатура, СоответствиеНоменклатураХарактеристика);
	Возврат СтруктураЗаполнения;  
	
КонецФункции

Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные) Экспорт
	
	РеквизитыНоменклатуры = Новый Массив;
	РеквизитыНоменклатуры.Добавить("ЕдиницаИзмерения");
	РеквизитыНоменклатуры.Добавить("ТипНоменклатуры");
	РеквизитыНоменклатуры.Добавить("ИспользоватьХарактеристики");
	РеквизитыНоменклатуры.Добавить("ПроверятьЗаполнениеХарактеристики");
	РеквизитыНоменклатуры.Добавить("ЭтоНабор");
	РеквизитыНоменклатуры.Добавить("ВидСтавкиНДС");
	РеквизитыНоменклатуры.Добавить("Склад");
	ЗначенияРеквизитовНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтруктураДанные.Номенклатура,
		РеквизитыНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", ЗначенияРеквизитовНоменклатуры.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("ТипНоменклатуры", ЗначенияРеквизитовНоменклатуры.ТипНоменклатуры);

	// Наборы
	СтруктураДанные.Вставить("ЭтоНабор", ЗначенияРеквизитовНоменклатуры.ЭтоНабор);
	
	ПериодСтавкиНДС = ?(ЗначениеЗаполнено(СтруктураДанные.ДатаОбработки), СтруктураДанные.ДатаОбработки,
		ТекущаяДатаСеанса());

	Если СтруктураДанные.Свойство("НалогообложениеНДС") 
		И НЕ СтруктураДанные.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
		
		Если СтруктураДанные.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС Тогда
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСБезНДС();
		Иначе
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьСтавкуНДСНоль();
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(ЗначенияРеквизитовНоменклатуры.ВидСтавкиНДС) Тогда
		СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(ЗначенияРеквизитовНоменклатуры.ВидСтавкиНДС, ПериодСтавкиНДС);
	Иначе
		ВидСтавкиНДСПоУмолчанию = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураДанные.Организация,
			"ВидСтавкиНДСПоУмолчанию");
		СтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(ВидСтавкиНДСПоУмолчанию, ПериодСтавкиНДС);
	КонецЕсли;
	СтруктураДанные.Вставить("СтавкаНДС", СтавкаНДС);
	
	// Характеристики
	СтруктураДанные.Вставить("ИспользоватьХарактеристики", Ложь);
	СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики", Ложь);
	
	Если ЗначениеЗаполнено(ЗначенияРеквизитовНоменклатуры) 
		И (ЗначенияРеквизитовНоменклатуры.ТипНоменклатуры <> Неопределено И Не ЗначенияРеквизитовНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга)
		И (ЗначенияРеквизитовНоменклатуры.ИспользоватьХарактеристики <> Неопределено И ЗначенияРеквизитовНоменклатуры.ИспользоватьХарактеристики)
		Тогда
		ЗначенияПоУмолчанию = НоменклатураВДокументахСервер.ЗначенияНоменклатурыПоУмолчанию(СтруктураДанные.Номенклатура);
		
		Если Не ЗначенияПоУмолчанию = Неопределено Тогда
			ХарактеристикаПоУмолчанию = ЗначенияПоУмолчанию;
		КонецЕсли;
		
		Если Не СтруктураДанные.Свойство("Характеристика") Тогда
			СтруктураДанные.Вставить("Характеристика", ХарактеристикаПоУмолчанию);
		Иначе
			СтруктураДанные.Характеристика = ?(ЗначениеЗаполнено(СтруктураДанные.Характеристика),
				СтруктураДанные.Характеристика, ХарактеристикаПоУмолчанию);
		КонецЕсли;
		
		СтруктураДанные.Вставить("ИспользоватьХарактеристики", Истина);
		СтруктураДанные.Вставить("ПроверятьЗаполнениеХарактеристики",
			ЗначенияРеквизитовНоменклатуры.ПроверятьЗаполнениеХарактеристики);
		
		Если СтруктураДанные.Свойство("ПодборНоменклатурыИзСписка") И СтруктураДанные.ПодборНоменклатурыИзСписка Тогда
			Если СтруктураДанные.Свойство("СтруктураВыбораНоменклатуры") И ТипЗнч(СтруктураДанные.СтруктураВыбораНоменклатуры) = Тип("Структура") Тогда
				СтруктураДанные.Характеристика = СтруктураДанные.СтруктураВыбораНоменклатуры.Характеристика;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли; 
	// Конец Характеристики
	
	Если СтруктураДанные.Свойство("ВидЦенКонтрагента") Тогда
		
		Цена = ЦенообразованиеСервер.ПолучитьЦенуНоменклатурыПоВидуЦенКонтрагента(СтруктураДанные);
		СтруктураДанные.Вставить("Цена", Цена);
		
	Иначе
		
		СтруктураДанные.Вставить("Цена", 0);
		
	КонецЕсли;
    //Вес и объем
	СтруктураДанные.Вставить("ВесЕдиницыТовара", СтруктураДанные.Номенклатура.Вес);
	СтруктураДанные.Вставить("ОбъемЕдиницыТовара", СтруктураДанные.Номенклатура.Объем);
	
	Если СтруктураДанные.Свойство("Характеристика") Тогда
		СпецификацияПоУмолчанию = Справочники.Спецификации.СпецификацияПоУмолчанию(СтруктураДанные.Номенклатура,
			СтруктураДанные.Характеристика);
		СтруктураДанные.Вставить("Спецификация", СпецификацияПоУмолчанию);
	Иначе
		СпецификацияПоУмолчанию = Справочники.Спецификации.СпецификацияПоУмолчанию(СтруктураДанные.Номенклатура);
		СтруктураДанные.Вставить("Спецификация", СпецификацияПоУмолчанию);
	КонецЕсли;
	
	СтруктураДанные.Вставить("ЭтоЗапас", ЗначенияРеквизитовНоменклатуры.ТипНоменклатуры = ПредопределенноеЗначение(
		"Перечисление.ТипыНоменклатуры.Запас"));
	СтруктураДанные.Вставить("Склад", ЗначенияРеквизитовНоменклатуры.Склад);
	
	Если СтруктураДанные.Свойство("УчетНоменклатурыПоставщиков") И СтруктураДанные.УчетНоменклатурыПоставщиков Тогда
		Характеристика = ?(СтруктураДанные.ИспользоватьХарактеристики, СтруктураДанные.Характеристика, Неопределено);
		СтруктураДанные.Вставить("НоменклатураПоставщика", НоменклатураВДокументахСервер.НоменклатураПоставщикаПоНоменклатуре(СтруктураДанные.Контрагент
																																, СтруктураДанные.Номенклатура, СтруктураДанные.Характеристика));
	Иначе
		СтруктураДанные.Вставить("НоменклатураПоставщика", Неопределено);
	КонецЕсли;
	
	СтруктураДанные.Вставить("ЗапретитьВводДробногоКоличества", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураДанные.Номенклатура, "ЗапретитьВводДробногоКоличества"));
	
	Возврат СтруктураДанные;
	
КонецФункции

Функция ЗаполнитьНоменклатураПоставщикаФормаСписка(ВыделенныеСтроки) Экспорт
	
	Если ТипЗнч(ВыделенныеСтроки) = Тип("Массив") И ВыделенныеСтроки.Количество() > 0 Тогда  
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаказПоставщикуЗапасы.Номенклатура КАК Номенклатура,
			|	ЗаказПоставщикуЗапасы.Характеристика КАК Характеристика
			|ИЗ
			|	Документ.ЗаказПоставщику.Запасы КАК ЗаказПоставщикуЗапасы
			|ГДЕ
			|	ЗаказПоставщикуЗапасы.Ссылка В(&ВыделенныеСтроки)";
		Запрос.УстановитьПараметр("ВыделенныеСтроки", ВыделенныеСтроки);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда 
			НоменклатураХарактеристика = РезультатЗапроса.Выгрузить(); 
			Номенклатура = НоменклатураХарактеристика.ВыгрузитьКолонку("Номенклатура");
			СоответствиеНоменклатураХарактеристика = Новый Соответствие;
			Для каждого Значение Из Номенклатура Цикл
				НайденныеСтроки = НоменклатураХарактеристика.НайтиСтроки(Новый Структура("Номенклатура", Значение));
				Если НайденныеСтроки.Количество() > 0 Тогда
					Характеристика = Новый Массив;
					Для каждого Строка Из НайденныеСтроки Цикл 
						Если ЗначениеЗаполнено(Строка.Характеристика) Тогда 
							Характеристика.Добавить(Строка.Характеристика);
						КонецЕсли;
					КонецЦикла;
					Если Характеристика.Количество() > 0 Тогда 
						СоответствиеНоменклатураХарактеристика.Вставить(Значение, Характеристика);
					КонецЕсли;
				КонецЕсли;
				
			КонецЦикла;   
			СтруктураЗаполнения =  Новый Структура("Номенклатура, СоответствиеНоменклатураХарактеристика", Номенклатура, СоответствиеНоменклатураХарактеристика);
			Возврат СтруктураЗаполнения;
		КонецЕсли; 
	КонецЕсли; 

	Возврат Неопределено;
	
КонецФункции


// ++ Терлецкий АВ 25.01.15
Процедура ОтменаПроведенияДокументЗаказНаПеремещения(Объект) Экспорт
	ДокументЗаказ = Объект.Ссылка;
	Если ДокументЗаказ.Проведен Тогда 
		ДокументОбъект = ДокументЗаказ.ПолучитьОбъект();
		Попытка
			ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Исключение
			ВызватьИсключение ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьСостояниеСообщенияДокументЗаказНаПеремещения(Форма, Ссылка) Экспорт
	РезультатОтправкиСообщения = Неопределено;
	ДекорацияФормыОтправкаСообщения = Неопределено;
	
	СтруктурнаяЕдиницаРезерв = спОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("спОтправлятьСообщениеДляПодсортировкиМагазина");
	Если ЗначениеЗаполнено(СтруктурнаяЕдиницаРезерв) И Форма.Объект.СтруктурнаяЕдиницаРезерв = СтруктурнаяЕдиницаРезерв Тогда 
		
		Если Ссылка <> Документы.ЗаказНаПеремещение.ПустаяСсылка() Тогда  
			РезультатОтправкиСообщения = ПроверкаИсходящегоСообщенияНаВебСервер(Ссылка);
		КонецЕсли;
		
		ДекорацияФормыОтправкаСообщения = Форма.Элементы.Найти("ОтправкаСообщения");
		
		Если Не ТипЗнч(ДекорацияФормыОтправкаСообщения) = Тип("ДекорацияФормы") Тогда 
			Возврат;	
		КонецЕсли;
		
		Если РезультатОтправкиСообщения = Истина Тогда 
			
			ДекорацияФормыОтправкаСообщения.Заголовок = "Сообщение отправлено";
			ДекорацияФормыОтправкаСообщения.ЦветТекста = WebЦвета.Зеленый;
			
		ИначеЕсли РезультатОтправкиСообщения = Ложь Тогда
			
			ДекорацияФормыОтправкаСообщения.Заголовок = "Ошибка отправки";
			ДекорацияФормыОтправкаСообщения.ЦветТекста = WebЦвета.Красный;
			
		Иначе
			ДекорацияФормыОтправкаСообщения.Заголовок = "Сообщение не отправлялось";
			ДекорацияФормыОтправкаСообщения.ЦветТекста = WebЦвета.Синий;
			
		КонецЕсли;
		
	Иначе
		ДекорацияФормыОтправкаСообщения = Форма.Элементы.Найти("ОтправкаСообщения");
		
		Если Не ТипЗнч(ДекорацияФормыОтправкаСообщения) = Тип("ДекорацияФормы") Тогда 
			Возврат;
		КонецЕсли;
		ДекорацияФормыОтправкаСообщения.Заголовок = "";
		
	КонецЕсли;
КонецПроцедуры  

Функция ПроверкаИсходящегоСообщенияНаВебСервер(Ссылка) Экспорт
	
	РезультатОтправкиСообщения = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спОтправленныеСообщения.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.спОтправленныеСообщения КАК спОтправленныеСообщения
		|ГДЕ
		|	спОтправленныеСообщения.СпособПередачи = &СпособПередачи
		|	И спОтправленныеСообщения.СсылкаНаОбъект = &СсылкаНаОбъект
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	тбОчередь.СсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|			И (тбСостояние.СтатусСообщения В (&СписокСтатусовИсходящихСообщений))
		|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
		|			И (тбОчередь.СпособПередачи = &СпособПередачи)
		|			И (тбОчередь.СсылкаНаОбъект = &СсылкаНаОбъект)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|			И (тбСостояние.СтатусСообщения В (&СписокСтатусовОшибкаОтправки))
		|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
		|			И (тбОчередь.СпособПередачи = &СпособПередачи)
		|			И (тбОчередь.СсылкаНаОбъект = &СсылкаНаОбъект)";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", Ссылка); 
	Запрос.УстановитьПараметр("СпособПередачи", Перечисления.спСпособПередачи.SOAP); 
	Запрос.УстановитьПараметр("СписокСтатусовИсходящихСообщений", спКэшируемыеФункцииВызовСервера.ПоучитьСписокСтатусовОчередиИсходящихСообщений()); 
	Запрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса()));  
    Запрос.УстановитьПараметр("СписокСтатусовОшибкаОтправки", спКэшируемыеФункцииВызовСервера.ПоучитьСписокСтатусовОшибкаОтправки()); 
	
	МассивРезультатов = Запрос.ВыполнитьПакет(); 
	
	ВыборкаОтправленныеСообщения = МассивРезультатов[0].Выбрать();
	
	Если ВыборкаОтправленныеСообщения.Следующий() Тогда
		
		РезультатОтправкиСообщения = Истина;
		Возврат РезультатОтправкиСообщения;
	КонецЕсли;
	
	ВыборкаОшибкаОтправки = МассивРезультатов[1].Выбрать();
	
	Если ВыборкаОшибкаОтправки.Следующий() Тогда
		
		РезультатОтправкиСообщения = Ложь;
		Возврат РезультатОтправкиСообщения;
		
	КонецЕсли;
	
	Возврат РезультатОтправкиСообщения;

КонецФункции

// -- Терлецкий АВ 25.01.15

// dimedrol 23.02.2025
Функция СоздатьУстановкуЦенПоАлгоритму(Знач Объект) Экспорт
	
	Алгоритм = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Контрагент, "спАлгоритмРасчетаУстановкиЦен");
	Если Не ЗначениеЗаполнено(Алгоритм) Тогда
		ОбщегоНазначения.СообщитьПользователю("Для контрагента не указан алгоритм формирования цен");
		Возврат Неопределено;
	КонецЕсли;
	
	ТЧНоменклатура = Объект.Запасы.Выгрузить(, "Номенклатура, Характеристика, Цена");
	ТЧНоменклатура.Колонки.Добавить("ЦенаНовая", ОбщегоНазначения.ОписаниеТипаЧисло(10, 3));
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ТЧНоменклатура", ТЧНоменклатура);
	
	ТаблицаРезультат = Справочники.спАлгоритмыРасчетаЦен.Вызвать(Алгоритм.КлючДляВызова, СтруктураПараметров);
	
	ДокументУстановкаЦенНоменклатурыОбъект = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	
	ДокументУстановкаЦенНоменклатурыОбъект.Дата        = ТекущаяДатаСеанса();
	ДокументУстановкаЦенНоменклатурыОбъект.Автор       = Пользователи.АвторизованныйПользователь();
	ДокументУстановкаЦенНоменклатурыОбъект.Комментарий = СтрШаблон("Документ цен создан программно по алгоритму %1", Алгоритм.Наименование);
	
	ДокументУстановкаЦенНоменклатурыОбъект.ПоказыватьДействующуюЦену  = Истина;
	ДокументУстановкаЦенНоменклатурыОбъект.ПоказыватьЕдиницыИзмерения = Истина;
	ДокументУстановкаЦенНоменклатурыОбъект.ПоказыватьХарактеристики   = Истина;
	ДокументУстановкаЦенНоменклатурыОбъект.ПоказыватьОтклонениеЦен    = Истина;
	ДокументУстановкаЦенНоменклатурыОбъект.ПоказыватьНовуюЦену        = Истина;
	ДокументУстановкаЦенНоменклатурыОбъект.ДокументОснование          = Объект.Ссылка;
	
	ВидЦены = Справочники.ВидыЦен.Оптовая; // Розничная цена, ₽
	
	ЗаписатьДокумент = Ложь;
	
	ТЧЗапасы = ДокументУстановкаЦенНоменклатурыОбъект.Запасы;
	Отбор = Новый Структура( "Номенклатура, Характеристика, ЕдиницаИзмерения, ВидЦены, Валюта" );
	Для Каждого ТоварыСтрока Из ТЧНоменклатура Цикл
	
		Отбор.Номенклатура     = ТоварыСтрока.Номенклатура;
		Отбор.Характеристика   = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Отбор.ЕдиницаИзмерения = ТоварыСтрока.Номенклатура.ЕдиницаИзмерения;
		Отбор.ВидЦены          = ВидЦены;
		Отбор.Валюта           = ВидЦены.ВалютаЦены;
		
		ТЧЗапасыСтроки = ТЧЗапасы.НайтиСтроки(Отбор);
		Если ТЧЗапасыСтроки.Количество() = 0 Тогда
		
			ТЧЗапасыСтрока = ТЧЗапасы.Добавить();
			
			ТЧЗапасыСтрока.Номенклатура     = ТоварыСтрока.Номенклатура;
			ТЧЗапасыСтрока.Характеристика   = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			ТЧЗапасыСтрока.ЕдиницаИзмерения = ТоварыСтрока.Номенклатура.ЕдиницаИзмерения;
			ТЧЗапасыСтрока.ВидЦены          = ВидЦены;
			ТЧЗапасыСтрока.Валюта           = ВидЦены.ВалютаЦены;
			
		Иначе
			ТЧЗапасыСтрока = ТЧЗапасыСтроки[0];
		КонецЕсли;
		
		Если ТЧЗапасыСтрока.Цена <> ТоварыСтрока.ЦенаНовая Тогда
			ТЧЗапасыСтрока.Цена = ТоварыСтрока.ЦенаНовая;
			ЗаписатьДокумент = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗаписатьДокумент = Истина Тогда
		ДокументУстановкаЦенНоменклатурыОбъект.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли;
	
	Возврат ДокументУстановкаЦенНоменклатурыОбъект.Ссылка;
	
КонецФункции
// end of dimedrol 23.02.2025

#КонецОбласти