
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТребуютОтправки = Истина;
	ИнтервалОбновления = спОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("спОтправкаСообщенийИнтервалОбновленияСтатусов");
	ИнтервалОбновленияСтатусов = ?(ЗначениеЗаполнено(ИнтервалОбновления), ИнтервалОбновления, 5);    
	АвтоматическоеОбновление = спОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("спОтправкаСообщенийАвтоматическоеОбновление");  
	
	ТипОбъекта.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"),"Приходная накладная");
	ТипОбъекта.Добавить(Тип("ДокументСсылка.ПеремещениеЗапасов"),"Перемещение запасов"); 
	
	СообщеняОтправки = ОбновитьСтатусыНаСервере(); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
 	ПодключитьОбработкуСообщений();
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработкуСообщений() 
	Интервал = ИнтервалОбновленияСтатусов * 60;
	ПодключитьОбработчикОжидания("ОбновитьСтатусыПроверитьОбработкуСообщений", Интервал); 	
КонецПроцедуры

&НаСервере
Функция ОбновитьСтатусыНаСервере()  
	
    СтатусПодчиненныхСообщений = Перечисления.спСтатусыСообщений.ПустаяСсылка();
	СтатусСообщенийИнициаторовОтправки = Перечисления.спСтатусыСообщений.ПустаяСсылка(); 
	
	Если ЗначениеЗаполнено(СтатусСообщенияДокумент) Тогда 
		
		Если  СтатусСообщенияДокумент = "ОжидаетОтправкиНоменклатуры" Тогда 
			СтатусПодчиненныхСообщений = Перечисления.спСтатусыСообщений.Новое;
			СтатусСообщенийИнициаторовОтправки = Перечисления.спСтатусыСообщений.Новое;
			
		ИначеЕсли СтатусСообщенияДокумент = "ОжидаетПодтвержденияНоменклатуры" Тогда 
			СтатусПодчиненныхСообщений = Перечисления.спСтатусыСообщений.Отправлено;
			СтатусСообщенийИнициаторовОтправки = Перечисления.спСтатусыСообщений.Новое;
			
		ИначеЕсли СтатусСообщенияДокумент = "НоменклатураПодтверждена" Тогда 
			СтатусПодчиненныхСообщений = Перечисления.спСтатусыСообщений.ОтправкаПодтверждена;
			СтатусСообщенийИнициаторовОтправки = Перечисления.спСтатусыСообщений.Новое;
			
		ИначеЕсли СтатусСообщенияДокумент = "ОшибкаДанныхСообшенияНоменклатуры" Тогда 
			СтатусПодчиненныхСообщений = Перечисления.спСтатусыСообщений.НеВалидно;
			СтатусСообщенийИнициаторовОтправки = Перечисления.спСтатусыСообщений.Новое;
			
		ИначеЕсли СтатусСообщенияДокумент = "ОшибкаОтправкиНоменклатуры" Тогда 
			
			СтатусПодчиненныхСообщений = Новый Массив;
			СтатусПодчиненныхСообщений.Добавить(Перечисления.спСтатусыСообщений.ОшибкаОтправки); 
			СтатусПодчиненныхСообщений.Добавить(Перечисления.спСтатусыСообщений.ОшибкаОбработки);
			
			СтатусСообщенийИнициаторовОтправки = Перечисления.спСтатусыСообщений.Новое;  
			
		ИначеЕсли СтатусСообщенияДокумент = "ОжидаетОтправки" Тогда 
			СтатусПодчиненныхСообщений = Перечисления.спСтатусыСообщений.ОтправкаПодтверждена;
			СтатусСообщенийИнициаторовОтправки = Перечисления.спСтатусыСообщений.Новое;  
			
		ИначеЕсли СтатусСообщенияДокумент = "Отправлена" Тогда 
			СтатусПодчиненныхСообщений = Перечисления.спСтатусыСообщений.ОтправкаПодтверждена;
			СтатусСообщенийИнициаторовОтправки = Перечисления.спСтатусыСообщений.Отправлено;
			
		ИначеЕсли СтатусСообщенияДокумент = "Подтверждена" Тогда 
			СтатусПодчиненныхСообщений = Перечисления.спСтатусыСообщений.ОтправкаПодтверждена;
			СтатусСообщенийИнициаторовОтправки = Перечисления.спСтатусыСообщений.ОтправкаПодтверждена;
			
		ИначеЕсли СтатусСообщенияДокумент = "ОшибкаДанныхСообшения" Тогда 
			
			СтатусПодчиненныхСообщений = Перечисления.спСтатусыСообщений.ОтправкаПодтверждена;
			СтатусСообщенийИнициаторовОтправки = Перечисления.спСтатусыСообщений.НеВалидно;	
			
		ИначеЕсли СтатусСообщенияДокумент = "ОшибкаОтправки" Тогда
			
			СтатусПодчиненныхСообщений = Перечисления.спСтатусыСообщений.ОтправкаПодтверждена;
			
			СтатусСообщенийИнициаторовОтправки = Новый Массив;
			СтатусСообщенийИнициаторовОтправки.Добавить(Перечисления.спСтатусыСообщений.ОшибкаОтправки); 
			СтатусСообщенийИнициаторовОтправки.Добавить(Перечисления.спСтатусыСообщений.ОшибкаОбработки);
			
		КонецЕсли;
	КонецЕсли;
	
	ДокументыДоОбновления = Объект.Документы.Выгрузить();
			
	СтатусыОтправки = Новый Структура;
	СтатусыОтправки.Вставить("ОжидаетОтправкиНоменклатуры", 		"Ожидает отправки номенклатуры"); 
	СтатусыОтправки.Вставить("ОжидаетПодтвержденияНоменклатуры", 	"Ожидает подтверждения номенклатуры");
	СтатусыОтправки.Вставить("НоменклатураПодтверждена",       		"Номенклатура подтверждена");
	
	СтатусыОтправки.Вставить("ОшибкаОтправкиНоменклатуры", 			"Ошибка загрузки номенклатуры");
	СтатусыОтправки.Вставить("ОшибкаДанныхСообшенияНоменклатуры", 	"Ошибка данных сообшения номенклатуры"); 


	СтатусыОтправки.Вставить("ОшибкаДанныхСообшения", 				"Ошибка данных сообщения");
	
	СтатусыОтправки.Вставить("ОжидаетОтправки", 					"Ожидает отправки");
	СтатусыОтправки.Вставить("Отправлена", 							"Отправлен"); 
	СтатусыОтправки.Вставить("ОжидаетПодтверждения",                "Ожидает подтверждения"); 
	СтатусыОтправки.Вставить("Подтверждена", 						"Подтверждена"); 
	
	СтатусыОтправки.Вставить("ОшибкаОтправки", 						"Ошибка отправки");


	Объект.Сообщения.Очистить();
	Объект.Документы.Очистить();

	Запрос = Новый Запрос;
	МВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МВТ; 
	Запрос.Текст = 
	
		//   %1
		//   %2
        //|   И %3  
		
		"ВЫБРАТЬ
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект
		|ПОМЕСТИТЬ ВТПодчиненныеСообщения
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
		|			И (ТИПЗНАЧЕНИЯ(тбОчередь.СсылкаНаОбъект) В (&ТипОбъектаПодчиненные))
		|			И (тбОчередь.СпособПередачи = &СпособПередачи)
		|			И (тбСостояние.СтатусСообщения %1)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ПОМЕСТИТЬ ВТСообщенияИнициаторОтправки
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
		|			И (ТИПЗНАЧЕНИЯ(тбОчередь.СсылкаНаОбъект) В (&ТипОбъекта))
		|			И (тбОчередь.СпособПередачи = &СпособПередачи)
		|			И (тбСостояние.СтатусСообщения %2)
		|			И (тбОчередь.СсылкаНаОбъект В
		|				(ВЫБРАТЬ
		|					ВТПодчиненныеСообщения.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект
		|				ИЗ
		|					ВТПодчиненныеСообщения КАК ВТПодчиненныеСообщения))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|
		|ВЫБРАТЬ
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения,
		|	тбОчередь.СпособПередачи КАК СпособПередачи
		|ПОМЕСТИТЬ ВТОтправленныеСообщенияДокумент
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
		|			И (ТИПЗНАЧЕНИЯ(тбОчередь.СсылкаНаОбъект) В (&ТипОбъекта))
		|			И (тбОчередь.СпособПередачи = &СпособПередачи)
		|           И %3
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения,
		|	тбОчередь.СпособПередачи КАК СпособПередачи
		|ПОМЕСТИТЬ ВТОтправленныеСообщения
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
		|			И (тбСостояние.СтатусСообщения В (&СписокСтатусовИсходящихСообщений))
		|			И (тбОчередь.СпособПередачи = &СпособПередачи)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
		|	ПриходнаяНакладнаяЗапасы.Ссылка КАК Документ
		|ПОМЕСТИТЬ ВТЗапасы
		|ИЗ
		|	ВТОтправленныеСообщенияДокумент КАК ВТОтправленныеСообщенияДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		|		ПО ВТОтправленныеСообщенияДокумент.СсылкаНаОбъект = ПриходнаяНакладнаяЗапасы.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПеремещениеЗапасовЗапасы.Номенклатура,
		|	ПеремещениеЗапасовЗапасы.Ссылка
		|ИЗ
		|	ВТОтправленныеСообщенияДокумент КАК ВТОтправленныеСообщенияДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
		|		ПО ВТОтправленныеСообщенияДокумент.СсылкаНаОбъект = ПеремещениеЗапасовЗапасы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗапасы.Номенклатура КАК Номенклатура,
		|	ВТЗапасы.Документ КАК Документ
		|ПОМЕСТИТЬ ВТДокументНоменклатура
		|ИЗ
		|	ВТЗапасы КАК ВТЗапасы
		|ГДЕ
		|	ВТЗапасы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И НЕ ВТЗапасы.Номенклатура ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТЗапасы.Документ,
		|	ВТЗапасы.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.ФорматСообщения КАК ФорматСообщения,
		|	тбОчередь.МетодХранения КАК МетодХранения,
		|	тбОчередь.ОбъектСобытия КАК ОбъектСобытия,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.СпособПередачи КАК СпособПередачи,
		|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения,
		|	тбСостояние.ОписаниеДанных КАК ОписаниеДанных,
		|	тбОчередь.Хранилище КАК Хранилище
		|ПОМЕСТИТЬ ВТ_ОчередьИсходящихСообщений
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
		|ГДЕ
		|	НЕ тбОчередь.ЭтоУдаление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДокументНоменклатура.Документ КАК Документ,
		|	ЕСТЬNULL(ВТОтправленныеСообщения.СсылкаНаОбъект, ВТ_ОчередьИсходящихСообщений.СсылкаНаОбъект) КАК СсылкаНаОбъект,
		|	ЕСТЬNULL(ВТОтправленныеСообщения.ДатаРегистрации, ВТ_ОчередьИсходящихСообщений.ДатаРегистрации) КАК ДатаРегистрации,
		|	ЕСТЬNULL(ВТОтправленныеСообщения.СтатусСообщения, ВТ_ОчередьИсходящихСообщений.СтатусСообщения) КАК СтатусСообщения,
		|	ВТ_ОчередьИсходящихСообщений.ОписаниеДанных КАК ОписаниеДанных
		|ИЗ
		|	ВТДокументНоменклатура КАК ВТДокументНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОчередьИсходящихСообщений КАК ВТ_ОчередьИсходящихСообщений
		|		ПО ВТДокументНоменклатура.Номенклатура = ВТ_ОчередьИсходящихСообщений.СсылкаНаОбъект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтправленныеСообщения КАК ВТОтправленныеСообщения
		|		ПО ВТДокументНоменклатура.Номенклатура = ВТОтправленныеСообщения.СсылкаНаОбъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТОтправленныеСообщения.ДатаРегистрации, ВТ_ОчередьИсходящихСообщений.ДатаРегистрации) КАК ДатаРегистрации,
		|	ЕСТЬNULL(ВТОтправленныеСообщения.СсылкаНаОбъект, ВТ_ОчередьИсходящихСообщений.СсылкаНаОбъект) КАК СсылкаНаОбъект,
		|	ЕСТЬNULL(ВТОтправленныеСообщения.СтатусСообщения, ВТ_ОчередьИсходящихСообщений.СтатусСообщения) КАК СтатусСообщения,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТДокументНоменклатура.Номенклатура) КАК Номенклатура
		|ПОМЕСТИТЬ ВТДокументНоменклатураДанные
		|ИЗ
		|	ВТДокументНоменклатура КАК ВТДокументНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОчередьИсходящихСообщений КАК ВТ_ОчередьИсходящихСообщений
		|		ПО ВТДокументНоменклатура.Документ = ВТ_ОчередьИсходящихСообщений.СсылкаНаОбъект
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОтправленныеСообщения КАК ВТОтправленныеСообщения
		|		ПО ВТДокументНоменклатура.Документ = ВТОтправленныеСообщения.СсылкаНаОбъект
		|
		|СГРУППИРОВАТЬ ПО
		|	ЕСТЬNULL(ВТОтправленныеСообщения.ДатаРегистрации, ВТ_ОчередьИсходящихСообщений.ДатаРегистрации),
		|	ЕСТЬNULL(ВТОтправленныеСообщения.СсылкаНаОбъект, ВТ_ОчередьИсходящихСообщений.СсылкаНаОбъект),
		|	ЕСТЬNULL(ВТОтправленныеСообщения.СтатусСообщения, ВТ_ОчередьИсходящихСообщений.СтатусСообщения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДокументНоменклатураДанные.ДатаРегистрации КАК ДатаРегистрации,
		|	ВТДокументНоменклатураДанные.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	ВТДокументНоменклатураДанные.СтатусСообщения КАК СтатусСообщения,
		|	ВТДокументНоменклатураДанные.Номенклатура КАК Номенклатура,
		|	ВТ_ОчередьИсходящихСообщений.ОписаниеДанных КАК ОписаниеДанных
		|ИЗ
		|	ВТДокументНоменклатураДанные КАК ВТДокументНоменклатураДанные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОчередьИсходящихСообщений КАК ВТ_ОчередьИсходящихСообщений
		|		ПО ВТДокументНоменклатураДанные.СсылкаНаОбъект = ВТ_ОчередьИсходящихСообщений.СсылкаНаОбъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДокументНоменклатура.Документ КАК Документ,
		|	ВТ_ОчередьИсходящихСообщений.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	ВТ_ОчередьИсходящихСообщений.ДатаРегистрации КАК ДатаРегистрации,
		|	ВТ_ОчередьИсходящихСообщений.ФорматСообщения КАК ФорматСообщения,
		|	ВТ_ОчередьИсходящихСообщений.МетодХранения КАК МетодХранения,
		|	ВТ_ОчередьИсходящихСообщений.ОбъектСобытия КАК ОбъектСобытия,
		|	ВТ_ОчередьИсходящихСообщений.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	ВТ_ОчередьИсходящихСообщений.СпособПередачи КАК СпособПередачи,
		|	ВТ_ОчередьИсходящихСообщений.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект,
		|	ВТ_ОчередьИсходящихСообщений.СтатусСообщения КАК СтатусСообщения,
		|	ВТ_ОчередьИсходящихСообщений.ОписаниеДанных КАК ОписаниеДанных,
		|	ВТ_ОчередьИсходящихСообщений.Хранилище КАК Хранилище
		|ПОМЕСТИТЬ ВТСообщеняСоСтатусамиДляОтправкиНоменклатура
		|ИЗ
		|	ВТДокументНоменклатура КАК ВТДокументНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОчередьИсходящихСообщений КАК ВТ_ОчередьИсходящихСообщений
		|		ПО ВТДокументНоменклатура.Номенклатура = ВТ_ОчередьИсходящихСообщений.СсылкаНаОбъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОчередьИсходящихСообщений.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	ВТ_ОчередьИсходящихСообщений.ДатаРегистрации КАК ДатаРегистрации,
		|	ВТ_ОчередьИсходящихСообщений.ФорматСообщения КАК ФорматСообщения,
		|	ВТ_ОчередьИсходящихСообщений.МетодХранения КАК МетодХранения,
		|	ВТ_ОчередьИсходящихСообщений.ОбъектСобытия КАК ОбъектСобытия,
		|	ВТ_ОчередьИсходящихСообщений.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	ВТ_ОчередьИсходящихСообщений.СпособПередачи КАК СпособПередачи,
		|	ВТ_ОчередьИсходящихСообщений.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект,
		|	ВТ_ОчередьИсходящихСообщений.СтатусСообщения КАК СтатусСообщения,
		|	ВТ_ОчередьИсходящихСообщений.ОписаниеДанных КАК ОписаниеДанных,
		|	ВТ_ОчередьИсходящихСообщений.Хранилище КАК Хранилище,
		|	Документ.ДокументСсылка КАК ДокументСсылка
		|ПОМЕСТИТЬ ВТСообщеняСоСтатусамиДляОтправкиДокументов
		|ИЗ
		|	ВТ_ОчередьИсходящихСообщений КАК ВТ_ОчередьИсходящихСообщений
		|		ПРАВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ВТДокументНоменклатура.Документ КАК ДокументСсылка
		|		ИЗ
		|			ВТДокументНоменклатура КАК ВТДокументНоменклатура) КАК Документ
		|		ПО (Документ.ДокументСсылка = ВТ_ОчередьИсходящихСообщений.СсылкаНаОбъект)
		|ГДЕ
		|	ВТ_ОчередьИсходящихСообщений.СтатусСообщения В(&СписокРабочихСтатусов)";  
		
	Параметр1 = "";
    Параметр2 = ""; 
	Параметр3 = ""; 
	
	Если ТипЗнч(СтатусПодчиненныхСообщений) = Тип("ПеречислениеСсылка.спСтатусыСообщений") ИЛИ СтатусПодчиненныхСообщений = Перечисления.спСтатусыСообщений.ПустаяСсылка() Тогда 
		Параметр1 =  "= &СтатусПодчиненныхСообщений";
		
	ИначеЕсли ТипЗнч(СтатусПодчиненныхСообщений) = Тип("Массив") Тогда 
		Параметр1 = "В (&СтатусПодчиненныхСообщений)";  
	Иначе 
		Параметр1 =  "= &СтатусПодчиненныхСообщений";
	КонецЕсли; 
	
	Если ТипЗнч(СтатусСообщенийИнициаторовОтправки) = Тип("ПеречислениеСсылка.спСтатусыСообщений") ИЛИ СтатусСообщенийИнициаторовОтправки = Перечисления.спСтатусыСообщений.ПустаяСсылка() Тогда 
		Параметр2 =  "= &СтатусСообщенийИнициаторовОтправки";
		
	ИначеЕсли ТипЗнч(СтатусСообщенийИнициаторовОтправки) = Тип("Массив") Тогда 
		Параметр2 = "В (&СтатусСообщенийИнициаторовОтправки)";  
	Иначе 
		Параметр2 =  "= &СтатусСообщенийИнициаторовОтправки";
	КонецЕсли;



    Если ЗначениеЗаполнено(СтатусСообщенияДокумент) И Не ТребуютОтправки Тогда 
		Параметр3 = 
		"
		| 			(тбОчередь.СсылкаНаОбъект В
		|				(ВЫБРАТЬ
		|					ВТСообщенияИнициаторОтправки.СсылкаНаОбъект КАК СсылкаНаОбъект
		|				ИЗ
		|					ВТСообщенияИнициаторОтправки КАК ВТСообщенияИнициаторОтправки))"; 

	ИначеЕсли ТребуютОтправки И СтатусПодчиненныхСообщений = Перечисления.спСтатусыСообщений.ПустаяСсылка() Тогда
		Параметр3 = " (НЕ тбСостояние.СтатусСообщения В(&СписокСтатусовИсходящихСообщений))";
		
	ИначеЕсли Не ТребуютОтправки И СтатусПодчиненныхСообщений = Перечисления.спСтатусыСообщений.ПустаяСсылка() Тогда 
		Параметр3 = "(ИСТИНА = ИСТИНА)";   
		
	Иначе
		Параметр3 = "(ИСТИНА = ИСТИНА)"; 
		
	КонецЕсли; 
	
	Запрос.Текст = СтрШаблон(Запрос.Текст, Параметр1, Параметр2, Параметр3);


	Запрос.УстановитьПараметр("ТипОбъекта", ТипОбъекта);
	Запрос.УстановитьПараметр("СпособПередачи", Перечисления.спСпособПередачи.FTP);
	Запрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса())); 
	Запрос.УстановитьПараметр("СписокСтатусовИсходящихСообщений", спКэшируемыеФункцииВызовСервера.ПоучитьСписокСтатусовОчередиИсходящихСообщений());
	Запрос.УстановитьПараметр("СписокРабочихСтатусов", спКэшируемыеФункцииВызовСервера.ПоучитьСписокСтатусовДляОтправки());
	
	Запрос.УстановитьПараметр("ТипОбъектаПодчиненные", Тип("СправочникСсылка.Номенклатура")); 
	Запрос.УстановитьПараметр("СтатусСообщенийИнициаторовОтправки", СтатусСообщенийИнициаторовОтправки); 
	Запрос.УстановитьПараметр("СтатусПодчиненныхСообщений", СтатусПодчиненныхСообщений);

		
	Пакет = Запрос.ВыполнитьПакет();
	ИсходящиеСообщеняСоСтатусамиНоменклатура = Пакет[7].Выбрать();
	Пока ИсходящиеСообщеняСоСтатусамиНоменклатура.Следующий() Цикл 
				
		НоваяСтрока = Объект.Сообщения.Добавить();  
		НоваяСтрока.ДатаРегистрацииНоменклатура    = ИсходящиеСообщеняСоСтатусамиНоменклатура.ДатаРегистрации;
		НоваяСтрока.СсылкаНаОбъектНоменклатура     = ИсходящиеСообщеняСоСтатусамиНоменклатура.СсылкаНаОбъект;
		НоваяСтрока.СтатусСообщенияНоменклатура    = ИсходящиеСообщеняСоСтатусамиНоменклатура.СтатусСообщения;
		НоваяСтрока.СсылкаНаОбъектДокумент         = ИсходящиеСообщеняСоСтатусамиНоменклатура.Документ; 
		
		Если ТипЗнч(ИсходящиеСообщеняСоСтатусамиНоменклатура.ОписаниеДанных) =  Тип("ХранилищеЗначения")  И ЗначениеЗаполнено(ИсходящиеСообщеняСоСтатусамиНоменклатура.ОписаниеДанных) Тогда 
			Попытка
				Данные 									   	= ИсходящиеСообщеняСоСтатусамиНоменклатура.ОписаниеДанных.Получить();
				НоваяСтрока.Информация 						= СериализоватьВJSON(Данные); 
			Исключение
			КонецПопытки;
		КонецЕсли;
		
		Если ИсходящиеСообщеняСоСтатусамиНоменклатура.СтатусСообщения = Перечисления.спСтатусыСообщений.Новое Тогда 
			НоваяСтрока.Статус = СтатусыОтправки.ОжидаетОтправкиНоменклатуры; 
		ИначеЕсли ИсходящиеСообщеняСоСтатусамиНоменклатура.СтатусСообщения = Перечисления.спСтатусыСообщений.ОшибкаОтправки 
			ИЛИ ИсходящиеСообщеняСоСтатусамиНоменклатура.СтатусСообщения = Перечисления.спСтатусыСообщений.ОшибкаОбработки Тогда
			НоваяСтрока.Статус = СтатусыОтправки.ОшибкаОтправкиНоменклатуры;  
			
		ИначеЕсли ИсходящиеСообщеняСоСтатусамиНоменклатура.СтатусСообщения = Перечисления.спСтатусыСообщений.ОжиданиеОбработки 
			ИЛИ ИсходящиеСообщеняСоСтатусамиНоменклатура.СтатусСообщения = Перечисления.спСтатусыСообщений.ВОбработке Тогда 
			ВремяСНачалаОбработки = ТекущаяДатаСеанса() - ИсходящиеСообщеняСоСтатусамиНоменклатура.ДатаРегистрации;
			Если ВремяСНачалаОбработки > 3 * 60 Тогда 
				НоваяСтрока.Статус = СтатусыОтправки.ОшибкаОтправкиНоменклатуры;
			Иначе 
				НоваяСтрока.Статус = СтатусыОтправки.ОжидаетОтправкиНоменклатуры;
			КонецЕсли;

		ИначеЕсли ИсходящиеСообщеняСоСтатусамиНоменклатура.СтатусСообщения = Перечисления.спСтатусыСообщений.Отправлено Тогда 
			НоваяСтрока.Статус = СтатусыОтправки.ОжидаетПодтвержденияНоменклатуры;
		ИначеЕсли ИсходящиеСообщеняСоСтатусамиНоменклатура.СтатусСообщения = Перечисления.спСтатусыСообщений.ОтправкаПодтверждена Тогда 
			НоваяСтрока.Статус = СтатусыОтправки.НоменклатураПодтверждена;
		ИначеЕсли ИсходящиеСообщеняСоСтатусамиНоменклатура.СтатусСообщения = Перечисления.спСтатусыСообщений.НеВалидно Тогда 
			НоваяСтрока.Статус = СтатусыОтправки.ОшибкаДанныхСообшения;  
		ИначеЕсли ИсходящиеСообщеняСоСтатусамиНоменклатура.СтатусСообщения = Перечисления.спСтатусыСообщений.ОшибкаПодтверждения Тогда 
			НоваяСтрока.Статус = СтатусыОтправки.ОшибкаДанныхСообшения; 
		КонецЕсли;
		
	КонецЦикла;   
	
	ИсходящиеСообщеняСоСтатусамиДокумент = Пакет[9].Выбрать();
	Пока ИсходящиеСообщеняСоСтатусамиДокумент.Следующий() Цикл 
				
		НоваяСтрока = Объект.Документы.Добавить(); 
		СтатусыСообщенийНоменклатуры = ПроверитьСтатусНоменклатуры(ИсходящиеСообщеняСоСтатусамиДокумент.СсылкаНаОбъект);
		
		Если Не АвтоматическоеОбновление Тогда 
			НайденыеСтроки = ДокументыДоОбновления.НайтиСтроки(Новый Структура("СсылкаНаОбъектДокумент", ИсходящиеСообщеняСоСтатусамиДокумент.СсылкаНаОбъект));
			Если НайденыеСтроки.Количество() > 0 Тогда  
				Для каждого СтрокаДокумент Из НайденыеСтроки Цикл
					НоваяСтрока.Флажек	= СтрокаДокумент.Флажек
				КонецЦикла;
			КонецЕсли; 
		Иначе 
			НоваяСтрока.Флажек							= Истина;    
		КонецЕсли;  
	
		НоваяСтрока.ДатаИзменения        			= ИсходящиеСообщеняСоСтатусамиДокумент.ДатаРегистрации;
		НоваяСтрока.СсылкаНаОбъектДокумент         	= ИсходящиеСообщеняСоСтатусамиДокумент.СсылкаНаОбъект;
		НоваяСтрока.СтатусСообщенияДокумент       	= ИсходящиеСообщеняСоСтатусамиДокумент.СтатусСообщения; 
		НоваяСтрока.СообщенийНоменклатуры           = ИсходящиеСообщеняСоСтатусамиДокумент.Номенклатура;
		
		Если ТипЗнч(ИсходящиеСообщеняСоСтатусамиНоменклатура.ОписаниеДанных) =  Тип("ХранилищеЗначения") И ЗначениеЗаполнено(ИсходящиеСообщеняСоСтатусамиДокумент.ОписаниеДанных) Тогда
			Попытка
				Данные 										= ИсходящиеСообщеняСоСтатусамиДокумент.ОписаниеДанных.Получить();
				НоваяСтрока.Информация 						= СериализоватьВJSON(Данные);  
			Исключение
			КонецПопытки;

			Если ЗначениеЗаполнено(НоваяСтрока.Информация) И ТипЗнч(НоваяСтрока.Информация) = Тип("Строка") Тогда 
				НоваяСтрока.ТекстоваяИнформацияОшибки               = ПолучитьИнформациюОшибки(НоваяСтрока.Информация); 
			КонецЕсли;

		КонецЕсли;

		Если ИсходящиеСообщеняСоСтатусамиДокумент.СтатусСообщения = Перечисления.спСтатусыСообщений.Новое 
			И  СтатусыСообщенийНоменклатуры = Перечисления.спСтатусыСообщений.Новое Тогда 
			НоваяСтрока.Статус = СтатусыОтправки.ОжидаетОтправкиНоменклатуры; 
			
		ИначеЕсли ИсходящиеСообщеняСоСтатусамиДокумент.СтатусСообщения = Перечисления.спСтатусыСообщений.Новое 
			И СтатусыСообщенийНоменклатуры = Перечисления.спСтатусыСообщений.Отправлено Тогда 
			НоваяСтрока.Статус = СтатусыОтправки.ОжидаетПодтвержденияНоменклатуры; 
			
		ИначеЕсли ИсходящиеСообщеняСоСтатусамиДокумент.СтатусСообщения = Перечисления.спСтатусыСообщений.Новое 
			И СтатусыСообщенийНоменклатуры = Перечисления.спСтатусыСообщений.ОтправкаПодтверждена Тогда 
			НоваяСтрока.Статус = СтатусыОтправки.ОжидаетОтправки;
			
		ИначеЕсли ИсходящиеСообщеняСоСтатусамиДокумент.СтатусСообщения = Перечисления.спСтатусыСообщений.Отправлено 
			И СтатусыСообщенийНоменклатуры = Перечисления.спСтатусыСообщений.ОтправкаПодтверждена Тогда 
			НоваяСтрока.Статус = СтатусыОтправки.ОжидаетПодтверждения;
			
		ИначеЕсли ИсходящиеСообщеняСоСтатусамиДокумент.СтатусСообщения = Перечисления.спСтатусыСообщений.ОтправкаПодтверждена 
			И СтатусыСообщенийНоменклатуры = Перечисления.спСтатусыСообщений.ОтправкаПодтверждена Тогда 
			НоваяСтрока.Статус = СтатусыОтправки.Подтверждена;
			
		ИначеЕсли ИсходящиеСообщеняСоСтатусамиДокумент.СтатусСообщения = Перечисления.спСтатусыСообщений.НеВалидно Тогда 
			НоваяСтрока.Статус = СтатусыОтправки.ОшибкаДанныхСообшения; 
							
		ИначеЕсли СтатусыСообщенийНоменклатуры = Перечисления.спСтатусыСообщений.НеВалидно Тогда 
			НоваяСтрока.Статус = СтатусыОтправки.ОшибкаДанныхСообшенияНоменклатуры;  
			
		ИначеЕсли ИсходящиеСообщеняСоСтатусамиДокумент.СтатусСообщения = Перечисления.спСтатусыСообщений.ОшибкаПодтверждения Тогда 
			НоваяСтрока.Статус = СтатусыОтправки.ОшибкаДанныхСообшения; 	
						
		ИначеЕсли СтатусыСообщенийНоменклатуры = Перечисления.спСтатусыСообщений.ОшибкаПодтверждения Тогда 
			НоваяСтрока.Статус = СтатусыОтправки.ОшибкаДанныхСообшенияНоменклатуры; 
			
		ИначеЕсли ИсходящиеСообщеняСоСтатусамиДокумент.СтатусСообщения = Перечисления.спСтатусыСообщений.ОшибкаОтправки 
			ИЛИ ИсходящиеСообщеняСоСтатусамиДокумент.СтатусСообщения = Перечисления.спСтатусыСообщений.ОшибкаОбработки Тогда
			НоваяСтрока.Статус = СтатусыОтправки.ОшибкаОтправки;

		
		ИначеЕсли ИсходящиеСообщеняСоСтатусамиДокумент.СтатусСообщения = Перечисления.спСтатусыСообщений.ОжиданиеОбработки
			ИЛИ ИсходящиеСообщеняСоСтатусамиДокумент.СтатусСообщения = Перечисления.спСтатусыСообщений.ВОбработке Тогда 
			
			ВремяСНачалаОбработки = ТекущаяДатаСеанса() - ИсходящиеСообщеняСоСтатусамиДокумент.ДатаРегистрации;
			Если ВремяСНачалаОбработки > 3 * 60 Тогда  
				НоваяСтрока.Статус = СтатусыОтправки.ОшибкаОтправки;
			Иначе  
				НоваяСтрока.Статус = СтатусыОтправки.ОжидаетОтправки;
			КонецЕсли;
			
		ИначеЕсли СтатусыСообщенийНоменклатуры = Перечисления.спСтатусыСообщений.ОшибкаОбработки 
			ИЛИ СтатусыСообщенийНоменклатуры = Перечисления.спСтатусыСообщений.ОшибкаОтправки 
			ИЛИ СтатусыСообщенийНоменклатуры = Перечисления.спСтатусыСообщений.ОжиданиеОбработки 
			ИЛИ СтатусыСообщенийНоменклатуры = Перечисления.спСтатусыСообщений.ВОбработке Тогда
			НоваяСтрока.Статус = СтатусыОтправки.ОжидаетОтправкиНоменклатуры;

				
		КонецЕсли;

	КонецЦикла;
	
	ЗапросДляОтправкиНоменклатура = Новый Запрос;  
	ЗапросДляОтправкиНоменклатура.МенеджерВременныхТаблиц = МВТ;
	ЗапросДляОтправкиНоменклатура.Текст = 
		"ВЫБРАТЬ
		|	ОчередьИсходящихСообщений.Документ КАК Документ,
		|	ОчередьИсходящихСообщений.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	ОчередьИсходящихСообщений.ДатаРегистрации КАК ДатаРегистрации,
		|	ОчередьИсходящихСообщений.ФорматСообщения КАК ФорматСообщения,
		|	ОчередьИсходящихСообщений.МетодХранения КАК МетодХранения,
		|	ОчередьИсходящихСообщений.ОбъектСобытия КАК ОбъектСобытия,
		|	ОчередьИсходящихСообщений.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	ОчередьИсходящихСообщений.СпособПередачи КАК СпособПередачи,
		|	ОчередьИсходящихСообщений.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект,
		|	ОчередьИсходящихСообщений.СтатусСообщения КАК СтатусСообщения,
		|	ОчередьИсходящихСообщений.ОписаниеДанных КАК ОписаниеДанных,
		|	ОчередьИсходящихСообщений.Хранилище КАК Хранилище
		|ПОМЕСТИТЬ ВТ_ИсходящииСообщения
		|ИЗ
		|	ВТСообщеняСоСтатусамиДляОтправкиНоменклатура КАК ОчередьИсходящихСообщений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИсходящииСообщения.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	МАКСИМУМ(ВТ_ИсходящииСообщения.Документ) КАК Документ
		|ПОМЕСТИТЬ ВТ_ИнициаторОтправкиСсылкаНаОбъектМаксимум
		|ИЗ
		|	ВТ_ИсходящииСообщения КАК ВТ_ИсходящииСообщения
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ИсходящииСообщения.СсылкаНаОбъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИсходящииСообщения.Документ КАК Документ,
		|	ВТ_ИсходящииСообщения.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	ВТ_ИсходящииСообщения.ДатаРегистрации КАК ДатаРегистрации,
		|	ВТ_ИсходящииСообщения.ФорматСообщения КАК ФорматСообщения,
		|	ВТ_ИсходящииСообщения.МетодХранения КАК МетодХранения,
		|	ВТ_ИсходящииСообщения.ОбъектСобытия КАК ОбъектСобытия,
		|	ВТ_ИсходящииСообщения.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	ВТ_ИсходящииСообщения.СпособПередачи КАК СпособПередачи,
		|	ВТ_ИсходящииСообщения.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект,
		|	ВТ_ИсходящииСообщения.СтатусСообщения КАК СтатусСообщения,
		|	ВТ_ИсходящииСообщения.ОписаниеДанных КАК ОписаниеДанных,
		|	ВТ_ИсходящииСообщения.Хранилище КАК Хранилище
		|ИЗ
		|	ВТ_ИнициаторОтправкиСсылкаНаОбъектМаксимум КАК ИнициаторОтправкиСсылкаНаОбъектМаксимум
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ИсходящииСообщения КАК ВТ_ИсходящииСообщения
		|		ПО ИнициаторОтправкиСсылкаНаОбъектМаксимум.СсылкаНаОбъект = ВТ_ИсходящииСообщения.СсылкаНаОбъект
		|			И ИнициаторОтправкиСсылкаНаОбъектМаксимум.Документ = ВТ_ИсходящииСообщения.Документ";
			
	ВыгрузкаНоменклатура = ЗапросДляОтправкиНоменклатура.Выполнить().Выгрузить(); 
	
	СписокСтатусовДляОтправки = спКэшируемыеФункцииВызовСервера.ПоучитьСписокСтатусовДляОтправки(); 
	
	ВыгрузкаНоменклатураПоДокументуСвертка = ВыгрузкаНоменклатура.Скопировать();
	ВыгрузкаНоменклатураПоДокументуСвертка.Свернуть("Документ", );
	
	ВыгрузкаНоменклатураСвертка = ВыгрузкаНоменклатура.Скопировать();	
	ВыгрузкаНоменклатураСвертка.Свернуть("ИдентификаторСобытия, Документ, ФорматСообщения, МетодХранения, ОбъектСобытия, СсылкаНаОбъект, СпособПередачи, ИнициаторОтправкиСсылкаНаОбъект, СтатусСообщения",);	
	ВыгрузкаНоменклатураСвертка.Колонки.Добавить("ОтправкаСообщения", Новый ОписаниеТипов("Булево"));
	
	
	НоменклатураДляОтправки = Новый Массив;
	
	Для каждого СверткаДокумент Из ВыгрузкаНоменклатураПоДокументуСвертка Цикл
	
		НайденыеСтроки = ВыгрузкаНоменклатура.НайтиСтроки(Новый Структура("Документ", СверткаДокумент.Документ));
		ОтменаОтправки = Ложь;
		Если НайденыеСтроки.Количество() > 0 Тогда  
			Для каждого НайденаяСтрока Из НайденыеСтроки Цикл  
				
				Если НайденаяСтрока.СтатусСообщения = Перечисления.спСтатусыСообщений.ВОбработке Тогда 	
					ВремяСНачалаОбработки = ТекущаяДатаСеанса() - НайденаяСтрока.ДатаРегистрации;
					Если ВремяСНачалаОбработки < 3 * 60 Тогда  
						ОтменаОтправки = Истина;
					КонецЕсли;
				КонецЕсли;	
				
				Если СписокСтатусовДляОтправки.Найти(НайденаяСтрока.СтатусСообщения) = Неопределено Тогда 
					ОтменаОтправки = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Не ОтменаОтправки Тогда 
			НайденыеСтроки = ВыгрузкаНоменклатураСвертка.НайтиСтроки(Новый Структура("Документ", СверткаДокумент.Документ));
			Если НайденыеСтроки.Количество() > 0 Тогда
				
				СообщеняСоСтатусамиДляОтправкиНоменклатура = Новый Массив;
				
				Для каждого НайденаяСтрока Из НайденыеСтроки Цикл
					
					СообщениеОтправки = Новый Структура;
					СообщениеОтправки.Вставить("ОтправкаСообщения", Истина);
					СообщениеОтправки.Вставить("Документ", НайденаяСтрока.Документ);
					СообщениеОтправки.Вставить("ИдентификаторСобытия", НайденаяСтрока.ИдентификаторСобытия);
					СообщениеОтправки.Вставить("ФорматСообщения", НайденаяСтрока.ФорматСообщения);
					СообщениеОтправки.Вставить("МетодХранения", НайденаяСтрока.МетодХранения);
					СообщениеОтправки.Вставить("ОбъектСобытия",  НайденаяСтрока.ОбъектСобытия);
					СообщениеОтправки.Вставить("СсылкаНаОбъект", НайденаяСтрока.СсылкаНаОбъект);
					СообщениеОтправки.Вставить("СпособПередачи", НайденаяСтрока.СпособПередачи);
					СообщениеОтправки.Вставить("ИнициаторОтправкиСсылкаНаОбъект", НайденаяСтрока.ИнициаторОтправкиСсылкаНаОбъект);
					СообщениеОтправки.Вставить("СтатусСообщения", НайденаяСтрока.СтатусСообщения); 
					
					
					СтрокиНайденые = ВыгрузкаНоменклатура.НайтиСтроки(Новый Структура("ИдентификаторСобытия", НайденаяСтрока.ИдентификаторСобытия));
					Если СтрокиНайденые.Количество() > 0 Тогда
						СообщениеОтправки.Вставить("ДатаРегистрации", 	СтрокиНайденые[0].ДатаРегистрации);
						СообщениеОтправки.Вставить("ОписаниеДанных", 	СтрокиНайденые[0].ОписаниеДанных); 
						СообщениеОтправки.Вставить("Хранилище",      	СтрокиНайденые[0].Хранилище);
						
					КонецЕсли;
					
					СообщеняСоСтатусамиДляОтправкиНоменклатура.Добавить(СообщениеОтправки);
					
				КонецЦикла;
				
				СообщенияНоменклатуры = Новый Структура("ИнициаторОтправки, НоменклатураОтправки");
				СообщенияНоменклатуры.Вставить("ИнициаторОтправки", СверткаДокумент.Документ);
				СообщенияНоменклатуры.Вставить("НоменклатураОтправки", СообщеняСоСтатусамиДляОтправкиНоменклатура); 
				НоменклатураДляОтправки.Добавить(СообщенияНоменклатуры);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЗапросДляОтправкиНоменклатура = Новый Запрос("ВЫБРАТЬ * ИЗ ВТСообщеняСоСтатусамиДляОтправкиНоменклатура"); 
	ЗапросДляОтправкиНоменклатура.МенеджерВременныхТаблиц = МВТ;
	НоменклатураСтатус = ЗапросДляОтправкиНоменклатура.Выполнить().Выгрузить();

	ЗапросДляОтправкиДокументов = Новый Запрос("ВЫБРАТЬ * ИЗ ВТСообщеняСоСтатусамиДляОтправкиДокументов");
	
	ЗапросДляОтправкиДокументов.МенеджерВременныхТаблиц = МВТ;
	
	ВыгрузкаДокументы = ЗапросДляОтправкиДокументов.Выполнить().Выгрузить();
	
	СообщеняСоСтатусамиДляОтправкиДокументов = Новый Массив;
	
	Для каждого СтрокаВыгрузки Из ВыгрузкаДокументы Цикл
		
		ОтправкаПодтверждена = Истина;
		НайденыеСтроки = НоменклатураСтатус.НайтиСтроки(Новый Структура("Документ", СтрокаВыгрузки.СсылкаНаОбъект));
		Если НайденыеСтроки.Количество() > 0 Тогда
			Для каждого НайденаяСтрока Из НайденыеСтроки Цикл  				
				Если НайденаяСтрока.СтатусСообщения <> ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.ОтправкаПодтверждена") Тогда  
					ОтправкаПодтверждена = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;  
					
		Если СтрокаВыгрузки.СтатусСообщения = Перечисления.спСтатусыСообщений.ВОбработке Тогда 	
			ВремяСНачалаОбработки = ТекущаяДатаСеанса() - СтрокаВыгрузки.ДатаРегистрации;
			Если ВремяСНачалаОбработки < 3 * 60 Тогда  
				ОтправкаПодтверждена = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ОтправкаПодтверждена Тогда 
			Продолжить;
		КонецЕсли;
		
		СообщениеОтправки = Новый Структура;
		СообщениеОтправки.Вставить("ИдентификаторСобытия", СтрокаВыгрузки.ИдентификаторСобытия);
		СообщениеОтправки.Вставить("ДатаРегистрации", СтрокаВыгрузки.ДатаРегистрации);
		СообщениеОтправки.Вставить("ФорматСообщения", СтрокаВыгрузки.ФорматСообщения);
		СообщениеОтправки.Вставить("МетодХранения", СтрокаВыгрузки.МетодХранения);
		СообщениеОтправки.Вставить("ОбъектСобытия",  СтрокаВыгрузки.ОбъектСобытия);
		СообщениеОтправки.Вставить("СсылкаНаОбъект", СтрокаВыгрузки.СсылкаНаОбъект);
		СообщениеОтправки.Вставить("СпособПередачи", СтрокаВыгрузки.СпособПередачи);
		СообщениеОтправки.Вставить("ИнициаторОтправкиСсылкаНаОбъект", СтрокаВыгрузки.ИнициаторОтправкиСсылкаНаОбъект);
		СообщениеОтправки.Вставить("СтатусСообщения", СтрокаВыгрузки.СтатусСообщения);
		СообщениеОтправки.Вставить("ОписаниеДанных", СтрокаВыгрузки.ОписаниеДанных); 
		СообщениеОтправки.Вставить("Хранилище",      СтрокаВыгрузки.Хранилище);  

		СообщеняСоСтатусамиДляОтправкиДокументов.Добавить(СообщениеОтправки);
		
	КонецЦикла;
	
	СообщеняОтправки = Новый Структура("СообщеняНоменклатура, СообщеняДокументов");
	СообщеняОтправки.Вставить("СообщеняНоменклатура", НоменклатураДляОтправки);
	СообщеняОтправки.Вставить("СообщеняДокументов", СообщеняСоСтатусамиДляОтправкиДокументов);
 	Возврат СообщеняОтправки;
	
КонецФункции 

&НаСервере
Функция СериализоватьВJSON(Значение)
    
    Настройки = Новый НастройкиСериализацииJSON();
    Настройки.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
    Настройки.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
    
    ЗаписьJSON = Новый ЗаписьJSON;
    ЗаписьJSON.УстановитьСтроку();
    ЗаписатьJSON(ЗаписьJSON, Значение, Настройки);
    СтрокаJSON = ЗаписьJSON.Закрыть();
    
    Возврат СтрокаJSON;
    
КонецФункции

&НаСервере
Функция ПроверитьСтатусНоменклатуры(ТекущийДокумент)
	СтатусыСообщений = Неопределено; 
	
	СообщенияВыгрузка = Объект.Сообщения.Выгрузить(,"СсылкаНаОбъектДокумент, СтатусСообщенияНоменклатура");
	СообщенияВыгрузка.Свернуть("СсылкаНаОбъектДокумент, СтатусСообщенияНоменклатура");
	
	ПоискСтатусаОшибкаОтправки = Новый Структура(); 
	ПоискСтатусаОшибкаОтправки.Вставить("СсылкаНаОбъектДокумент", ТекущийДокумент);
	ПоискСтатусаОшибкаОтправки.Вставить("СтатусСообщенияНоменклатура", Перечисления.спСтатусыСообщений.ОшибкаОтправки);  

	ПоискСтатусаОшибкаОбработки = Новый Структура(); 
	ПоискСтатусаОшибкаОбработки.Вставить("СсылкаНаОбъектДокумент", ТекущийДокумент);
	ПоискСтатусаОшибкаОбработки.Вставить("СтатусСообщенияНоменклатура", Перечисления.спСтатусыСообщений.ОшибкаОбработки);

	ПоискСтатусаНовое = Новый Структура(); 
	ПоискСтатусаНовое.Вставить("СсылкаНаОбъектДокумент", ТекущийДокумент);
	ПоискСтатусаНовое.Вставить("СтатусСообщенияНоменклатура", Перечисления.спСтатусыСообщений.Новое);  

	ПоискСтатусаОтправлено = Новый Структура(); 
	ПоискСтатусаОтправлено.Вставить("СсылкаНаОбъектДокумент", ТекущийДокумент);
	ПоискСтатусаОтправлено.Вставить("СтатусСообщенияНоменклатура", Перечисления.спСтатусыСообщений.Отправлено);   
	
	ПоискСтатусаОтправкаПодтверждена = Новый Структура(); 
	ПоискСтатусаОтправкаПодтверждена.Вставить("СсылкаНаОбъектДокумент", ТекущийДокумент);
	ПоискСтатусаОтправкаПодтверждена.Вставить("СтатусСообщенияНоменклатура", Перечисления.спСтатусыСообщений.ОтправкаПодтверждена);  
	
	ПоискСтатусаНеВалидно = Новый Структура(); 
	ПоискСтатусаНеВалидно.Вставить("СсылкаНаОбъектДокумент", ТекущийДокумент);
	ПоискСтатусаНеВалидно.Вставить("СтатусСообщенияНоменклатура", Перечисления.спСтатусыСообщений.НеВалидно); 
	
	ПоискСтатусаОшибкаПодтверждения = Новый Структура(); 
	ПоискСтатусаОшибкаПодтверждения.Вставить("СсылкаНаОбъектДокумент", ТекущийДокумент);
	ПоискСтатусаОшибкаПодтверждения.Вставить("СтатусСообщенияНоменклатура", Перечисления.спСтатусыСообщений.ОшибкаПодтверждения);  
	
	ПоискСтатусаОжиданиеОбработки = Новый Структура(); 
	ПоискСтатусаОжиданиеОбработки.Вставить("СсылкаНаОбъектДокумент", ТекущийДокумент);
	ПоискСтатусаОжиданиеОбработки.Вставить("СтатусСообщенияНоменклатура", Перечисления.спСтатусыСообщений.ОжиданиеОбработки); 
	
	ПоискСтатусаВОбработке = Новый Структура(); 
	ПоискСтатусаВОбработке.Вставить("СсылкаНаОбъектДокумент", ТекущийДокумент);
	ПоискСтатусаВОбработке.Вставить("СтатусСообщенияНоменклатура", Перечисления.спСтатусыСообщений.ВОбработке);
	
	НайденыеСтрокиСтатусаОжиданиеОбработки = СообщенияВыгрузка.НайтиСтроки(ПоискСтатусаОжиданиеОбработки);
	Если НайденыеСтрокиСтатусаОжиданиеОбработки.Количество() > 0 Тогда
		Возврат Перечисления.спСтатусыСообщений.ОшибкаОбработки; 
	КонецЕсли; 
	
	НайденыеСтрокиСтатусаВОбработке = СообщенияВыгрузка.НайтиСтроки(ПоискСтатусаВОбработке);
	Если НайденыеСтрокиСтатусаВОбработке.Количество() > 0 Тогда
		Возврат Перечисления.спСтатусыСообщений.ВОбработке; 
	КонецЕсли; 

	
	НайденыеСтрокиСтатусОшибкаОтправки = СообщенияВыгрузка.НайтиСтроки(ПоискСтатусаОшибкаОтправки);
	Если НайденыеСтрокиСтатусОшибкаОтправки.Количество() > 0 Тогда
		Возврат Перечисления.спСтатусыСообщений.ОшибкаОтправки; 
	КонецЕсли; 
	
	НайденыеСтрокиСтатусОшибкаОбработки = СообщенияВыгрузка.НайтиСтроки(ПоискСтатусаОшибкаОбработки);
	Если НайденыеСтрокиСтатусОшибкаОбработки.Количество() > 0 Тогда
		Возврат Перечисления.спСтатусыСообщений.ОшибкаОбработки; 
	КонецЕсли;  
	
	НайденыеСтрокиСтатусНовое = СообщенияВыгрузка.НайтиСтроки(ПоискСтатусаНовое);
	Если НайденыеСтрокиСтатусНовое.Количество() > 0 Тогда
		Возврат Перечисления.спСтатусыСообщений.Новое; 
	КонецЕсли; 
	
	НайденыеСтрокиСтатусОтправлено = СообщенияВыгрузка.НайтиСтроки(ПоискСтатусаОтправлено);
	Если НайденыеСтрокиСтатусОтправлено.Количество() > 0 Тогда
		Возврат Перечисления.спСтатусыСообщений.Отправлено;
	КонецЕсли; 
	
	НайденыеСтрокиСтатусОтправкаПодтверждена = СообщенияВыгрузка.НайтиСтроки(ПоискСтатусаОтправкаПодтверждена);
	Если НайденыеСтрокиСтатусОтправкаПодтверждена.Количество() > 0 Тогда
		Возврат Перечисления.спСтатусыСообщений.ОтправкаПодтверждена; 
	КонецЕсли;  
	
	НайденыеСтрокиСтатусНеВалидно = СообщенияВыгрузка.НайтиСтроки(ПоискСтатусаНеВалидно);
	Если НайденыеСтрокиСтатусНеВалидно.Количество() > 0 Тогда
		Возврат Перечисления.спСтатусыСообщений.НеВалидно; 
	КонецЕсли; 

	НайденыеСтрокиСтатусОшибкаПодтверждения = СообщенияВыгрузка.НайтиСтроки(ПоискСтатусаОшибкаПодтверждения);
	Если НайденыеСтрокиСтатусОшибкаПодтверждения.Количество() > 0 Тогда
		Возврат Перечисления.спСтатусыСообщений.ОшибкаПодтверждения; 
	КонецЕсли;
	
	Возврат СтатусыСообщений;
КонецФункции

&НаКлиенте
Процедура ОбновитьСтатусы(Команда)
	Состояние("Подождите. Идет обработка");  
	ИменаФайлов = ПолучитьИменаФайловДляПодтверждения();
	спСервисИнтеграцииКлиент.ПроверитьОбработкуСообщенийНоменклатуры(ИменаФайлов);
	СообщеняОтправки = ОбновитьСтатусыНаСервере(); 
	
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ДокументыНомерСтроки;
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьСтатусыПроверитьОбработкуСообщений()  
	Если АвтоматическоеОбновление Тогда
		
		Состояние("Подождите. Идет обработка");
		
		Если Элементы.ГруппаОбновления.ЦветФона = WebЦвета.Красный Тогда 
			Элементы.ГруппаОбновления.ЦветФона = Новый Цвет();
		Иначе 
			Элементы.ГруппаОбновления.ЦветФона = WebЦвета.Красный; 
		КонецЕсли;
		ИменаФайлов = ПолучитьИменаФайловДляПодтверждения();
		спСервисИнтеграцииКлиент.ПроверитьОбработкуСообщенийНоменклатуры(ИменаФайлов);
		
		СообщеняОтправки = ОбновитьСтатусыНаСервере(); 
		АвтоматическаяОтправкаСообщенийНоменклатурыДокументов(СообщеняОтправки); 
		
		ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ДокументыНомерСтроки;
	КонецЕсли; 	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщенияНоменклатура(Команда) 
	
	Состояние("Подождите. Идет обработка"); 

	Если ТипЗнч(СообщеняОтправки.СообщеняНоменклатура) = Тип("Массив") И СообщеняОтправки.СообщеняНоменклатура.Количество() > 0 Тогда
		
		Для каждого СтрокаСообщения Из СообщеняОтправки.СообщеняНоменклатура Цикл
			
			СтрокиПоиска = Объект.Документы.НайтиСтроки(Новый Структура("СсылкаНаОбъектДокумент", СтрокаСообщения.ИнициаторОтправки));
			Если СтрокиПоиска.Количество() > 0 Тогда  
				Если НЕ СтрокиПоиска[0].Флажек Тогда  
					Продолжить;
				КонецЕсли; 
			Иначе 
				Продолжить;
			КонецЕсли;
			спСервисИнтеграцииКлиент.ОтправитьСообщениеНоменклатурыПоsFTP(СтрокаСообщения.НоменклатураОтправки);
		КонецЦикла;
	КонецЕсли;
	
	СообщеняОтправки = ОбновитьСтатусыНаСервере(); 
	
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ДокументыНомерСтроки;
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщенияДокумент(Команда)  	
	СообщеняДокументов = Новый Массив;
	
	Состояние("Подождите. Идет обработка"); 
	
	Если ТипЗнч(СообщеняОтправки.СообщеняДокументов) = Тип("Массив") И СообщеняОтправки.СообщеняДокументов.Количество() > 0 Тогда  
		
		Для каждого СтрокаСообщения Из СообщеняОтправки.СообщеняДокументов Цикл
			
			СтрокиПоиска = Объект.Документы.НайтиСтроки(Новый Структура("СсылкаНаОбъектДокумент", СтрокаСообщения.СсылкаНаОбъект));
			Если СтрокиПоиска.Количество() > 0 Тогда  
				Если НЕ СтрокиПоиска[0].Флажек Тогда  
					Продолжить;  
				Иначе 
					СообщеняДокументов.Добавить(СтрокаСообщения);	
				КонецЕсли; 
			Иначе 
				Продолжить;
			КонецЕсли;
		КонецЦикла;    
		спСервисИнтеграцииКлиент.ОтправитьСообщениеДокументовПоsFTP(СообщеняДокументов);
	КонецЕсли;

	СообщеняОтправки = ОбновитьСтатусыНаСервере(); 
	
	ЭтаФорма.ТекущийЭлемент = ЭтаФорма.Элементы.ДокументыНомерСтроки;
КонецПроцедуры

&НаКлиенте
Процедура ТипОбъектаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка = ЛОЖЬ;
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Тип("ДокументСсылка.ПриходнаяНакладная"),"Приходная накладная");
	ДанныеВыбора.Добавить(Тип("ДокументСсылка.ПеремещениеЗапасов"),"Перемещение запасов");	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)  
	Если Элемент.ТекущийЭлемент <> Неопределено И Элемент.ТекущийЭлемент.Имя = "ДокументыФлажек" Тогда  
		Возврат;
		
	ИначеЕсли  Элемент.ТекущийЭлемент <> Неопределено И Элемент.ТекущийЭлемент.Имя = "ДокументыТекстоваяИнформацияОшибки" Тогда 
		
		Информация = Элементы.Документы.ТекущиеДанные.Информация;
		ПараметрыВвода = Новый Структура("Информация, Документ");
		ПараметрыВвода.Вставить("Информация", Информация); 
		ПараметрыВвода.Вставить("Документ", Истина);
		
		ОткрытьФорму("Обработка.спОтправкаСообщений.Форма.ОтображениеИнформации", ПараметрыВвода,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе 
		
		СтандартнаяОбработка = Ложь;
		ТекущаяСтрока = Элементы.Документы.ТекущиеДанные;
		Если ТипЗнч(ТекущаяСтрока) = Тип("ДанныеФормыЭлементКоллекции") Тогда 
			
			ТекущийДокумент = ТекущаяСтрока.СсылкаНаОбъектДокумент; 
			СообщенийНоменклатуры = ТекущаяСтрока.СообщенийНоменклатуры;
			
			Если СообщенийНоменклатуры > 0 И ЗначениеЗаполнено(ТекущийДокумент) Тогда 
				Номенклатура = ПолучитьНоменклатуруПоТекущемуДокументу(ТекущийДокумент);
				ПараметрыВвода = Новый Структура("Номенклатура", Номенклатура);
				ОткрытьФорму("Обработка.спОтправкаСообщений.Форма.НоменклатурыДокумента", ПараметрыВвода,,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьНоменклатуруПоТекущемуДокументу(ТекущийДокумент) 
	Номенклатура = Новый Массив;
	НайденыеСтроки = Объект.Сообщения.НайтиСтроки(Новый Структура("СсылкаНаОбъектДокумент", ТекущийДокумент));
	Если НайденыеСтроки.Количество() > 0 Тогда
		Для каждого НайденаяСтрока  Из НайденыеСтроки Цикл 
			Строка = Новый Структура;
			Строка.Вставить("СсылкаНаОбъектДокумент", 					НайденаяСтрока.СсылкаНаОбъектДокумент); 
			Строка.Вставить("ДатаИзмененияСтатусСообщенияНоменклатура",	НайденаяСтрока.ДатаРегистрацииНоменклатура);
			Строка.Вставить("СсылкаНаОбъектНоменклатура", 				НайденаяСтрока.СсылкаНаОбъектНоменклатура);
			Строка.Вставить("СтатусСообщенияНоменклатура",				НайденаяСтрока.СтатусСообщенияНоменклатура);
			Строка.Вставить("Статус",									НайденаяСтрока.Статус);
			Строка.Вставить("Информация",                               НайденаяСтрока.Информация);
		
			Номенклатура.Добавить(Строка);
		КонецЦикла;	
	КонецЕсли; 
	Возврат Номенклатура;
КонецФункции	

&НаСервере
Функция ПолучитьИменаФайловДляПодтверждения()
    ИменаФайлов = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тбОчередь.ИмяФайла КАК ИмяФайла,
		|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	тбОчередь.ОбъектСобытия КАК ОбъектСобытия,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
		|			И (тбСостояние.СтатусСообщения = &СтатусСообщения)
		|			И (тбОчередь.СпособПередачи = &СпособПередачи)
		|ГДЕ
		|	НЕ тбОчередь.ЭтоУдаление";
	
	Запрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса())); 
	Запрос.УстановитьПараметр("СтатусСообщения", Перечисления.спСтатусыСообщений.Отправлено);
	Запрос.УстановитьПараметр("СпособПередачи", Перечисления.спСпособПередачи.FTP);

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Если НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИмяФайла) ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ИдентификаторСобытия) 
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.СсылкаНаОбъект) Тогда  
			Продолжить; 
		КонецЕсли;
		СообщенияДляПодтверждения = Новый Структура;  
		СообщенияДляПодтверждения.Вставить("ИмяФайла", ВыборкаДетальныеЗаписи.ИмяФайла);
        СообщенияДляПодтверждения.Вставить("ИдентификаторСобытия", ВыборкаДетальныеЗаписи.ИдентификаторСобытия);
		СообщенияДляПодтверждения.Вставить("ОбъектСобытия", ВыборкаДетальныеЗаписи.ОбъектСобытия);
		СообщенияДляПодтверждения.Вставить("СсылкаНаОбъект", ВыборкаДетальныеЗаписи.СсылкаНаОбъект);
		ИменаФайлов.Добавить(СообщенияДляПодтверждения);
	КонецЦикла;

	Возврат ИменаФайлов;
КонецФункции

&НаКлиенте
Процедура ИнтервалОбновленияСтатусовПриИзменении(Элемент)
	Если ИнтервалОбновленияСтатусов < 1 Тогда 
		ИнтервалОбновленияСтатусов = 1;	
	КонецЕсли;  	
	ИзменитьЗначениеКонстантыИнтервалОбновленияСтатусов(ИнтервалОбновленияСтатусов); 
	
	ПодключитьОбработкуСообщений();
КонецПроцедуры

&НаСервере
Процедура ИзменитьЗначениеКонстантыИнтервалОбновленияСтатусов(Интервал)	
	Константы.спОтправкаСообщенийИнтервалОбновленияСтатусов.Установить(Интервал);
КонецПроцедуры
	
&НаСервере
Функция ПолучитьИнформациюОшибки(Информация) 
	СообщенииеОшибки = "";
	СерилизированаяИнформация = ДесериализоватьИзJSON(Информация);  
	Если ТипЗнч(СерилизированаяИнформация) = Тип("Структура") Тогда 	
		СообщенииеОшибки = ПолучитьДанные(СерилизированаяИнформация);
	КонецЕсли; 
	Возврат СообщенииеОшибки;
КонецФункции 

&НаСервере
Функция ПолучитьДанные(ИнформацияСообщения)
	
	СообщенииеОшибки = "";
	ОшибкиВФайле = Новый Массив;
	
	Если ИнформацияСообщения.Сервис.messageDate = Ложь Тогда 
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Дата сообщения»"));
	КонецЕсли;
	
	Если ИнформацияСообщения.Сервис.messageId = Ложь Тогда 
		ОшибкиВФайле.Добавить( СтрШаблон("%1", "Не задано значение реквизита «Id сообщения»"));
	КонецЕсли;
	
	Если ИнформацияСообщения.Сервис.shop = Ложь Тогда 
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «shop»"));
	КонецЕсли;
	
	Если ИнформацияСообщения.Сервис.token = Ложь Тогда 
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «token»"));
	КонецЕсли;
	
	
	Товары = Новый Массив;
	Для каждого ЭлементТовара Из ИнформацияСообщения.Товары Цикл 
		Ошибка = Ложь;
		Товар = Новый Структура("Гуид, Ean, Количество, Размер, Цена");
		
		Если ЭлементТовара.Гуид = Ложь ИЛИ ЭлементТовара.Ean = Ложь ИЛИ ЭлементТовара.Количество = Ложь 
			ИЛИ ЭлементТовара.Размер = Ложь ИЛИ ЭлементТовара.Цена = Ложь Тогда 
			
			Товар.Вставить("Гуид", 			ЭлементТовара.Гуид);
			Товар.Вставить("Ean", 			ЭлементТовара.Ean); 
			Товар.Вставить("Количество", 	ЭлементТовара.Количество); 
			Товар.Вставить("Размер", 		ЭлементТовара.Размер);
			Товар.Вставить("Цена", 			ЭлементТовара.Цена);
			Ошибка = Истина;
		КонецЕсли;  
		
		Если Ошибка Тогда 
			Товары.Добавить(Товар);
			ОшибкаФайла = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Товары.Количество() > 0 Тогда
		
		Для каждого ЭлементТовары Из Товары Цикл
			Если ЭлементТовары.Гуид = Ложь ИЛИ ЭлементТовары.Ean = Ложь ИЛИ ЭлементТовары.Количество = Ложь ИЛИ ЭлементТовары.Размер = Ложь ИЛИ ЭлементТовары.Цена = Ложь Тогда				
				
				Если ЭлементТовары.Гуид = Ложь Тогда 
					ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Номенклатура»"));
				КонецЕсли;
				
				Если ЭлементТовары.Ean  = Ложь Тогда 
					ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Ean"));
				КонецЕсли;
				
				Если ЭлементТовары.Количество = Ложь Тогда 
					ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Количество»"));
				КонецЕсли;
				
				Если ЭлементТовары.Размер = Ложь Тогда 
					ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Размер»"));
				КонецЕсли;
				
				Если ЭлементТовары.Цена = Ложь Тогда 
					ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Цена»"));
				КонецЕсли;
				
			КонецЕсли;
						
		КонецЦикла;	
	КонецЕсли;
	
	Если ОшибкиВФайле.Количество() > 0 Тогда 
		ОшибкиВФайлеБезДублей = УдалитьПовторяющиесяЭлементыМассива(ОшибкиВФайле);
		СообщенииеОшибки = ВывестиЭлементыМассиваВСтроку(ОшибкиВФайлеБезДублей);
	КонецЕсли; 
	
    Возврат СообщенииеОшибки;
КонецФункции

&НаСервере
Функция УдалитьПовторяющиесяЭлементыМассива(Массив) 
	ТекущийИндекс = 0; 
	ВсегоЭлементов = Массив.Количество(); 
	Пока ТекущийИндекс < ВсегоЭлементов Цикл 
		Индекс2 = ТекущийИндекс + 1; 
		Пока Индекс2 < ВсегоЭлементов Цикл 
			Если Массив[Индекс2] = Массив[ТекущийИндекс] Тогда 
				Массив.Удалить(Индекс2); 
				ВсегоЭлементов = ВсегоЭлементов - 1; 
			Иначе 
				Индекс2 = Индекс2 + 1; 
			КонецЕсли; 
		КонецЦикла; 
		ТекущийИндекс = ТекущийИндекс + 1; 
	КонецЦикла;
	
	Возврат Массив; 
КонецФункции 

Функция ВывестиЭлементыМассиваВСтроку(Массив)
	ВыходнаяСтрока = "";
	Разделитель = "; ";
	Для каждого ЭлементМассива Из Массив Цикл
		ВыходнаяСтрока = ВыходнаяСтрока + ?(ПустаяСтрока(ВыходнаяСтрока), "", Разделитель);
		ВыходнаяСтрока = ВыходнаяСтрока + ЭлементМассива;
	КонецЦикла;
	Возврат ВыходнаяСтрока;
КонецФункции

&НаСервере
Функция ДесериализоватьИзJSON(СтрокаJSON, ПоляДата = "")
    
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
    Значение = ПрочитатьJSON(ЧтениеJSON,, ПоляДата, ФорматДатыJSON.ISO);          
    ЧтениеJSON.Закрыть();
    Возврат Значение;
    
КонецФункции 

&НаКлиенте
Процедура ДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПередУдалением(Элемент, Отказ)
	Отказ = Истина;	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПередНачаломИзменения(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура АвтоматическаяОтправкаСообщенийНоменклатурыДокументов(СообщеняОтправки)  	
	СообщеняДокументов = Новый Массив;
	
	Если ТипЗнч(СообщеняОтправки.СообщеняДокументов) = Тип("Массив") И СообщеняОтправки.СообщеняДокументов.Количество() > 0 Тогда  
		
		Для каждого СтрокаСообщения Из СообщеняОтправки.СообщеняДокументов Цикл
			
			СтрокиПоиска = Объект.Документы.НайтиСтроки(Новый Структура("СсылкаНаОбъектДокумент", СтрокаСообщения.СсылкаНаОбъект));
			Если СтрокиПоиска.Количество() > 0 Тогда  
				Если НЕ СтрокиПоиска[0].Флажек Тогда  
					Продолжить;  
				Иначе 
					СообщеняДокументов.Добавить(СтрокаСообщения);	
				КонецЕсли; 
			Иначе 
				Продолжить;
			КонецЕсли;
		КонецЦикла;    
		спСервисИнтеграцииКлиент.ОтправитьСообщениеДокументовПоsFTP(СообщеняДокументов);
	КонецЕсли;

	
	
	
	Если ТипЗнч(СообщеняОтправки.СообщеняНоменклатура) = Тип("Массив") И СообщеняОтправки.СообщеняНоменклатура.Количество() > 0 Тогда
		
		Для каждого СтрокаСообщения Из СообщеняОтправки.СообщеняНоменклатура Цикл
			
			СтрокиПоиска = Объект.Документы.НайтиСтроки(Новый Структура("СсылкаНаОбъектДокумент", СтрокаСообщения.ИнициаторОтправки));
			Если СтрокиПоиска.Количество() > 0 Тогда  
				Если НЕ СтрокиПоиска[0].Флажек Тогда  
					Продолжить;
				КонецЕсли; 
			Иначе 
				Продолжить;
			КонецЕсли;
			спСервисИнтеграцииКлиент.ОтправитьСообщениеНоменклатурыПоsFTP(СтрокаСообщения.НоменклатураОтправки);
		КонецЦикла;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПриАктивизацииЯчейки(Элемент) 
	Если Элемент.ТекущийЭлемент <> Неопределено И Элемент.ТекущийЭлемент.Имя = "ДокументыФлажек" Тогда 
		Элемент.ТекущиеДанные.Флажек = НЕ Элемент.ТекущиеДанные.Флажек; 
		Элементы.Документы.ВыделенныеСтроки.Очистить(); 
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеФлажки(Команда)
	УстановитьВсеФлажкиНаСервере();
КонецПроцедуры 

&НаСервере
Процедура УстановитьВсеФлажкиНаСервере()  
	Для каждого СтрокаДокумент  Из Объект.Документы Цикл
		СтрокаДокумент.Флажек = Истина;
	КонецЦикла;
КонецПроцедуры 


&НаСервере
Процедура СнятьВсеФлажкиНаСервере()
	Для каждого СтрокаДокумент  Из Объект.Документы Цикл
		СтрокаДокумент.Флажек = Ложь;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура СнятьВсеФлажки(Команда)
	СнятьВсеФлажкиНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПолучитьСтатусНаСервере()
	ТаблицаСтатусовСообщений.Очистить();
	
	Запрос = Новый Запрос;

	Если ЗначениеЗаполнено(СсылкаНаОбъект) Тогда    
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
			|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
			|	ПРЕДСТАВЛЕНИЕ(тбОчередь.ИдентификаторСобытия) КАК ИдентификаторСобытияСтрока,
			|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
			|	тбОчередь.СпособПередачи КАК СпособПередачи,
			|	тбСостояние.СтатусСообщения КАК СтатусСообщения,
			|	0 КАК Приоритет,
			|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект
			|ПОМЕСТИТЬ ВТИсходящихСообщений
			|ИЗ
			|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
			|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
			|ГДЕ
			|	тбОчередь.СсылкаНаОбъект = &СсылкаНаОбъект
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
			|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
			|	ПРЕДСТАВЛЕНИЕ(тбОчередь.ИдентификаторСобытия) КАК ИдентификаторСобытияСтрока,
			|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
			|	тбОчередь.СпособПередачи КАК СпособПередачи,
			|	тбСостояние.СтатусСообщения КАК СтатусСообщения,
			|	1 КАК Приоритет,
			|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект
			|ПОМЕСТИТЬ ВТСообщения
			|ИЗ
			|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
			|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
			|			И (тбОчередь.ИнициаторОтправкиСсылкаНаОбъект В
			|				(ВЫБРАТЬ
			|					ВТИсходящихСообщений.СсылкаНаОбъект КАК СсылкаНаОбъект
			|				ИЗ
			|					ВТИсходящихСообщений КАК ВТИсходящихСообщений))
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ВТИсходящихСообщений.ДатаРегистрации,
			|	ВТИсходящихСообщений.ИдентификаторСобытия,
			|	ВТИсходящихСообщений.ИдентификаторСобытияСтрока,
			|	ВТИсходящихСообщений.СсылкаНаОбъект,
			|	ВТИсходящихСообщений.СпособПередачи,
			|	ВТИсходящихСообщений.СтатусСообщения,
			|	ВТИсходящихСообщений.Приоритет,
			|	ВТИсходящихСообщений.ИнициаторОтправкиСсылкаНаОбъект
			|ИЗ
			|	ВТИсходящихСообщений КАК ВТИсходящихСообщений
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТСообщения.ДатаРегистрации КАК ДатаРегистрации,
			|	ВТСообщения.ИдентификаторСобытия КАК ИдентификаторСобытия,
			|	ВТСообщения.ИдентификаторСобытияСтрока КАК ИдентификаторСобытияСтрока,
			|	ВТСообщения.СсылкаНаОбъект КАК СсылкаНаОбъект,
			|	ВТСообщения.СпособПередачи КАК СпособПередачи,
			|	ВТСообщения.СтатусСообщения КАК СтатусСообщения,
			|	ВТСообщения.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект
			|ИЗ
			|	ВТСообщения КАК ВТСообщения
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВТСообщения.Приоритет,
			|	ИнициаторОтправкиСсылкаНаОбъект"; 
			
			Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
			
			
		Иначе 
			Запрос.Текст = 	
			"ВЫБРАТЬ
			|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
			|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
			|	ПРЕДСТАВЛЕНИЕ(тбОчередь.ИдентификаторСобытия) КАК ИдентификаторСобытияСтрока,
			|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
			|	тбОчередь.СпособПередачи КАК СпособПередачи,
			|	тбСостояние.СтатусСообщения КАК СтатусСообщения,
			|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект
			|ИЗ
			|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
			|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
			|
			|УПОРЯДОЧИТЬ ПО
			|	ИнициаторОтправкиСсылкаНаОбъект"; 
			
		КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ТаблицаСтатусовСообщений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи); 
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьСтатус(Команда)
	ПолучитьСтатусНаСервере();
КонецПроцедуры 

&НаСервере
Процедура ОбработатьСообщенияНаСервере() 
	Если ЗначениеЗаполнено(СтатусОтправкиСообщения) Тогда 
		ИзменитьСтатус(); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьСообщения(Команда) 
	Если ТаблицаСтатусовСообщений.Количество() = 0 Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Таблица сообщений не заполнена'"), , , , );  
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СтатусОтправкиСообщения) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Заполните статус сообщения'"), , , , );  
		Возврат;
	КонецЕсли;
	ОбработатьСообщенияНаСервере();
КонецПроцедуры 

&НаСервере
Процедура ИзменитьСтатус()  
	
	СтруктураПоиска = Новый Структура("Флажок", Истина); 
	НайденнаяСтрока = ТаблицаСтатусовСообщений.НайтиСтроки(СтруктураПоиска); 
	Если НайденнаяСтрока.Количество() > 0 Тогда 
		ИдентификаторОтбор = Новый Массив;
		Для каждого СтрокаНайденнаяСтрока Из НайденнаяСтрока Цикл  
			ИдентификаторОтбор.Добавить(СтрокаНайденнаяСтрока.ИдентификаторСобытия);
		КонецЦикла; 
		
		ИзменитьСтатусСообщения(ИдентификаторОтбор); 
		ПолучитьСтатусНаСервере();
	КонецЕсли;
КонецПроцедуры   

&НаСервере
Процедура ИзменитьСтатусСообщения(ИдентификаторОтбор)
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	спСостояниеСообщений.ИдентификаторСобытия КАК ИдентификаторСобытия,
	               |	спСостояниеСообщений.ИдентификаторСообщения КАК ИдентификаторСообщения,
	               |	спСостояниеСообщений.СтатусСообщения КАК СтатусСообщения,
	               |	спСостояниеСообщений.ДатаИзменения КАК ДатаИзменения,
	               |	спСостояниеСообщений.Задержка КАК Задержка,
	               |	спСостояниеСообщений.ЗадержкаЧисло КАК ЗадержкаЧисло,
	               |	спСостояниеСообщений.ИндексПотока КАК ИндексПотока,
	               |	спСостояниеСообщений.НачалоСеанса КАК НачалоСеанса,
	               |	спСостояниеСообщений.НомерСеанса КАК НомерСеанса,
	               |	спСостояниеСообщений.ОписаниеДанных КАК ОписаниеДанных,
	               |	спОчередьИсходящихСообщений.СсылкаНаОбъект КАК СсылкаНаОбъект,
	               |	спОчередьИсходящихСообщений.СпособПередачи КАК СпособПередачи
	               |ИЗ
	               |	РегистрСведений.спСостояниеСообщений КАК спСостояниеСообщений
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спОчередьИсходящихСообщений КАК спОчередьИсходящихСообщений
	               |		ПО спСостояниеСообщений.ИдентификаторСобытия = спОчередьИсходящихСообщений.ИдентификаторСобытия
	               |ГДЕ
	               |	спСостояниеСообщений.ИдентификаторСобытия В(&ИдентификаторОтбор)";  
	Запрос.УстановитьПараметр("ИдентификаторОтбор", ИдентификаторОтбор); 
	Выгрузка = Запрос.Выполнить().Выгрузить();  
	Для каждого СтрокаВыгрузки Из Выгрузка Цикл
	   	МенеджерЗаписи = РегистрыСведений.спСостояниеСообщений.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, СтрокаВыгрузки); 
		МенеджерЗаписи.СтатусСообщения = СтатусОтправкиСообщения; 
		МенеджерЗаписи.Записать();   
		
		СписокСтатусовОчередиИсходящих = спКэшируемыеФункцииВызовСервера.ПоучитьСписокСтатусовОчередиИсходящихСообщений(); 
		Если ОчиститьРегистрОтправленныеСообщения И СписокСтатусовОчередиИсходящих.Найти(СтатусОтправкиСообщения) = Неопределено Тогда 
			 ОчиститьРегистрОтправленныеСообщения(СтрокаВыгрузки.СсылкаНаОбъект, СтрокаВыгрузки.СпособПередачи); 
		 Иначе
			 спРаботаСДаннымиВызовСервера.ПоместитьВОтправленныеСообщения(СтрокаВыгрузки.СсылкаНаОбъект, СтрокаВыгрузки.СпособПередачи);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры   

&НаСервере
Процедура ОчиститьРегистрОтправленныеСообщения(СсылкаНаОбъект, СпособПередачи)  
	НабЗап = РегистрыСведений["спОтправленныеСообщения"].СоздатьНаборЗаписей();
	НабЗап.Отбор["СсылкаНаОбъект"].Установить(СсылкаНаОбъект); 
	НабЗап.Отбор["СпособПередачи"].Установить(СпособПередачи);
	
	НабЗап.Записать(); 	
КонецПроцедуры

&НаСервере
Процедура ОчиститьРегистрОчередьИсходящихСообщений(ИдентификаторСобытия)  
	НабЗап = РегистрыСведений["спОчередьИсходящихСообщений"].СоздатьНаборЗаписей();
	НабЗап.Отбор["ИдентификаторСобытия"].Установить(ИдентификаторСобытия); 
	
	НабЗап.Записать(); 	
КонецПроцедуры


&НаСервере
Процедура ОчиститьРегистрСостояниеСообщений(ИдентификаторСобытия)  
	НабЗап = РегистрыСведений["спСостояниеСообщений"].СоздатьНаборЗаписей();
	НабЗап.Отбор["ИдентификаторСобытия"].Установить(ИдентификаторСобытия); 
	
	НабЗап.Записать(); 	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаОбработкаСообщенийПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если ТекущаяСтраница.Заголовок = "Статусы" Тогда 
		ОчиститьРегистрОтправленныеСообщения = Истина;
		ОчиститьРегистрОтправленныеСообщенияПриУдалении = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеТаблицаСтатусовСообщений(Команда)
	Для каждого СтрокаТаблицаСтатусовСообщений из ТаблицаСтатусовСообщений цикл
		СтрокаТаблицаСтатусовСообщений.Флажок = истина;
	Конеццикла
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеТаблицаСтатусовСообщений(Команда)
	Для каждого СтрокаТаблицаСтатусовСообщений из ТаблицаСтатусовСообщений цикл
		СтрокаТаблицаСтатусовСообщений.Флажок = Ложь;
	Конеццикла
КонецПроцедуры

&НаСервере
Функция ТаблицаИнициаторыОтправкиПриИзмененииНаСервере(СсылкаНаОбъект) 
	
	ПараметрСпособПередачи = Перечисления.спСпособПередачи.FTP;	
	
	ТекущиеДанные = Новый Структура("ДатаРегистрации, ИдентификаторСобытия, ИдентификаторСобытияСтрока, СсылкаНаОбъект, СпособПередачи, СтатусСообщения");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	ПРЕДСТАВЛЕНИЕ(тбОчередь.ИдентификаторСобытия) КАК ИдентификаторСобытияСтрока,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.СпособПередачи КАК СпособПередачи,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|ГДЕ
		|	тбОчередь.СсылкаНаОбъект = &СсылкаНаОбъект
		|	И тбОчередь.СпособПередачи = &СпособПередачи";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект); 
	Запрос.УстановитьПараметр("СпособПередачи", ПараметрСпособПередачи);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекущиеДанные.Вставить("ДатаРегистрации", ВыборкаДетальныеЗаписи.ДатаРегистрации);
		ТекущиеДанные.Вставить("ИдентификаторСобытия", ВыборкаДетальныеЗаписи.ИдентификаторСобытия );
		ТекущиеДанные.Вставить("ИдентификаторСобытияСтрока", ВыборкаДетальныеЗаписи.ИдентификаторСобытияСтрока );
		ТекущиеДанные.Вставить("СсылкаНаОбъект", ВыборкаДетальныеЗаписи.СсылкаНаОбъект );
		ТекущиеДанные.Вставить("СпособПередачи", ВыборкаДетальныеЗаписи.СпособПередачи );
		ТекущиеДанные.Вставить("СтатусСообщения", ВыборкаДетальныеЗаписи.СтатусСообщения );
	КонецЦикла;
	
	Возврат ТекущиеДанные;
КонецФункции

&НаКлиенте
Процедура ТаблицаИнициаторыОтправкиПриИзменении(Элемент)
	ТекущиеДанныеТаблицаИнициаторыОтправки = Элементы.ТаблицаИнициаторыОтправки.ТекущиеДанные;
	Если ТекущиеДанныеТаблицаИнициаторыОтправки <> Неопределено И ЗначениеЗаполнено(ТекущиеДанныеТаблицаИнициаторыОтправки.СсылкаНаОбъект) Тогда 
		ТекущиеДанныеИзЗапроса = ТаблицаИнициаторыОтправкиПриИзмененииНаСервере(ТекущиеДанныеТаблицаИнициаторыОтправки.СсылкаНаОбъект); 
		ТекущиеДанныеТаблицаИнициаторыОтправки.ДатаРегистрации 				= ТекущиеДанныеИзЗапроса.ДатаРегистрации;
        ТекущиеДанныеТаблицаИнициаторыОтправки.ИдентификаторСобытия 		= ТекущиеДанныеИзЗапроса.ИдентификаторСобытия;
		ТекущиеДанныеТаблицаИнициаторыОтправки.ИдентификаторСобытияСтрока 	= ТекущиеДанныеИзЗапроса.ИдентификаторСобытияСтрока;
		ТекущиеДанныеТаблицаИнициаторыОтправки.СпособПередачи 				= ТекущиеДанныеИзЗапроса.СпособПередачи;
		ТекущиеДанныеТаблицаИнициаторыОтправки.СтатусСообщения 				= ТекущиеДанныеИзЗапроса.СтатусСообщения;
	КонецЕсли;
	
	ПроверитьВозможностьОтправкиТаблицаИнициаторыОтправкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтекстноеПодменюЗаполнитьТаблицуПодчиненныеНаОснованииНаСервере(СсылкаНаОбъект)

	ПараметрСпособПередачи = Перечисления.спСпособПередачи.FTP;		
	
	Если ЗначениеЗаполнено(СсылкаНаОбъект) И ЗначениеЗаполнено(ПараметрСпособПередачи) Тогда  
		
		НоваяТаблицаПодчиненныеСообщения = ТаблицаПодчиненныеСообщения.Выгрузить(, "ДатаРегистрации, ИдентификаторСобытия, ИдентификаторСобытияСтрока, СсылкаНаОбъект, СпособПередачи, СтатусСообщения, ИнициаторОтправкиСсылкаНаОбъект"); 
		
		Для каждого СтрокаТаблицаПодчиненныеСообщения Из ТаблицаПодчиненныеСообщения Цикл
		    Если СтрокаТаблицаПодчиненныеСообщения.СсылкаНаОбъект <> СсылкаНаОбъект Тогда   
				НоваяСтрока = НоваяТаблицаПодчиненныеСообщения.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицаПодчиненныеСообщения); 
			КонецЕсли;
		КонецЦикла;
		
		ТаблицаПодчиненныеСообщения.Очистить(); 
		ТаблицаПодчиненныеСообщения.Загрузить(НоваяТаблицаПодчиненныеСообщения);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	ПРЕДСТАВЛЕНИЕ(тбОчередь.ИдентификаторСобытия) КАК ИдентификаторСобытияСтрока,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.СпособПередачи КАК СпособПередачи,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения,
		|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|			И (тбОчередь.ИнициаторОтправкиСсылкаНаОбъект = &СсылкаНаОбъект)"; 
		
		Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
		Запрос.УстановитьПараметр("СпособПередачи", ПараметрСпособПередачи);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НоваяСтрока = ТаблицаПодчиненныеСообщения.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи); 
		КонецЦикла; 
		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура КонтекстноеПодменюЗаполнитьТаблицуПодчиненныеНаОсновании(Команда)  
	ТекущиеДанныеТаблицаИнициаторыОтправки = Элементы.ТаблицаИнициаторыОтправки.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанныеТаблицаИнициаторыОтправки.СсылкаНаОбъект) Тогда 
		КонтекстноеПодменюЗаполнитьТаблицуПодчиненныеНаОснованииНаСервере(ТекущиеДанныеТаблицаИнициаторыОтправки.СсылкаНаОбъект);  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеТаблицаИнициаторыОтправки(Команда)
	Для каждого СтрокаТаблицаИнициаторыОтправки из ТаблицаИнициаторыОтправки цикл
		СтрокаТаблицаИнициаторыОтправки.Флажок = Ложь;
	Конеццикла
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеТаблицаИнициаторыОтправки(Команда)
	Для каждого СтрокаТаблицаИнициаторыОтправки из ТаблицаИнициаторыОтправки цикл
		СтрокаТаблицаИнициаторыОтправки.Флажок = истина;
	Конеццикла
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеТаблицаПодчиненныеСообщения(Команда)
	Для каждого СтрокаТаблицаПодчиненныеСообщения из ТаблицаПодчиненныеСообщения цикл
		СтрокаТаблицаПодчиненныеСообщения.Флажок = Ложь;
	Конеццикла
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеТаблицаПодчиненныеСообщения(Команда)
	Для каждого СтрокаТаблицаПодчиненныеСообщения из ТаблицаПодчиненныеСообщения цикл
		СтрокаТаблицаПодчиненныеСообщения.Флажок = истина;
	Конеццикла
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеТаблицаПодчиненныеСообщения(Команда)
	Состояние("Подождите. Идет обработка"); 
	
	СообщеняДляОтправки = ПолучитьДанныеДляОтправкиИзТаблицыПодчиненныеСообщения(); 
	Для каждого СтрокаСообщеняДляОтправки Из СообщеняДляОтправки Цикл
		
		Если ТипЗнч(СтрокаСообщеняДляОтправки.НоменклатураОтправки) = Тип("Массив") И СтрокаСообщеняДляОтправки.НоменклатураОтправки.Количество() > 0 Тогда	
			спСервисИнтеграцииКлиент.ОтправитьСообщениеНоменклатурыПоsFTP(СтрокаСообщеняДляОтправки.НоменклатураОтправки);
		КонецЕсли;
	КонецЦикла;

	
	ОбновитьДанныеТаблицаПодчиненныеСообщения();
КонецПроцедуры  

&НаСервере
Функция ПолучитьДанныеДляОтправкиИзТаблицыПодчиненныеСообщения() 
	
	ТаблицаПодчиненные = ТаблицаПодчиненныеСообщения.Выгрузить(, "СсылкаНаОбъект"); 
	ТаблицаПодчиненные.Очистить(); 
	
	Для каждого СтрокаТаблицаПодчиненныеСообщения Из ТаблицаПодчиненныеСообщения Цикл
		Если СтрокаТаблицаПодчиненныеСообщения.Флажок Тогда  
			 НоваяСтрока = ТаблицаПодчиненные.Добавить();
			 НоваяСтрока.СсылкаНаОбъект = СтрокаТаблицаПодчиненныеСообщения.СсылкаНаОбъект;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПодчиненные.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ПОМЕСТИТЬ ВнутренняяТаблицаПодчиненныеСообщения
		|ИЗ
		|	&ТаблицаПодчиненные КАК ТаблицаПодчиненные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.ФорматСообщения КАК ФорматСообщения,
		|	тбОчередь.МетодХранения КАК МетодХранения,
		|	тбОчередь.ОбъектСобытия КАК ОбъектСобытия,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.СпособПередачи КАК СпособПередачи,
		|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения,
		|	тбСостояние.ОписаниеДанных КАК ОписаниеДанных,
		|	тбОчередь.Хранилище КАК Хранилище
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|ГДЕ
		|	тбОчередь.СсылкаНаОбъект В
		|			(ВЫБРАТЬ
		|				ВнутренняяТаблицаПодчиненныеСообщения.СсылкаНаОбъект КАК СсылкаНаОбъект
		|			ИЗ
		|				ВнутренняяТаблицаПодчиненныеСообщения КАК ВнутренняяТаблицаПодчиненныеСообщения)
		|	И тбОчередь.СпособПередачи = &СпособПередачи";

	
	Запрос.УстановитьПараметр("ТаблицаПодчиненные", ТаблицаПодчиненные); 
	Запрос.УстановитьПараметр("СпособПередачи", Перечисления.спСпособПередачи.FTP); 
	
	ВыгрузкаНоменклатура = Запрос.Выполнить().Выгрузить(); 
	
	СписокСтатусовДляОтправки = спКэшируемыеФункцииВызовСервера.ПоучитьСписокСтатусовДляОтправки(); 
	
	ВыгрузкаНоменклатураПоДокументуСвертка = ВыгрузкаНоменклатура.Скопировать();
	ВыгрузкаНоменклатураПоДокументуСвертка.Свернуть("ИнициаторОтправкиСсылкаНаОбъект", );
	
	ВыгрузкаНоменклатураСвертка = ВыгрузкаНоменклатура.Скопировать();	
	ВыгрузкаНоменклатураСвертка.Свернуть("ИдентификаторСобытия, ФорматСообщения, МетодХранения, ОбъектСобытия, СсылкаНаОбъект, СпособПередачи, ИнициаторОтправкиСсылкаНаОбъект, СтатусСообщения",);
	
	НоменклатураДляОтправки = Новый Массив;
	
	Для каждого СверткаДокумент Из ВыгрузкаНоменклатураПоДокументуСвертка Цикл
		
		НайденыеСтроки = ВыгрузкаНоменклатура.НайтиСтроки(Новый Структура("ИнициаторОтправкиСсылкаНаОбъект", СверткаДокумент.ИнициаторОтправкиСсылкаНаОбъект));
		ОтменаОтправки = Ложь;
		Если НайденыеСтроки.Количество() > 0 Тогда  
			Для каждого НайденаяСтрока Из НайденыеСтроки Цикл  
				
				Если НайденаяСтрока.СтатусСообщения = Перечисления.спСтатусыСообщений.ВОбработке Тогда 	
					ВремяСНачалаОбработки = ТекущаяДатаСеанса() - НайденаяСтрока.ДатаРегистрации;
					Если ВремяСНачалаОбработки < 3 * 60 Тогда  
						ОтменаОтправки = Истина;
					КонецЕсли;
				КонецЕсли;	
				
				Если СписокСтатусовДляОтправки.Найти(НайденаяСтрока.СтатусСообщения) = Неопределено Тогда 
					ОтменаОтправки = Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Если Не ОтменаОтправки Тогда 
			НайденыеСтроки = ВыгрузкаНоменклатураСвертка.НайтиСтроки(Новый Структура("ИнициаторОтправкиСсылкаНаОбъект", СверткаДокумент.ИнициаторОтправкиСсылкаНаОбъект));
			Если НайденыеСтроки.Количество() > 0 Тогда
				
				СообщеняСоСтатусамиДляОтправкиНоменклатура = Новый Массив;
				
				Для каждого НайденаяСтрока Из НайденыеСтроки Цикл
					
					СообщениеОтправки = Новый Структура;
					СообщениеОтправки.Вставить("ИдентификаторСобытия", НайденаяСтрока.ИдентификаторСобытия);
					СообщениеОтправки.Вставить("ФорматСообщения", НайденаяСтрока.ФорматСообщения);
					СообщениеОтправки.Вставить("МетодХранения", НайденаяСтрока.МетодХранения);
					СообщениеОтправки.Вставить("ОбъектСобытия",  НайденаяСтрока.ОбъектСобытия);
					СообщениеОтправки.Вставить("СсылкаНаОбъект", НайденаяСтрока.СсылкаНаОбъект);
					СообщениеОтправки.Вставить("СпособПередачи", НайденаяСтрока.СпособПередачи);
					СообщениеОтправки.Вставить("ИнициаторОтправкиСсылкаНаОбъект", НайденаяСтрока.ИнициаторОтправкиСсылкаНаОбъект);
					СообщениеОтправки.Вставить("СтатусСообщения", НайденаяСтрока.СтатусСообщения); 
					
					
					СтрокиНайденые = ВыгрузкаНоменклатура.НайтиСтроки(Новый Структура("ИдентификаторСобытия", НайденаяСтрока.ИдентификаторСобытия));
					Если СтрокиНайденые.Количество() > 0 Тогда
						СообщениеОтправки.Вставить("ДатаРегистрации", 	СтрокиНайденые[0].ДатаРегистрации);
						СообщениеОтправки.Вставить("ОписаниеДанных", 	СтрокиНайденые[0].ОписаниеДанных); 
						СообщениеОтправки.Вставить("Хранилище",      	СтрокиНайденые[0].Хранилище);
						
					КонецЕсли;
					
					СообщеняСоСтатусамиДляОтправкиНоменклатура.Добавить(СообщениеОтправки);
					
				КонецЦикла;
				
				СообщенияНоменклатуры = Новый Структура("ИнициаторОтправки, НоменклатураОтправки");
				СообщенияНоменклатуры.Вставить("ИнициаторОтправки", СверткаДокумент.ИнициаторОтправкиСсылкаНаОбъект);
				СообщенияНоменклатуры.Вставить("НоменклатураОтправки", СообщеняСоСтатусамиДляОтправкиНоменклатура); 
				НоменклатураДляОтправки.Добавить(СообщенияНоменклатуры);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Возврат НоменклатураДляОтправки;
КонецФункции

&НаСервере
Процедура ПолучитьДанныеТаблицаПодчиненныеСообщенияНаСервере()
	Для каждого СтрокаТаблицаПодчиненныеСообщения Из ТаблицаПодчиненныеСообщения Цикл
		Если СтрокаТаблицаПодчиненныеСообщения.Флажок Тогда
			ОчиститьРегистрОтправленныеСообщения(СтрокаТаблицаПодчиненныеСообщения.СсылкаНаОбъект, СтрокаТаблицаПодчиненныеСообщения.СпособПередачи); 
			ОчиститьРегистрОчередьИсходящихСообщений(СтрокаТаблицаПодчиненныеСообщения.ИдентификаторСобытия); 
			ОчиститьРегистрСостояниеСообщений(СтрокаТаблицаПодчиненныеСообщения.ИдентификаторСобытия);
			Если СтрокаТаблицаПодчиненныеСообщения.СпособПередачи = Перечисления.спСпособПередачи.FTP Тогда 
				спОбработкаСобытийВызовСервера.СериализоватьИЗаписатьДанныеВРегистрСообщений(СтрокаТаблицаПодчиненныеСообщения.СсылкаНаОбъект, СтрокаТаблицаПодчиненныеСообщения.ИнициаторОтправкиСсылкаНаОбъект);
			КонецЕсли;	
		КонецЕсли;
		
		Если СтрокаТаблицаПодчиненныеСообщения.Флажок Тогда
			Если СтрокаТаблицаПодчиненныеСообщения.СпособПередачи = Перечисления.спСпособПередачи.FTP Тогда 
				спОбработкаСобытийВызовСервера.СериализоватьИЗаписатьДанныеВРегистрСообщений(СтрокаТаблицаПодчиненныеСообщения.СсылкаНаОбъект, СтрокаТаблицаПодчиненныеСообщения.ИнициаторОтправкиСсылкаНаОбъект);	
			КонецЕсли;	
		КонецЕсли;
		
	КонецЦикла; 
	
	ОбновитьДанныеТаблицаПодчиненныеСообщения();
	
КонецПроцедуры  

&НаСервере
Процедура ОбновитьДанныеТаблицаПодчиненныеСообщения() 
	
	ПараметрСпособПередачи = Перечисления.спСпособПередачи.FTP;	

	ТаблицаПодчиненные = ТаблицаПодчиненныеСообщения.Выгрузить(, "СсылкаНаОбъект"); 
	ТаблицаПодчиненныеСообщения.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПодчиненные.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ПОМЕСТИТЬ ВнутренняяТаблицаПодчиненныеСообщения
		|ИЗ
		|	&ТаблицаПодчиненные КАК ТаблицаПодчиненные
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	ПРЕДСТАВЛЕНИЕ(тбОчередь.ИдентификаторСобытия) КАК ИдентификаторСобытияСтрока,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.СпособПередачи КАК СпособПередачи,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения,
		|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|ГДЕ
		|	тбОчередь.СсылкаНаОбъект В
		|			(ВЫБРАТЬ
		|				ВнутренняяТаблицаПодчиненныеСообщения.СсылкаНаОбъект КАК СсылкаНаОбъект
		|			ИЗ
		|				ВнутренняяТаблицаПодчиненныеСообщения КАК ВнутренняяТаблицаПодчиненныеСообщения)
		|	И тбОчередь.СпособПередачи = &СпособПередачи";
	
	Запрос.УстановитьПараметр("ТаблицаПодчиненные", ТаблицаПодчиненные); 
	Запрос.УстановитьПараметр("СпособПередачи", ПараметрСпособПередачи);

	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаПодчиненныеСообщения.Загрузить(РезультатЗапроса);
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьДанныеТаблицаПодчиненныеСообщения(Команда)
	ПолучитьДанныеТаблицаПодчиненныеСообщенияНаСервере();
КонецПроцедуры

&НаСервере
Функция ТаблицаПодчиненныеСообщенияПриИзмененииНаСервере(СсылкаНаОбъект)
	ПараметрСпособПередачи = Перечисления.спСпособПередачи.FTP;	
	
	ТекущиеДанные = Новый Структура("ДатаРегистрации, ИдентификаторСобытия, ИдентификаторСобытияСтрока, СсылкаНаОбъект, СпособПередачи, СтатусСообщения, ИнициаторОтправкиСсылкаНаОбъект");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	ПРЕДСТАВЛЕНИЕ(тбОчередь.ИдентификаторСобытия) КАК ИдентификаторСобытияСтрока,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.СпособПередачи КАК СпособПередачи,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения,
		|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|ГДЕ
		|	тбОчередь.СсылкаНаОбъект = &СсылкаНаОбъект
		|	И тбОчередь.СпособПередачи = &СпособПередачи";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект); 
	Запрос.УстановитьПараметр("СпособПередачи", ПараметрСпособПередачи);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекущиеДанные.Вставить("ДатаРегистрации", ВыборкаДетальныеЗаписи.ДатаРегистрации);
		ТекущиеДанные.Вставить("ИдентификаторСобытия", ВыборкаДетальныеЗаписи.ИдентификаторСобытия);
		ТекущиеДанные.Вставить("ИдентификаторСобытияСтрока", ВыборкаДетальныеЗаписи.ИдентификаторСобытияСтрока);
		ТекущиеДанные.Вставить("СсылкаНаОбъект", ВыборкаДетальныеЗаписи.СсылкаНаОбъект);
		ТекущиеДанные.Вставить("СпособПередачи", ВыборкаДетальныеЗаписи.СпособПередачи);
		ТекущиеДанные.Вставить("СтатусСообщения", ВыборкаДетальныеЗаписи.СтатусСообщения); 
		ТекущиеДанные.Вставить("ИнициаторОтправкиСсылкаНаОбъект", ВыборкаДетальныеЗаписи.ИнициаторОтправкиСсылкаНаОбъект);
	КонецЦикла;
	
	Возврат ТекущиеДанные;

КонецФункции

&НаКлиенте
Процедура ТаблицаПодчиненныеСообщенияПриИзменении(Элемент) 
	ТекущиеДанныеТаблицаПодчиненныеСообщения = Элементы.ТаблицаПодчиненныеСообщения.ТекущиеДанные;
	Если ТекущиеДанныеТаблицаПодчиненныеСообщения <> Неопределено И ЗначениеЗаполнено(ТекущиеДанныеТаблицаПодчиненныеСообщения.СсылкаНаОбъект) Тогда 
		ТекущиеДанныеИзЗапроса = ТаблицаПодчиненныеСообщенияПриИзмененииНаСервере(ТекущиеДанныеТаблицаПодчиненныеСообщения.СсылкаНаОбъект); 
		ТекущиеДанныеТаблицаПодчиненныеСообщения.ДатаРегистрации 				= ТекущиеДанныеИзЗапроса.ДатаРегистрации;
        ТекущиеДанныеТаблицаПодчиненныеСообщения.ИдентификаторСобытия 			= ТекущиеДанныеИзЗапроса.ИдентификаторСобытия;
		ТекущиеДанныеТаблицаПодчиненныеСообщения.ИдентификаторСобытияСтрока 	= ТекущиеДанныеИзЗапроса.ИдентификаторСобытияСтрока;
		ТекущиеДанныеТаблицаПодчиненныеСообщения.СпособПередачи 				= ТекущиеДанныеИзЗапроса.СпособПередачи;
		ТекущиеДанныеТаблицаПодчиненныеСообщения.СтатусСообщения 				= ТекущиеДанныеИзЗапроса.СтатусСообщения;
		ТекущиеДанныеТаблицаПодчиненныеСообщения.ИнициаторОтправкиСсылкаНаОбъект 				= ТекущиеДанныеИзЗапроса.ИнициаторОтправкиСсылкаНаОбъект;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПолучитьДанныеТаблицаИнициаторыОтправкиНаСервере()
	Для каждого СтрокаТаблицаИнициаторыОтправки Из ТаблицаИнициаторыОтправки Цикл
		Если СтрокаТаблицаИнициаторыОтправки.Флажок Тогда
			ОчиститьРегистрОтправленныеСообщения(СтрокаТаблицаИнициаторыОтправки.СсылкаНаОбъект, СтрокаТаблицаИнициаторыОтправки.СпособПередачи); 
			ОчиститьРегистрОчередьИсходящихСообщений(СтрокаТаблицаИнициаторыОтправки.ИдентификаторСобытия); 
			ОчиститьРегистрСостояниеСообщений(СтрокаТаблицаИнициаторыОтправки.ИдентификаторСобытия);
			
			Если СтрокаТаблицаИнициаторыОтправки.СпособПередачи = Перечисления.спСпособПередачи.FTP Тогда 
				спОбработкаСобытийВызовСервера.СериализоватьИЗаписатьДанныеВРегистрСообщений(СтрокаТаблицаИнициаторыОтправки.СсылкаНаОбъект);
			КонецЕсли;	
		КонецЕсли;		
	КонецЦикла; 
	
	ОбновитьДанныеТаблицаИнициаторыОтправки();
	ПроверитьВозможностьОтправкиТаблицаИнициаторыОтправкиНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОбновитьДанныеТаблицаИнициаторыОтправки() 
	ПараметрСпособПередачи = Перечисления.спСпособПередачи.FTP;	
	
	ТаблицаИнициаторы = ТаблицаИнициаторыОтправки.Выгрузить(, "СсылкаНаОбъект"); 
	ТаблицаИнициаторыОтправки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаИнициаторы.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ПОМЕСТИТЬ ВнутренняяТаблицаИнициаторыОтправки
		|ИЗ
		|	&ТаблицаИнициаторы КАК ТаблицаИнициаторы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	ПРЕДСТАВЛЕНИЕ(тбОчередь.ИдентификаторСобытия) КАК ИдентификаторСобытияСтрока,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.СпособПередачи КАК СпособПередачи,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|ГДЕ
		|	тбОчередь.СсылкаНаОбъект В
		|			(ВЫБРАТЬ
		|				ВнутренняяТаблицаИнициаторыОтправки.СсылкаНаОбъект КАК СсылкаНаОбъект
		|			ИЗ
		|				ВнутренняяТаблицаИнициаторыОтправки КАК ВнутренняяТаблицаИнициаторыОтправки)
		|	И тбОчередь.СпособПередачи = &СпособПередачи";
	
	Запрос.УстановитьПараметр("ТаблицаИнициаторы", ТаблицаИнициаторы); 
	Запрос.УстановитьПараметр("СпособПередачи", ПараметрСпособПередачи);

	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	ТаблицаИнициаторыОтправки.Загрузить(РезультатЗапроса);
КонецПроцедуры


&НаКлиенте
Процедура ПолучитьДанныеТаблицаИнициаторыОтправки(Команда)
	ПолучитьДанныеТаблицаИнициаторыОтправкиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПроверитьВозможностьОтправкиТаблицаИнициаторыОтправкиНаСервере()
	
    ТаблицаИнициаторы = ТаблицаИнициаторыОтправки.Выгрузить(, "СсылкаНаОбъект");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТаблицаИнициаторы.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ПОМЕСТИТЬ ВнутренняяТаблицаИнициаторыОтправки
		|ИЗ
		|	&ТаблицаИнициаторы КАК ТаблицаИнициаторы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения,
		|	тбОчередь.СпособПередачи КАК СпособПередачи
		|ПОМЕСТИТЬ ВТОтправленныеСообщенияДокумент
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
		|			И (тбОчередь.СпособПередачи = &СпособПередачи)
		|ГДЕ
		|	тбОчередь.СсылкаНаОбъект В
		|			(ВЫБРАТЬ
		|				ВнутренняяТаблицаИнициаторыОтправки.СсылкаНаОбъект КАК СсылкаНаОбъект
		|			ИЗ
		|				ВнутренняяТаблицаИнициаторыОтправки КАК ВнутренняяТаблицаИнициаторыОтправки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект
		|ПОМЕСТИТЬ ВТНеПодтвержденныеОтправленныеСообщения
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
		|			И (тбСостояние.СтатусСообщения <> &СписокСтатусовИсходящихСообщений)
		|			И (тбОчередь.СпособПередачи = &СпособПередачи)
		|ГДЕ
		|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект В
		|			(ВЫБРАТЬ
		|				ВнутренняяТаблицаИнициаторыОтправки.СсылкаНаОбъект КАК СсылкаНаОбъект
		|			ИЗ
		|				ВнутренняяТаблицаИнициаторыОтправки КАК ВнутренняяТаблицаИнициаторыОтправки)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТНеПодтвержденныеОтправленныеСообщения.СсылкаНаОбъект), 0) КАК КоличествоСообщений,
		|	ВТНеПодтвержденныеОтправленныеСообщения.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправки
		|ПОМЕСТИТЬ ВТКоличествоНеподтвержденныхСообщений
		|ИЗ
		|	ВТНеПодтвержденныеОтправленныеСообщения КАК ВТНеПодтвержденныеОтправленныеСообщения
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТНеПодтвержденныеОтправленныеСообщения.ИнициаторОтправкиСсылкаНаОбъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОтправленныеСообщенияДокумент.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТКоличествоНеподтвержденныхСообщений.КоличествоСообщений, 0) = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтправкаПодтверждена
		|ИЗ
		|	ВТОтправленныеСообщенияДокумент КАК ВТОтправленныеСообщенияДокумент
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоНеподтвержденныхСообщений КАК ВТКоличествоНеподтвержденныхСообщений
		|		ПО ВТОтправленныеСообщенияДокумент.СсылкаНаОбъект = ВТКоличествоНеподтвержденныхСообщений.ИнициаторОтправки";
	
	
	Запрос.УстановитьПараметр("СпособПередачи", Перечисления.спСпособПередачи.FTP);
	Запрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса())); 
	Запрос.УстановитьПараметр("СписокСтатусовИсходящихСообщений", Перечисления.спСтатусыСообщений.ОтправкаПодтверждена);
	Запрос.УстановитьПараметр("ТаблицаИнициаторы", ТаблицаИнициаторы); 

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПоиска = Новый Структура("СсылкаНаОбъект", ВыборкаДетальныеЗаписи.СсылкаНаОбъект);
		НайденныеСтроки = ТаблицаИнициаторыОтправки.НайтиСтроки(СтруктураПоиска); 
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			НайденнаяСтрока.ОтправкаНоменклатурыПодтверждена = ВыборкаДетальныеЗаписи.ОтправкаПодтверждена; 
		КонецЦикла;
	КонецЦикла;

	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВозможностьОтправкиТаблицаИнициаторыОтправки(Команда)
	ПроверитьВозможностьОтправкиТаблицаИнициаторыОтправкиНаСервере();
КонецПроцедуры 

&НаСервере
Функция ПолучитьДанныеДляОтправкиИзТаблицаИнициаторыОтправки() 
	 	
	ТаблицаЗапросаИнициаторовОтправки = ТаблицаИнициаторыОтправки.Выгрузить(, "СсылкаНаОбъект"); 
	ТаблицаЗапросаИнициаторовОтправки.Очистить(); 
	
	Для каждого СтрокаТаблицаИнициаторыОтправки Из ТаблицаИнициаторыОтправки Цикл
		Если СтрокаТаблицаИнициаторыОтправки.Флажок Тогда  
			 НоваяСтрока = ТаблицаЗапросаИнициаторовОтправки.Добавить();
			 НоваяСтрока.СсылкаНаОбъект = СтрокаТаблицаИнициаторыОтправки.СсылкаНаОбъект;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЗапросаИнициаторовОтправки.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ПОМЕСТИТЬ ВнутренняяТаблицаИнициаторовОтправкиСообщения
		|ИЗ
		|	&ТаблицаЗапросаИнициаторовОтправки КАК ТаблицаЗапросаИнициаторовОтправки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.ФорматСообщения КАК ФорматСообщения,
		|	тбОчередь.МетодХранения КАК МетодХранения,
		|	тбОчередь.ОбъектСобытия КАК ОбъектСобытия,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.СпособПередачи КАК СпособПередачи,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения,
		|	тбСостояние.ОписаниеДанных КАК ОписаниеДанных,
		|	тбОчередь.Хранилище КАК Хранилище
		|ПОМЕСТИТЬ ВТОтправленныеСообщенияИнициаторОтправки
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|ГДЕ
		|	тбОчередь.СсылкаНаОбъект В
		|			(ВЫБРАТЬ
		|				ВнутренняяТаблицаИнициаторовОтправкиСообщения.СсылкаНаОбъект КАК СсылкаНаОбъект
		|			ИЗ
		|				ВнутренняяТаблицаИнициаторовОтправкиСообщения КАК ВнутренняяТаблицаИнициаторовОтправкиСообщения)
		|	И тбОчередь.СпособПередачи = &СпособПередачи
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект
		|ПОМЕСТИТЬ ВТНеПодтвержденныеОтправленныеСообщения
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
		|			И (тбСостояние.СтатусСообщения <> &СписокСтатусовИсходящихСообщений)
		|			И (тбОчередь.СпособПередачи = &СпособПередачи)
		|ГДЕ
		|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект В
		|			(ВЫБРАТЬ
		|				ВнутренняяТаблицаИнициаторовОтправкиСообщения.СсылкаНаОбъект КАК СсылкаНаОбъект
		|			ИЗ
		|				ВнутренняяТаблицаИнициаторовОтправкиСообщения КАК ВнутренняяТаблицаИнициаторовОтправкиСообщения)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТНеПодтвержденныеОтправленныеСообщения.СсылкаНаОбъект) КАК КоличествоСообщений,
		|	ВТНеПодтвержденныеОтправленныеСообщения.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправки
		|ПОМЕСТИТЬ ВТКоличествоНеподтвержденныхСообщений
		|ИЗ
		|	ВТНеПодтвержденныеОтправленныеСообщения КАК ВТНеПодтвержденныеОтправленныеСообщения
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТНеПодтвержденныеОтправленныеСообщения.ИнициаторОтправкиСсылкаНаОбъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОтправленныеСообщенияИнициаторОтправки.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВТКоличествоНеподтвержденныхСообщений.КоличествоСообщений, 0) = 0
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ОтправкаПодтверждена
		|ПОМЕСТИТЬ ВТИнициаторОтправкиСоСтатусомОтправки
		|ИЗ
		|	ВТОтправленныеСообщенияИнициаторОтправки КАК ВТОтправленныеСообщенияИнициаторОтправки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКоличествоНеподтвержденныхСообщений КАК ВТКоличествоНеподтвержденныхСообщений
		|		ПО ВТОтправленныеСообщенияИнициаторОтправки.СсылкаНаОбъект = ВТКоличествоНеподтвержденныхСообщений.ИнициаторОтправки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТОтправленныеСообщенияИнициаторОтправки.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	ВТОтправленныеСообщенияИнициаторОтправки.ДатаРегистрации КАК ДатаРегистрации,
		|	ВТОтправленныеСообщенияИнициаторОтправки.ФорматСообщения КАК ФорматСообщения,
		|	ВТОтправленныеСообщенияИнициаторОтправки.МетодХранения КАК МетодХранения,
		|	ВТОтправленныеСообщенияИнициаторОтправки.ОбъектСобытия КАК ОбъектСобытия,
		|	ВТОтправленныеСообщенияИнициаторОтправки.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	ВТОтправленныеСообщенияИнициаторОтправки.СпособПередачи КАК СпособПередачи,
		|	ВТОтправленныеСообщенияИнициаторОтправки.СтатусСообщения КАК СтатусСообщения,
		|	ВТОтправленныеСообщенияИнициаторОтправки.ОписаниеДанных КАК ОписаниеДанных,
		|	ВТОтправленныеСообщенияИнициаторОтправки.Хранилище КАК Хранилище,
		|	ВТИнициаторОтправкиСоСтатусомОтправки.ОтправкаПодтверждена КАК ОтправкаПодтверждена
		|ИЗ
		|	ВТОтправленныеСообщенияИнициаторОтправки КАК ВТОтправленныеСообщенияИнициаторОтправки
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТИнициаторОтправкиСоСтатусомОтправки КАК ВТИнициаторОтправкиСоСтатусомОтправки
		|		ПО ВТОтправленныеСообщенияИнициаторОтправки.СсылкаНаОбъект = ВТИнициаторОтправкиСоСтатусомОтправки.СсылкаНаОбъект";
	

	Запрос.УстановитьПараметр("ТаблицаЗапросаИнициаторовОтправки", ТаблицаЗапросаИнициаторовОтправки); 
	Запрос.УстановитьПараметр("СпособПередачи", Перечисления.спСпособПередачи.FTP);
	Запрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса())); 
	Запрос.УстановитьПараметр("СписокСтатусовИсходящихСообщений", Перечисления.спСтатусыСообщений.ОтправкаПодтверждена);

	
	ВыгрузкаИнициаторовОтправки = Запрос.Выполнить().Выгрузить(); 
	
	СписокСтатусовДляОтправки = спКэшируемыеФункцииВызовСервера.ПоучитьСписокСтатусовДляОтправки(); 
	ИнициаторыДляОтправкиСообщеня = Новый Массив;
	
	Для каждого СтрокаИнициаторовОтправки Из ВыгрузкаИнициаторовОтправки Цикл 
		ОтменаОтправки = Ложь;
		
		Если СтрокаИнициаторовОтправки.СтатусСообщения = Перечисления.спСтатусыСообщений.ВОбработке Тогда 	
			ВремяСНачалаОбработки = ТекущаяДатаСеанса() - СтрокаИнициаторовОтправки.ДатаРегистрации;
			Если ВремяСНачалаОбработки < 3 * 60 Тогда  
				ОтменаОтправки = Истина;
			КонецЕсли;
		КонецЕсли;	
		
		Если СписокСтатусовДляОтправки.Найти(СтрокаИнициаторовОтправки.СтатусСообщения) = Неопределено Тогда 
			ОтменаОтправки = Истина;
		КонецЕсли; 
		
		Если НЕ СтрокаИнициаторовОтправки.ОтправкаПодтверждена Тогда
			ОтменаОтправки = Истина;
		КонецЕсли;
			
		Если Не ОтменаОтправки Тогда 
			
			СообщениеОтправки = Новый Структура;
			СообщениеОтправки.Вставить("ИдентификаторСобытия", 		СтрокаИнициаторовОтправки.ИдентификаторСобытия);
			СообщениеОтправки.Вставить("ФорматСообщения", 			СтрокаИнициаторовОтправки.ФорматСообщения);
			СообщениеОтправки.Вставить("МетодХранения", 			СтрокаИнициаторовОтправки.МетодХранения);
			СообщениеОтправки.Вставить("ОбъектСобытия", 			СтрокаИнициаторовОтправки.ОбъектСобытия);
			СообщениеОтправки.Вставить("СсылкаНаОбъект", 			СтрокаИнициаторовОтправки.СсылкаНаОбъект);
			СообщениеОтправки.Вставить("СпособПередачи", 			СтрокаИнициаторовОтправки.СпособПередачи);
			СообщениеОтправки.Вставить("СтатусСообщения", 			СтрокаИнициаторовОтправки.СтатусСообщения); 
			СообщениеОтправки.Вставить("ДатаРегистрации", 			СтрокаИнициаторовОтправки.ДатаРегистрации);
			СообщениеОтправки.Вставить("ОписаниеДанных", 			СтрокаИнициаторовОтправки.ОписаниеДанных); 
			СообщениеОтправки.Вставить("Хранилище",      			СтрокаИнициаторовОтправки.Хранилище);
			
			ИнициаторыДляОтправкиСообщеня.Добавить(СообщениеОтправки);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ИнициаторыДляОтправкиСообщеня;

КонецФункции

&НаКлиенте
Процедура ОтправитьСообщенияТаблицаИнициаторыОтправки(Команда)
	Состояние("Подождите. Идет обработка"); 
	
	СообщеняДляОтправки = ПолучитьДанныеДляОтправкиИзТаблицаИнициаторыОтправки(); 	
	Если ТипЗнч(СообщеняДляОтправки) = Тип("Массив") И СообщеняДляОтправки.Количество() > 0 Тогда	
		спСервисИнтеграцииКлиент.ОтправитьСообщениеДокументовПоsFTP(СообщеняДляОтправки);
	КонецЕсли;
	
	ОбновитьДанныеТаблицаПодчиненныеСообщения();
	ПроверитьВозможностьОтправкиТаблицаИнициаторыОтправкиНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицаИнициаторыОтправкиНаСервере()
	
	ВыгрузкаТаблицанициаторыОтправки =  ТаблицаИнициаторыОтправки.Выгрузить(, "СсылкаНаОбъект");
	
	Если ВыгрузкаТаблицанициаторыОтправки.Количество() > 0 Тогда 
		
		ТаблицаИнициаторыОтправки.Очистить();	
		ТекущиеДанныеИзЗапроса = ТаблицаИнициаторыСообщения(ВыгрузкаТаблицанициаторыОтправки);
		
		Для каждого СтрокаТекущиеДанныеИзЗапроса Из ТекущиеДанныеИзЗапроса Цикл
			
			ТекущиеДанныеТаблицаПодчиненныеСообщения = ТаблицаИнициаторыОтправки.Добавить();	
			ТекущиеДанныеТаблицаПодчиненныеСообщения.ДатаРегистрации 					= СтрокаТекущиеДанныеИзЗапроса.ДатаРегистрации;
	        ТекущиеДанныеТаблицаПодчиненныеСообщения.ИдентификаторСобытия 				= СтрокаТекущиеДанныеИзЗапроса.ИдентификаторСобытия;
			ТекущиеДанныеТаблицаПодчиненныеСообщения.ИдентификаторСобытияСтрока 		= СтрокаТекущиеДанныеИзЗапроса.ИдентификаторСобытияСтрока; 
			ТекущиеДанныеТаблицаПодчиненныеСообщения.СсылкаНаОбъект 					= СтрокаТекущиеДанныеИзЗапроса.СсылкаНаОбъект;
			ТекущиеДанныеТаблицаПодчиненныеСообщения.СпособПередачи 					= СтрокаТекущиеДанныеИзЗапроса.СпособПередачи;
			ТекущиеДанныеТаблицаПодчиненныеСообщения.СтатусСообщения 					= СтрокаТекущиеДанныеИзЗапроса.СтатусСообщения;
		КонецЦикла;
	КонецЕсли;
	
	ПроверитьВозможностьОтправкиТаблицаИнициаторыОтправкиНаСервере();
КонецПроцедуры 

&НаСервере
Функция ТаблицаИнициаторыСообщения(ВыгрузкаТаблицаСообщения) 
	ДанныеВыборка = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыгрузкаТаблицаСообщения.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ПОМЕСТИТЬ ВнутренняяТаблицаСообщений
		|ИЗ
		|	&ВыгрузкаТаблицаСообщения КАК ВыгрузкаТаблицаСообщения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	ПРЕДСТАВЛЕНИЕ(тбОчередь.ИдентификаторСобытия) КАК ИдентификаторСобытияСтрока,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.СпособПередачи КАК СпособПередачи,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|ГДЕ
		|	тбОчередь.СсылкаНаОбъект В
		|			(ВЫБРАТЬ
		|				ВнутренняяТаблицаСообщений.СсылкаНаОбъект КАК СсылкаНаОбъект
		|			ИЗ
		|				ВнутренняяТаблицаСообщений КАК ВнутренняяТаблицаСообщений)
		|	И тбОчередь.СпособПередачи = &СпособПередачи";
	
	Запрос.УстановитьПараметр("ВыгрузкаТаблицаСообщения", ВыгрузкаТаблицаСообщения); 
	Запрос.УстановитьПараметр("СпособПередачи", Перечисления.спСпособПередачи.FTP);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		ТекущиеДанные = Новый Структура("ДатаРегистрации, ИдентификаторСобытия, ИдентификаторСобытияСтрока, СсылкаНаОбъект, СпособПередачи, СтатусСообщения");
		ТекущиеДанные.Вставить("ДатаРегистрации", ВыборкаДетальныеЗаписи.ДатаРегистрации);
		ТекущиеДанные.Вставить("ИдентификаторСобытия", ВыборкаДетальныеЗаписи.ИдентификаторСобытия);
		ТекущиеДанные.Вставить("ИдентификаторСобытияСтрока", ВыборкаДетальныеЗаписи.ИдентификаторСобытияСтрока);
		ТекущиеДанные.Вставить("СсылкаНаОбъект", ВыборкаДетальныеЗаписи.СсылкаНаОбъект);
		ТекущиеДанные.Вставить("СпособПередачи", ВыборкаДетальныеЗаписи.СпособПередачи);
		ТекущиеДанные.Вставить("СтатусСообщения", ВыборкаДетальныеЗаписи.СтатусСообщения);   
		
		ДанныеВыборка.Добавить(ТекущиеДанные);
	КонецЦикла;
	
	Возврат ДанныеВыборка;

КонецФункции

&НаКлиенте
Процедура ОбновитьТаблицаИнициаторыОтправки(Команда)
	ОбновитьТаблицаИнициаторыОтправкиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицаПодчиненныеСообщения(Команда)
	ОбновитьТаблицаПодчиненныеСообщенияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицаПодчиненныеСообщенияНаСервере() 
	
	ВыгрузкаТаблицаПодчиненныеСообщения =  ТаблицаПодчиненныеСообщения.Выгрузить(,СсылкаНаОбъект);
	
	Если ВыгрузкаТаблицаПодчиненныеСообщения.Количество() > 0 Тогда 
		
		ТаблицаПодчиненныеСообщения.Очистить();	
		ТекущиеДанныеИзЗапроса = ТаблицаПодчиненныеСообщения(ВыгрузкаТаблицаПодчиненныеСообщения);
		
		Для каждого СтрокаТекущиеДанныеИзЗапроса Из ТекущиеДанныеИзЗапроса Цикл
			
			ТекущиеДанныеТаблицаПодчиненныеСообщения = ТаблицаПодчиненныеСообщения.Добавить();	
			ТекущиеДанныеТаблицаПодчиненныеСообщения.ДатаРегистрации 					= СтрокаТекущиеДанныеИзЗапроса.ДатаРегистрации;
	        ТекущиеДанныеТаблицаПодчиненныеСообщения.ИдентификаторСобытия 				= СтрокаТекущиеДанныеИзЗапроса.ИдентификаторСобытия;
			ТекущиеДанныеТаблицаПодчиненныеСообщения.ИдентификаторСобытияСтрока 		= СтрокаТекущиеДанныеИзЗапроса.ИдентификаторСобытияСтрока; 
			ТекущиеДанныеТаблицаПодчиненныеСообщения.СсылкаНаОбъект 					= СтрокаТекущиеДанныеИзЗапроса.СсылкаНаОбъект;
			ТекущиеДанныеТаблицаПодчиненныеСообщения.СпособПередачи 					= СтрокаТекущиеДанныеИзЗапроса.СпособПередачи;
			ТекущиеДанныеТаблицаПодчиненныеСообщения.СтатусСообщения 					= СтрокаТекущиеДанныеИзЗапроса.СтатусСообщения;
			ТекущиеДанныеТаблицаПодчиненныеСообщения.ИнициаторОтправкиСсылкаНаОбъект 	= СтрокаТекущиеДанныеИзЗапроса.ИнициаторОтправкиСсылкаНаОбъект;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ТаблицаПодчиненныеСообщения(ВыгрузкаТаблицаПодчиненныеСообщения)
	ДанныеВыборка = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВыгрузкаТаблицаПодчиненныеСообщения.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ПОМЕСТИТЬ ВнутренняяТаблицаПодчиненныеСообщения
		|ИЗ
		|	&ВыгрузкаТаблицаПодчиненныеСообщения КАК ВыгрузкаТаблицаПодчиненныеСообщения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	ПРЕДСТАВЛЕНИЕ(тбОчередь.ИдентификаторСобытия) КАК ИдентификаторСобытияСтрока,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.СпособПередачи КАК СпособПередачи,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения,
		|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|ГДЕ
		|	тбОчередь.СсылкаНаОбъект В
		|			(ВЫБРАТЬ
		|				ВнутренняяТаблицаПодчиненныеСообщения.СсылкаНаОбъект КАК СсылкаНаОбъект
		|			ИЗ
		|				ВнутренняяТаблицаПодчиненныеСообщения КАК ВнутренняяТаблицаПодчиненныеСообщения)
		|	И тбОчередь.СпособПередачи = &СпособПередачи";
	
	Запрос.УстановитьПараметр("ВыгрузкаТаблицаПодчиненныеСообщения", ВыгрузкаТаблицаПодчиненныеСообщения); 
	Запрос.УстановитьПараметр("СпособПередачи", Перечисления.спСпособПередачи.FTP);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл  
		ТекущиеДанные = Новый Структура("ДатаРегистрации, ИдентификаторСобытия, ИдентификаторСобытияСтрока, СсылкаНаОбъект, СпособПередачи, СтатусСообщения, ИнициаторОтправкиСсылкаНаОбъект");
		ТекущиеДанные.Вставить("ДатаРегистрации", ВыборкаДетальныеЗаписи.ДатаРегистрации);
		ТекущиеДанные.Вставить("ИдентификаторСобытия", ВыборкаДетальныеЗаписи.ИдентификаторСобытия);
		ТекущиеДанные.Вставить("ИдентификаторСобытияСтрока", ВыборкаДетальныеЗаписи.ИдентификаторСобытияСтрока);
		ТекущиеДанные.Вставить("СсылкаНаОбъект", ВыборкаДетальныеЗаписи.СсылкаНаОбъект);
		ТекущиеДанные.Вставить("СпособПередачи", ВыборкаДетальныеЗаписи.СпособПередачи);
		ТекущиеДанные.Вставить("СтатусСообщения", ВыборкаДетальныеЗаписи.СтатусСообщения); 
		ТекущиеДанные.Вставить("ИнициаторОтправкиСсылкаНаОбъект", ВыборкаДетальныеЗаписи.ИнициаторОтправкиСсылкаНаОбъект);  
		
		ДанныеВыборка.Добавить(ТекущиеДанные);
	КонецЦикла;
	
	Возврат ДанныеВыборка;

КонецФункции


&НаСервере
Процедура УдалениеСообщенийНаСервере()   
	
	ТаблицаИдентификаторСобытия = ТаблицаСтатусовСообщений.Выгрузить(, "ИдентификаторСобытия");
	
	 Для каждого СтрокаТаблицаСтатусовСообщений Из ТаблицаСтатусовСообщений Цикл
		 Если СтрокаТаблицаСтатусовСообщений.Флажок Тогда  
			 УдалитьЗаписиСообщенийИзРегистров(СтрокаТаблицаСтатусовСообщений.СсылкаНаОбъект, СтрокаТаблицаСтатусовСообщений.СпособПередачи, СтрокаТаблицаСтатусовСообщений.ИдентификаторСобытия)
		 КонецЕсли;
	 КонецЦикла;
	 
	 ТаблицаСтатусовСообщений.Очистить();
	 ЗаполнитьТаблицуТаблицаСтатусовСообщений(ТаблицаИдентификаторСобытия);
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписиСообщенийИзРегистров(СсылкаНаОбъект, СпособПередачи, ИдентификаторСобытия)  
	Если ОчиститьРегистрОтправленныеСообщенияПриУдалении Тогда 
		ОчиститьРегистрОтправленныеСообщения(СсылкаНаОбъект, СпособПередачи);  
	КонецЕсли;
	
	ОчиститьРегистрОчередьИсходящихСообщений(ИдентификаторСобытия);  
	
	ОчиститьРегистрСостояниеСообщений(ИдентификаторСобытия);  
	
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьТаблицуТаблицаСтатусовСообщений(ТаблицаИдентификаторСобытия)
	Запрос = Новый Запрос();
	Запрос.Текст = 
	
	"ВЫБРАТЬ
	|	ТаблицаИдентификаторСобытия.ИдентификаторСобытия КАК ИдентификаторСобытия
	|ПОМЕСТИТЬ ВнутренняяТаблицаТаблицаИдентификаторСобытияИдентификаторСобытия
	|ИЗ
	|	&ТаблицаИдентификаторСобытия КАК ТаблицаИдентификаторСобытия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	спСостояниеСообщений.ИдентификаторСобытия КАК ИдентификаторСобытия,
	|	ПРЕДСТАВЛЕНИЕ(спОчередьИсходящихСообщений.ИдентификаторСобытия) КАК ИдентификаторСобытияСтрока,
	|	спСостояниеСообщений.СтатусСообщения КАК СтатусСообщения,
	|	спОчередьИсходящихСообщений.СсылкаНаОбъект КАК СсылкаНаОбъект,
	|	спОчередьИсходящихСообщений.СпособПередачи КАК СпособПередачи,
	|	спОчередьИсходящихСообщений.ДатаРегистрации КАК ДатаРегистрации,
	|	спОчередьИсходящихСообщений.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект
	|ИЗ
	|	РегистрСведений.спСостояниеСообщений КАК спСостояниеСообщений
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спОчередьИсходящихСообщений КАК спОчередьИсходящихСообщений
	|		ПО спСостояниеСообщений.ИдентификаторСобытия = спОчередьИсходящихСообщений.ИдентификаторСобытия
	|ГДЕ
	|	спСостояниеСообщений.ИдентификаторСобытия В
	|			(ВЫБРАТЬ
	|				ВнутренняяТаблицаТаблицаИдентификаторСобытияИдентификаторСобытия.ИдентификаторСобытия КАК ИдентификаторСобытия
	|			ИЗ
	|				ВнутренняяТаблицаТаблицаИдентификаторСобытияИдентификаторСобытия КАК ВнутренняяТаблицаТаблицаИдентификаторСобытияИдентификаторСобытия)";  
	
	Запрос.УстановитьПараметр("ТаблицаИдентификаторСобытия", ТаблицаИдентификаторСобытия); 
	
	Выгрузка = Запрос.Выполнить().Выгрузить();  
	ТаблицаСтатусовСообщений.Загрузить(Выгрузка);
КонецПроцедуры

&НаКлиенте
Процедура УдалениеСообщений(Команда)
	УдалениеСообщенийНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаСтатусовСообщенийПриИзменении(Элемент)
	ТекущиеДанныеТаблицаСтатусовСообщений = Элементы.ТаблицаСтатусовСообщений.ТекущиеДанные;
	Если ТекущиеДанныеТаблицаСтатусовСообщений <> Неопределено И ЗначениеЗаполнено(ТекущиеДанныеТаблицаСтатусовСообщений.СсылкаНаОбъект) Тогда 
		ТекущиеДанныеИзЗапроса = ТаблицаСтатусовСообщенийПриИзмененииПриИзмененииНаСервере(ТекущиеДанныеТаблицаСтатусовСообщений.СсылкаНаОбъект); 
		ТекущиеДанныеТаблицаСтатусовСообщений.ДатаРегистрации 					= ТекущиеДанныеИзЗапроса.ДатаРегистрации;
        ТекущиеДанныеТаблицаСтатусовСообщений.ИдентификаторСобытия 				= ТекущиеДанныеИзЗапроса.ИдентификаторСобытия;
		ТекущиеДанныеТаблицаСтатусовСообщений.ИдентификаторСобытияСтрока 		= ТекущиеДанныеИзЗапроса.ИдентификаторСобытияСтрока;
		ТекущиеДанныеТаблицаСтатусовСообщений.СпособПередачи 					= ТекущиеДанныеИзЗапроса.СпособПередачи;
		ТекущиеДанныеТаблицаСтатусовСообщений.СтатусСообщения 					= ТекущиеДанныеИзЗапроса.СтатусСообщения;
		ТекущиеДанныеТаблицаСтатусовСообщений.ИнициаторОтправкиСсылкаНаОбъект   = ТекущиеДанныеИзЗапроса.ИнициаторОтправкиСсылкаНаОбъект;

	КонецЕсли;

КонецПроцедуры

Функция ТаблицаСтатусовСообщенийПриИзмененииПриИзмененииНаСервере(СсылкаНаОбъект) 
	ПараметрСпособПередачи = Перечисления.спСпособПередачи.FTP;	
	
	ТекущиеДанные = Новый Структура("ДатаРегистрации, ИдентификаторСобытия, ИдентификаторСобытияСтрока, СсылкаНаОбъект, СпособПередачи, СтатусСообщения, ИнициаторОтправкиСсылкаНаОбъект");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	ПРЕДСТАВЛЕНИЕ(тбОчередь.ИдентификаторСобытия) КАК ИдентификаторСобытияСтрока,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.СпособПередачи КАК СпособПередачи,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения,
		|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|ГДЕ
		|	тбОчередь.СсылкаНаОбъект = &СсылкаНаОбъект
		|	И тбОчередь.СпособПередачи = &СпособПередачи";
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект); 
	Запрос.УстановитьПараметр("СпособПередачи", ПараметрСпособПередачи);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ТекущиеДанные.Вставить("ДатаРегистрации", ВыборкаДетальныеЗаписи.ДатаРегистрации);
		ТекущиеДанные.Вставить("ИдентификаторСобытия", ВыборкаДетальныеЗаписи.ИдентификаторСобытия );
		ТекущиеДанные.Вставить("ИдентификаторСобытияСтрока", ВыборкаДетальныеЗаписи.ИдентификаторСобытияСтрока );
		ТекущиеДанные.Вставить("СсылкаНаОбъект", ВыборкаДетальныеЗаписи.СсылкаНаОбъект );
		ТекущиеДанные.Вставить("СпособПередачи", ВыборкаДетальныеЗаписи.СпособПередачи );
		ТекущиеДанные.Вставить("СтатусСообщения", ВыборкаДетальныеЗаписи.СтатусСообщения );  
		ТекущиеДанные.Вставить("ИнициаторОтправкиСсылкаНаОбъект", ВыборкаДетальныеЗаписи.ИнициаторОтправкиСсылкаНаОбъект );

	КонецЦикла;
	
	Возврат ТекущиеДанные;	
КонецФункции

&НаКлиенте
Процедура СтатусСообщенияДокументПриИзменении(Элемент)
	Если ЗначениеЗаполнено(СтатусСообщенияДокумент) Тогда
		ТребуютОтправки = Ложь;
	Иначе 
		ТребуютОтправки = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТребуютОтправкиПриИзменении(Элемент)
	СтатусСообщенияДокумент = "";
КонецПроцедуры

