#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбъединитьОбластьЯчеекШаблонаСервер(ПолеТабличногоДокумента, ИмяОбласти) Экспорт
	
	спПодключаемыеКомандыСервер.ОбъединитьОбластьЯчеекШаблонаСервер(ПолеТабличногоДокумента, ИмяОбласти);
	
КонецПроцедуры

Процедура ВставитьВШаблонРисунокЗнакиУхода(ПолеТабличногоДокумента, ИмяТекущейОбласти, ИмяПоляВШаблоне) Экспорт
	
	спПодключаемыеКомандыСервер.ВставитьВШаблонРисунокЗнакиУхода(ПолеТабличногоДокумента, ИмяТекущейОбласти, ИмяПоляВШаблоне);
	
КонецПроцедуры

Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные) Экспорт
	
	СтруктураДанные = спПодключаемыеКомандыСервер.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	Возврат СтруктураДанные;
	
КонецФункции

Функция ЗаполнитьНоменклатураПоставщика(Знач Запасы) Экспорт
	
	СтруктураЗаполнения = спПодключаемыеКомандыСервер.ЗаполнитьНоменклатураПоставщика(Запасы);
	
	Возврат СтруктураЗаполнения;  
	
КонецФункции

Функция ЗаполнитьНоменклатураПоставщикаФормаСписка(ВыделенныеСтроки) Экспорт
	
	СтруктураЗаполнения = спПодключаемыеКомандыСервер.ЗаполнитьНоменклатураПоставщикаФормаСписка(ВыделенныеСтроки);
	
	Возврат СтруктураЗаполнения;  
	
КонецФункции
// end of dimedrol 23.02.2025

// ++ Терлецкий АВ 25.01.15
Процедура ОтменаПроведенияДокументЗаказНаПеремещения(Объект) Экспорт   
	
	спПодключаемыеКомандыСервер.ОтменаПроведенияДокументЗаказНаПеремещения(Объект);
	
КонецПроцедуры

Функция  ОбновитьСостояниеСообщенияДокументЗаказНаПеремещения(Ссылка) Экспорт

	Возврат спПодключаемыеКомандыСервер.ПроверкаИсходящегоСообщенияНаВебСервер(Ссылка);
	
КонецФункции

Функция ПроверитьСообщениеНаОтправкуВебСерверу(Ссылка) Экспорт
	
	ТаблицаПроверки = Новый ТаблицаЗначений;
	ТаблицаПроверки.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПеремещение"));
	
	НоваяСтрока = ТаблицаПроверки.Добавить();
	НоваяСтрока.Ссылка = Ссылка;
	ОтправленныеСообщения = спОбработкаСобытийВызовСервера.ИсключитьПовторнуюОтправку(ТаблицаПроверки, Перечисления.спСпособПередачи.SOAP);
	
	Если ТипЗнч(ОтправленныеСообщения) = Тип("ТаблицаЗначений") И ОтправленныеСообщения.Количество() > 0 Тогда 
		Возврат Истина;
	Иначе 
		Возврат Ложь;	
	КонецЕсли; 
КонецФункции
// -- Терлецкий АВ 25.01.15  

Функция ЕстьАктОРасхожденияхПриПеремещении(ЗаказНаПеремещение) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	спАктОРасхожденияхПриПеремещении.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.спАктОРасхожденияхПриПеремещении КАК спАктОРасхожденияхПриПеремещении
		|ГДЕ
		|	НЕ спАктОРасхожденияхПриПеремещении.ПометкаУдаления
		|	И спАктОРасхожденияхПриПеремещении.Проведен
		|	И спАктОРасхожденияхПриПеремещении.ЗаказНаПеремещение = &ЗаказНаПеремещение";

	Запрос.УстановитьПараметр("ЗаказНаПеремещение", ЗаказНаПеремещение);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();	
	
КонецФункции

Функция Документ_ПеремещениеЗапасов_ПроверкаСоответствия(Отправитель, Получатель) Экспорт
	
	Возврат спМодификацияКонфигурацииПереопределяемый.Документ_ПеремещениеЗапасов_ПроверкаСоответствия(Отправитель, Получатель); 
	
КонецФункции

Процедура СохранитьИнтервалОбновленияСписка(ИмяФормы, Интервал) Экспорт

	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(ИмяФормы, ИмяФормы, Интервал,, ИмяПользователя());
	
КонецПроцедуры

// dimedrol 23.02.2025
Функция СоздатьУстановкуЦенПоАлгоритму(Знач Объект) Экспорт
	
	Возврат спПодключаемыеКомандыСервер.СоздатьУстановкуЦенПоАлгоритму(Объект);
	
КонецФункции

// Функция - Неотгруженные строки
// Возвращает массив строк заказа, которые по данным системы не отгружены покупателю
//
// Параметры:
//  Заказ	 - Массив, ДокументСсылка.ЗаказПокупателя - ссылка или массив ссылок на документы заказ покупателя
// 
// Возвращаемое значение:
//   - Массив - массив идентификаторов строк 
//
Функция НеотгруженныеСтроки(Заказ) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗаказыПокупателейОстатки.Номенклатура КАК Номенклатура,
	|	ЗаказыПокупателейОстатки.КоличествоОстаток КАК Неотгружено
	|ИЗ
	|	РегистрНакопления.ЗаказыПокупателей.Остатки(&ТекущаяДата, ЗаказПокупателя = &Заказ) КАК ЗаказыПокупателейОстатки
	|ГДЕ
	|	ЗаказыПокупателейОстатки.КоличествоОстаток > 0";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	НеотгруженныеСтроки = ОбщегоНазначения.ТаблицаЗначенийВМассив(РезультатЗапроса.Выгрузить());
	
	Возврат НеотгруженныеСтроки;
	
КонецФункции

// Функция - Настройки вида упаковок GTIN
//
// Параметры:
//  ЗаказНаЭмиссиюКМСУЗ	 - ДокументСсылка.ЗаказНаЭмиссиюКодовМаркировкиСУЗ  - ссылка на документ ЗаказНаЭмиссиюКодовМаркировкиСУЗ
// 
// Возвращаемое значение:
//   - Соответствие - настройки заполнения вида упаковки и GTIN в документе ЗаказНаЭмиссиюКодовМаркировкиСУЗ
//
Функция НастройкиВидаУпаковокGTIN(ЗаказНаЭмиссиюКМСУЗ) Экспорт
	
	// { Иванов С.С. (TNext) - 20.05.2025 - Задача №2064 
	НастройкиВидаУпаковокGTIN = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Номенклатура КАК Номенклатура,
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.GTIN КАК GTIN,
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Шаблон КАК Шаблон,
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.НомерСтроки КАК НомерСтроки,
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Номенклатура.ЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Товары КАК ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары
		|ГДЕ
		|	ЗаказНаЭмиссиюКодовМаркировкиСУЗТовары.Ссылка = &ЗаказНаЭмиссиюКМСУЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Товары.НомерСтроки КАК НомерСтроки,
		|	ВТ_Товары.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ЕСТЬNULL(ШтрихкодыНоменклатуры.Штрихкод, """") = """"
		|				ТОГДА ВТ_Товары.GTIN
		|			ИНАЧЕ ""0"" + ШтрихкодыНоменклатуры.Штрихкод
		|		КОНЕЦ) КАК GTIN,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА ВТ_Товары.НоменклатураЕдиницаИзмерения.Код = ""796""
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленность)
		|			КОГДА ВТ_Товары.НоменклатураЕдиницаИзмерения.Код = ""839""
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленностьКомплект)
		|			КОГДА ВТ_Товары.НоменклатураЕдиницаИзмерения.Код = ""704""
		|				ТОГДА ЗНАЧЕНИЕ(Перечисление.ШаблоныКодовМаркировкиСУЗ.ЛегкаяПромышленностьНабор)
		|			ИНАЧЕ ВТ_Товары.Шаблон
		|		КОНЕЦ) КАК Шаблон
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ВТ_Товары.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Товары.НомерСтроки,
		|	ВТ_Товары.Номенклатура";
	
	Запрос.УстановитьПараметр("ЗаказНаЭмиссиюКМСУЗ", ЗаказНаЭмиссиюКМСУЗ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		НастройкаВидаУпаковкиGTIN = Новый Структура("Шаблон, GTIN");
		ЗаполнитьЗначенияСвойств(НастройкаВидаУпаковкиGTIN, Выборка);
		
		НастройкиВидаУпаковокGTIN.Вставить(Выборка.Номенклатура, НастройкаВидаУпаковкиGTIN);
		
	КонецЦикла;
	
	Возврат НастройкиВидаУпаковокGTIN;
	// }
	
КонецФункции

#КонецОбласти