#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	РезультатСсылка = ВыбранноеЗначение;
	
	Если ТипЗнч(РезультатСсылка) = Тип("СправочникСсылка.спЗнакиУхода") И ЗначениеЗаполнено(Номенклатура) Тогда 
		ДобавитьЗнакиУходаНаСервере(РезультатСсылка); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.Свойство("Отбор") Тогда
		ВызватьИсключение НСтр("ru = 'Обработка не предназначена для непосредственного использования.'");
	КонецЕсли;  
	
	Если Не Параметры.Отбор.Свойство("Номенклатура") Тогда
		ВызватьИсключение НСтр("ru = 'Отбор не заполнен.'");
	КонецЕсли;

    Номенклатура = Параметры.Отбор.Номенклатура;
	ЗаполнитьТаблицуЗнаковУхода();
КонецПроцедуры 
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаЗнаковУхода

&НаКлиенте
Процедура ТаблицаЗнаковУходаПередНачаломИзменения(Элемент, Отказ) 
	Если Элемент.ТекущийЭлемент.Имя <> "ТаблицаЗнаковУходаИспользование" Тогда 
		Отказ = Истина;	 
	КонецЕсли;
КонецПроцедуры 

&НаКлиенте
Процедура ТаблицаЗнаковУходаИспользованиеПриИзменении(Элемент)
	Если Элементы.ТаблицаЗнаковУхода.ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;

	ТекущиеДанные = Элементы.ТаблицаЗнаковУхода.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекущиеДанные.ЗнакиУхода) И ЗначениеЗаполнено(Номенклатура) Тогда 
		ПараметрыСтруктура = Новый Структура();
		ПараметрыСтруктура.Вставить("ЗнакиУхода", ТекущиеДанные.ЗнакиУхода);
		ПараметрыСтруктура.Вставить("Использование", ТекущиеДанные.Использование);
		ТаблицаЗнаковУходаИспользованиеПриИзмененииНаСервере(ПараметрыСтруктура);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗнаковУходаПриАктивизацииСтроки(Элемент)
	Если Элементы.ТаблицаЗнаковУхода.ТекущиеДанные = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	ЗнакиУхода = Элементы.ТаблицаЗнаковУхода.ТекущиеДанные.ЗнакиУхода;
	Если ЗначениеЗаполнено(ЗнакиУхода) Тогда
		ОбновитьИзображение(ЗнакиУхода);
	КонецЕсли;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Удалить(Команда) 
	ЗнакиУхода = Элементы.ТаблицаЗнаковУхода.ТекущиеДанные.ЗнакиУхода;
	Если ЗначениеЗаполнено(ЗнакиУхода) И ЗначениеЗаполнено(Номенклатура) Тогда 
		УдалитьНаСервере(ЗнакиУхода);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиЗнакиУхода(Команда)
	ОткрытьФорму("Справочник.спЗнакиУхода.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗнакиУхода(Команда) 
	ЗнакиУхода = Элементы.ТаблицаЗнаковУхода.ТекущиеДанные.ЗнакиУхода;
	Если ЗначениеЗаполнено(ЗнакиУхода) Тогда 
		ПараметрыФормы = Новый Структура("Ключ", ЗнакиУхода);
		ОткрытьФорму("Справочник.спЗнакиУхода.ФормаОбъекта", ПараметрыФормы);	
    КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТаблицаЗнаковУхода(Команда)
	ОбновитьТаблицаЗнаковУходаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Добавить(Команда)
	ПараметрыФормы = Новый Структура("РежимВыбора", Истина);
	
	ОткрытьФорму("Справочник.спЗнакиУхода.ФормаВыбора", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
 
 &НаСервере
Процедура ОбновитьТаблицаЗнаковУходаНаСервере()
	ТаблицаЗнаковУхода.Очистить();
	ЗаполнитьТаблицуЗнаковУхода();
КонецПроцедуры
 
&НаСервере
Процедура ЗаполнитьТаблицуЗнаковУхода()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спЗнакиУходаВНоменклатуре.Номенклатура КАК Номенклатура,
		|	спЗнакиУходаВНоменклатуре.ЗнакиУхода КАК ЗнакиУхода,
		|	спЗнакиУходаВНоменклатуре.Использование КАК Использование
		|ИЗ
		|	РегистрСведений.спЗнакиУходаВНоменклатуре КАК спЗнакиУходаВНоменклатуре
		|ГДЕ
		|	спЗнакиУходаВНоменклатуре.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = ТаблицаЗнаковУхода.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаДетальныеЗаписи); 
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьЗнакиУходаНаСервере(ЗнакиУхода) 
	НаборЗаписей = РегистрыСведений.спЗнакиУходаВНоменклатуре.СоздатьНаборЗаписей();
	Отбор = НаборЗаписей.Отбор;
	Отбор.Номенклатура.Установить(Номенклатура); 
	Отбор.ЗнакиУхода.Установить(ЗнакиУхода);
	
	НаборЗаписей.Прочитать(); 
	
	Если НаборЗаписей.Количество() = 0 Тогда	
		МенеджерЗаписи = РегистрыСведений.спЗнакиУходаВНоменклатуре.СоздатьМенеджерЗаписи(); 
		МенеджерЗаписи.Номенклатура = Номенклатура; 
		МенеджерЗаписи.ЗнакиУхода = ЗнакиУхода; 
		МенеджерЗаписи.Использование = Истина; 
		МенеджерЗаписи.Записать();  
	КонецЕсли;
	
	ТаблицаЗнаковУхода.Очистить();
	ЗаполнитьТаблицуЗнаковУхода();
КонецПроцедуры 

&НаСервере
Процедура УдалитьНаСервере(ЗнакиУхода) 
	РегистрСведенийМенеджерЗаписи = РегистрыСведений.спЗнакиУходаВНоменклатуре.СоздатьМенеджерЗаписи(); 
	
	РегистрСведенийМенеджерЗаписи.Номенклатура = Номенклатура; 
	РегистрСведенийМенеджерЗаписи.ЗнакиУхода = ЗнакиУхода;
	РегистрСведенийМенеджерЗаписи.Прочитать();
	
	Если РегистрСведенийМенеджерЗаписи.Выбран() Тогда
		РегистрСведенийМенеджерЗаписи.Удалить();
	КонецЕсли;  
	
	ТаблицаЗнаковУхода.Очистить();
	ЗаполнитьТаблицуЗнаковУхода();

КонецПроцедуры

&НаСервере
Процедура ОбновитьИзображение(ЗнакиУхода)
	Изображения = "";
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спЗнакиУходаПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла,
		|	спЗнакиУходаПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	спЗнакиУходаПрисоединенныеФайлы.ТекстХранилище КАК ТекстХранилище,
		|	спЗнакиУходаПрисоединенныеФайлы.ФайлХранилище КАК ФайлХранилище
		|ИЗ
		|	Справочник.спЗнакиУходаПрисоединенныеФайлы КАК спЗнакиУходаПрисоединенныеФайлы
		|ГДЕ
		|	спЗнакиУходаПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла",ЗнакиУхода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоменклатураПрисоединенныйФайл = ВыборкаДетальныеЗаписи.Ссылка; 	
	КонецЦикла;  
		
	// Присоединенный файл записанный в Объект.ФайлКартинки показываем первым.
	Если НоменклатураПрисоединенныйФайл <> Неопределено И НЕ НоменклатураПрисоединенныйФайл.Пустая() Тогда
		ДвоичныеДанныеКартинки = РаботаСФайламиУНФ.СсылкаНаДвоичныеДанныеФайла(НоменклатураПрисоединенныйФайл, УникальныйИдентификатор);
		Если ДвоичныеДанныеКартинки <> Неопределено Тогда
			Изображения = ДвоичныеДанныеКартинки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ТаблицаЗнаковУходаИспользованиеПриИзмененииНаСервере(Параметры)	
	
	НаборЗаписей = РегистрыСведений.спЗнакиУходаВНоменклатуре.СоздатьНаборЗаписей();  			
	Отбор = НаборЗаписей.Отбор;
	Отбор.Номенклатура.Установить(Номенклатура); 
	Отбор.ЗнакиУхода.Установить(Параметры.ЗнакиУхода);
	НаборЗаписей.Прочитать();
	
    Если НаборЗаписей.Количество() = 1 Тогда
		 НаборЗаписей[0].Использование = Параметры.Использование;
	КонецЕсли;
	НаборЗаписей.Записать();
	
	ТаблицаЗнаковУхода.Очистить();
	ЗаполнитьТаблицуЗнаковУхода();
КонецПроцедуры

#КонецОбласти
