#Область ПрограммныйИнтерфейс

// Выполнение обработки сервисов интеграции.
Процедура ВыполнениеОбработкиСервисовИнтеграции() Экспорт 
	
	спОбслуживаниеОчередей.ЗапуститьОбработчики();
КонецПроцедуры

// Получить сообщение.
// 
// Параметры:
//  Сообщение - - Сообщение
Процедура ПолучитьСообщение(Сообщение) Экспорт
	//ТекстСообщения = СтрШаблон("Начало получения сообщения %1 от %2", Сообщение.Идентификатор, Сообщение.КодОтправителя);
	//ЗаписьЖурналаРегистрации("Сервисы интеграции.Обработка", УровеньЖурналаРегистрации.Информация, , ТекстСообщения); 
	//Попытка
	//	
	//	РасшОСШ_РаботаСДанными.ПоместитьВОчередьВходящихщих(Сообщение);
	//	
	//	ТекстСообщения = СтрШаблон("Сообщение %1 от %2 успешно обработано.", Сообщение.Идентификатор, Сообщение.КодОтправителя);
	//	ЗаписьЖурналаРегистрации("Сервисы интеграции.Обработка", УровеньЖурналаРегистрации.Информация, , ТекстСообщения); 
	//Исключение
	//	ТекстСообщения = СтрШаблон("%1. Не удалось обработать сообщение ID: %2 от %3", ОписаниеОшибки(), Сообщение.Идентификатор, Сообщение.КодОтправителя);
	//	ЗаписьЖурналаРегистрации("Сервисы интеграции.Обработка", УровеньЖурналаРегистрации.Ошибка, , ТекстСообщения); 
	//КонецПопытки;
	//
КонецПроцедуры

// Отправить сообщение.
// 
// Параметры:
//  Сообщение - - Сообщение
//  Идентификатор - - Идентификатор
//  ДатаРегистрации - - Дата регистрации
//  ТипОчередей - - Тип очередей
Процедура ОтправитьСообщение(Сообщение, Идентификатор, ДатаРегистрации, ФорматСообщения, ТипОбъекта, СпособПередачи, ТипОчередей) Экспорт	
	
	Если СпособПередачи = Перечисления.спСпособПередачи.FTP Тогда 
		
		Каталог = ФайловаяСистема.СоздатьВременныйКаталог("спsFTP");
		
		ЧтениеСообщение(Сообщение, ТипОбъекта, ФорматСообщения, Каталог);
		
		sFTPСервер = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спsFTPСервер"); 
		sFTPЛогин = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спsFTPЛогин");
		sFTPПароль = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спsFTPПароль");
		sFTPПорт = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спsFTPПорт");
		спsFTPSHHКлюч = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спsFTPSHHКлюч"); 
		спsFTPПутьНаFTPPending = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спsFTPПутьНаFTPPending");

		
		Попытка 
			//Создаем объект Session
			Сессия = Новый COMОбъект("WinSCP.Session");   
			
			//Создаем объект SessionOptions
			Настройки = Новый COMОбъект("WinSCP.SessionOptions");   
			Настройки.HostName = sFTPСервер;
			Настройки.UserName = sFTPЛогин;
			Настройки.Password = sFTPПароль;
			Настройки.PortNumber = sFTPПорт; 
			Настройки.SshHostKeyFingerprint = спsFTPSHHКлюч; 
			
			// Подключаемся
			Сессия.Open(Настройки);
		Исключение
			ЗаписьЖурналаРегистрации("sFTP", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		КонецПопытки; 
		
		Попытка 
			ПутьВыгрузки = Каталог + "*";
			Результат = Сессия.PutFiles(ПутьВыгрузки, спsFTPПутьНаFTPPending);
			
			//Проверяем результат на возможные ошибки
			Результат.Check();
		Исключение
			ЗаписьЖурналаРегистрации("sFTP",УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		КонецПопытки; 
		
		//Обрабатываем результат выгрузки
		Для каждого ВыгруженныйФайл Из Результат.Transfers Цикл
			ОбщегоНазначения.СообщитьПользователю("Выгружен файл: " + ВыгруженныйФайл.FileName);
			//ПереместитьФайл(ВыгруженныйФайл.FileName, ХранилищеВыгруженныхФайлов);
		КонецЦикла; 
		
		Сессия.Dispose();  
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЧтениеСообщение(Сообщение, ТипОбъекта, ФорматСообщения, ПрочтенноеСообщение, Каталог = Неопределено)
 
	Если ТипОбъекта = "Документ.ПеремещениеЗапасов" ИЛИ ТипОбъекта = "Документ.ПриходнаяНакладная" 
		И ФорматСообщения = Перечисления.спФорматыСообщений.XML Тогда
		
		ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
		Попытка
			ЧтениеИЗаписьXML(ВременныйФайл, Сообщение); 
		Исключение 
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Чтение и запись XML в исходящее сообщение", УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецПопытки; 
		
		Двоичное = Новый ДвоичныеДанные(ВременныйФайл); 
		
		ПрочтенноеСообщение.Вставить("ДвоичныеДанные", ПоместитьВоВременноеХранилище(Двоичное)); 
		ПрочтенноеСообщение.Вставить("Префикс", "FE720");  
		
	ИначеЕсли ТипОбъекта = "Справочник.Номенклатура" И ФорматСообщения = Перечисления.спФорматыСообщений.XML Тогда 
	
		ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
		Попытка
			ЧтениеИЗаписьXML(ВременныйФайл, Сообщение);
		Исключение 
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Чтение и запись XML в исходящее сообщение", УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)); 
		КонецПопытки; 
		
		Двоичное = Новый ДвоичныеДанные(ВременныйФайл); 
		
		ПрочтенноеСообщение.Вставить("ДвоичныеДанные", ПоместитьВоВременноеХранилище(Двоичное)); 
		ПрочтенноеСообщение.Вставить("Префикс", "FE714");	
	КонецЕсли;   

	Возврат ПрочтенноеСообщение; 

КонецФункции  

Процедура ЧтениеИЗаписьXML(ИмяВременногоФайла, Сообщение)
	
	ИмяПромежуточногоФайла = ПолучитьИмяВременногоФайла("xml");
	
	Чтение = Новый ЧтениеXML(); 
	Чтение.УстановитьСтроку(Сообщение);  
		
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяПромежуточногоФайла ,"UTF-8");
	ЗаписьXML.ЗаписатьОбъявлениеXML();

	Пока Чтение.Прочитать() Цикл  
				
		// Прочитать "структурные части" элементов. 
		// Проверить, какая часть элемента - текущая. 
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 			
			
			// Атрибуты элементов можно читать только если текущая часть - 
			// начало элемента    
			ЗаписьXML.ЗаписатьНачалоЭлемента(Чтение.Имя);
			
			Пока Чтение.ПрочитатьАтрибут() Цикл 
				
				// Прочитать данные узла атрибута. 
				ТипУзла = Чтение.ТипУзла; 
				Имя = Чтение.Имя; 
				Значение = Чтение.Значение; 
				
				// Обработать полученные значения.
				ЗаписьXML.ЗаписатьАтрибут(Имя, XMLСтрока(Значение));

			КонецЦикла;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст Тогда 
			
			// Обработать полученные значения.
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(Чтение.Значение));   
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда 
			
			// Обработать полученные значения.
			ЗаписьXML.ЗаписатьКонецЭлемента();

		КонецЕсли; 
		
	КонецЦикла; 
	
	ЗаписьXML.Закрыть();  
	
					
					
	ТекстФайла = Новый ЧтениеТекста(ИмяПромежуточногоФайла, КодировкаТекста.UTF8);  
	СтрокаДляЗамены = "<shipmentAnnouncementRequest xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"" xmlns=""http://service.profashionsolutions.ru/fe720_r002"">";
	СтрокаЗамены = "<shipmentAnnouncementRequest xmlns=""http://service.profashionsolutions.ru/fe720_r002"" xmlns:xs=""http://www.w3.org/2001/XMLSchema"" xmlns:xsi=""http://www.w3.org/2001/XMLSchema-instance"">";
	Текст = ТекстФайла.Прочитать(); 
	
	Если Найти(Текст, СтрокаДляЗамены) > 0 Тогда
		Текст = СтрЗаменить(Текст, СтрокаДляЗамены, СтрокаЗамены);
	КонецЕсли;
	
	НовыйТекст = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста.UTF8);
	НовыйТекст.Записать(Текст); 
	НовыйТекст.Закрыть();
	
	Попытка
		УдалитьФайлы(ИмяПромежуточногоФайла);
	Исключение

	КонецПопытки;
	
КонецПроцедуры

// Получить сообщение. 
Функция ПолучитьДанныеФайла(Сообщение, Идентификатор, ДатаРегистрации, ФорматСообщения, ТипОбъекта, СпособПередачи, ТипОчередей) Экспорт	
	
	ПрочтенноеСообщение = Новый Структура("ДвоичныеДанные, Префикс");  
	
	Если СпособПередачи = Перечисления.спСпособПередачи.FTP Тогда 
		ПрочтенноеСообщение = ЧтениеСообщение(Сообщение, ТипОбъекта, ФорматСообщения, ПрочтенноеСообщение);
	КонецЕсли;  
	
	Возврат ПрочтенноеСообщение;
КонецФункции
 
Функция ПроверкаДокументаПриходнаяНакладная(Ссылка) Экспорт 
    Ошибка = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
		|	ПриходнаяНакладнаяЗапасы.Ссылка КАК Документ
		|ПОМЕСТИТЬ ВТЗапасы
		|ИЗ
		|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		|ГДЕ
		|	ПриходнаяНакладнаяЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗапасы.Номенклатура КАК Номенклатура,
		|	ВТЗапасы.Документ КАК Документ
		|ПОМЕСТИТЬ ВТДокументНоменклатура
		|ИЗ
		|	ВТЗапасы КАК ВТЗапасы
		|ГДЕ
		|	ВТЗапасы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И НЕ ВТЗапасы.Номенклатура ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТЗапасы.Документ,
		|	ВТЗапасы.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.ОбъектСобытия КАК ОбъектСобытия,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения
		|ПОМЕСТИТЬ ВТ_ОчередьИсходящихСообщений
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|		И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
		|ГДЕ
		|	НЕ тбОчередь.ЭтоУдаление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДокументНоменклатура.Документ КАК Документ,
		|	ВТ_ОчередьИсходящихСообщений.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	ВТ_ОчередьИсходящихСообщений.ДатаРегистрации КАК ДатаРегистрации,
		|	ВТ_ОчередьИсходящихСообщений.СтатусСообщения КАК СтатусСообщения
		|ИЗ
		|	ВТДокументНоменклатура КАК ВТДокументНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОчередьИсходящихСообщений КАК ВТ_ОчередьИсходящихСообщений
		|		ПО ВТДокументНоменклатура.Номенклатура = ВТ_ОчередьИсходящихСообщений.СсылкаНаОбъект";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса())); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СтатусСообщения <> Перечисления.спСтатусыСообщений.ОтправкаПодтверждена Тогда 
			Ошибка = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ошибка;	
КонецФункции

Функция ПроверкаДокументаПеремещениеЗапасов(Ссылка) Экспорт 
	Ошибка = Ложь;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
		|	ПеремещениеЗапасовЗапасы.Ссылка КАК Документ
		|ПОМЕСТИТЬ ВТЗапасы
		|ИЗ
		|	Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
		|ГДЕ
		|	ПеремещениеЗапасовЗапасы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТЗапасы.Номенклатура КАК Номенклатура,
		|	ВТЗапасы.Документ КАК Документ
		|ПОМЕСТИТЬ ВТДокументНоменклатура
		|ИЗ
		|	ВТЗапасы КАК ВТЗапасы
		|ГДЕ
		|	ВТЗапасы.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	И НЕ ВТЗапасы.Номенклатура ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТЗапасы.Документ,
		|	ВТЗапасы.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
		|	тбОчередь.ОбъектСобытия КАК ОбъектСобытия,
		|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	тбОчередь.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект,
		|	тбСостояние.СтатусСообщения КАК СтатусСообщения
		|ПОМЕСТИТЬ ВТ_ОчередьИсходящихСообщений
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|		И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
		|ГДЕ
		|	НЕ тбОчередь.ЭтоУдаление
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДокументНоменклатура.Документ КАК Документ,
		|	ВТ_ОчередьИсходящихСообщений.СсылкаНаОбъект КАК СсылкаНаОбъект,
		|	ВТ_ОчередьИсходящихСообщений.ДатаРегистрации КАК ДатаРегистрации,
		|	ВТ_ОчередьИсходящихСообщений.СтатусСообщения КАК СтатусСообщения
		|ИЗ
		|	ВТДокументНоменклатура КАК ВТДокументНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОчередьИсходящихСообщений КАК ВТ_ОчередьИсходящихСообщений
		|		ПО ВТДокументНоменклатура.Номенклатура = ВТ_ОчередьИсходящихСообщений.СсылкаНаОбъект";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса())); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.СтатусСообщения <> Перечисления.спСтатусыСообщений.ОтправкаПодтверждена Тогда 
			Ошибка = Истина; 
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ошибка;	
КонецФункции

// Получить сообщение. 
Функция ПолучитьДанныеФайлаXML(Сообщение, Идентификатор, ДатаРегистрации, ФорматСообщения, ТипОбъекта, СпособПередачи, ТипОчередей) Экспорт	
	
	СообщениеXML = Неопределено; 
	
	Если СпособПередачи = Перечисления.спСпособПередачи.FTP И ТипОбъекта = "Справочник.Номенклатура" 
		И ФорматСообщения = Перечисления.спФорматыСообщений.XML Тогда 

		Попытка
			СообщениеXML = ЧтениеXML(Сообщение);
		Исключение 
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Чтение XML для исходящего сообщения", УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)); 
		КонецПопытки; 
	
	КонецЕсли;   
	Возврат СообщениеXML;
 КонецФункции

Функция ЧтениеXML(Сообщение)  
	
	Чтение = Новый ЧтениеXML(); 
	Чтение.УстановитьСтроку(Сообщение);  
	
	СтруктураСообщения = Новый Структура();
	СтекУзлов = Новый Массив;
	ТекущийПуть = "";
	
	Пока Чтение.Прочитать() Цикл    
		
		// Прочитать "структурные части" элементов. 
		// Проверить, какая часть элемента - текущая. 
		Если Чтение.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда 
			
			Если Чтение.Имя = "productMasterDataRequest" Тогда 
				Продолжить;
			КонецЕсли;
			
			СтекУзлов.Добавить(Чтение.Имя);
			ТекущийПуть = МассивВСтроку(СтекУзлов); 
			
			// Атрибуты элементов можно читать только если текущая часть - 
			// начало элемента  
			Если Чтение.Имя = "prices" И ТекущийПуть = "main/prices" Тогда 
				prices = Новый Массив; 
			ИначеЕсли Чтение.Имя = "price" И ТекущийПуть = "main/prices/price" Тогда 
				price = Новый Структура("id, name, currency");
			ИначеЕсли Чтение.Имя = "items" И ТекущийПуть = "items" Тогда 
				items = Новый Массив;
			ИначеЕсли Чтение.Имя = "item" И ТекущийПуть = "items/item" Тогда 
				item = Новый Структура("uuid, active, parentId, typeItemId, article, name, images, fullDescr, shortDescr, materialDescr, vatCode, color, packingUnit, sizesInfo, stateCodes");
			ИначеЕсли Чтение.Имя = "packingUnit" И ТекущийПуть = "items/item/packingUnit" Тогда
				packingUnit = Новый Структура("length, width, height, volume, weight");
			ИначеЕсли Чтение.Имя = "sizesInfo" И ТекущийПуть = "items/item/sizesInfo" Тогда
				sizesInfo = Новый Массив;
			ИначеЕсли Чтение.Имя = "sizeInfo" И ТекущийПуть = "items/item/sizesInfo/sizeInfo" Тогда
				sizeInfo = Новый Структура("size, sizeText, ean, prices, addFieldValues");
			ИначеЕсли Чтение.Имя = "prices" И ТекущийПуть = "items/item/sizesInfo/sizeInfo/prices" Тогда
				sizeInfoPrices = Новый Массив;
			ИначеЕсли Чтение.Имя = "price" И ТекущийПуть = "items/item/sizesInfo/sizeInfo/prices/price" Тогда
				sizeInfoPrice = Новый Структура("price, id"); 
				
			ИначеЕсли Чтение.Имя = "stateCodes" И ТекущийПуть = "items/item/stateCodes" Тогда
				stateCodes = Новый Структура("tnved, okpd2");

			КонецЕсли;  
			
				
			Пока Чтение.ПрочитатьАтрибут() Цикл 
				
				Если НЕ ЗначениеЗаполнено(ТекущийПуть) Тогда 
					Продолжить;
				КонецЕсли;
				
				// Прочитать данные узла атрибута. 
				ТипУзла = Чтение.ТипУзла; 
				Имя = Чтение.Имя; 
				Значение = Чтение.Значение; 
				
				// Обработать полученные значения.
				Если Чтение.Имя = "id" И ТекущийПуть = "main/prices/price" Тогда
					price.Вставить("id", XMLСтрока(Значение));
				ИначеЕсли Чтение.Имя = "uuid" И ТекущийПуть = "items/item" Тогда
					item.Вставить("uuid", XMLСтрока(Значение)); 
				ИначеЕсли Чтение.Имя = "size" И ТекущийПуть = "items/item/sizesInfo/sizeInfo" Тогда	
					sizeInfo.Вставить("size", XMLСтрока(Значение));
				ИначеЕсли Чтение.Имя = "id" И ТекущийПуть = "items/item/sizesInfo/sizeInfo/prices/price" Тогда
					sizeInfoPrice.Вставить("id", XMLСтрока(Значение));
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.Текст Тогда
			Если НЕ ЗначениеЗаполнено(ТекущийПуть) Тогда 
				Продолжить;
			КонецЕсли;
			
			// Обработать полученные значения.			
			Если  ТекущийПуть = "main/prices/price/name" Тогда  
				price.Вставить("name", XMLСтрока(Чтение.Значение)); 
			ИначеЕсли ТекущийПуть = "main/prices/price/currency" Тогда 
				price.Вставить("currency", XMLСтрока(Чтение.Значение));
				
			ИначеЕсли ТекущийПуть = "items/item/active" Тогда 
				item.Вставить("active", XMLСтрока(Чтение.Значение));   
			ИначеЕсли ТекущийПуть = "items/item/parentId" Тогда 
				item.Вставить("parentId", XMLСтрока(Чтение.Значение));
			ИначеЕсли ТекущийПуть = "items/item/typeItemId" Тогда 
				item.Вставить("typeItemId", XMLСтрока(Чтение.Значение));
			ИначеЕсли ТекущийПуть = "items/item/article" Тогда 
				item.Вставить("article", XMLСтрока(Чтение.Значение));
			ИначеЕсли ТекущийПуть = "items/item/name" Тогда 
				item.Вставить("name", XMLСтрока(Чтение.Значение));  
				
			ИначеЕсли ТекущийПуть = "items/item/images" Тогда 
				item.Вставить("images", XMLСтрока(Чтение.Значение)); 
			ИначеЕсли ТекущийПуть = "items/item/fullDescr" Тогда 
				item.Вставить("fullDescr", XMLСтрока(Чтение.Значение)); 
			ИначеЕсли ТекущийПуть = "items/item/shortDescr" Тогда 
				item.Вставить("shortDescr", XMLСтрока(Чтение.Значение)); 
			ИначеЕсли ТекущийПуть = "items/item/materialDescr" Тогда 
				item.Вставить("materialDescr", XMLСтрока(Чтение.Значение)); 
			ИначеЕсли ТекущийПуть = "items/item/vatCode" Тогда 
				item.Вставить("vatCode", XMLСтрока(Чтение.Значение)); 
			ИначеЕсли ТекущийПуть = "items/item/color" Тогда 
				item.Вставить("color", XMLСтрока(Чтение.Значение)); 
				
				
			ИначеЕсли ТекущийПуть = "items/item/packingUnit/length" Тогда 
				packingUnit.Вставить("length", XMLСтрока(Чтение.Значение));
			ИначеЕсли ТекущийПуть = "items/item/packingUnit/width" Тогда 
				packingUnit.Вставить("width", XMLСтрока(Чтение.Значение));
			ИначеЕсли ТекущийПуть = "items/item/packingUnit/height" Тогда 
				packingUnit.Вставить("height", XMLСтрока(Чтение.Значение));
			ИначеЕсли ТекущийПуть = "items/item/packingUnit/volume" Тогда 
				packingUnit.Вставить("volume", XMLСтрока(Чтение.Значение));
			ИначеЕсли ТекущийПуть = "items/item/packingUnit/weight" Тогда 
				packingUnit.Вставить("weight", XMLСтрока(Чтение.Значение));
				
			ИначеЕсли ТекущийПуть = "items/item/sizesInfo/sizeInfo/sizeText" Тогда 
				sizeInfo.Вставить("sizeText", XMLСтрока(Чтение.Значение));
			ИначеЕсли ТекущийПуть = "items/item/sizesInfo/sizeInfo/sizeText" Тогда 
				sizeInfo.Вставить("sizeText", XMLСтрока(Чтение.Значение));
			ИначеЕсли ТекущийПуть = "items/item/sizesInfo/sizeInfo/ean" Тогда 
				sizeInfo.Вставить("ean", XMLСтрока(Чтение.Значение));
				
			ИначеЕсли ТекущийПуть = "items/item/sizesInfo/sizeInfo/prices/price" Тогда
				sizeInfoPrice.Вставить("price", XMLСтрока(Чтение.Значение)); 
				
			ИначеЕсли ТекущийПуть = "items/item/stateCodes/tnved" Тогда
                 stateCodes.Вставить("tnved", XMLСтрока(Чтение.Значение));  
			ИначеЕсли ТекущийПуть = "items/item/stateCodes/okpd2" Тогда
                 stateCodes.Вставить("okpd2", XMLСтрока(Чтение.Значение));
			КонецЕсли; 

			
		ИначеЕсли Чтение.ТипУзла = ТипУзлаXML.КонецЭлемента Тогда
			Если НЕ ЗначениеЗаполнено(ТекущийПуть) Тогда 
				Продолжить;
			КонецЕсли;
			// Обработать полученные значения.
			Если ТекущийПуть = "main/prices/price" И Чтение.Имя = "price" Тогда   
				prices.Добавить(price);
			ИначеЕсли ТекущийПуть = "items/item/packingUnit" И Чтение.Имя = "packingUnit" Тогда   
				item.Вставить("packingUnit", packingUnit); 
			ИначеЕсли ТекущийПуть = "items/item/sizesInfo/sizeInfo/prices/price" И Чтение.Имя = "price" Тогда   
				sizeInfoPrices.Добавить(sizeInfoPrice);  
			ИначеЕсли ТекущийПуть = "items/item/sizesInfo/sizeInfo/prices" И Чтение.Имя = "prices" Тогда   
				sizeInfo.Вставить("prices", sizeInfoPrices);   
			ИначеЕсли ТекущийПуть = "items/item/sizesInfo/sizeInfo" И Чтение.Имя = "sizeInfo" Тогда   
				sizesInfo.Добавить(sizeInfo); 
			ИначеЕсли ТекущийПуть = "items/item/sizesInfo" И Чтение.Имя = "sizesInfo" Тогда   
				item.Вставить("sizesInfo", sizesInfo);
			ИначеЕсли ТекущийПуть = "items/item/stateCodes" И Чтение.Имя = "stateCodes" Тогда   
				item.Вставить("stateCodes", stateCodes);
			ИначеЕсли ТекущийПуть = "items/item" И Чтение.Имя = "item" Тогда   
				items.Добавить(item);
				
			КонецЕсли;  
			
			Если СтекУзлов.Количество() = 0 Тогда
				Прервать;
			КонецЕсли;
			СтекУзлов.Удалить(СтекУзлов.Количество() - 1);
			ТекущийПуть = МассивВСтроку(СтекУзлов);
			
		КонецЕсли; 
		
	КонецЦикла; 
	
	СтруктураСообщения.Вставить("prices", prices); 
	СтруктураСообщения.Вставить("items", items);
	
	Возврат СтруктураСообщения; 
КонецФункции

Функция МассивВСтроку(Массив)
	Возврат СтрСоединить(Массив, "/");
КонецФункции 

Функция ЧтениеИЗаписьXMLИзПодготовленныхДанных(ДанныеДляФайла) Экспорт 
	ПрочтенноеСообщение = Новый Структура;
	ВременныйФайл = ПолучитьИмяВременногоФайла("xml");
	Попытка
		ПолучитьФайлXML(ВременныйФайл, ДанныеДляФайла);
	Исключение 
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("Чтение и запись XML в исходящее сообщение", УровеньЖурналаРегистрации.Ошибка, , ,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)); 
	КонецПопытки; 
			
	Двоичное = Новый ДвоичныеДанные(ВременныйФайл); 
	
	ПрочтенноеСообщение.Вставить("ДвоичныеДанные", ПоместитьВоВременноеХранилище(Двоичное)); 
	ПрочтенноеСообщение.Вставить("Префикс", "FE714");	

	Возврат ПрочтенноеСообщение;
КонецФункции

Функция ПолучитьФайлXML(ИмяВременногоФайла, ДанныеДляФайла)
	prices  = Новый ТаблицаЗначений;
	prices.Колонки.Добавить("id", Новый ОписаниеТипов("Строка"));
	prices.Колонки.Добавить("name", Новый ОписаниеТипов("Строка"));
	prices.Колонки.Добавить("currency", Новый ОписаниеТипов("Строка"));
	
	Для каждого Данные Из ДанныеДляФайла Цикл
		
		Для каждого pricе Из Данные.prices Цикл 
			НоваяСтрока =  prices.Добавить();
			НоваяСтрока.id = pricе.id;  
			НоваяСтрока.name = pricе.name;
			НоваяСтрока.currency = pricе.currency;
		КонецЦикла;	
	КонецЦикла; 
	
	pricesДляЗаполнения =  prices.СкопироватьКолонки();
	
	pricеСвертка = prices.Скопировать(, "id");
	pricеСвертка.Свернуть("id");   
	
	Для каждого Строкаpricе Из pricеСвертка Цикл
		
		Отбор = Новый Структура();
		Отбор.Вставить("id", Строкаpricе.id);
		НайденыеСтроки = prices.НайтиСтроки(Отбор);
		Если НайденыеСтроки.Количество() > 0 Тогда
			НоваяСтрока =  pricesДляЗаполнения.Добавить();
			НоваяСтрока.id 			= НайденыеСтроки[0].id;  
			НоваяСтрока.name 		= НайденыеСтроки[0].name;
			НоваяСтрока.currency 	= НайденыеСтроки[0].currency;
		КонецЕсли; 
	КонецЦикла; 
	
			
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл(ИмяВременногоФайла,"UTF-8"); 
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("productMasterDataRequest");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xs", "http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("", "http://service.profashionsolutions.ru/fe714_r002");
	ЗаписьXML.ЗаписатьНачалоЭлемента("main");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("parents");
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("typesItems");
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("prices"); 
	Если pricesДляЗаполнения.Количество() > 0 И ЗначениеЗаполнено(pricesДляЗаполнения[0].id) Тогда 
		Для каждого ТипЦены Из pricesДляЗаполнения Цикл
			ЗаписьXML.ЗаписатьНачалоЭлемента("price"); 	
			ЗаписьXML.ЗаписатьАтрибут("id", XMLСтрока(ТипЦены.id));
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("name"); 
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(ТипЦены.name));
			ЗаписьXML.ЗаписатьКонецЭлемента();  
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("currency"); 
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(ТипЦены.currency));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЦикла;  
	Иначе 
		ЗаписьXML.ЗаписатьНачалоЭлемента("price");
		ЗаписьXML.ЗаписатьАтрибут("id", XMLСтрока(""));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("name"); 
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
		ЗаписьXML.ЗаписатьКонецЭлемента();  
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("currency"); 
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("commonAddFieldsItem");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("commonAddFieldsSize");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("items");  
	
	Для каждого Данные Из ДанныеДляФайла Цикл
		
		Для каждого item Из Данные.items Цикл  
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("item");
			
			ЗаписьXML.ЗаписатьАтрибут("uuid", XMLСтрока(item.uuid)); 
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("active");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(item.active));
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("parentId");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(item.parentId));
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("typeItemId");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(item.typeItemId));
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("article");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(item.article));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("name");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(item.name));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("images");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("fullDescr");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(item.fullDescr));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("shortDescr");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("materialDescr");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("vatCode");
            ЗаписьXML.ЗаписатьТекст(XMLСтрока(XMLСтрока(item.vatCode)));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("color");
            ЗаписьXML.ЗаписатьТекст(XMLСтрока(XMLСтрока(item.color)));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			

			ЗаписьXML.ЗаписатьНачалоЭлемента("packingUnit"); 
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("length");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(item.packingUnit.height));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("width");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(item.packingUnit.width));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("height");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(item.packingUnit.height));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("volume");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(item.packingUnit.height));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("weight");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(item.packingUnit.weight));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("sizesInfo");  
			
			Если item.sizesInfo.Количество() > 0 Тогда 
				Для каждого sizesInfo Из item.sizesInfo Цикл  
						ЗаписьXML.ЗаписатьНачалоЭлемента("sizeInfo");
						ЗаписьXML.ЗаписатьАтрибут("size", XMLСтрока(sizesInfo.size));
						
						ЗаписьXML.ЗаписатьНачалоЭлемента("sizeText");
						ЗаписьXML.ЗаписатьТекст(XMLСтрока(sizesInfo.sizeText));
						ЗаписьXML.ЗаписатьКонецЭлемента(); 
						
						ЗаписьXML.ЗаписатьНачалоЭлемента("ean");
						ЗаписьXML.ЗаписатьТекст(XMLСтрока(sizesInfo.ean));
						ЗаписьXML.ЗаписатьКонецЭлемента(); 
						
						ЗаписьXML.ЗаписатьНачалоЭлемента("prices");
						Для каждого price Из sizesInfo.prices Цикл
							ЗаписьXML.ЗаписатьНачалоЭлемента("price");
							ЗаписьXML.ЗаписатьАтрибут("id", XMLСтрока(price.id)); 
							ЗаписьXML.ЗаписатьТекст(XMLСтрока(price.price));
							ЗаписьXML.ЗаписатьКонецЭлемента();
						КонецЦикла;
 
						ЗаписьXML.ЗаписатьКонецЭлемента();
						
						ЗаписьXML.ЗаписатьНачалоЭлемента("addFieldValues");
						ЗаписьXML.ЗаписатьКонецЭлемента();
						
						ЗаписьXML.ЗаписатьКонецЭлемента();
				КонецЦикла;
				Иначе
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("sizeInfo");
					ЗаписьXML.ЗаписатьАтрибут("size", XMLСтрока(""));
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("sizeText");
					ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); 
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("ean");
					ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
					ЗаписьXML.ЗаписатьКонецЭлемента(); 
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("prices"); 
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("price");
					ЗаписьXML.ЗаписатьАтрибут("id", XMLСтрока("")); 	
					ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
					ЗаписьXML.ЗаписатьКонецЭлемента();  
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("addFieldValues");
					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					ЗаписьXML.ЗаписатьКонецЭлемента(); 
					
				КонецЕсли;
				
				
				ЗаписьXML.ЗаписатьКонецЭлемента();  
				
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("addFieldValues");
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("buyWithThisItem"); 
				ЗаписьXML.ЗаписатьКонецЭлемента();
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("stateCodes");
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("tnved");
				ЗаписьXML.ЗаписатьТекст(XMLСтрока(item.stateCodes.tnved));
				ЗаписьXML.ЗаписатьКонецЭлемента(); 
				
				ЗаписьXML.ЗаписатьНачалоЭлемента("okpd2");
				ЗаписьXML.ЗаписатьТекст(XMLСтрока(item.stateCodes.okpd2));
				ЗаписьXML.ЗаписатьКонецЭлемента(); 
				
				ЗаписьXML.ЗаписатьКонецЭлемента();
				ЗаписьXML.ЗаписатьКонецЭлемента();
			КонецЦикла; 			
			
		КонецЦикла;
		

	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.Закрыть();  
	
	
	//Стр = ЗаписьXML.Закрыть();


КонецФункции 

Функция ОтправитьСообщениеДокументовПоSOAP(ОтправкаДокументов = Неопределено) Экспорт 
	
	ОтправитьСообщение = Новый Структура("ОшибкаДанных, Результат");  
	
	Если спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спОтключитьПотокиОбработкиДанных") Тогда
		ОтправитьСообщение.Вставить("Результат", Ложь); 
		ОтправитьСообщение.Вставить("ОшибкаДанных", "Отправка сообщений по Web серверу отключена");
		Возврат ОтправитьСообщение;
	КонецЕсли; 
	
	// ++ Терлецкий АВ 25.01.15
	ТаблицаПроверки = Новый ТаблицаЗначений;
	ТаблицаПроверки.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПеремещение"));
	
	Для каждого СсылкаНаОбъект Из ОтправкаДокументов Цикл
		НоваяСтрока = ТаблицаПроверки.Добавить();
		НоваяСтрока.Ссылка = СсылкаНаОбъект; 
	КонецЦикла;
	ОтправленныеСообщения = спОбработкаСобытийВызовСервера.ИсключитьПовторнуюОтправку(ТаблицаПроверки, Перечисления.спСпособПередачи.SOAP);
	
	Если ТипЗнч(ОтправленныеСообщения) = Тип("ТаблицаЗначений") И ОтправленныеСообщения.Количество() > 0 Тогда 
		ОтправитьСообщение.Вставить("Результат", Ложь); 
		ОтправитьСообщение.Вставить("СостояниеДанных", "Заказ с этим номером уже был оформлен магазином");
		Возврат ОтправитьСообщение;
	КонецЕсли; 	
	// -- Терлецкий АВ 25.01.15

	
	Если ТипЗнч(ОтправкаДокументов) <> Тип("Массив") ИЛИ ОтправкаДокументов.Количество() = 0 Тогда 
		ОтправитьСообщение.Вставить("Результат", Ложь);
		Возврат ОтправитьСообщение;
	КонецЕсли; 
	
	Попытка
		WSПрокси = спВзаимодействиеСПодключением.ПодключитьКоннектор(ПредопределенноеЗначение("Перечисление.спТипыКоннекторов.SOAP")); 
	Исключение   
		
		Для каждого СсылкаНаОбъект Из ОтправкаДокументов Цикл
			ЗаписьВЖурнала(СсылкаНаОбъект, Истина);
		КонецЦикла;									
		
		ОтправитьСообщение.Вставить("ОшибкаДанных", "Ошибка подключения к Web серверу");
		ОтправитьСообщение.Вставить("Результат", Ложь);

		Возврат ОтправитьСообщение;
	КонецПопытки;
	
	Для каждого СсылкаНаОбъект Из ОтправкаДокументов Цикл   
		Попытка
			ИсходящееСообщение = спОбслуживаниеОчередей.ОбработкаОчередиИсходящегоСообщения(СсылкаНаОбъект);
		Исключение 
			ЗаписьВЖурнала(СсылкаНаОбъект, Истина);
	
			ОтправитьСообщение.Вставить("ОшибкаДанных", "Ошибка получения данных для отправки сообщения по Web серверу");
			ОтправитьСообщение.Вставить("Результат", Ложь);
			
			Продолжить;
		КонецПопытки; 
		
		Если ИсходящееСообщение.Сообщение <> Неопределено Тогда 
			ЧтениеXML = Новый ЧтениеXML; 
			ЧтениеXML.УстановитьСтроку(ИсходящееСообщение.Сообщение);  
		Иначе
			Если ТипЗнч(ИсходящееСообщение.ОписаниеДанных) = Тип("ХранилищеЗначения") 
				И ЗначениеЗаполнено(ИсходящееСообщение.ОписаниеДанных) Тогда 
				
				Попытка
					Данные 				= ИсходящееСообщение.ОписаниеДанных.Получить();
					Информация 			= ПолучитьИнформациюОшибки(Данные); 
				Исключение
				КонецПопытки; 
								
			КонецЕсли;
			
			ЗаписьВЖурнала(СсылкаНаОбъект, Истина);
			Если ЗначениеЗаполнено(Информация) Тогда 
				ОтправитьСообщение.Вставить("ОшибкаДанных", Информация); 
			Иначе 
				ОтправитьСообщение.Вставить("ОшибкаДанных", "Ошибка получения данных для отправки сообщения по Web серверу");
			КонецЕсли; 
			ОтправитьСообщение.Вставить("Результат", Ложь);
			
			Продолжить;
		КонецЕсли;
		
		Если ЧтениеXML <> Неопределено Тогда
			Попытка
				СвояФабрикаXDTO = WSПрокси.ФабрикаXDTO;
				СвояФабрикаXDTO = СвояФабрикаXDTO.ПрочитатьXML(ЧтениеXML); 
				Результат = WSПрокси.createOrder(СвояФабрикаXDTO.service, СвояФабрикаXDTO.param, СвояФабрикаXDTO.version, СвояФабрикаXDTO.order); 
			Исключение 
				ЗаписьВЖурнала(СсылкаНаОбъект, Истина);
				
				ОтправитьСообщение.Вставить("ОшибкаДанных", "Ошибка отправки сообщения по Web серверу");
				ОтправитьСообщение.Вставить("Результат", Ложь);
			КонецПопытки;

		Иначе 
            ЗаписьВЖурнала(СсылкаНаОбъект, Истина);
			
			ОтправитьСообщение.Вставить("ОшибкаДанных", "Ошибка получения данных для отправки сообщения по Web серверу");
			ОтправитьСообщение.Вставить("Результат", Ложь);
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(Результат) = Тип("ОбъектXDTO") Тогда 
			СвойствоОбъектаXDTO = Результат.Свойства();  
			
			ОтправитьСообщение.Вставить("Результат", ?(СвойствоОбъектаXDTO.Получить("successful") <> Неопределено, Результат.successful, Ложь)); 
			Если Не Результат.successful Тогда 
				СообщениеОшибки = ПолучитьРасшифровкуОшибки(Результат.faultHandler.errorCode);
				ОтправитьСообщение.Вставить("СостояниеДанных", СообщениеОшибки);
				ОтправитьСообщение.Вставить("КодОшибки", Результат.faultHandler.errorCode); 
			Иначе
				
				ОтправитьСообщение.Вставить("СостояниеДанных", "Отправка исходящего сообщения Web-серверу успешна");
			КонецЕсли;
			
			Если Результат.successful Тогда  
				ЗаписьВЖурнала(СсылкаНаОбъект, Ложь);
			Иначе 
				ЗаписьВЖурнала(СсылкаНаОбъект, Истина);
			КонецЕсли;
		КонецЕсли;
		
    КонецЦикла;
	
	Возврат ОтправитьСообщение;
КонецФункции

Функция ПространствоИмен()
    Возврат спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спSOAPПространстваИменСервиса")
КонецФункции

Функция ПолучитьРасшифровкуОшибки(errorCode)  
	
	КодОшибок = Новый Соответствие; 
	КодОшибок.Вставить(601, "Токен безопасности недействителен");  
	КодОшибок.Вставить(634, "Адрес электронной почты не был указан");
	КодОшибок.Вставить(635, "Телефон не был предоставлен");
	КодОшибок.Вставить(636, "Имя не было указано");
	КодОшибок.Вставить(650, "Веб-службы версии ошибки");
	КодОшибок.Вставить(666, "Внутренняя ошибка");
	КодОшибок.Вставить(712, "Ошибка при разборе списка товаров");
	КодОшибок.Вставить(714, "Ошибка в идентификации товара");
	КодОшибок.Вставить(716, "Этот товар не идентифицирован");
	КодОшибок.Вставить(717, "Этот размер не идентифицирован");
	КодОшибок.Вставить(719, "Не все товары идентифицированы");
	КодОшибок.Вставить(720, "Нет в наличии. АМОС");
	КодОшибок.Вставить(721, "Нет в наличии. 1С");
    КодОшибок.Вставить(722, "Безуспешный поиск остатков товара. AMOS+1C");
	КодОшибок.Вставить(804, "Идентификатор заказа пуст");
	КодОшибок.Вставить(822, "Товары, не прошедшие контроль цен");
	КодОшибок.Вставить(699, "Заказ с этим номером уже был оформлен магазином");
	
	Возврат КодОшибок.Получить(errorCode);
КонецФункции

Процедура ЗаписьВЖурнала(СсылкаНаОбъект, Ошибка)
	Если Ошибка Тогда 
		
		ИдентификаторСообщения = спОбщегоНазначенияВызовСервера.ПолучитьИдентификаторСообщенияПоСсылке(СсылкаНаОбъект, ПредопределенноеЗначение("Перечисление.спСпособПередачи.SOAP"));
		ЗаписьЖурнала = Новый Структура; 
		ЗаписьЖурнала.Вставить("Ошибка", Истина);
		ЗаписьЖурнала.Вставить("СтатусСообщения", ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.ОшибкаОтправки"));
		ЗаписьЖурнала.Вставить("Идентификатор", ИдентификаторСообщения);
		ЗаписьЖурнала.Вставить("СпособПередачи", ПредопределенноеЗначение("Перечисление.спСпособПередачи.SOAP"));
		ЗаписьЖурнала.Вставить("Ссылка", СсылкаНаОбъект);
		ЗаписьЖурнала.Вставить("ИмяФайла", Неопределено);
		ЗаписьЖурнала.Вставить("ТипИнтеграции", ПредопределенноеЗначение("Перечисление.спТипыИнтеграции.Исходящая"));
		ЗаписьЖурнала.Вставить("ЗаписатьВОчередьИсходящих", Ложь);	
		спРаботаСДаннымиВызовСервера.ЗаписьВЖурнал(ЗаписьЖурнала);
	Иначе  
		
		ИдентификаторСообщения = спОбщегоНазначенияВызовСервера.ПолучитьИдентификаторСообщенияПоСсылке(СсылкаНаОбъект, ПредопределенноеЗначение("Перечисление.спСпособПередачи.SOAP"));
		ЗаписьЖурнала = Новый Структура; 
		ЗаписьЖурнала.Вставить("Ошибка", Ложь);
		ЗаписьЖурнала.Вставить("СтатусСообщения", ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.Отправлено"));
		ЗаписьЖурнала.Вставить("Идентификатор", ИдентификаторСообщения);
		ЗаписьЖурнала.Вставить("СпособПередачи", ПредопределенноеЗначение("Перечисление.спСпособПередачи.SOAP"));
		ЗаписьЖурнала.Вставить("Ссылка", СсылкаНаОбъект);
		ЗаписьЖурнала.Вставить("ИмяФайла", Неопределено);
		ЗаписьЖурнала.Вставить("ТипИнтеграции", ПредопределенноеЗначение("Перечисление.спТипыИнтеграции.Исходящая"));
		ЗаписьЖурнала.Вставить("ЗаписатьВОчередьИсходящих", Истина);	
		спРаботаСДаннымиВызовСервера.ЗаписьВЖурнал(ЗаписьЖурнала);
		
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьИнформациюОшибки(Информация) 
	СообщенииеОшибки = "";
	Если ТипЗнч(Информация) = Тип("Структура") Тогда 
		СообщенииеОшибки = ПолучитьДанные(Информация);
	Иначе 	
		СерилизированаяИнформация = ДесериализоватьИзJSON(Информация);  
		Если ТипЗнч(СерилизированаяИнформация) = Тип("Структура") Тогда 	
			СообщенииеОшибки = ПолучитьДанные(СерилизированаяИнформация);
		КонецЕсли; 
	КонецЕсли;
	Возврат СообщенииеОшибки;
КонецФункции

Функция ПолучитьДанные(ИнформацияСообщения)
	
	СообщенииеОшибки = "";
	ОшибкиВФайле = Новый Массив;
	
	Если ИнформацияСообщения.Service.MessageDate = Ложь Тогда 
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Дата сообщения»"));
	КонецЕсли;
	
	Если ИнформацияСообщения.Service.MessageID = Ложь Тогда 
		ОшибкиВФайле.Добавить( СтрШаблон("%1", "Не задано значение реквизита «Id сообщения»"));
	КонецЕсли;
	
	Если ИнформацияСообщения.Service.Shop = Ложь Тогда 
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «shop»"));
	КонецЕсли;
	
	Если ИнформацияСообщения.Service.Token = Ложь Тогда 
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «token»"));
	КонецЕсли;  
	
	Если ИнформацияСообщения.AddFields.LegalReciever = Ложь Тогда  
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Наименование грузополучателя»"));
	КонецЕсли;
	
	Если ИнформацияСообщения.AddFields.legalRecieverAddress = Ложь Тогда  
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Юридический адрес грузополучателя"));
	КонецЕсли; 
	
	Если ИнформацияСообщения.AddFields.legalRecieverINN = Ложь Тогда  
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «ИНН грузополучателя»"));
	КонецЕсли; 
	
	Если ИнформацияСообщения.AddFields.legalRecieverKPP = Ложь Тогда  
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «КПП грузополучателя»"));
	КонецЕсли;
	
	Если ИнформацияСообщения.Order.CarrierId = Ложь Тогда  
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «ID доставщика»"));
	КонецЕсли;  
	
	Если ИнформацияСообщения.Order.Client.Phone = Ложь Тогда  
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Телефон получателя заказа»"));
	КонецЕсли;

	Если ИнформацияСообщения.Order.Client.СustomerFingerprint.Email = Ложь Тогда  
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «E-mail клиента»"));
	КонецЕсли;

	Если ИнформацияСообщения.Order.DeliveryAddress = Ложь Тогда  
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Адрес доставки заказа»"));
	КонецЕсли;
	
	Если ТипЗнч(ИнформацияСообщения.Order.DeliveryAddress) = Тип("Структура") Тогда 
		Если ИнформацияСообщения.Order.DeliveryAddress.zip = Ложь Тогда 
			ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Индекс адреса доставки заказа»"));
		КонецЕсли;
		
		Если ИнформацияСообщения.Order.DeliveryAddress.region = Ложь Тогда 
			ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Регион адреса доставки заказа»"));
		КонецЕсли;
		
		Если ИнформацияСообщения.Order.DeliveryAddress.city = Ложь Тогда 
			ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Город адреса доставки заказа»"));
		КонецЕсли;
		
		Если ИнформацияСообщения.Order.DeliveryAddress.street = Ложь Тогда 
			ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Улица адреса доставки заказа»"));
		КонецЕсли;
		
		Если ИнформацияСообщения.Order.DeliveryAddress.building = Ложь Тогда 
			ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Здание адреса доставки заказа»"));
		КонецЕсли;
	КонецЕсли;


	Если ИнформацияСообщения.Order.PaymentMode = Ложь Тогда  
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Код способа оплаты»"));
	КонецЕсли;

	
	Если ИнформацияСообщения.Param.OrderType = Ложь Тогда  
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Тип заказа»"));
	КонецЕсли; 
	
	Если ИнформацияСообщения.Version = Ложь Тогда  
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Версия операции»"));
	КонецЕсли;
	
	Если ИнформацияСообщения.WSПрокси = Ложь Тогда  
		ОшибкиВФайле.Добавить(СтрШаблон("%1", "Ошибка «WS прокси»"));
	КонецЕсли;

	
	Товары = Новый Массив;
	Для каждого ЭлементТовара Из ИнформацияСообщения.Order.Items Цикл 
		Ошибка = Ложь;
		Товар = Новый Структура("Гуид, Ean, Quantity, Размер, Price");
		
		Если ЭлементТовара.Uuid = Ложь ИЛИ ЭлементТовара.Ean = Ложь ИЛИ ЭлементТовара.Quantity = Ложь 
			ИЛИ ЭлементТовара.Size = Ложь ИЛИ ЭлементТовара.Price = Ложь Тогда 
			
			Товар.Вставить("Гуид", 			ЭлементТовара.Uuid);
			Товар.Вставить("Ean", 			ЭлементТовара.Ean); 
			Товар.Вставить("Количество", 	ЭлементТовара.Quantity); 
			Товар.Вставить("Размер", 		ЭлементТовара.Size);
			Товар.Вставить("Цена", 			ЭлементТовара.Price);
			Ошибка = Истина;
		КонецЕсли;  
		
		Если Ошибка Тогда 
			Товары.Добавить(Товар);
			ОшибкаФайла = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Товары.Количество() > 0 Тогда
		
		Для каждого ЭлементТовары Из Товары Цикл
			Если ЭлементТовары.Гуид = Ложь ИЛИ ЭлементТовары.Ean = Ложь ИЛИ ЭлементТовары.Количество = Ложь ИЛИ ЭлементТовары.Размер = Ложь ИЛИ ЭлементТовары.Цена = Ложь Тогда				
				
				Если ЭлементТовары.Гуид = Ложь Тогда 
					ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Номенклатура»"));
				КонецЕсли;
				
				Если ЭлементТовары.Ean  = Ложь Тогда 
					ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Ean"));
				КонецЕсли;
				
				Если ЭлементТовары.Количество = Ложь Тогда 
					ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Количество»"));
				КонецЕсли;
				
				Если ЭлементТовары.Размер = Ложь Тогда 
					ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Размер»"));
				КонецЕсли;
				
				Если ЭлементТовары.Цена = Ложь Тогда 
					ОшибкиВФайле.Добавить(СтрШаблон("%1", "Не задано значение реквизита «Цена»"));
				КонецЕсли;
				
			КонецЕсли;
						
		КонецЦикла;	
	КонецЕсли;
	
	Если ОшибкиВФайле.Количество() > 0 Тогда 
		ОшибкиВФайлеБезДублей = УдалитьПовторяющиесяЭлементыМассива(ОшибкиВФайле);
		СообщенииеОшибки = ВывестиЭлементыМассиваВСтроку(ОшибкиВФайлеБезДублей);
	КонецЕсли; 
	
    Возврат СообщенииеОшибки;
КонецФункции

Функция ДесериализоватьИзJSON(СтрокаJSON, ПоляДата = "")
    
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
    Значение = ПрочитатьJSON(ЧтениеJSON,, ПоляДата, ФорматДатыJSON.ISO);          
    ЧтениеJSON.Закрыть();
    Возврат Значение;
    
КонецФункции 

Функция УдалитьПовторяющиесяЭлементыМассива(Массив) 
	ТекущийИндекс = 0; 
	ВсегоЭлементов = Массив.Количество(); 
	Пока ТекущийИндекс < ВсегоЭлементов Цикл 
		Индекс2 = ТекущийИндекс + 1; 
		Пока Индекс2 < ВсегоЭлементов Цикл 
			Если Массив[Индекс2] = Массив[ТекущийИндекс] Тогда 
				Массив.Удалить(Индекс2); 
				ВсегоЭлементов = ВсегоЭлементов - 1; 
			Иначе 
				Индекс2 = Индекс2 + 1; 
			КонецЕсли; 
		КонецЦикла; 
		ТекущийИндекс = ТекущийИндекс + 1; 
	КонецЦикла;
	
	Возврат Массив; 
КонецФункции 

Функция ВывестиЭлементыМассиваВСтроку(Массив)
	ВыходнаяСтрока = "";
	Разделитель = "; ";
	Для каждого ЭлементМассива Из Массив Цикл
		ВыходнаяСтрока = ВыходнаяСтрока + ?(ПустаяСтрока(ВыходнаяСтрока), "", Разделитель);
		ВыходнаяСтрока = ВыходнаяСтрока + ЭлементМассива;
	КонецЦикла;
	Возврат ВыходнаяСтрока;
КонецФункции

 #КонецОбласти 
