#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормы

&После("ПриСозданииНаСервере")
Процедура спПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка)
	
	Если Форма.ИмяФормы = "Обработка.ПроверкаИПодборПродукцииИСМП.Форма.ПроверкаИПодбор" Тогда
	
		Параметры = Форма.Параметры;
		
		Если Параметры.Свойство("ПроверяемыйДокумент") И ТипЗнч(Параметры.ПроверяемыйДокумент) = Тип("ДокументСсылка.спПриемкаТовара") Тогда
			
		Если Форма.ПодобраннаяМаркируемаяПродукция.Количество() > 0 Тогда
			Возврат;
		КонецЕсли;
			
			// Заполним ТЧ ПодобраннаяМаркируемаяПродукция из документа  
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	спПриемкаТовараЗапасы.Номенклатура КАК Номенклатура,
			|	спПриемкаТовараЗапасы.Принято КАК Принято,
			|	спПриемкаТовараЗапасы.Количество КАК Количество,
			|	спПриемкаТовараЗапасы.КоличествоФакт КАК КоличествоФакт,
			|	спПриемкаТовараЗапасы.Отклонение КАК Отклонение,
			|	спПриемкаТовараЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	спПриемкаТовараЗапасы.СерииНоменклатуры КАК СерииНоменклатуры,
			|	спПриемкаТовараЗапасы.Характеристика КАК Характеристика,
			|	""0"" + спПриемкаТовараЗапасы.Номенклатура.Штрихкод КАК GTIN
			|ИЗ
			|	Документ.спПриемкаТовара.Запасы КАК спПриемкаТовараЗапасы
			|ГДЕ
			|	спПриемкаТовараЗапасы.Ссылка = &Ссылка
			|	И спПриемкаТовараЗапасы.Номенклатура.УдалитьВидПродукцииИС = &ВидПродукцииИС";
			
			Запрос.УстановитьПараметр("ВидПродукцииИС", Параметры.ВидМаркируемойПродукции);
			Запрос.УстановитьПараметр("Ссылка", Параметры.ПроверяемыйДокумент);
			
			РезультатЗапроса = Запрос.Выполнить();
			Запасы = РезультатЗапроса.Выгрузить();	
			Форма.ПодобраннаяМаркируемаяПродукция.Загрузить(Запасы);  
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
