
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Цвета.Ссылка КАК Ссылка,
	|	Цвета.RGB КАК RGB
	|ИЗ
	|	Справочник.спЦвета КАК Цвета";
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОформляемоеПоле  = "Заливка";
	ИмяПоляСсылка    = "Ссылка";
	
	Пока Выборка.Следующий() Цикл 
		
		МассивЦветов = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Выборка.RGB, ",",Ложь,Истина);
		Если МассивЦветов.Количество() = 3 Тогда
			
			ЦветФона = Новый Цвет(МассивЦветов[0], МассивЦветов[1], МассивЦветов[2]);
			
			Если ТипЗнч(ЦветФона) <> Тип("Цвет") Тогда
				Продолжить;
			КонецЕсли;
			
			УсловноеОформлениеКД = Список.КомпоновщикНастроек.Настройки.УсловноеОформление;
			
			ЭлементУсловногоОформленияФон = УсловноеОформлениеКД.Элементы.Добавить();
			
			ЭлементУсловногоОформленияФон.Оформление.УстановитьЗначениеПараметра("ЦветФона", ЦветФона);
			ЭлементУсловногоОформленияФон.ИдентификаторПользовательскойНастройки = "ЦветФона";
			ЭлементУсловногоОформленияФон.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
			ЭлементУсловногоОформленияФон.Представление	= НСтр("ru='Палитра цветов'");
			
			ЭлементОтбора = ЭлементУсловногоОформленияФон.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных(ИмяПоляСсылка);
			ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.ПравоеЗначение	= Выборка.Ссылка;
		
			Если ОформляемоеПоле <> Неопределено Тогда
				ОформляемоеПолеКД = ЭлементУсловногоОформленияФон.Поля.Элементы.Добавить();
				ОформляемоеПолеКД.Поле = Новый ПолеКомпоновкиДанных(ОформляемоеПоле);
				ОформляемоеПолеКД.Использование = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти