#Область ПрограммныйИнтерфейс

Процедура ВыполнитьОбменОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если Отказ = Ложь И НЕ Источник.ОбменДанными.Загрузка И ОтправлятьСообщение(Источник) Тогда	
		Если  ТипЗнч(Источник) = Тип("ДокументОбъект.ПеремещениеЗапасов") ИЛИ ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходнаяНакладная") Тогда 
			ЗарегистрироватьСобытиеОтправкиСообщенийFTP(Источник.Ссылка); 
		ИначеЕсли  ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказНаПеремещение") Тогда  
			ЗарегистрироватьСобытиеОтправкиСообщенийSOAP(Источник.Ссылка);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ВыполнитьОбменПриЗаписи(Источник, Отказ) Экспорт
	Если Отказ = Ложь И НЕ Источник.ОбменДанными.Загрузка Тогда 
		ЗаполнитьОписаниеGTINИС(Источник.Ссылка)
	КонецЕсли;
КонецПроцедуры  

// ++ Терлецкий АВ 25.01.20
Процедура ПередЗаписьюДокументаАвтозаполнениеРеквизитов(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт 
	Если Отказ = Ложь И НЕ Источник.ОбменДанными.Загрузка Тогда
		ДокументОснованиеНомер = Неопределено;
		Префикс = 0;
		Попытка
			ДокументОснованиеНомер = Источник["ДокументОснование"].Номер; 
			Префикс = ?(ЗначениеЗаполнено(ДокументОснованиеНомер), Найти(ДокументОснованиеНомер, "СЗ"), 0);
		Исключение
			Префикс = 0;
		КонецПопытки;
			
		Если ТипЗнч(Источник) = Тип("ДокументОбъект.ОперацияПоПлатежнымКартам") И Префикс > 0 Тогда 
			ЗаполнитьВидОплаты(Источник);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
// -- Терлецкий АВ 25.01.20

// ++ Терлецкий АВ 25.02.04
Процедура ВыполнитьПередЗаписью(Источник, Отказ) Экспорт 
	
	Если ЗначениеЗаполнено(Источник.спЦвет) Тогда 
		ЗаполнитьГруппаЦветИсправление(Источник);
	Иначе 
		ОчиститьДополнительныйРеквизит(Источник, "Группа цвета");
		ОчиститьДополнительныйРеквизит(Источник, "Цвет для сайта");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.спРазмер) Тогда 
		ЗаполнитьРазмерРостДляСайтаИсправление(Источник);
	Иначе 
		ОчиститьДополнительныйРеквизит(Источник, "Размер для сайта"); 
		ОчиститьДополнительныйРеквизит(Источник, "Рост для сайта");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Источник.спБренд) Тогда 
		ЗаполнитьБрендИсправление(Источник);
	Иначе 
		ОчиститьДополнительныйРеквизит(Источник, "Бренд");

	КонецЕсли; 
	
	// ++ Терлецкий АВ 25.03.18
	Если ЗначениеЗаполнено(Источник.СтранаПроисхождения) Тогда 
		ЗаполнитьСтранаПроизводителяИсправление(Источник);
	Иначе 
		ОчиститьДополнительныйРеквизит(Источник, "Страна производителя");

	КонецЕсли;
    // ++ Терлецкий АВ 25.03.18
	
КонецПроцедуры 
// -- Терлецкий АВ 25.02.04

// Процедура - Зарегистрировать событие
//
// Параметры:
//  СсылкаНаОбъект - Справочни.Объект, Документ.Объект, РегистрСведений.НаборЗаписей - объект-источник события.
//	ЭтоРегистр - булево - это событие регистрации регистра
//	ЭтоУдаление - булево - это удаление  
//
Процедура ЗарегистрироватьСообщение(СсылкаНаОбъект, ЭтоРегистр = Ложь, ЭтоУдаление = Ложь) Экспорт  
	
	СсылкиНаОбъект = Новый Массив;
	СсылкиНаОбъект.Добавить(СсылкаНаОбъект);
	ОчиститьРегистрПоСсылкеНаОбъект(СсылкиНаОбъект, Перечисления.спСпособПередачи.FTP);
	
	ПомещатьВХранилищеЗначения = Истина;
	ТипОбъекта = СсылкаНаОбъект.Метаданные().ПолноеИмя();
	ЗначениеХранения = Неопределено;
	МетодХранения = Перечисления.спМетодХранения.Сериализация;
	ФорматСериализация = Перечисления.спФорматыСообщений.XML;
	СпособПередачи = Перечисления.спСпособПередачи.FTP;
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	#Иначе				
		ЗначениеХранения = спФункцииРаботыXMLВызовСервера.СериализоватьОбъект(СсылкаНаОбъект);
	#КонецЕсли 
	
	Если Не ЗначениеХранения = Неопределено Тогда
		спРаботаСДаннымиВызовСервера.ПоместитьВОчередьИсходящих(ТипОбъекта, ЗначениеХранения, ФорматСериализация,
		МетодХранения, СпособПередачи, ПомещатьВХранилищеЗначения, ЭтоУдаление, СсылкаНаОбъект);
	КонецЕсли;
		
КонецПроцедуры

Процедура спПриходнаяНакладнаяОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Не Отказ Тогда 
		
		// ++ Терлецкий АВ 25.01.23
		ДокументСсылкаУстановкаЦенНоменклатуры = ПолучитьДокументУстановкиЦен(Источник); 
		
		Если ТипЗнч(ДокументСсылкаУстановкаЦенНоменклатуры) = Тип("ДокументСсылка.УстановкаЦенНоменклатуры") 
			И ДокументСсылкаУстановкаЦенНоменклатуры <> Документы.УстановкаЦенНоменклатуры.ПустаяСсылка() Тогда
			
			ДокументУстановкаЦен = ДокументСсылкаУстановкаЦенНоменклатуры.ПолучитьОбъект();
			ДокументУстановкаЦен.Запасы.Очистить();
		Иначе 
			
			ДокументУстановкаЦен = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент(); 
		КонецЕсли; 
		
		Если ТипЗнч(ДокументУстановкаЦен) <> Тип("ДокументОбъект.УстановкаЦенНоменклатуры") Тогда 
			Возврат;
		КонецЕсли;
		// -- Терлецкий АВ 25.01.23
		
		ДокументУстановкаЦен.Дата = ТекущаяДатаСеанса(); 
		ДокументУстановкаЦен.ЗаписыватьНовыеЦеныПоверхУстановленных = Истина;
		ДокументУстановкаЦен.ПоказыватьХарактеристики 				= Истина;
		ДокументУстановкаЦен.ПоказыватьДействующуюЦену 				= Истина;
		ДокументУстановкаЦен.ПоказыватьОтклонениеЦен   				= Истина;
		ДокументУстановкаЦен.ПоказыватьЕдиницыИзмерения 			= Истина;
		ДокументУстановкаЦен.ПоказыватьЗависимыеЦены                = Истина;
		ДокументУстановкаЦен.ПоказыватьНовуюЦену                    = Истина;  
		
		ДокументУстановкаЦен.ДокументОснование 						= Источник.Ссылка; // ++ Терлецкий АВ 25.01.28 
		ДокументУстановкаЦен.Комментарий 							= "Документ цен создан программно";
		ДокументУстановкаЦен.Автор 									= Пользователи.ТекущийПользователь(); 
		
		ВидЦены = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спВидЦеныПоступления");
		ТаблицаЗапасы = ДокументУстановкаЦен.Запасы.Выгрузить(); 
		
		ИсточникЗапасы = Источник.Запасы.Выгрузить();
		ИсточникЗапасы.Свернуть("Номенклатура, Характеристика");
		
		Для каждого СтрокаЗапасы Из ИсточникЗапасы Цикл  
			
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Номенклатура", 	СтрокаЗапасы.Номенклатура);
			СтруктураПоиска.Вставить("Характеристика",	СтрокаЗапасы.Характеристика);
			НайденыеСтроки = Источник.Запасы.НайтиСтроки(СтруктураПоиска);
			Если НайденыеСтроки.Количество() > 0 Тогда
				НоваяСтрокаЗапасы = ТаблицаЗапасы.Добавить();
				НоваяСтрокаЗапасы.Номенклатура 		= СтрокаЗапасы.Номенклатура; 
				НоваяСтрокаЗапасы.Характеристика 	= СтрокаЗапасы.Характеристика;
				НоваяСтрокаЗапасы.ВидЦены 			= ВидЦены;
				НоваяСтрокаЗапасы.Валюта 			= ВидЦены.ВалютаЦены;  
				Если НайденыеСтроки.Количество() > 0 Тогда
					Если НайденыеСтроки[0].Количество > 1 Тогда
						НоваяСтрокаЗапасы.Цена 				= НайденыеСтроки[0].Сумма / НайденыеСтроки[0].Количество; 
					Иначе 
						НоваяСтрокаЗапасы.Цена 				= НайденыеСтроки[0].Цена
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Попытка
			
			ДокументУстановкаЦен.Запасы.Загрузить(ТаблицаЗапасы); 
			ДокументУстановкаЦен.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение   
	
			ТекстСообщения = СтрШаблон(НСтр("ru = 'Ошибка проведения документа ""Установка цен номенклатуры"" '"),);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик подписки на событие спКонтагентПередЗаписью
//
// Параметры:
//  Источник - СправочникОбъект.Контрагенты - объект справочника контрагенты
//  Отказ	 - Булево - признак отказа от выполнения записи
//
Процедура спКонтрагентПередЗаписью(Источник, Отказ) Экспорт
	
	// { Иванов С.С. (TNext) - 13.05.2025 - Задача № 1774 
	Если Не ЗначениеЗаполнено(Источник.ВидКонтрагента) Тогда
		Источник.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Источник.СчетУчетаАвансовПокупателя) Тогда
		Источник.СчетУчетаАвансовПокупателя = ПланыСчетов.Управленческий.РасчетыПоАвансамПолученным;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Источник.СчетУчетаАвансовПоставщику) Тогда
		Источник.СчетУчетаАвансовПоставщику = ПланыСчетов.Управленческий.РасчетыПоАвансамВыданным;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Источник.СчетУчетаРасчетовСПокупателем ) Тогда
		Источник.СчетУчетаРасчетовСПокупателем = ПланыСчетов.Управленческий.РасчетыСПокупателями;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Источник.СчетУчетаРасчетовСПоставщиком) Тогда
		Источник.СчетУчетаРасчетовСПоставщиком = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
	КонецЕсли;
	// }
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

// Процедура - Зарегистрировать событие
//
// Параметры:
//  Источник - Справочни.Объект, Документ.Объект, РегистрСведений.НаборЗаписей - объект-источник события.
//	ЭтоРегистр - булево - это событие регистрации регистра
//	ЭтоУдаление - булево - это удаление  
//
Процедура ЗарегистрироватьСобытиеОтправкиСообщенийFTP(Источник) 
	
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.ПриходнаяНакладная") ИЛИ ТипЗнч(Источник) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда  
		ЗапасыДляЗаписи = ПолучитьНоменклатуруДляОтправки(Источник.Запасы);
		Для каждого СтрокаЗапасов Из ЗапасыДляЗаписи Цикл 
			Если СтрокаЗапасов.Записать Тогда 
				СериализоватьИЗаписатьДанныеВРегистрСообщений(СтрокаЗапасов.Ссылка, Источник);
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли; 	

	ТаблицаПроверки = Новый ТаблицаЗначений;
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда 
		ТаблицаПроверки.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ПеремещениеЗапасов"));
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда 
		ТаблицаПроверки.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ПриходнаяНакладная")); 
	Иначе
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаПроверки.Добавить();
	НоваяСтрока.Ссылка = Источник;
	ОтправленныеСообщения = ИсключитьПовторнуюОтправку(ТаблицаПроверки, Перечисления.спСпособПередачи.FTP); // ++ Терлецкий АВ 25.01.15
	
	Если ТипЗнч(ОтправленныеСообщения) = Тип("ТаблицаЗначений") И ОтправленныеСообщения.Количество() > 0 Тогда 
		Возврат
	КонецЕсли; 
	
	СсылкиНаОбъект = Новый Массив;
	СсылкиНаОбъект.Добавить(Источник); 
	ОчиститьРегистрПоСсылкеНаОбъект(СсылкиНаОбъект, Перечисления.спСпособПередачи.FTP);  

	СериализоватьИЗаписатьДанныеВРегистрСообщений(Источник);
КонецПроцедуры

Функция ПолучитьНоменклатуруДляОтправки(ЗапасыИсточника)
	
	Запасы = ЗапасыИсточника.Выгрузить(,"Номенклатура"); 
	Запасы.Свернуть("Номенклатура");
	Запасы.Колонки.Номенклатура.Имя = "Ссылка";
	Запасы.Колонки.Ссылка.Заголовок = "Ссылка";
	Запасы.Колонки.Добавить("Записать", Новый ОписаниеТипов("Булево"));
	 
	ЗапасыОтправленныеСообщения = ИсключитьПовторнуюОтправку(Запасы, Перечисления.спСпособПередачи.FTP); // ++ Терлецкий АВ 25.01.15
	
	Для каждого СтрокаЗапасов Из Запасы Цикл  
		Если ТипЗнч(СтрокаЗапасов.Ссылка) = Тип("СправочникСсылка.Номенклатура") И СтрокаЗапасов.Ссылка <> Справочники.Номенклатура.ПустаяСсылка() Тогда 
			Если ТипЗнч(ЗапасыОтправленныеСообщения) = Тип("ТаблицаЗначений") Тогда 
				НайденыеСтроки = ЗапасыОтправленныеСообщения.НайтиСтроки(Новый Структура("Ссылка", СтрокаЗапасов.Ссылка));
				Если НайденыеСтроки.Количество() > 0 Тогда
					СтрокаЗапасов.Записать = Ложь; 
				Иначе 
					СтрокаЗапасов.Записать = Истина;
				КонецЕсли;
			Иначе 
				СтрокаЗапасов.Записать = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
		
	ОчиститьВРегистр = Запасы.НайтиСтроки(Новый Структура("Записать", Истина));  
	СсылкиДляОчистики = Новый Массив; 
	Если ОчиститьВРегистр.Количество() > 0 Тогда  
		Для каждого ЗаписьРегистра Из ОчиститьВРегистр Цикл
			СсылкиДляОчистики.Добавить(ЗаписьРегистра.Ссылка);
		КонецЦикла;
		ОчиститьРегистрПоСсылкеНаОбъект(СсылкиДляОчистики, Перечисления.спСпособПередачи.FTP);   
	КонецЕсли;
	
	Возврат Запасы;
КонецФункции

Процедура СериализоватьИЗаписатьДанныеВРегистрСообщений(Источник, ИнициаторОтправкиСсылкаНаОбъект = Неопределено, ЭтоРегистр = Ложь, ЭтоУдаление = Ложь) Экспорт 
	//ОчиститьРегистрПоСсылкеНаОбъект(Источник, Перечисления.спСпособПередачи.FTP);
	
	ПомещатьВХранилищеЗначения = Истина; 
	ТипОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(Источник)).ПолноеИмя();
	ЗначениеХранения = Неопределено;
	МетодХранения = Перечисления.спМетодХранения.Сериализация;
	ФорматСериализация = Перечисления.спФорматыСообщений.XML;
	СпособПередачи = Перечисления.спСпособПередачи.FTP;
	ИдентификаторСообщения = Новый УникальныйИдентификатор();

	#Если ТолстыйКлиентОбычноеПриложение Тогда
	#Иначе				
		ЗначениеХранения = спФункцииРаботыXMLВызовСервера.СериализоватьОбъект(Источник, ИнициаторОтправкиСсылкаНаОбъект);
	#КонецЕсли 
	
	Если ЭтоРегистр Или ЭтоУдаление Тогда		
		СсылкаНаОбъект = Неопределено;		
	Иначе		
		СсылкаНаОбъект = Источник;	
	КонецЕсли; 
	
	Если ТипЗнч(ЗначениеХранения) = тип("Структура") И ЗначениеЗаполнено(ЗначениеХранения.Строка) Тогда
		
		ЗаписьВОчередьИсходящих = Новый Структура;
		ЗаписьВОчередьИсходящих.Вставить("ТипОбъекта", ТипОбъекта);
		ЗаписьВОчередьИсходящих.Вставить("ОбъектСобщения", ЗначениеХранения.Строка);
		ЗаписьВОчередьИсходящих.Вставить("Формат", ФорматСериализация);
		ЗаписьВОчередьИсходящих.Вставить("Метод", МетодХранения);
		ЗаписьВОчередьИсходящих.Вставить("СпособПередачи", СпособПередачи);
		ЗаписьВОчередьИсходящих.Вставить("ПомещатьВХранилищеЗначения", ПомещатьВХранилищеЗначения);
		ЗаписьВОчередьИсходящих.Вставить("ЭтоУдаление", ЭтоУдаление);   
		ЗаписьВОчередьИсходящих.Вставить("СсылкаНаОбъект", СсылкаНаОбъект); 
		ЗаписьВОчередьИсходящих.Вставить("ИдентификаторСообщения", ИдентификаторСообщения);
		ЗаписьВОчередьИсходящих.Вставить("ИнициаторОтправкиСсылкаНаОбъект", ИнициаторОтправкиСсылкаНаОбъект); 
		спРаботаСДаннымиВызовСервера.ПоместитьВОчередьИсходящих(ЗаписьВОчередьИсходящих);
		
		ЗаписьЖурнала = Новый Структура; 
		ЗаписьЖурнала.Вставить("Ошибка", ЗначениеХранения.ОшибкаДанных);  
		ЗаписьЖурнала.Вставить("СтатусСообщения", ?(ЗначениеХранения.ОшибкаДанных И ЗначениеХранения.СтатусСообщения = ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.НеВалидно"), ЗначениеХранения.СтатусСообщения, ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.Новое")));
		ЗаписьЖурнала.Вставить("Идентификатор", ИдентификаторСообщения);
		ЗаписьЖурнала.Вставить("СпособПередачи", СпособПередачи);
		ЗаписьЖурнала.Вставить("Ссылка", СсылкаНаОбъект);
		ЗаписьЖурнала.Вставить("ИмяФайла", Неопределено);
		ЗаписьЖурнала.Вставить("ТипИнтеграции", Перечисления.спТипыИнтеграции.Исходящая); 
		ЗаписьЖурнала.Вставить("ОписаниеДанных", ЗначениеХранения.ОписаниеДанных);
		ЗаписьЖурнала.Вставить("ЗаписатьВОчередьИсходящих", Ложь);
	
		спРаботаСДаннымиВызовСервера.ЗаписьВЖурнал(ЗаписьЖурнала);

	КонецЕсли;
	
	
КонецПроцедуры

Процедура ОчиститьРегистрПоСсылкеНаОбъект(СсылкиНаОбъект, СпособПередачи)
	Запрос = Новый Запрос;
	Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
		|	тбСостояние.ИдентификаторСообщения КАК ИдентификаторСообщения
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|			И (НЕ тбСостояние.СтатусСообщения В (&СписокСтатусов))
		|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
		|			И (тбОчередь.СсылкаНаОбъект В (&СсылкаНаОбъект))
		|			И (тбОчередь.СпособПередачи = &СпособПередачи)";
	
	Если СпособПередачи = Перечисления.спСпособПередачи.SOAP Тогда
		 Текст = СтрЗаменить(Текст, "(НЕ тбСостояние.СтатусСообщения В (&СписокСтатусов))", "(ИСТИНА = ИСТИНА)");
	Иначе
		Запрос.УстановитьПараметр("СписокСтатусов", спКэшируемыеФункцииВызовСервера.ПоучитьСписокСтатусовОчередиИсходящихСообщений());
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса()));  
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкиНаОбъект);
	Запрос.УстановитьПараметр("СпособПередачи", СпособПередачи);
	
	Запрос.Текст = Текст;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НабЗап = РегистрыСведений["спОчередьИсходящихСообщений"].СоздатьНаборЗаписей();
		НабЗап.Отбор["ИдентификаторСобытия"].Установить(ВыборкаДетальныеЗаписи.ИдентификаторСобытия);
		НабЗап.Записать();  
		
		НабЗап = РегистрыСведений["спСостояниеСообщений"].СоздатьНаборЗаписей();
		НабЗап.Отбор["ИдентификаторСобытия"].Установить(ВыборкаДетальныеЗаписи.ИдентификаторСобытия);
		НабЗап.Отбор["ИдентификаторСообщения"].Установить(ВыборкаДетальныеЗаписи.ИдентификаторСообщения);
		НабЗап.Записать(); 

	КонецЦикла;

КонецПроцедуры

Функция ОтправлятьСообщение(Источник)   
	ОтправлятьСообщение = Ложь;  
	
	Если  ТипЗнч(Источник) = Тип("ДокументОбъект.ПеремещениеЗапасов") 
		И (ОбщегоНазначения.ЕстьРеквизитОбъекта("СтруктурнаяЕдиницаПолучатель", Источник.Метаданные()) 
		И Источник.СтруктурнаяЕдиницаПолучатель = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спОтправлятьСообщениеПеремещениеЗапасов")) Тогда  
		ОтправлятьСообщение = Истина; 
		
	ИначеЕсли  ТипЗнч(Источник) = Тип("ДокументОбъект.ПриходнаяНакладная") 
		И  (ОбщегоНазначения.ЕстьРеквизитОбъекта("СтруктурнаяЕдиница", Источник.Метаданные()) 
		И Источник.СтруктурнаяЕдиница = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спОтправлятьСообщениеспПриходнаяНакладная")) Тогда  
		ОтправлятьСообщение = Истина;
	ИначеЕсли  ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказНаПеремещение") 
		И (ОбщегоНазначения.ЕстьРеквизитОбъекта("СтруктурнаяЕдиницаПолучатель", Источник.Метаданные())  
		И Источник.СтруктурнаяЕдиницаРезерв = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спОтправлятьСообщениеДляПодсортировкиМагазина")) Тогда // ++ Терлецкий АВ 25.01.15
		ОтправлятьСообщение = Истина;	
	КонецЕсли; 
	
	Возврат ОтправлятьСообщение;
КонецФункции 

// ++ Терлецкий АВ 25.01.15
Функция ИсключитьПовторнуюОтправку(ТаблицаПроверки, СпособПередачи) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаПроверки.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТТаблицаПроверки
		|ИЗ
		|	&ТаблицаПроверки КАК ТаблицаПроверки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	спОтправленныеСообщения.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ПОМЕСТИТЬ ВТТаблицаОтправленых
		|ИЗ
		|	РегистрСведений.спОтправленныеСообщения КАК спОтправленныеСообщения
		|ГДЕ
		|	спОтправленныеСообщения.СпособПередачи = &СпособПередачи
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	тбОчередь.СсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		|			И (тбСостояние.СтатусСообщения В (&СписокСтатусов))
		|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
		|			И (тбОчередь.СпособПередачи = &СпособПередачи)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТТаблицаПроверки.Ссылка КАК Ссылка
		|ИЗ
		|	ВТТаблицаПроверки КАК ВТТаблицаПроверки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТаблицаОтправленых КАК ВТТаблицаОтправленых
		|		ПО ВТТаблицаПроверки.Ссылка = ВТТаблицаОтправленых.СсылкаНаОбъект";
	
	Запрос.УстановитьПараметр("ТаблицаПроверки", ТаблицаПроверки); 
	Запрос.УстановитьПараметр("СпособПередачи", СпособПередачи); 
	Запрос.УстановитьПараметр("СписокСтатусов", спКэшируемыеФункцииВызовСервера.ПоучитьСписокСтатусовОчередиИсходящихСообщений()); 
	Запрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса()));  

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда  
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции
// -- Терлецкий АВ 25.01.15  

// Процедура - Зарегистрировать событие
//
// Параметры:
//  СсылкаНаОбъект - Справочни.Объект, Документ.Объект, РегистрСведений.НаборЗаписей - объект-источник события.
//	ЭтоРегистр - булево - это событие регистрации регистра
//	ЭтоУдаление - булево - это удаление  
//
Процедура ЗарегистрироватьСобытиеОтправкиСообщенийSOAP(Источник, ИнициаторОтправкиСсылкаНаОбъект = Неопределено, ЭтоРегистр = Ложь, ЭтоУдаление = Ложь) Экспорт 
	
	// ++ Терлецкий АВ 25.01.15
	ТаблицаПроверки = Новый ТаблицаЗначений;
	ТаблицаПроверки.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ЗаказНаПеремещение"));
	
	НоваяСтрока = ТаблицаПроверки.Добавить();
	НоваяСтрока.Ссылка = Источник;
	ОтправленныеСообщения = ИсключитьПовторнуюОтправку(ТаблицаПроверки, Перечисления.спСпособПередачи.SOAP);
	
	Если ТипЗнч(ОтправленныеСообщения) = Тип("ТаблицаЗначений") И ОтправленныеСообщения.Количество() > 0 Тогда 
		Возврат
	КонецЕсли; 	
	// -- Терлецкий АВ 25.01.15
	
	СсылкиНаОбъект = Новый Массив;
	СсылкиНаОбъект.Добавить(Источник);
	
	ОчиститьРегистрПоСсылкеНаОбъект(СсылкиНаОбъект, Перечисления.спСпособПередачи.SOAP);
	
	ПомещатьВХранилищеЗначения = Истина;
	ТипОбъекта = Источник.Метаданные().ПолноеИмя();
	ЗначениеХранения = Неопределено;
	МетодХранения = Перечисления.спМетодХранения.Сериализация;
	ФорматСериализация = Перечисления.спФорматыСообщений.XML;
	СпособПередачи = Перечисления.спСпособПередачи.SOAP;
	ИдентификаторСообщения = Новый УникальныйИдентификатор();
	
	#Если ТолстыйКлиентОбычноеПриложение Тогда
	#Иначе				
		ЗначениеХранения = спФункцииРаботыXMLВызовСервера.СериализоватьОбъект(Источник, ИнициаторОтправкиСсылкаНаОбъект);
	#КонецЕсли 

	Если ЭтоРегистр Или ЭтоУдаление Тогда		
		СсылкаНаОбъект = Неопределено;		
	Иначе		
		СсылкаНаОбъект = Источник;	
	КонецЕсли;
	
	
	
	Если ТипЗнч(ЗначениеХранения) = Тип("Структура") Тогда
		
		ЗаписьВОчередьИсходящих = Новый Структура;
		ЗаписьВОчередьИсходящих.Вставить("ТипОбъекта", ТипОбъекта);
		ЗаписьВОчередьИсходящих.Вставить("ОбъектСобщения", ?(ЗначениеХранения.Свойство("Строка"), ЗначениеХранения.Строка, Неопределено));
		ЗаписьВОчередьИсходящих.Вставить("Формат", ФорматСериализация);
		ЗаписьВОчередьИсходящих.Вставить("Метод", МетодХранения);
		ЗаписьВОчередьИсходящих.Вставить("СпособПередачи", СпособПередачи);
		ЗаписьВОчередьИсходящих.Вставить("ПомещатьВХранилищеЗначения", ПомещатьВХранилищеЗначения);
		ЗаписьВОчередьИсходящих.Вставить("ЭтоУдаление", ЭтоУдаление);   
		ЗаписьВОчередьИсходящих.Вставить("СсылкаНаОбъект", СсылкаНаОбъект); 
		ЗаписьВОчередьИсходящих.Вставить("ИдентификаторСообщения", ИдентификаторСообщения);
		ЗаписьВОчередьИсходящих.Вставить("ИнициаторОтправкиСсылкаНаОбъект", ИнициаторОтправкиСсылкаНаОбъект); 
		спРаботаСДаннымиВызовСервера.ПоместитьВОчередьИсходящих(ЗаписьВОчередьИсходящих);
		
		ЗаписьЖурнала = Новый Структура; 
		ОшибкаДанных = ?(ЗначениеХранения.Свойство("ОшибкаДанных"), ЗначениеХранения.ОшибкаДанных, Ложь);
		ЗаписьЖурнала.Вставить("Ошибка", ОшибкаДанных);
		
		
		СтатусДляСообщения = ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.Новое");
		Если ЗначениеХранения.Свойство("СтатусСообщения") Тогда  
			Если ЗначениеХранения.СтатусСообщения = ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.НеВалидно") ИЛИ ОшибкаДанных Тогда  
				СтатусДляСообщения = ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.НеВалидно");
			КонецЕсли;
		Иначе 
			СтатусДляСообщения = ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.ОшибкаОбработки");
		КонецЕсли;
		ЗаписьЖурнала.Вставить("СтатусСообщения", СтатусДляСообщения);  
		
		ЗаписьЖурнала.Вставить("Идентификатор", ИдентификаторСообщения);
		ЗаписьЖурнала.Вставить("СпособПередачи", СпособПередачи);
		ЗаписьЖурнала.Вставить("Ссылка", СсылкаНаОбъект);
		ЗаписьЖурнала.Вставить("ИмяФайла", Неопределено);
		ЗаписьЖурнала.Вставить("ТипИнтеграции", Перечисления.спТипыИнтеграции.Исходящая); 
		ЗаписьЖурнала.Вставить("ОписаниеДанных", ?(ЗначениеХранения.Свойство("ОписаниеДанных"), ЗначениеХранения.ОписаниеДанных, Неопределено));
		ЗаписьЖурнала.Вставить("ЗаписатьВОчередьИсходящих", Ложь);
	
		спРаботаСДаннымиВызовСервера.ЗаписьВЖурнал(ЗаписьЖурнала); 
		
	Иначе
		
		ЗаписьВОчередьИсходящих = Новый Структура;
		ЗаписьВОчередьИсходящих.Вставить("ТипОбъекта", ТипОбъекта);
		ЗаписьВОчередьИсходящих.Вставить("ОбъектСобщения", Неопределено);
		ЗаписьВОчередьИсходящих.Вставить("Формат", ФорматСериализация);
		ЗаписьВОчередьИсходящих.Вставить("Метод", МетодХранения);
		ЗаписьВОчередьИсходящих.Вставить("СпособПередачи", СпособПередачи);
		ЗаписьВОчередьИсходящих.Вставить("ПомещатьВХранилищеЗначения", ПомещатьВХранилищеЗначения);
		ЗаписьВОчередьИсходящих.Вставить("ЭтоУдаление", ЭтоУдаление);   
		ЗаписьВОчередьИсходящих.Вставить("СсылкаНаОбъект", СсылкаНаОбъект); 
		ЗаписьВОчередьИсходящих.Вставить("ИдентификаторСообщения", ИдентификаторСообщения);
		ЗаписьВОчередьИсходящих.Вставить("ИнициаторОтправкиСсылкаНаОбъект", ИнициаторОтправкиСсылкаНаОбъект); 
		спРаботаСДаннымиВызовСервера.ПоместитьВОчередьИсходящих(ЗаписьВОчередьИсходящих);
		
		ЗаписьЖурнала = Новый Структура; 
		ЗаписьЖурнала.Вставить("Ошибка", Истина);
		ЗаписьЖурнала.Вставить("СтатусСообщения", ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.ОшибкаОбработки"));  
		
		ЗаписьЖурнала.Вставить("Идентификатор", ИдентификаторСообщения);
		ЗаписьЖурнала.Вставить("СпособПередачи", СпособПередачи);
		ЗаписьЖурнала.Вставить("Ссылка", СсылкаНаОбъект);
		ЗаписьЖурнала.Вставить("ИмяФайла", Неопределено);
		ЗаписьЖурнала.Вставить("ТипИнтеграции", Перечисления.спТипыИнтеграции.Исходящая); 
		ЗаписьЖурнала.Вставить("ОписаниеДанных", Неопределено);
		ЗаписьЖурнала.Вставить("ЗаписатьВОчередьИсходящих", Ложь);
	
		спРаботаСДаннымиВызовСервера.ЗаписьВЖурнал(ЗаписьЖурнала);

	КонецЕсли;		
КонецПроцедуры

Процедура ЗаполнитьОписаниеGTINИС(Ссылка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	ХарактеристикиНоменклатуры.Ссылка КАК Характеристика
		|ПОМЕСТИТЬ ВТНоменклатурХарактеристика
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ПО Номенклатура.Ссылка = ХарактеристикиНоменклатуры.Владелец
		|ГДЕ
		|	Номенклатура.Ссылка = &Ссылка
		|	И НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ВТНоменклатурХарактеристика.Номенклатура КАК Номенклатура,
		|	ВТНоменклатурХарактеристика.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	ВТНоменклатурХарактеристика КАК ВТНоменклатурХарактеристика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ВТНоменклатурХарактеристика.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура
		|			И ВТНоменклатурХарактеристика.Характеристика = ШтрихкодыНоменклатуры.Характеристика";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Набор = Справочники.КлассификаторЕдиницИзмерения.ЕдиницаИзмеренияПоКоду("704");
	
	Пока Выборка.Следующий() Цикл  
		
		Если ЗначениеЗаполнено(Выборка.Штрихкод) Тогда
			
			GTINДляЗаписи = СтрШаблон("%1%2", 0, Выборка.Штрихкод);  
			
			МенеджерЗаписи = РегистрыСведений.ОписаниеGTINИС.СоздатьМенеджерЗаписи(); 
			МенеджерЗаписи.GTIN = GTINДляЗаписи; 
			МенеджерЗаписи.ВидУпаковки = ?(Выборка.ЕдиницаИзмерения = Набор, Перечисления.ВидыУпаковокИС.Набор, Перечисления.ВидыУпаковокИС.Потребительская); 
			МенеджерЗаписи.КоличествоПотребительскихУпаковок = 1; 
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

// ++ Терлецкий АВ 25.01.30
Функция ПолучитьДокументУстановкиЦен(Источник)
	УстановкаЦенНоменклатуры = Неопределено;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УстановкаЦенНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
		|ГДЕ
		|	УстановкаЦенНоменклатуры.ДокументОснование = &ДокументОснование
		|	И НЕ УстановкаЦенНоменклатуры.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	УстановкаЦенНоменклатуры.Дата УБЫВ";

	
	Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		УстановкаЦенНоменклатуры = ВыборкаДетальныеЗаписи.Ссылка 
	КонецЦикла;
	
	Возврат УстановкаЦенНоменклатуры;
КонецФункции
// -- Терлецкий АВ 25.01.30

// ++ Терлецкий АВ 25.02.04
Процедура ЗаполнитьГруппаЦветИсправление(Источник) 
	
	ОчиститьДополнительныйРеквизит(Источник, "Группа цвета");
	ОчиститьДополнительныйРеквизит(Источник, "Цвет для сайта");

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спЦвета.Родитель КАК ГруппаЦвет,
		|	спЦвета.Наименование КАК Цвет
		|ИЗ
		|	Справочник.спЦвета КАК спЦвета
		|ГДЕ
		|	спЦвета.Родитель.ЭтоГруппа
		|	И НЕ спЦвета.Родитель.ПометкаУдаления
		|	И спЦвета.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.спЦвет);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТЗДополнительныеРеквизиты = Новый ТаблицаЗначений;
		ТЗДополнительныеРеквизиты.Колонки.Добавить("Свойство", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
		ТЗДополнительныеРеквизиты.Колонки.Добавить("Значение"); 
		
		ДополнительнйРеквизитГруппаЦвет = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Группа цвета", Истина);
		
		Если ЗначениеЗаполнено(ДополнительнйРеквизитГруппаЦвет) И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ГруппаЦвет)Тогда 
			ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
			ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитГруппаЦвет;
			
			Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(ВыборкаДетальныеЗаписи.ГруппаЦвет,,, ТЗРеквизитНоваяСтрока.Свойство);
			
			Если ТипЗнч(Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И ЗначениеЗаполнено(Значение) Тогда 	
				ТЗРеквизитНоваяСтрока.Значение = Значение;    
			Иначе  
				Попытка
					НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент(); 
					НовоеЗначение.Владелец = ДополнительнйРеквизитГруппаЦвет;
					НовоеЗначение.Наименование = ВыборкаДетальныеЗаписи.ГруппаЦвет;
					НовоеЗначение.Записать();  
				Исключение
				КонецПопытки;    
				ТЗРеквизитНоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(ВыборкаДетальныеЗаписи.ГруппаЦвет,,, ТЗРеквизитНоваяСтрока.Свойство);	
			КонецЕсли;
			
		КонецЕсли;  
		
		ДополнительнйРеквизитЦветДляСайта = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Цвет для сайта", Истина);
		
		Если ЗначениеЗаполнено(ДополнительнйРеквизитЦветДляСайта) И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Цвет) Тогда 
			ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
			ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитЦветДляСайта;
			
			Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(ВыборкаДетальныеЗаписи.Цвет,,, ТЗРеквизитНоваяСтрока.Свойство);
			
			Если ТипЗнч(Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И ЗначениеЗаполнено(Значение) Тогда 	
				ТЗРеквизитНоваяСтрока.Значение = Значение;    
			Иначе  
				Попытка
					НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент(); 
					НовоеЗначение.Владелец = ДополнительнйРеквизитЦветДляСайта;
					НовоеЗначение.Наименование = ВыборкаДетальныеЗаписи.Цвет;
					НовоеЗначение.Записать();  
				Исключение
				КонецПопытки;    
				ТЗРеквизитНоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(ВыборкаДетальныеЗаписи.Цвет,,, ТЗРеквизитНоваяСтрока.Свойство);	
			КонецЕсли;
			
			
		КонецЕсли;
		
		
		ЗаписатьСвойстваУОбъекта(Источник, ТЗДополнительныеРеквизиты); 
	КонецЦикла;  
	
КонецПроцедуры

Процедура ЗаполнитьРазмерРостДляСайтаИсправление(Источник)
	
	ОчиститьДополнительныйРеквизит(Источник, "Размер для сайта"); 
	ОчиститьДополнительныйРеквизит(Источник, "Рост для сайта");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спРазмеры.РусскоеНаименование КАК РазмерДляСайта,
		|	спРазмеры.Рост КАК РостДляСайта,
		|	спРазмеры.Наименование КАК ЦветДляСайта
		|ИЗ
		|	Справочник.спРазмеры КАК спРазмеры
		|ГДЕ
		|	спРазмеры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Источник.спРазмер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ТЗДополнительныеРеквизиты = Новый ТаблицаЗначений;
		ТЗДополнительныеРеквизиты.Колонки.Добавить("Свойство", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
		ТЗДополнительныеРеквизиты.Колонки.Добавить("Значение");  
		
		
		ДополнительнйРеквизитРазмерДляСайта = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Размер для сайта", Истина);
		
		Если ЗначениеЗаполнено(ДополнительнйРеквизитРазмерДляСайта) И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РазмерДляСайта) Тогда 
			ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
			ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитРазмерДляСайта;
			
			Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(ВыборкаДетальныеЗаписи.РазмерДляСайта,,, ТЗРеквизитНоваяСтрока.Свойство);
			
			Если ТипЗнч(Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И ЗначениеЗаполнено(Значение) Тогда 	
				ТЗРеквизитНоваяСтрока.Значение = Значение;    
			Иначе  
				Попытка
					НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент(); 
					НовоеЗначение.Владелец = ДополнительнйРеквизитРазмерДляСайта;
					НовоеЗначение.Наименование = ВыборкаДетальныеЗаписи.РазмерДляСайта;
					НовоеЗначение.Записать();  
				Исключение
				КонецПопытки;    
				ТЗРеквизитНоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(ВыборкаДетальныеЗаписи.РазмерДляСайта,,, ТЗРеквизитНоваяСтрока.Свойство);	
			КонецЕсли;

			
		КонецЕсли;
		
		ДополнительнйРеквизитРостДляСайта = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Рост для сайта", Истина);
		
		Если ЗначениеЗаполнено(ДополнительнйРеквизитРостДляСайта) И ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.РостДляСайта) Тогда 
			ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
			ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитРостДляСайта;
			
			Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(ВыборкаДетальныеЗаписи.РостДляСайта,,, ТЗРеквизитНоваяСтрока.Свойство);
			
			Если ТипЗнч(Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И ЗначениеЗаполнено(Значение) Тогда 	
				ТЗРеквизитНоваяСтрока.Значение = Значение;    
			Иначе  
				Попытка
					НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент(); 
					НовоеЗначение.Владелец = ДополнительнйРеквизитРостДляСайта;
					НовоеЗначение.Наименование = ВыборкаДетальныеЗаписи.РостДляСайта;
					НовоеЗначение.Записать();  
				Исключение
				КонецПопытки;    
				ТЗРеквизитНоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(ВыборкаДетальныеЗаписи.РостДляСайта,,, ТЗРеквизитНоваяСтрока.Свойство);	
			КонецЕсли;
		КонецЕсли;
		
		ЗаписатьСвойстваУОбъекта(Источник, ТЗДополнительныеРеквизиты); 
	КонецЦикла;

КонецПроцедуры 

Процедура ЗаполнитьБрендИсправление(Источник) 
		
	ОчиститьДополнительныйРеквизит(Источник, "Бренд");
	
	ТЗДополнительныеРеквизиты = Новый ТаблицаЗначений;
	ТЗДополнительныеРеквизиты.Колонки.Добавить("Свойство", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
	ТЗДополнительныеРеквизиты.Колонки.Добавить("Значение"); 
	
	ДополнительнйРеквизитБренд = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Бренд", Истина);
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитБренд) И ЗначениеЗаполнено(Источник.спБренд)Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитБренд;
		
		Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Источник.спБренд.Наименование,,, ТЗРеквизитНоваяСтрока.Свойство);
		
		Если ТипЗнч(Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И ЗначениеЗаполнено(Значение) Тогда 	
			ТЗРеквизитНоваяСтрока.Значение = Значение;    
		Иначе  
			Попытка
				НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент(); 
				НовоеЗначение.Владелец = ДополнительнйРеквизитБренд;
				НовоеЗначение.Наименование = Источник.спБренд.Наименование;
				НовоеЗначение.Записать();  
			Исключение
			КонецПопытки;    
			ТЗРеквизитНоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Источник.спБренд.Наименование,,, ТЗРеквизитНоваяСтрока.Свойство);	
		КонецЕсли;
		
	КонецЕсли;  
			
	ЗаписатьСвойстваУОбъекта(Источник, ТЗДополнительныеРеквизиты); 
	
КонецПроцедуры 

// ++ Терлецкий АВ 25.03.18
Процедура ЗаполнитьСтранаПроизводителяИсправление(Источник) 
		
	ОчиститьДополнительныйРеквизит(Источник, "Страна производителя");
	
	ТЗДополнительныеРеквизиты = Новый ТаблицаЗначений;
	ТЗДополнительныеРеквизиты.Колонки.Добавить("Свойство", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
	ТЗДополнительныеРеквизиты.Колонки.Добавить("Значение"); 
	
	ДополнительнйРеквизитСтранаПроизводителя = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Страна производителя", Истина);
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитСтранаПроизводителя) И ЗначениеЗаполнено(Источник.СтранаПроисхождения)Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитСтранаПроизводителя;
		
		Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Источник.СтранаПроисхождения.Наименование,,, ТЗРеквизитНоваяСтрока.Свойство);
		
		Если ТипЗнч(Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И ЗначениеЗаполнено(Значение) Тогда 	
			ТЗРеквизитНоваяСтрока.Значение = Значение;    
		Иначе  
			Попытка
				НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент(); 
				НовоеЗначение.Владелец = ДополнительнйРеквизитСтранаПроизводителя;
				НовоеЗначение.Наименование = Источник.СтранаПроисхождения.Наименование;
				НовоеЗначение.Записать();  
			Исключение
			КонецПопытки;    
			ТЗРеквизитНоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(Источник.СтранаПроисхождения.Наименование,,, ТЗРеквизитНоваяСтрока.Свойство);	
		КонецЕсли;
		
	КонецЕсли;  
			
	ЗаписатьСвойстваУОбъекта(Источник, ТЗДополнительныеРеквизиты); 
	
КонецПроцедуры
// ++ Терлецкий АВ 25.03.18

Процедура ОчиститьДополнительныйРеквизит(Источник, Наименование)  
	
	ДополнительнйРеквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию(Наименование, Истина);
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Свойство", ДополнительнйРеквизит);
	
	Массив = Источник.ДополнительныеРеквизиты.НайтиСтроки(ПараметрыОтбора);
	Для Каждого ЭлементМассива из Массив Цикл 
		ЭлементМассива.Значение = Справочники.ЗначенияСвойствОбъектов.ПустаяСсылка();
	КонецЦикла;  
	
КонецПроцедуры 

Процедура ЗаписатьСвойстваУОбъекта(Источник, ТЗДополнительныеРеквизиты) 
	
	ТаблицаДопРеквизитов = Новый ТаблицаЗначений;
	ТаблицаДопРеквизитов.Колонки.Добавить("Свойство", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
	ТаблицаДопРеквизитов.Колонки.Добавить("Значение");
	ТаблицаДопРеквизитов.Колонки.Добавить("ТекстоваяСтрока");
	
	Свойства = ТЗДополнительныеРеквизиты.ВыгрузитьКолонку("Свойство");
	
	ТаблицаДопСведений = ТаблицаДопРеквизитов.СкопироватьКолонки();
	
	Для Каждого СтрокаТаблицыСвойств Из ТЗДополнительныеРеквизиты Цикл
		НоваяСтрока = ТаблицаДопРеквизитов.Добавить();
		
		Если ТипЗнч(СтрокаТаблицыСвойств.Значение) = Тип("Строка")
			И СтрДлина(СтрокаТаблицыСвойств.Значение) > 1024 Тогда
			НоваяСтрока.ТекстоваяСтрока = СтрокаТаблицыСвойств.Значение;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицыСвойств, "Свойство,Значение");
	КонецЦикла;
	
	
	МассивСвойств = УправлениеСвойствами.СвойстваОбъекта(Источник.Ссылка);
	МассивДопРеквизитов = Новый Массив;
	
	Для Каждого ДопСвойство Из МассивСвойств Цикл
		Если НЕ ДопСвойство.ЭтоДополнительноеСведение Тогда
			МассивДопРеквизитов.Добавить(ДопСвойство);
		КонецЕсли;
	КонецЦикла;
	
	
	Для Каждого ДопРеквизит Из ТаблицаДопРеквизитов Цикл
		Если МассивДопРеквизитов.Найти(ДопРеквизит.Свойство) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		МассивСтрок = Источник.ДополнительныеРеквизиты.НайтиСтроки(Новый Структура("Свойство", ДопРеквизит.Свойство));
		Если МассивСтрок.Количество() Тогда
			СтрокаСвойства = МассивСтрок[0];
		Иначе
			СтрокаСвойства = Источник.ДополнительныеРеквизиты.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаСвойства, ДопРеквизит, "Свойство,Значение,ТекстоваяСтрока");
	КонецЦикла; 
	
КонецПроцедуры
// -- Терлецкий АВ 25.02.04

// ++ Терлецкий АВ 25.01.20
Процедура ЗаполнитьВидОплаты(Источник)
	
	Источник.ВидПлатежнойКарты = "РФ";  
	
	Если Источник.ЭквайринговыйТерминал = Справочники.СпособыОплаты.ПолучитьСсылку(Новый УникальныйИдентификатор("20e57d48-e9ef-11ef-9fef-fa163e21cbae"))  Тогда 
		ВидПлатежнойКартыПриИзмененииФрагментНаКлиенте(Источник); 
	КонецЕсли;

КонецПроцедуры 

Процедура ВидПлатежнойКартыПриИзмененииФрагментНаКлиенте(Объект) 
	
	

	ТаблицаВидовКартИПроцентовКомиссии = Справочники.СпособыОплаты.ВидыПлатежныхКартИПроцентыКомиссии(Объект.ЭквайринговыйТерминал);
	СтрокиКомиссии = ТаблицаВидовКартИПроцентовКомиссии.НайтиСтроки(Новый Структура("ВидПлатежнойКарты", Объект.ВидПлатежнойКарты));
	
	Если СтрокиКомиссии.Количество() > 0 Тогда
		
		Если Объект.ВидОперации = Перечисления.ВидыОперацийЭквайринга.ПоступлениеОплатыОтПокупателя Тогда
			Объект.ПроцентКомиссии = СтрокиКомиссии[0].ПроцентКомиссии;
		ИначеЕсли Объект.ЭтоОтменаОплаты(Объект.ДатаДокумента, Объект.НомерСменыККМ, Объект.ОперацияПоПлатежнымКартамШапка) Тогда
			Объект.ПроцентКомиссии = СтрокиКомиссии[0].ПроцентКомиссииПриОтмене;
		Иначе // Это возврат
			Объект.ПроцентКомиссии = СтрокиКомиссии[0].ПроцентКомиссииПриВозврате;
		КонецЕсли;
		
		Объект.СуммаКомиссииПоДоговору =Объект.ПроцентКомиссии * Объект.СуммаДокумента / 100;
		
	Иначе
		Объект.ПроцентКомиссии = 0;
		Объект.СуммаКомиссииПоДоговору = 0;
	КонецЕсли;
	
КонецПроцедуры
// -- Терлецкий АВ 25.01.20

#КонецОбласти   



