#Область ПрограммныйИнтерфейс

#Область ОбработчикиКоманд

Процедура Документ_ЗаказПокупателя_спОтменаНеотгруженныхСтрок(ПараметрКоманды, ПараметрыВыполнения) Экспорт

	// { Иванов С.С. (TNext) - 05.05.2025 - Задача №1448 
	ОписаниеЗавершения = Новый ОписаниеОповещения("ОбработатьВыборПричиныОтмены", ЭтотОбъект, ПараметрыВыполнения);
	ПараметрыФормыВыбора = Новый Структура;
	ПараметрыФормыВыбора.Вставить("РежимВыбора", Истина);
	ОткрытьФорму("Справочник.ПричиныОтменыЗаказа.ФормаВыбора",ПараметрыФормыВыбора,,,,,ОписаниеЗавершения);
    // }
	
КонецПроцедуры

Процедура Документ_ЗаказНаЭмиссиюКодовМаркировкиСУЗ_спВидУпаковкиGTIN(ПараметрКоманды, ПараметрыВыполнения) Экспорт

	// { Иванов С.С. (TNext) - 20.05.2025 - Задача №2064 
	Форма = ПараметрыВыполнения.Форма;

	Товары = Форма.Объект.Товары; 
	
	НастройкиВидаУпаковокGTIN = спПодключаемыеКомандыВызовСервера.НастройкиВидаУпаковокGTIN(ПараметрКоманды);
	
	Модифицированность = Ложь;
	
	Для каждого Строка Из Товары Цикл
		
		ВидУпаковкиGTIN = НастройкиВидаУпаковокGTIN.Получить(Строка.Номенклатура);
		
		Если ВидУпаковкиGTIN = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(Строка, ВидУпаковкиGTIN, "Шаблон, GTIN");
		
		Модифицированность = Истина;
		
	КонецЦикла;  
	
	Форма.Модифицированность = Модифицированность;
	// }
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Документ_ЗаказПокупателя

Процедура ОбработатьВыборПричиныОтмены(ПричинаОтмены, ПараметрыВыполнения) Экспорт

	// { Иванов С.С. (TNext) - 05.05.2025 - Задача №1448 
	Форма = ПараметрыВыполнения.Форма;
	
	Если Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		
		НеотгруженныеСтроки = спПодключаемыеКомандыВызовСервера.НеотгруженныеСтроки(Форма.Объект.Ссылка);
		
		Запасы = ПараметрыВыполнения.Источник.Запасы;
		 
		Для каждого Строка Из НеотгруженныеСтроки Цикл
			
			Фильтр = Новый Структура("Номенклатура", Строка.Номенклатура);
			НайденныеСтроки = Запасы.НайтиСтроки(Фильтр);
			
			Неотгружено = Строка.Неотгружено;
			
			Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
				
				Если Неотгружено <= 0 Тогда
					Прервать;
				КонецЕсли;
				
				Если НайденнаяСтрока.Количество > Неотгружено Тогда
					
					НайденнаяСтрока.Количество = НайденнаяСтрока.Количество - Неотгружено;
					РассчитатьСуммуВСтрокеТабличнойЧасти(Форма,, НайденнаяСтрока);
					
					ОтменяемаяСтрока = Запасы.Добавить();
					ЗаполнитьЗначенияСвойств(ОтменяемаяСтрока, НайденнаяСтрока);
					ОтменяемаяСтрока.Количество = Неотгружено;
					РассчитатьСуммуВСтрокеТабличнойЧасти(Форма,, ОтменяемаяСтрока);

				Иначе
					
					ОтменяемаяСтрока = НайденнаяСтрока;
					
				КонецЕсли;
				
				ОтменяемаяСтрока.ПричинаОтмены = ПричинаОтмены;
				
				Неотгружено = Неотгружено - ОтменяемаяСтрока.Количество;
				
				Форма.спОтменитьВернутьЗапасы(ОтменяемаяСтрока);
				
			КонецЦикла;
			
		КонецЦикла;
		
		КоличествоОтмененных = Форма.Объект.ОтмененныеЗапасы.НайтиСтроки(Новый Структура("НомерВариантаКП", Форма.ТекущийВариантКП));
		Форма.Элементы.ГруппаОтмененныеТоварыУслуги.Видимость = КоличествоОтмененных.Количество() <> 0 ИЛИ Форма.ОтображатьГруппуОтмененных;
	    Форма.Модифицированность = КоличествоОтмененных.Количество() <> 0;
		
	КонецЕсли;
    // }
	
КонецПроцедуры

Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(Форма, ИмяТабличнойЧасти = "Запасы", СтрокаТабличнойЧасти = Неопределено, ПараметрыРасчета = Неопределено)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	КэшЗначений = Форма.КэшЗначений; 
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	КонецЕсли;
	
	Если ПараметрыРасчета=Неопределено Тогда
		ПараметрыРасчета = Новый Структура("СброситьФлагСкидкиРассчитаны",Истина);
	КонецЕсли;	
	
	ПараметрыРасчета.Вставить("СуммаВключаетНДС", Объект.СуммаВключаетНДС);
	ПараметрыРасчета.Вставить("ИспользоватьМинимальныеЦены", КэшЗначений.ИспользоватьМинимальныеЦены);
	Если Не Форма.ЗапрашиватьРаспределение 
		И НЕ ПараметрыРасчета.Свойство("КорректировкаСуммыЗаСчетРучнойСкидки")
		И ПараметрыРасчета.Свойство("РассчитатьЦену")
		И ПараметрыРасчета.РассчитатьЦену Тогда
		ПараметрыРасчета.Вставить("КорректировкаСуммыЗаСчетРучнойСкидки", Форма.КорректировкаСуммыЗаСчетРучнойСкидки);
	КонецЕсли;
	
	ТабличныеЧастиУНФКлиент.РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти, ПараметрыРасчета);
	
	ЦенообразованиеКлиент.ПоказатьОповещениеПользователяОКорректировкеЦены(ПараметрыРасчета);   		

КонецПроцедуры

#КонецОбласти 

#Область Документ_ЗаказНаЭмиссиюКодовМаркировкиСУЗ


#КонецОбласти

#КонецОбласти

#КонецОбласти