 
#Область ПрограммныйИнтерфейс
  
// Запустить поток.
// 
// Параметры:
//  ИмяМетода - Строка - Имя метода
//  Параметры - Неопределено - Параметры
//  Ключ - Неопределено, Строка - Ключ
Процедура ЗапуститьПоток(ИмяМетода, Параметры = Неопределено, Ключ = Неопределено) Экспорт
	
	Попытка
		ФоновыеЗадания.Выполнить(ИмяМетода, Параметры, Ключ);
	Исключение
		// Запускаем фоновое задание со статическим ключем. Запуск других экземпляров должен заканчиваться ошибкой (паттерн синглтон).
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("Обработка потокай", УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
	КонецПопытки;
	
КонецПроцедуры

// Запустить обработчики.
Процедура ЗапуститьОбработчики() Экспорт
	
	ЗапуститьПоток("спОбслуживаниеОчередей.ОчисткаОчередейСообщений",, "спОбслуживаниеОчередей.ОчисткаОчередейСообщений");
	ЗапуститьПоток("спОбслуживаниеОчередей.ОбработкаОчередиИсходящихСообщений",, "спОбслуживаниеОчередей.ОбработкаОчередиИсходящихСообщений");
	ЗапуститьПоток("спОбслуживаниеОчередей.ОбработкаОчередиВходящихСообщений",, "спОбслуживаниеОчередей.ОбработкаОчередиВходящихСообщений");
		
КонецПроцедуры

// Процедура - Очистка очередей сообщений
//
Процедура ОчисткаОчередейСообщений() Экспорт
		
		//Возврат в обработку "зависших" сообщений
		ТекЗапрос = Новый Запрос("ВЫБРАТЬ
		                         |	тбОчередь.ИдентификаторСобытия КАК Идентификатор,
		                         |	ЗНАЧЕНИЕ(Перечисление.спТипыОчередей.Исходящая) КАК ТипОчереди
		                         |ИЗ
		                         |	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		                         |		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		                         |			И (тбСостояние.СтатусСообщения = ЗНАЧЕНИЕ(Перечисление.спСтатусыСообщений.ВОбработке))
		                         |			И (РАЗНОСТЬДАТ(&ТекущаяДата, тбСостояние.ДатаИзменения, МИНУТА) > 60)
		                         |
		                         |ОБЪЕДИНИТЬ ВСЕ
		                         |
		                         |ВЫБРАТЬ
		                         |	тбОчередь.ИдентификаторСообщения,
		                         |	ЗНАЧЕНИЕ(Перечисление.спТипыОчередей.Входящая)
		                         |ИЗ
		                         |	РегистрСведений.спОчередьВходящихСообщений КАК тбОчередь
		                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		                         |		ПО тбОчередь.ИдентификаторСообщения = тбСостояние.ИдентификаторСообщения
		                         |			И (тбСостояние.СтатусСообщения = ЗНАЧЕНИЕ(Перечисление.спСтатусыСообщений.ВОбработке))
		                         |			И (РАЗНОСТЬДАТ(&ТекущаяДата, тбСостояние.ДатаИзменения, МИНУТА) > 60)");
		ТекЗапрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		
		ТекВыборка = текЗапрос.Выполнить().Выбрать();
		
		Пока ТекВыборка.Следующий() Цикл
			
			Состояние = Перечисления.спСтатусыСообщений.ОжиданиеОбработки;
			спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(текВыборка.Идентификатор, Состояние);
			
		КонецЦикла;
		
		//Очистка очереди от старых сообщений
		ТекЗапрос = Новый Запрос("ВЫБРАТЬ
		                         |	ТаблицаДлительностиОжидания.ТипОчереди КАК ТипОчереди,
		                         |	ТаблицаДлительностиОжидания.СтатусСообщения КАК СтатусСообщения,
		                         |	ТаблицаДлительностиОжидания.ДлительностьХранения КАК Длительность
		                         |ПОМЕСТИТЬ ТаблицаДлительностиОжидания
		                         |ИЗ
		                         |	&ТаблицаДлительностиОжидания КАК ТаблицаДлительностиОжидания
		                         |;
		                         |
		                         |////////////////////////////////////////////////////////////////////////////////
		                         |ВЫБРАТЬ
		                         |	тбОчередь.ИдентификаторСобытия КАК Идентификатор,
		                         |	ЗНАЧЕНИЕ(Перечисление.спТипыОчередей.Исходящая) КАК ТипОчереди
		                         |ИЗ
		                         |	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		                         |			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДлительностиОжидания КАК ТаблицаДлительностиОжидания
		                         |			ПО тбСостояние.СтатусСообщения = ТаблицаДлительностиОжидания.СтатусСообщения
		                         |				И (ЗНАЧЕНИЕ(Перечисление.спТипыОчередей.Исходящая) = ТаблицаДлительностиОжидания.ТипОчереди)
		                         |		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
		                         |			И (РАЗНОСТЬДАТ(тбСостояние.ДатаИзменения, &ТекущаяДата, ДЕНЬ) > ЕСТЬNULL(ТаблицаДлительностиОжидания.Длительность, &СрокХраненияПоУмолчанию))
		                         |			И (ЕСТЬNULL(ТаблицаДлительностиОжидания.Длительность, &СрокХраненияПоУмолчанию) > 0)
		                         |
		                         |ОБЪЕДИНИТЬ ВСЕ
		                         |
		                         |ВЫБРАТЬ
		                         |	тбОчередь.ИдентификаторСообщения,
		                         |	ЗНАЧЕНИЕ(Перечисление.спТипыОчередей.Входящая)
		                         |ИЗ
		                         |	РегистрСведений.спОчередьВходящихСообщений КАК тбОчередь
		                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		                         |			ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаДлительностиОжидания КАК ТаблицаДлительностиОжидания
		                         |			ПО тбСостояние.СтатусСообщения = ТаблицаДлительностиОжидания.СтатусСообщения
		                         |				И (ЗНАЧЕНИЕ(Перечисление.спТипыОчередей.Входящая) = ТаблицаДлительностиОжидания.ТипОчереди)
		                         |		ПО тбОчередь.ИдентификаторСообщения = тбСостояние.ИдентификаторСообщения
		                         |			И (РАЗНОСТЬДАТ(тбСостояние.ДатаИзменения, &ТекущаяДата, ДЕНЬ) > ЕСТЬNULL(ТаблицаДлительностиОжидания.Длительность, &СрокХраненияПоУмолчанию))
		                         |			И (ЕСТЬNULL(ТаблицаДлительностиОжидания.Длительность, &СрокХраненияПоУмолчанию) > 0)");
		ТекЗапрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
		ТекЗапрос.УстановитьПараметр("СрокХраненияПоУмолчанию", спРаботаСКонстантами.ПолучитьДлительностьХраненияПоУмолчанию());
		ТекЗапрос.УстановитьПараметр("ТаблицаДлительностиОжидания",спРаботаСКонстантами.ПолучитьДлительностьХранения());
		
		ТекВыборка = ТекЗапрос.Выполнить().Выбрать();
		
		Пока ТекВыборка.Следующий() Цикл
			
			спРаботаСДаннымиВызовСервера.УдалитьСообщение(ТекВыборка.ТипОчереди, ТекВыборка.Идентификатор);
		
		КонецЦикла;
						
		//Очистка очереди исходящих сообщений 
		
		Если спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спУдалитьСообщенияСтатусСообщенийОтправкаПодтверждена") Тогда 
			
			ТекЗапрос = Новый Запрос("ВЫБРАТЬ
			|	сшпОчередьИсходящихСообщений.ИдентификаторСобытия КАК Идентификатор
			|ИЗ
			|	РегистрСведений.спОчередьИсходящихСообщений КАК сшпОчередьИсходящихСообщений
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК сшпСостояниеСообщений
			|		ПО сшпОчередьИсходящихСообщений.ИдентификаторСобытия = сшпСостояниеСообщений.ИдентификаторСобытия
			|			И (сшпСостояниеСообщений.СтатусСообщения = ЗНАЧЕНИЕ(Перечисление.спСтатусыСообщений.ОтправкаПодтверждена))");
			
			ТекВыборка = ТекЗапрос.Выполнить().Выбрать();
			
			Пока ТекВыборка.Следующий() Цикл
				
				спРаботаСДаннымиВызовСервера.УдалитьСообщение(Перечисления.спТипыОчередей.Исходящая, ТекВыборка.Идентификатор);
				
			КонецЦикла;
		КонецЕсли;
КонецПроцедуры	

// Процедура - Обработка очереди входящих сообщений
//
Процедура ОбработкаОчередиВходящихСообщений() Экспорт
	
	
	ВремяОжидания = ?(спФункциональныеОпцииВызовСервера.АвтоматическийСтартОбработчиков(), спКэшируемыеФункцииВызовСервера.ДлительностьОжиданияПриАвтоматическомСтарте(), спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спДлительностьОжидания")) * 1000;
	
	ОстатокВремениОжидания = ВремяОжидания;	
	МаксимумПотоков = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спМаксимальноеКоличествоПотоковОбработкиИсходящих");
	
	Пока ОстатокВремениОжидания > 0 Цикл
		
		СтартОжидания = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Если ПолучитьФункциональнуюОпцию("спОтключитьПотоки") Тогда
			
			Прервать;
			
		КонецЕсли;
		
		ТекКоличествоПотоков = МаксимумПотоков - спОбщегоНазначенияВызовСервера.ПолучитьКоличествоПотоков("Наименование", "ОбработатьВходящееСообщение");
		
		Если ТекКоличествоПотоков > 0 Тогда
			
			ТекЗапрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ " + Строка(ТекКоличествоПотоков) + "
			|	тбОчередь.ДатаРегистрации,
			|	тбОчередь.ИдентификаторСообщения,
			|	тбОчередь.ФорматСообщения,
			|	тбОчередь.КлассСообщения
			|ИЗ
			|	РегистрСведений.спОчередьВходящихСообщений КАК тбОчередь
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
			|		ПО тбОчередь.ИдентификаторСообщения = тбСостояние.ИдентификаторСообщения
			|			И (тбСостояние.СтатусСообщения В (&СписокСтатусов))
			|			И тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло
			|
			|УПОРЯДОЧИТЬ ПО
			|	тбОчередь.ДатаСоздания,
			|	тбСостояние.ДатаИзменения");
			ТекЗапрос.УстановитьПараметр("СписокСтатусов", спКэшируемыеФункцииВызовСервера.ПоучитьСписокРабочихСтатусов());
			ТекЗапрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса()));
			
			ТекРезультат = ТекЗапрос.Выполнить();
			
			Если ТекРезультат.Пустой() Тогда
				
				спОбщегоНазначенияВызовСервера.Ожидание(1);
				ОстатокВремениОжидания = ОстатокВремениОжидания - (ТекущаяУниверсальнаяДатаВМиллисекундах() - СтартОжидания);
			
			Иначе
				
				ТекИдентификатор = "Идентификатор не определен";
				
				Попытка
					
					ТекВыборка = ТекРезультат.Выбрать();
					
					Пока ТекВыборка.Следующий() Цикл
						
						ТекИдентификатор = ТекВыборка.ИдентификаторСообщения;
						
						спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(ТекИдентификатор, Перечисления.спСтатусыСообщений.ВОбработке);
						
						МсвПараметры = Новый Массив;
						МсвПараметры.Добавить(ТекИдентификатор);
						МсвПараметры.Добавить(ТекВыборка.ФорматСообщения);
						МсвПараметры.Добавить(ТекВыборка.КлассСообщения);
						МсвПараметры.Добавить(ТекВыборка.ДатаРегистрации);
						
						ФоновыеЗадания.Выполнить("спОбслуживаниеОчередей.ОбработатьВходящееСообщение", МсвПараметры, ТекИдентификатор, "ОбработатьВходящееСообщение");
					КонецЦикла;
					
					ОстатокВремениОжидания = ВремяОжидания;
					
				Исключение
					
					ИнформацияОбОшибке = ИнформацияОбОшибке();
					ЗаписьЖурналаРегистрации("Обработка очереди входящих сообщений", УровеньЖурналаРегистрации.Ошибка,, ТекИдентификатор, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
				
				КонецПопытки;
				
			КонецЕсли;
				
		КонецЕсли;  
		
		ОстатокВремениОжидания = ОстатокВремениОжидания - (ТекущаяУниверсальнаяДатаВМиллисекундах() - СтартОжидания);
		
		
	КонецЦикла;
		
КонецПроцедуры

// Процедура - Обработать входящее сообщение 
//
// Параметры:
//  Идентификатор - УникальныйИдентификатор - Идентификатор сообщения
//  ФорматСообщения - ПеречислениеСсылка.спФорматыСообщений - Формат поступившего сообщения
//  КлассСообщения - Строка - Идентификатор класса поступившего сообщения, по данному классу выполняется получение обработчика для сообщения
//  ДатаРегистрации - Дата - Дата регистрации сообщения
//
Процедура ОбработатьВходящееСообщение(Идентификатор, ФорматСообщения, КлассСообщения, ДатаРегистрации) Экспорт
	
	Если ИдетОбработкаСистемныхСобытий() Тогда
		
		Возврат; //Если включена обработка системных событий останавливаем рабочие потоки.
	
	КонецЕсли;
				
			Попытка
				
				Задержка = 0;
				
				ОбъектСобытия = ПолучитьОбъектСобытия(Перечисления.спТипыИнтеграции.Входящая, Идентификатор);
								
				СостояниеСообщения = Перечисления.спСтатусыСообщений.Обработано; // Переменная для установки нового состояние сообщения  
				
				ОбъектСобытия = спФункцииРаботыJSON.ДесериализоватьОбъект(ОбъектСобытия);
				
				ОбъектСобытия.ОбменДанными.Загрузка = Истина;
				
				ОбъектСобытия.Записать();  
				
				спРаботаСДаннымиВызовСервера.ПоместитьСсылкаНаОбъектВОчередьВходящихщих(Идентификатор, ОбъектСобытия.Ссылка);
				
				спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(Идентификатор, СостояниеСообщения, Задержка, , , Истина, Перечисления.спТипыИнтеграции.Входящая, КлассСообщения);
				
			Исключение
				// WMS Начало изменений
				Пока ТранзакцияАктивна() Цикл 
					ОтменитьТранзакцию();
				КонецЦикла;
				// WMS Конец изменений
				
				ТекстОшибки = спОбщегоНазначенияВызовСервера.ДополнитьТекстОшибки(спОбщегоНазначенияВызовСервера.ПолучитьТекстОшибкиОбработчика(ИнформацияОбОшибке()), , Неопределено);			
				ЗаписьЖурналаРегистрации("Обработка сообщения", УровеньЖурналаРегистрации.Ошибка, , Идентификатор, ТекстОшибки);
								
				спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(Идентификатор, Перечисления.спСтатусыСообщений.ОшибкаОбработки, , ТекстОшибки, , , Перечисления.спТипыИнтеграции.Входящая, КлассСообщения);
			
			КонецПопытки;
	
КонецПроцедуры

// Процедура - Обработка очереди исходящих сообщений
Процедура ОбработкаОчередиИсходящихСообщений() Экспорт
	
	ТочкаОбмена = Неопределено;
	
	ВремяОжидания = ?(спФункциональныеОпцииВызовСервера.АвтоматическийСтартОбработчиков(), спКэшируемыеФункцииВызовСервера.ДлительностьОжиданияПриАвтоматическомСтарте(), спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спДлительностьОжидания")) * 1000;
	ОстатокВремениОжидания = времяОжидания;
	МаксимумПотоков = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спМаксимальноеКоличествоПотоковОбработкиИсходящих");
	
	 Пока ОстатокВремениОжидания > 0 Цикл
		
		СтартОжидания = ТекущаяУниверсальнаяДатаВМиллисекундах();
		
		Если ПолучитьФункциональнуюОпцию("спОтключитьПотоки") Тогда
			
			Прервать;
		
		КонецЕсли;
		
		ТекКоличествоПотоков = МаксимумПотоков - спОбщегоНазначенияВызовСервера.ПолучитьКоличествоПотоков("Наименование", "СформироватьИсходящееСообщение");
		
		Если ТекКоличествоПотоков > 0 Тогда
			
			ТекЗапрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ " + Строка(ТекКоличествоПотоков) + "
			|	тбОчередь.ИдентификаторСобытия,
			|	тбОчередь.ДатаРегистрации,
			|	тбОчередь.ФорматСообщения,
			|	тбОчередь.МетодХранения,
			|	тбОчередь.ЭтоУдаление,
			|	тбОчередь.ОбъектСобытия,
			|	тбОчередь.СсылкаНаОбъект,
			|	тбОчередь.СпособПередачи
			|ИЗ
			|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
			|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
			|			И (тбСостояние.СтатусСообщения  В (&СписокСтатусов))  
			|			И тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло
			|
			|УПОРЯДОЧИТЬ ПО
			|	тбСостояние.ДатаИзменения");
			ТекЗапрос.УстановитьПараметр("СписокСтатусов", спКэшируемыеФункцииВызовСервера.ПоучитьСписокРабочихСтатусов()); 
			ТекЗапрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса()));
			
			ТекРезультат = ТекЗапрос.Выполнить();
			
			Если ТекРезультат.Пустой() Тогда
				
				спОбщегоНазначенияВызовСервера.Ожидание(1);
				ОстатокВремениОжидания = ОстатокВремениОжидания - (ТекущаяУниверсальнаяДатаВМиллисекундах() - СтартОжидания);
			
			Иначе
				
				ТекИдентификатор = "Идентификатор не определен";
				
				Попытка
					
					ТекВыборка = ТекРезультат.Выбрать();
					
					Пока ТекВыборка.Следующий() Цикл
						
						ТекИдентификатор = ТекВыборка.ИдентификаторСобытия;
						спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(ТекИдентификатор, Перечисления.спСтатусыСообщений.ВОбработке, , , , , Перечисления.спТипыИнтеграции.Исходящая);
						
						МсвПараметры = Новый Массив; 
						
						Данные = Новый Структура;
						Данные.Вставить("ТекИдентификатор", ТекИдентификатор); 
						Данные.Вставить("ФорматСообщения", ТекВыборка.ФорматСообщения);
						Данные.Вставить("ОбъектСобытия", ТекВыборка.ОбъектСобытия);
						Данные.Вставить("МетодХранения", ТекВыборка.МетодХранения);
						Данные.Вставить("ДатаРегистрации", ТекВыборка.ДатаРегистрации);
						Данные.Вставить("ЭтоУдаление", ТекВыборка.ЭтоУдаление);
						Данные.Вставить("СсылкаНаОбъект", ТекВыборка.СсылкаНаОбъект);
						Данные.Вставить("СпособПередачи", ТекВыборка.СпособПередачи);
						Данные.Вставить("ТочкаОбмена", ТочкаОбмена);
						
						МсвПараметры.Добавить(Данные);
						
						//МсвПараметры.Добавить(ТекИдентификатор);
						//МсвПараметры.Добавить(ТекВыборка.ФорматСообщения);
						//МсвПараметры.Добавить(ТекВыборка.ОбъектСобытия);
						//МсвПараметры.Добавить(ТекВыборка.МетодХранения);
						//МсвПараметры.Добавить(ТекВыборка.ДатаРегистрации);
						//МсвПараметры.Добавить(ТекВыборка.ЭтоУдаление);
						//МсвПараметры.Добавить(ТекВыборка.СсылкаНаОбъект);
						//МсвПараметры.Добавить(ТекВыборка.СпособПередачи);
						//МсвПараметры.Добавить(ТочкаОбмена); 
						
						Попытка
							ФоновыеЗадания.Выполнить("спОбслуживаниеОчередей.СформироватьИсходящееСообщение", МсвПараметры, ТекИдентификатор, "СформироватьИсходящееСообщение");  
						Исключение
							// Запускаем фоновое задание со статическим ключем. Запуск других экземпляров должен заканчиваться ошибкой (паттерн синглтон).
							ИнформацияОбОшибке = ИнформацияОбОшибке();
							ЗаписьЖурналаРегистрации("Сформировать исходящее сообщение", УровеньЖурналаРегистрации.Ошибка, , ,
							ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)); 
							
						КонецПопытки            
					КонецЦикла;
					
					ОстатокВремениОжидания = ВремяОжидания;
					
				Исключение
					
					ИнформацияОбОшибке = ИнформацияОбОшибке();
					ЗаписьЖурналаРегистрации("Обработка очереди исходящих сообщений", УровеньЖурналаРегистрации.Ошибка,, ТекИдентификатор, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
				
				КонецПопытки;
				
			КонецЕсли;
				
		КонецЕсли; 
		
		ОстатокВремениОжидания = ОстатокВремениОжидания - (ТекущаяУниверсальнаяДатаВМиллисекундах() - СтартОжидания);
	
	КонецЦикла;
	
		
КонецПроцедуры

// Процедура - Отправить исходящее сообщение 
//
// Параметры:
//  Идентификатор - УникальныйИдентификатор - Идентификатор сообщения
//  ФорматСообщения - ПеречислениеСсылка.спФорматыСообщений - Формат отправляемого сообщения
//	ТипОбъекта - Строка - Строковое представление имени метаданных объекта
//  МетодХранения - ПеречислениеСсылка.спМетодХранения - Метод хранения сообщения
//  ДатаРегистрации - Дата - Дата регистрации сообщения
//	ЭтоУдаление - Булево - Обозначение удаления
//	СсылкаНаОбъект - ЛюбаяСсылка - Ссылка на объект исходящего сообщения
//  ТочкаОбмена - Неопределено - Точка обмена
//
Процедура СформироватьИсходящееСообщение(Данные) Экспорт 
	
	Идентификатор = Данные.ТекИдентификатор; 
	ФорматСообщения = Данные.ФорматСообщения; 
	ТипОбъекта = Данные.ОбъектСобытия; 
	МетодХранения = Данные.МетодХранения; 
	ДатаРегистрации = Данные.ДатаРегистрации; 
	ЭтоУдаление = Данные.ЭтоУдаление;
	СсылкаНаОбъект = Данные.СсылкаНаОбъект; 
	СпособПередачи = Данные.СпособПередачи; 
	ТочкаОбмена = Неопределено;
	
	Задержка = 0;
	ТекЗаголовокЖурнала = "Получение объекта события";
	ТекстОшибки = "";

	ОбъектСобытия = ПолучитьОбъектСобытия(Перечисления.спТипыИнтеграции.Исходящая, Идентификатор);

	ТекЗаголовокЖурнала = "Формирование сообщения";

	Попытка

		СостояниеСообщения = Перечисления.спСтатусыСообщений.Обработано;
			
		ТекЗаголовокЖурнала = "Отправка сообщения";
		
		ТекВозврат = ОтправитьСообщениеБезОчереди(ОбъектСобытия, Идентификатор, ДатаРегистрации, ФорматСообщения, ТипОбъекта, СпособПередачи, СостояниеСообщения);
		
		Если Не ТекВозврат Тогда	
			СостояниеСообщения = Перечисления.спСтатусыСообщений.ОжиданиеОбработки;
			Задержка = 30;   
		Иначе
			ЗаписатьВОчередьИсходящих(Идентификатор, ОбъектСобытия);
		КонецЕсли;
		
	Исключение
		Пока ТранзакцияАктивна() Цикл
			ОтменитьТранзакцию();
		КонецЦикла;

		ТекстОшибки = спОбщегоНазначенияВызовСервера.ПолучитьТекстОшибкиОбработчика(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(текЗаголовокЖурнала, УровеньЖурналаРегистрации.Ошибка, , Идентификатор, ТекстОшибки);

		Если текЗаголовокЖурнала = "Формирование сообщения" Тогда

			СостояниеСообщения = Перечисления.спСтатусыСообщений.ОшибкаОбработки;

		Иначе

			СостояниеСообщения = Перечисления.спСтатусыСообщений.ОжиданиеОбработки;
			Задержка = 30;

		КонецЕсли;

	КонецПопытки;

	Если Не СостояниеСообщения = Перечисления.спСтатусыСообщений.Отправлено Тогда
        СткОбработчик = "";
        
		Если СостояниеСообщения = Перечисления.спСтатусыСообщений.ОшибкаОбработки Тогда
			ТекстОшибки = спОбщегоНазначенияВызовСервера.ДополнитьТекстОшибки(ТекстОшибки, СткОбработчик, СсылкаНаОбъект);
		КонецЕсли;

		спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(Идентификатор, СостояниеСообщения, Задержка, ТекстОшибки, ,
			, Перечисления.спТипыИнтеграции.Исходящая);

	КонецЕсли;
	
КонецПроцедуры

// Функция - Идет обработка системных событий
// 
// Возвращаемое значение:
// Булево  - Признак выполнения системных сообщений по изменению обработчиков.
//
Функция ИдетОбработкаСистемныхСобытий() Экспорт
	
	МсвКлючи = Новый Массив;
	МсвКлючи.Добавить("ВыполнитьИзменениеОбработчиков");  
	
	КоличествоПотоков = спОбщегоНазначенияВызовСервера.ПолучитьКоличествоПотоков("Ключ", МсвКлючи);
	
	Возврат Не КоличествоПотоков = 0; 

КонецФункции

// Функция - Получить объект события
//
// Параметры:
//  ТипОчереди - ПеречислениеСсылка.спТипыИнтеграции - тип очереди из которой необходимо получить данные 
//  Идентификатор - УникальныйИдентификатор - идентификатор события по которому требуется получить данные. 
// 
// Возвращаемое значение:
//  Строка - данные события.
//
Функция ПолучитьОбъектСобытия(ТипОчереди, Идентификатор) Экспорт 
	
	ЗапросОбъектСобытия = Новый Запрос;
	ЗапросОбъектСобытия.Текст = "ВЫБРАТЬ
	|	тбОчередь.Хранилище
	|ИЗ
	|	РегистрСведений." +?(ТипОчереди = Перечисления.спТипыИнтеграции.Исходящая, "спОчередьИсходящихСообщений", "спОчередьВходящихСообщений") + " КАК тбОчередь
	|ГДЕ
	|	тбОчередь." +?(ТипОчереди = Перечисления.спТипыИнтеграции.Исходящая, "ИдентификаторСобытия", "ИдентификаторСообщения") + " = &Идентификатор";
	ЗапросОбъектСобытия.УстановитьПараметр("Идентификатор", Идентификатор);
	
	ЗапросВыборка = ЗапросОбъектСобытия.Выполнить().Выбрать();
	
	ЗапросВыборка.Следующий();
	
	Возврат ЗапросВыборка.Хранилище.Получить();
	
КонецФункции

// Записать в очередь исходящих.
// 
// Параметры:
//  ИдентификаторСообщения - УникальныйИдентификатор - Идентификатор сообщения
//  Сообщение - Структура - Сообщение:
// * Id - Строка - 
// * Type - Строка - 
// * ClassId - Строка - 
// * Body - Строка - 
// * CreationTime - Дата - 
// * NeedAcknowledgment - Булево - 
// * Properties - Неопределено - 
// * Receivers - Массив - 
// * ReplyTo - Неопределено - 
// * Source - Неопределено - 
// * CorrelationId - Неопределено - 
Процедура ЗаписатьВОчередьИсходящих(ИдентификаторСообщения, Сообщение = Неопределено, ИмяФайла = Неопределено) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОчередьИсходящихСообщений.ИдентификаторСобытия КАК ИдентификаторСобытия,
	               |	ОчередьИсходящихСообщений.Хранилище КАК Хранилище,
	               |	ОчередьИсходящихСообщений.tl_ХранилищеСообщения КАК tl_ХранилищеСообщения,
	               |	ОчередьИсходящихСообщений.ДатаРегистрации КАК ДатаРегистрации,
	               |	ОчередьИсходящихСообщений.ОбъектСобытия КАК ОбъектСобытия,
	               |	ОчередьИсходящихСообщений.ФорматСообщения КАК ФорматСообщения,
	               |	ОчередьИсходящихСообщений.МетодХранения КАК МетодХранения,
	               |	ОчередьИсходящихСообщений.ЭтоУдаление КАК ЭтоУдаление,
	               |	ОчередьИсходящихСообщений.СсылкаНаОбъект КАК СсылкаНаОбъект,
	               |	ОчередьИсходящихСообщений.СпособПередачи КАК СпособПередачи,
	               |	ОчередьИсходящихСообщений.ИнициаторОтправкиСсылкаНаОбъект КАК ИнициаторОтправкиСсылкаНаОбъект,
				   |	ОчередьИсходящихСообщений.ИмяФайла КАК ИмяФайла
	               |ИЗ
	               |	РегистрСведений.спОчередьИсходящихСообщений КАК ОчередьИсходящихСообщений
	               |ГДЕ
	               |	ОчередьИсходящихСообщений.ИдентификаторСобытия = &ИдентификаторСобытия";  
	Запрос.УстановитьПараметр("ИдентификаторСобытия", ИдентификаторСообщения); 
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		МенеджерЗаписи = РегистрыСведений.спОчередьИсходящихСообщений.СоздатьМенеджерЗаписи();   
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);  
		Если Сообщение <> Неопределено Тогда
			МенеджерЗаписи.tl_ХранилищеСообщения = Новый ХранилищеЗначения(Сообщение); 
		КонецЕсли;
		Если ИмяФайла <> Неопределено Тогда 
			МенеджерЗаписи.ИмяФайла = ИмяФайла; 
		КонецЕсли;
		МенеджерЗаписи.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Функция - Отправить сообщение без очереди
//
// 
// Параметры:
//  Сообщение - Структура - Структура описывающая состав отправляемого сообщения. Способ обработки зависит от типа коннектора адаптера.
//  Идентификатор - УникальныйИдентификатор - Идентификатор
//  ДатаРегистрации - Дата - Дата регистрации
//  СостояниеСообщения - ПеречислениеСсылка.спСтатусыСообщений - Статус сообщения.
// 
// Возвращаемое значение:
//  Булево - Признак успешности отправки сообщения на адаптер.
//
//{{MRG[ <-> ]
Функция ОтправитьСообщениеБезОчереди(Сообщение, Идентификатор, ДатаРегистрации, ФорматСообщения, ТипОбъекта, СпособПередачи, СостояниеСообщения = Неопределено) Экспорт
	
	ОтправкаРезультат = Истина;
		
	Попытка
		спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(Идентификатор, Перечисления.спСтатусыСообщений.Отправлено, , , , , Перечисления.спТипыИнтеграции.Исходящая);
		
		Если ПолучитьФункциональнуюОпцию("спОтключитьПотоки") Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
		ОтправитьСообщение(Сообщение, Идентификатор, ДатаРегистрации, ФорматСообщения, ТипОбъекта, СпособПередачи, СостояниеСообщения);
				
		Если Не СостояниеСообщения = Неопределено Тогда
			СостояниеСообщения = Перечисления.спСтатусыСообщений.Отправлено;
		КонецЕсли;
		
	Исключение
		
		ОтправкаРезультат = Ложь;
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ЗаписьЖурналаРегистрации("Обработка очереди отправляемых сообщений", УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		
	КонецПопытки;
	
	Возврат ОтправкаРезультат;
	
КонецФункции

// Отправить сообщение.
// 
// Параметры:
//  Сообщение - Структура, Строка - Сообщение
//  Идентификатор - УникальныйИдентификатор - Идентификатор
//  ДатаРегистрации - Дата - Дата регистрации
//  СостояниеСообщения - Неопределено, ПеречислениеСсылка.спСтатусыСообщений - Состояние сообщения
// 
// Возвращаемое значение:
//  Булево - Отправить сообщение
Функция ОтправитьСообщение(Знач Сообщение, Идентификатор, ДатаРегистрации, ФорматСообщения, ТипОбъекта, СпособПередачи, СостояниеСообщения = Неопределено) Экспорт 
	спСервисИнтеграцииВызовСервера.ОтправитьСообщение(Сообщение, Идентификатор, ДатаРегистрации, ФорматСообщения, ТипОбъекта, СпособПередачи, Перечисления.спТипыОчередей.Отправки);
	Возврат Истина;
	
КонецФункции  

// Обработка очереди исходящего сообщения

// Процедура - Обработка очереди исходящих сообщений
Функция ОбработкаОчередиИсходящегоСообщения(СсылкаНаОбъект) Экспорт 
	ИсходящееСообщение = Новый Структура("ДвоичныеДанные, Префикс, Идентификатор, Сообщение, СтатусСообщения, ОписаниеДанных");
	ТочкаОбмена = Неопределено;
	
	Если ПолучитьФункциональнуюОпцию("спОтключитьПотоки") Тогда	
		Возврат ИсходящееСообщение;		
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
				|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
				|	тбОчередь.ФорматСообщения КАК ФорматСообщения,
				|	тбОчередь.МетодХранения КАК МетодХранения,
				|	тбОчередь.ЭтоУдаление КАК ЭтоУдаление,
				|	тбОчередь.ОбъектСобытия КАК ОбъектСобытия,
				|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
				|	тбОчередь.СпособПередачи КАК СпособПередачи,
				|	тбСостояние.СтатусСообщения КАК СтатусСообщения,
				|	тбСостояние.ОписаниеДанных КАК ОписаниеДанных
				|ИЗ
				|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
				|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
				|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
				|			И (тбОчередь.СсылкаНаОбъект = &СсылкаНаОбъект)
				|
				|УПОРЯДОЧИТЬ ПО
				|	тбСостояние.ДатаИзменения";
				
	Запрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса()));  
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		ТекИдентификатор = "Идентификатор не определен";
		
		Попытка
			
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл 
				
				СписокРабочихСтатусов = спКэшируемыеФункцииВызовСервера.ПоучитьСписокСтатусовДляОтправки();  
				
				Статус = Неопределено;
				Для ИндексЭлемента = 0 По СписокРабочихСтатусов.ВГраница() Цикл 
					Если СписокРабочихСтатусов[ИндексЭлемента] = Выборка.СтатусСообщения Тогда 
						Статус = Выборка.СтатусСообщения;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				Если Статус = Неопределено Тогда
                     ИсходящееСообщение.Вставить("Идентификатор", 	Выборка.ИдентификаторСобытия);
					 ИсходящееСообщение.Вставить("ОписаниеДанных", 	Выборка.ОписаниеДанных);
					 ИсходящееСообщение.Вставить("СтатусСообщения", Выборка.СтатусСообщения); 
					 Возврат ИсходящееСообщение;
				КонецЕсли;
				
				ТекИдентификатор = Выборка.ИдентификаторСобытия;
				спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(ТекИдентификатор, Перечисления.спСтатусыСообщений.ВОбработке, , , , , Перечисления.спТипыИнтеграции.Исходящая);
				
				Данные = Новый Структура;
				Данные.Вставить("ТекИдентификатор", ТекИдентификатор); 
				Данные.Вставить("ФорматСообщения", 	Выборка.ФорматСообщения);
				Данные.Вставить("ОбъектСобытия", 	Выборка.ОбъектСобытия);
				Данные.Вставить("МетодХранения", 	Выборка.МетодХранения);
				Данные.Вставить("ДатаРегистрации", 	Выборка.ДатаРегистрации);
				Данные.Вставить("ЭтоУдаление", 		Выборка.ЭтоУдаление);
				Данные.Вставить("СсылкаНаОбъект", 	Выборка.СсылкаНаОбъект);
				Данные.Вставить("СпособПередачи", 	Выборка.СпособПередачи);
				Данные.Вставить("ОписаниеДанных",   Выборка.ОписаниеДанных);
				Данные.Вставить("ТочкаОбмена", 		ТочкаОбмена);
				
				Попытка
					ПрочтенноеСообщение = СформироватьИсходящееСообщениеСКлиента(Данные);
					Если ТипЗнч(ПрочтенноеСообщение) = Тип("Структура") Тогда
						Значение = Неопределено;
						Если ПрочтенноеСообщение.Свойство("ДвоичныеДанные", Значение) Тогда 
							ИсходящееСообщение.Вставить("ДвоичныеДанные", Значение); 
						КонецЕсли; 
						Значение = Неопределено;
						Если ПрочтенноеСообщение.Свойство("Префикс", Значение) Тогда 
							ИсходящееСообщение.Вставить("Префикс", Значение);
						КонецЕсли;
						Значение = Неопределено;
						Если ПрочтенноеСообщение.Свойство("Сообщение", Значение) Тогда 
							ИсходящееСообщение.Вставить("Сообщение", Значение);
						КонецЕсли;
						
					КонецЕсли;
					ИсходящееСообщение.Вставить("Идентификатор", ТекИдентификатор);
					
				Исключение
					
					// Запускаем фоновое задание со статическим ключем. Запуск других экземпляров должен заканчиваться ошибкой (паттерн синглтон).
					ИнформацияОбОшибке = ИнформацияОбОшибке();
					ЗаписьЖурналаРегистрации("Сформировать исходящее сообщение", УровеньЖурналаРегистрации.Ошибка
												, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)); 

				КонецПопытки            
			КонецЦикла;
			
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Обработка очереди исходящих сообщений", УровеньЖурналаРегистрации.Ошибка
										, , ТекИдентификатор, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));

		КонецПопытки;
		
	КонецЕсли;	
	
	Возврат ИсходящееСообщение;	
КонецФункции  

// Процедура - Обработка очереди исходящих сообщений
Функция ОбработкаОчередиИсходящегоСообщенияПоСсылкеИСтатусу(СсылкаНаОбъект, Статусы) Экспорт 
	ИсходящееСообщение = Новый Структура("ДвоичныеДанные, Префикс, Идентификатор");
	ТочкаОбмена = Неопределено;
	
	Если ПолучитьФункциональнуюОпцию("спОтключитьПотоки") Тогда	
		Возврат ИсходящееСообщение;		
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
				"ВЫБРАТЬ ПЕРВЫЕ 1
				|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
				|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
				|	тбОчередь.ФорматСообщения КАК ФорматСообщения,
				|	тбОчередь.МетодХранения КАК МетодХранения,
				|	тбОчередь.ЭтоУдаление КАК ЭтоУдаление,
				|	тбОчередь.ОбъектСобытия КАК ОбъектСобытия,
				|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
				|	тбОчередь.СпособПередачи КАК СпособПередачи
				|ИЗ
				|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
				|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
				|			И (тбСостояние.СтатусСообщения В (&СписокСтатусов))
				|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
				|			И (тбОчередь.СсылкаНаОбъект = &СсылкаНаОбъект)
				|
				|УПОРЯДОЧИТЬ ПО
				|	тбСостояние.ДатаИзменения";
	
	Запрос.УстановитьПараметр("СписокСтатусов", Статусы); 
	Запрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса()));  
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		ТекИдентификатор = "Идентификатор не определен";
		
		Попытка
			
			Выборка = Результат.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ТекИдентификатор = Выборка.ИдентификаторСобытия;
				спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(ТекИдентификатор, Перечисления.спСтатусыСообщений.ВОбработке, , , , , Перечисления.спТипыИнтеграции.Исходящая);
				
				Данные = Новый Структура;
				Данные.Вставить("ТекИдентификатор", ТекИдентификатор); 
				Данные.Вставить("ФорматСообщения", 	Выборка.ФорматСообщения);
				Данные.Вставить("ОбъектСобытия", 	Выборка.ОбъектСобытия);
				Данные.Вставить("МетодХранения", 	Выборка.МетодХранения);
				Данные.Вставить("ДатаРегистрации", 	Выборка.ДатаРегистрации);
				Данные.Вставить("ЭтоУдаление", 		Выборка.ЭтоУдаление);
				Данные.Вставить("СсылкаНаОбъект", 	Выборка.СсылкаНаОбъект);
				Данные.Вставить("СпособПередачи", 	Выборка.СпособПередачи);
				Данные.Вставить("ТочкаОбмена", 		ТочкаОбмена);
				
				Попытка
					ПрочтенноеСообщение = СформироватьИсходящееСообщениеСКлиента(Данные);
					Если ТипЗнч(ПрочтенноеСообщение) = Тип("Структура") Тогда
						Значение = Неопределено;
						Если ПрочтенноеСообщение.Свойство("ДвоичныеДанные", Значение) Тогда 
							ИсходящееСообщение.Вставить("ДвоичныеДанные", Значение); 
						КонецЕсли; 
						Значение = Неопределено;
						Если ПрочтенноеСообщение.Свойство("Префикс", Значение) Тогда 
							ИсходящееСообщение.Вставить("Префикс", Значение);
						КонецЕсли;
					КонецЕсли;
					ИсходящееСообщение.Вставить("Идентификатор", ТекИдентификатор);
					
				Исключение
					
					// Запускаем фоновое задание со статическим ключем. Запуск других экземпляров должен заканчиваться ошибкой (паттерн синглтон).
					ИнформацияОбОшибке = ИнформацияОбОшибке();
					ЗаписьЖурналаРегистрации("Сформировать исходящее сообщение", УровеньЖурналаРегистрации.Ошибка
												, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)); 

				КонецПопытки            
			КонецЦикла;
			
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Обработка очереди исходящих сообщений", УровеньЖурналаРегистрации.Ошибка
										, , ТекИдентификатор, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));

		КонецПопытки;
		
	КонецЕсли;	
	
	Возврат ИсходящееСообщение;	
КонецФункции  

// Процедура - Обработка очереди исходящих сообщений
Функция ОбработкаОчередиИсходящегоСообщенияПоСсылкамИСтатусу(СсылкиНаОбъект, Статусы) Экспорт 
		
	ИсходящееСообщение = Новый Структура("ДвоичныеДанные, Префикс, Идентификатор");
	ТочкаОбмена = Неопределено;

	Если ТипЗнч(СсылкиНаОбъект) <> Тип("Массив") И СсылкиНаОбъект.Количество = 0 Тогда  
		Возврат ИсходящееСообщение;
	КонецЕсли;    
	
	Если ПолучитьФункциональнуюОпцию("спОтключитьПотоки") Тогда	
		Возврат ИсходящееСообщение;		
	КонецЕсли;
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
				"ВЫБРАТЬ
				|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
				|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
				|	тбОчередь.ФорматСообщения КАК ФорматСообщения,
				|	тбОчередь.МетодХранения КАК МетодХранения,
				|	тбОчередь.ЭтоУдаление КАК ЭтоУдаление,
				|	тбОчередь.ОбъектСобытия КАК ОбъектСобытия,
				|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
				|	тбОчередь.СпособПередачи КАК СпособПередачи,
				|	тбОчередь.Хранилище КАК Хранилище
				|ИЗ
				|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
				|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
				|			И (тбСостояние.СтатусСообщения В (&СписокСтатусов))
				|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
				|			И (тбОчередь.СсылкаНаОбъект В (&СсылкиНаОбъект))
				|
				|УПОРЯДОЧИТЬ ПО
				|	тбСостояние.ДатаИзменения";
	
	Запрос.УстановитьПараметр("СписокСтатусов", Статусы); 
	Запрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса()));  
	Запрос.УстановитьПараметр("СсылкиНаОбъект", СсылкиНаОбъект);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		ТекИдентификатор = "Идентификатор не определен";
		
		Попытка
			
			Выборка = Результат.Выбрать();
			
			ПакетДанных = Новый Массив;
			Пока Выборка.Следующий() Цикл
				
				ТекИдентификатор = Выборка.ИдентификаторСобытия;
				спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(ТекИдентификатор, Перечисления.спСтатусыСообщений.ВОбработке, , , , , Перечисления.спТипыИнтеграции.Исходящая);
				
				Данные = Новый Структура;
				Данные.Вставить("ТекИдентификатор", ТекИдентификатор); 
				Данные.Вставить("ФорматСообщения", 	Выборка.ФорматСообщения);
				Данные.Вставить("ОбъектСобытия", 	Выборка.ОбъектСобытия);
				Данные.Вставить("МетодХранения", 	Выборка.МетодХранения);
				Данные.Вставить("ДатаРегистрации", 	Выборка.ДатаРегистрации);
				Данные.Вставить("ЭтоУдаление", 		Выборка.ЭтоУдаление);
				Данные.Вставить("СсылкаНаОбъект", 	Выборка.СсылкаНаОбъект);
				Данные.Вставить("СпособПередачи", 	Выборка.СпособПередачи);
				Данные.Вставить("ТочкаОбмена", 		ТочкаОбмена);
				Данные.Вставить("Хранилище", 		Выборка.Хранилище);
				ПакетДанных.Добавить(Данные);
			КонецЦикла;  
			
			Попытка 
			    			
				Если ПакетДанных.Количество() = 0 Тогда 
					Возврат ИсходящееСообщение;
				КонецЕсли;
				
				ПрочтенноеСообщение = СформироватьИсходящееСообщениеСКлиентаИзМассиваДанных(ПакетДанных);
				
				Если ТипЗнч(ПрочтенноеСообщение) = Тип("Структура") Тогда
					Значение = Неопределено;
					Если ПрочтенноеСообщение.Свойство("ДвоичныеДанные", Значение) Тогда 
						ИсходящееСообщение.Вставить("ДвоичныеДанные", Значение); 
					КонецЕсли; 
					Значение = Неопределено;
					Если ПрочтенноеСообщение.Свойство("Префикс", Значение) Тогда 
						ИсходящееСообщение.Вставить("Префикс", Значение);
					КонецЕсли;
				КонецЕсли;
				ИсходящееСообщение.Вставить("Идентификатор", ТекИдентификатор);
				
			Исключение
				
				// Запускаем фоновое задание со статическим ключем. Запуск других экземпляров должен заканчиваться ошибкой (паттерн синглтон).
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ЗаписьЖурналаРегистрации("Сформировать исходящее сообщение", УровеньЖурналаРегистрации.Ошибка
				, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)); 
				
			КонецПопытки 
			
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Обработка очереди исходящих сообщений", УровеньЖурналаРегистрации.Ошибка
										, , ТекИдентификатор, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));

		КонецПопытки;
		
	КонецЕсли;	
	
	Возврат ИсходящееСообщение;	
КонецФункции 

// Процедура - Отправить исходящее сообщение 
//
// Параметры:
//  Идентификатор - УникальныйИдентификатор - Идентификатор сообщения
//  ФорматСообщения - ПеречислениеСсылка.спФорматыСообщений - Формат отправляемого сообщения
//	ТипОбъекта - Строка - Строковое представление имени метаданных объекта
//  МетодХранения - ПеречислениеСсылка.спМетодХранения - Метод хранения сообщения
//  ДатаРегистрации - Дата - Дата регистрации сообщения
//	ЭтоУдаление - Булево - Обозначение удаления
//	СсылкаНаОбъект - ЛюбаяСсылка - Ссылка на объект исходящего сообщения
//  ТочкаОбмена - Неопределено - Точка обмена
//
Функция СформироватьИсходящееСообщениеСКлиента(Данные) 
	
	Перем ПрочтенноеСообщение;
	Идентификатор = Данные.ТекИдентификатор; 
	ФорматСообщения = Данные.ФорматСообщения; 
	ТипОбъекта = Данные.ОбъектСобытия; 
	МетодХранения = Данные.МетодХранения; 
	ДатаРегистрации = Данные.ДатаРегистрации; 
	ЭтоУдаление = Данные.ЭтоУдаление;
	СсылкаНаОбъект = Данные.СсылкаНаОбъект; 
	СпособПередачи = Данные.СпособПередачи;
	ОписаниеДанных = ?(Данные.Свойство("ОписаниеДанных") ,Данные.ОписаниеДанных, Неопределено);
	ТочкаОбмена = Неопределено;
	
	Задержка = 0;
	ТекЗаголовокЖурнала = "Получение объекта события";
	ТекстОшибки = "";
	
	ОбъектСобытия = ПолучитьОбъектСобытия(Перечисления.спТипыИнтеграции.Исходящая, Идентификатор);
	
	ТекЗаголовокЖурнала = "Формирование сообщения";
	
	Попытка
		
		СостояниеСообщения = Перечисления.спСтатусыСообщений.ОжиданиеОтправки;
		
		ТекЗаголовокЖурнала = "Отправка сообщения";
		
		спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(Идентификатор, СостояниеСообщения, , , , , Перечисления.спТипыИнтеграции.Исходящая);
		
		Если СпособПередачи = Перечисления.спСпособПередачи.FTP Тогда
			ПрочтенноеСообщение = спСервисИнтеграцииВызовСервера.ПолучитьДанныеФайла(ОбъектСобытия, Идентификатор, ДатаРегистрации, ФорматСообщения, ТипОбъекта, 
																						СпособПередачи, Перечисления.спТипыОчередей.Отправки);
		ИначеЕсли СпособПередачи = Перечисления.спСпособПередачи.SOAP Тогда
			ПрочтенноеСообщение = Новый Структура;
			ПрочтенноеСообщение.Вставить("Сообщение", ОбъектСобытия);
		КонецЕсли;																			
		ЗаписатьВОчередьИсходящих(Идентификатор, ОбъектСобытия); 
		
	Исключение
		
		Пока ТранзакцияАктивна() Цикл
			ОтменитьТранзакцию();
		КонецЦикла;   
		
		СостояниеСообщения = Перечисления.спСтатусыСообщений.ОшибкаОбработки;
		
		ТекстОшибки = спОбщегоНазначенияВызовСервера.ПолучитьТекстОшибкиОбработчика(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(текЗаголовокЖурнала, УровеньЖурналаРегистрации.Ошибка, , Идентификатор, ТекстОшибки);  
		
		СткОбработчик = "";
		ТекстОшибки = спОбщегоНазначенияВызовСервера.ДополнитьТекстОшибки(ТекстОшибки, СткОбработчик, СсылкаНаОбъект);
		спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(Идентификатор, СостояниеСообщения, Задержка, ТекстОшибки, , , Перечисления.спТипыИнтеграции.Исходящая);
			
	КонецПопытки;
	
	Возврат ПрочтенноеСообщение;
КонецФункции


// Процедура - Отправить исходящее сообщение 
//
// Параметры:
//  Идентификатор - УникальныйИдентификатор - Идентификатор сообщения
//  ФорматСообщения - ПеречислениеСсылка.спФорматыСообщений - Формат отправляемого сообщения
//	ТипОбъекта - Строка - Строковое представление имени метаданных объекта
//  МетодХранения - ПеречислениеСсылка.спМетодХранения - Метод хранения сообщения
//  ДатаРегистрации - Дата - Дата регистрации сообщения
//	ЭтоУдаление - Булево - Обозначение удаления
//	СсылкаНаОбъект - ЛюбаяСсылка - Ссылка на объект исходящего сообщения
//  ТочкаОбмена - Неопределено - Точка обмена
//
Функция СформироватьИсходящееСообщениеСКлиентаИзМассиваДанных(ПакетДанных) 
	Перем ПрочтенноеСообщение; 
	ДанныеДляФайла = Новый Массив;
	Для каждого Данные Из ПакетДанных Цикл
		
		Идентификатор = Данные.ТекИдентификатор; 
		ФорматСообщения = Данные.ФорматСообщения; 
		ТипОбъекта = Данные.ОбъектСобытия; 
		МетодХранения = Данные.МетодХранения; 
		ДатаРегистрации = Данные.ДатаРегистрации; 
		ЭтоУдаление = Данные.ЭтоУдаление;
		СсылкаНаОбъект = Данные.СсылкаНаОбъект; 
		СпособПередачи = Данные.СпособПередачи; 
		Сообщение = Данные.Хранилище.Получить();

		ТочкаОбмена = Неопределено;
		
		Задержка = 0;
		ТекЗаголовокЖурнала = "Получение объекта события";
		ТекстОшибки = "";
		
		ТекЗаголовокЖурнала = "Формирование сообщения";
		
		Попытка
			
			СостояниеСообщения = Перечисления.спСтатусыСообщений.ОжиданиеОбработки;
			
			спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(Идентификатор, СостояниеСообщения, , , , , Перечисления.спТипыИнтеграции.Исходящая);
			
			ПрочтенныеДанныеФайлаXML = спСервисИнтеграцииВызовСервера.ПолучитьДанныеФайлаXML(Сообщение, Идентификатор, ДатаРегистрации, ФорматСообщения, ТипОбъекта, 
			СпособПередачи, Перечисления.спТипыОчередей.Отправки);
			
			Если ТипЗнч(ПрочтенныеДанныеФайлаXML) = Тип("Структура") Тогда
				ДанныеДляФайла.Добавить(ПрочтенныеДанныеФайлаXML);
				ЗаписатьВОчередьИсходящих(Идентификатор, Сообщение); 
			КонецЕсли;
				
		Исключение
			
			Пока ТранзакцияАктивна() Цикл
				ОтменитьТранзакцию();
			КонецЦикла;   
			
			СостояниеСообщения = Перечисления.спСтатусыСообщений.ОшибкаОбработки;
			
			ТекстОшибки = спОбщегоНазначенияВызовСервера.ПолучитьТекстОшибкиОбработчика(ИнформацияОбОшибке());
			ЗаписьЖурналаРегистрации(текЗаголовокЖурнала, УровеньЖурналаРегистрации.Ошибка, , Идентификатор, ТекстОшибки);  
			
			СткОбработчик = "";
			ТекстОшибки = спОбщегоНазначенияВызовСервера.ДополнитьТекстОшибки(ТекстОшибки, СткОбработчик, СсылкаНаОбъект);
			спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(Идентификатор, СостояниеСообщения, Задержка, ТекстОшибки, , , Перечисления.спТипыИнтеграции.Исходящая);
			
		КонецПопытки;
	КонецЦикла; 
	
	Если ДанныеДляФайла.Количество() > 0 Тогда 
		 ПрочтенноеСообщение = спСервисИнтеграцииВызовСервера.ЧтениеИЗаписьXMLИзПодготовленныхДанных(ДанныеДляФайла);
	КонецЕсли;

	Возврат ПрочтенноеСообщение;
КонецФункции
 
// Процедура - Обработка очереди исходящих сообщений
Функция ПолучитьДанныеИсходящихСообщенийПоСсылкеИСтатусу(СсылкиНаОбъект, Статусы) Экспорт 
	ПакетДанных = Новый Массив;
	
	Если ТипЗнч(СсылкиНаОбъект) <> Тип("Массив") И СсылкиНаОбъект.Количество = 0 Тогда  
		Возврат ПакетДанных;
	КонецЕсли;    
	
	Запрос = Новый Запрос;	
	Запрос.Текст = 
				"ВЫБРАТЬ
				|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия,
				|	тбОчередь.ДатаРегистрации КАК ДатаРегистрации,
				|	тбОчередь.ФорматСообщения КАК ФорматСообщения,
				|	тбОчередь.МетодХранения КАК МетодХранения,
				|	тбОчередь.ЭтоУдаление КАК ЭтоУдаление,
				|	тбОчередь.ОбъектСобытия КАК ОбъектСобытия,
				|	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
				|	тбОчередь.СпособПередачи КАК СпособПередачи,
				|	тбОчередь.Хранилище КАК Хранилище
				|ИЗ
				|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
				|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
				|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
				|			И (тбСостояние.СтатусСообщения В (&СписокСтатусов))
				|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
				|			И (тбОчередь.СсылкаНаОбъект В (&СсылкиНаОбъект))
				|
				|УПОРЯДОЧИТЬ ПО
				|	тбСостояние.ДатаИзменения";
	
	Запрос.УстановитьПараметр("СписокСтатусов", Статусы); 
	Запрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса()));  
	Запрос.УстановитьПараметр("СсылкиНаОбъект", СсылкиНаОбъект);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		ТекИдентификатор = "Идентификатор не определен";
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл					
			Данные = Новый Структура;
			Данные.Вставить("Идентификатор", 	Выборка.ИдентификаторСобытия); 
			Данные.Вставить("ФорматСообщения", 	Выборка.ФорматСообщения);
			Данные.Вставить("ОбъектСобытия", 	Выборка.ОбъектСобытия);
			Данные.Вставить("МетодХранения", 	Выборка.МетодХранения);
			Данные.Вставить("ДатаРегистрации", 	Выборка.ДатаРегистрации);
			Данные.Вставить("ЭтоУдаление", 		Выборка.ЭтоУдаление);
			Данные.Вставить("СсылкаНаОбъект", 	Выборка.СсылкаНаОбъект);
			Данные.Вставить("СпособПередачи", 	Выборка.СпособПередачи);
			Данные.Вставить("Хранилище", 		Выборка.Хранилище);
			ПакетДанных.Добавить(Данные);
		КонецЦикла;  
		
	КонецЕсли;	
	
	Возврат ПакетДанных;	
КонецФункции 

// Процедура - Обработка очереди исходящих сообщений
Функция ОбработкаИсходящихСообщения(СообщенияДляОтправки) Экспорт 
		
	ИсходящееСообщение = Новый Структура("ДвоичныеДанные, Префикс, Идентификатор");
	ТочкаОбмена = Неопределено;

	Если ТипЗнч(СообщенияДляОтправки) <> Тип("Массив") И СообщенияДляОтправки.Количество = 0 Тогда  
		Возврат ИсходящееСообщение;
	КонецЕсли;    
	
	Если ПолучитьФункциональнуюОпцию("спОтключитьПотоки") Тогда	
		Возврат ИсходящееСообщение;		
	КонецЕсли;
			
		ТекИдентификатор = "Идентификатор не определен";
		
		Попытка
			
			ПакетДанных = Новый Массив;
			
			 Для каждого Выборка Из СообщенияДляОтправки Цикл
				
				ТекИдентификатор = Выборка.ИдентификаторСобытия;
				спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(ТекИдентификатор, Перечисления.спСтатусыСообщений.ВОбработке, , , , , Перечисления.спТипыИнтеграции.Исходящая);
				
				Данные = Новый Структура;
				Данные.Вставить("ТекИдентификатор", ТекИдентификатор); 
				Данные.Вставить("ФорматСообщения", 	Выборка.ФорматСообщения);
				Данные.Вставить("ОбъектСобытия", 	Выборка.ОбъектСобытия);
				Данные.Вставить("МетодХранения", 	Выборка.МетодХранения);
				Данные.Вставить("ДатаРегистрации", 	Выборка.ДатаРегистрации);
				Данные.Вставить("ЭтоУдаление", 		Ложь);
				Данные.Вставить("СсылкаНаОбъект", 	Выборка.СсылкаНаОбъект);
				Данные.Вставить("СпособПередачи", 	Выборка.СпособПередачи);
				Данные.Вставить("ТочкаОбмена", 		ТочкаОбмена);
				Данные.Вставить("Хранилище", 		Выборка.Хранилище);
				ПакетДанных.Добавить(Данные);
			КонецЦикла;  
			
			Попытка 
			    			
				Если ПакетДанных.Количество() = 0 Тогда 
					Возврат ИсходящееСообщение;
				КонецЕсли;
				
				ПрочтенноеСообщение = СформироватьИсходящееСообщениеСКлиентаИзМассиваДанных(ПакетДанных);
				
				Если ТипЗнч(ПрочтенноеСообщение) = Тип("Структура") Тогда
					Значение = Неопределено;
					Если ПрочтенноеСообщение.Свойство("ДвоичныеДанные", Значение) Тогда 
						ИсходящееСообщение.Вставить("ДвоичныеДанные", Значение); 
					КонецЕсли; 
					Значение = Неопределено;
					Если ПрочтенноеСообщение.Свойство("Префикс", Значение) Тогда 
						ИсходящееСообщение.Вставить("Префикс", Значение);
					КонецЕсли;
				КонецЕсли;
				ИсходящееСообщение.Вставить("Идентификатор", ТекИдентификатор);
				
			Исключение
				
				// Запускаем фоновое задание со статическим ключем. Запуск других экземпляров должен заканчиваться ошибкой (паттерн синглтон).
				ИнформацияОбОшибке = ИнформацияОбОшибке();
				ЗаписьЖурналаРегистрации("Сформировать исходящее сообщение", УровеньЖурналаРегистрации.Ошибка
				, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)); 
				
			КонецПопытки 
			
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Обработка очереди исходящих сообщений", УровеньЖурналаРегистрации.Ошибка
										, , ТекИдентификатор, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));

		КонецПопытки;
	
	Возврат ИсходящееСообщение;	
КонецФункции 

// Процедура - Обработка очереди исходящих сообщений
Функция ОбработкаОчередиИсходящегоСообщенияПоСсылке(СсылкаНаОбъект) Экспорт 
	ИсходящееСообщение = Новый Структура("ДвоичныеДанные, Префикс, Идентификатор");
	ТочкаОбмена = Неопределено;
	
	Если ПолучитьФункциональнуюОпцию("спОтключитьПотоки") Тогда	
		Возврат ИсходящееСообщение;		
	КонецЕсли;
		
		ТекИдентификатор = "Идентификатор не определен";
		
		Попытка
				
				ТекИдентификатор = СсылкаНаОбъект.ИдентификаторСобытия;
				спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(ТекИдентификатор, Перечисления.спСтатусыСообщений.ВОбработке, , , , , Перечисления.спТипыИнтеграции.Исходящая);
				
				Данные = Новый Структура;
				Данные.Вставить("ТекИдентификатор", ТекИдентификатор); 
				Данные.Вставить("ФорматСообщения", 	СсылкаНаОбъект.ФорматСообщения);
				Данные.Вставить("ОбъектСобытия", 	СсылкаНаОбъект.ОбъектСобытия);
				Данные.Вставить("МетодХранения", 	СсылкаНаОбъект.МетодХранения);
				Данные.Вставить("ДатаРегистрации", 	СсылкаНаОбъект.ДатаРегистрации);
				Данные.Вставить("ЭтоУдаление", 		Ложь);
				Данные.Вставить("СсылкаНаОбъект", 	СсылкаНаОбъект.СсылкаНаОбъект);
				Данные.Вставить("СпособПередачи", 	СсылкаНаОбъект.СпособПередачи);
				Данные.Вставить("ТочкаОбмена", 		ТочкаОбмена);
				
				Попытка
					ПрочтенноеСообщение = СформироватьИсходящееСообщениеСКлиента(Данные);
					Если ТипЗнч(ПрочтенноеСообщение) = Тип("Структура") Тогда
						Значение = Неопределено;
						Если ПрочтенноеСообщение.Свойство("ДвоичныеДанные", Значение) Тогда 
							ИсходящееСообщение.Вставить("ДвоичныеДанные", Значение); 
						КонецЕсли; 
						Значение = Неопределено;
						Если ПрочтенноеСообщение.Свойство("Префикс", Значение) Тогда 
							ИсходящееСообщение.Вставить("Префикс", Значение);
						КонецЕсли;
					КонецЕсли;
					ИсходящееСообщение.Вставить("Идентификатор", ТекИдентификатор);
					
				Исключение
					
					// Запускаем фоновое задание со статическим ключем. Запуск других экземпляров должен заканчиваться ошибкой (паттерн синглтон).
					ИнформацияОбОшибке = ИнформацияОбОшибке();
					ЗаписьЖурналаРегистрации("Сформировать исходящее сообщение", УровеньЖурналаРегистрации.Ошибка
												, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке)); 

				КонецПопытки            			
		Исключение
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Обработка очереди исходящих сообщений", УровеньЖурналаРегистрации.Ошибка
										, , ТекИдентификатор, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));

		КонецПопытки;

	
	Возврат ИсходящееСообщение;	
КонецФункции

#КонецОбласти