
#Область ПрограммныйИнтерфейс

// Обработчик регламентного задания "Автоподсорт товаров в торговый зал (Tnext)"
//
Процедура спАвтоподсортТоваровВТорговыйЗал() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.спАвтоподсортТоваровВТорговыйЗал);
		
	Автор = Пользователи.ТекущийПользователь();
	ДатаОбработки = ТекущаяДатаСеанса();
	Комментарий = СтрШаблон(НСтр("ru = 'Автоподсорт %1'"), ДатаОбработки);
	ИнтервалАвтоподсорта 	= спУправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("спИнтервалАвтоподсорта");
	
	Если ИнтервалАвтоподсорта = 0 Тогда
		Возврат;
	Иначе
		НачалоПериода = ДатаОбработки - ИнтервалАвтоподсорта * 60;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	#Область ТекстЗапроса
		"ВЫБРАТЬ
		|	спНастройкиАвтоподсортаТоваров.Склад КАК СкладМагазина,
		|	спНастройкиАвтоподсортаТоваров.ГруппаНоменклатуры КАК ГруппаНоменклатуры,
		|	спНастройкиАвтоподсортаТоваров.Порядок КАК Порядок,
		|	спНастройкиАвтоподсортаТоваров.ИмяРеквизита КАК ИмяРеквизита,
		|	спНастройкиАвтоподсортаТоваров.ВидСравнения КАК ВидСравнения
		|ПОМЕСТИТЬ ВТ_НастройкиАвтоподсорта
		|ИЗ
		|	РегистрСведений.спНастройкиАвтоподсортаТоваров КАК спНастройкиАвтоподсортаТоваров
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТорговыеЗалы.Ссылка КАК ТорговыйЗал,
		|	ТорговыеЗалы.Родитель КАК ГруппаСкладов,
		|	ЕСТЬNULL(СкладыМагазинов.Ссылка, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК СкладМагазина,
		|	&Организация КАК Организация
		|ПОМЕСТИТЬ ВТ_ГруппыСкладовМагазинов
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК ТорговыеЗалы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СкладыМагазинов
		|		ПО ТорговыеЗалы.Родитель = СкладыМагазинов.Родитель
		|ГДЕ
		|	ТорговыеЗалы.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
		|	И СкладыМагазинов.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|	И СкладыМагазинов.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТ_НастройкиАвтоподсорта.СкладМагазина КАК СкладМагазина
		|			ИЗ
		|				ВТ_НастройкиАвтоподсорта КАК ВТ_НастройкиАвтоподсорта
		|			СГРУППИРОВАТЬ ПО
		|				ВТ_НастройкиАвтоподсорта.СкладМагазина)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыНаСкладахОстатки.Организация КАК Организация,
		|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница.Родитель КАК ГруппаСкладов,
		|	ЗапасыНаСкладахОстатки.Номенклатура.Артикул КАК Артикул,
		|	ЗапасыНаСкладахОстатки.Номенклатура.спАртикулПоставщика КАК АртикулПоставщика,
		|	ЗапасыНаСкладахОстатки.Номенклатура.спРазмер.Наименование КАК Размер,
		|	ЗапасыНаСкладахОстатки.Номенклатура.спЦвет КАК Цвет,
		|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница КАК СкладМагазина,
		|	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ЗапасыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	СУММА(ЗапасыНаСкладахОстатки.КоличествоОстаток) КАК КоличествоОстаток,
		|	ЗапасыНаСкладахОстатки.Номенклатура.спРазмер.Рост КАК Рост,
		|	ЗапасыНаСкладахОстатки.Номенклатура.спРазмер.Сантиметры КАК Сантиметры
		|ПОМЕСТИТЬ ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
		|			&КонецПериода,
		|			(Организация, СтруктурнаяЕдиница) В
		|				(ВЫБРАТЬ
		|					ВТ_ГруппыСкладовМагазинов.Организация КАК Организация,
		|					ВТ_ГруппыСкладовМагазинов.СкладМагазина КАК СкладМагазина
		|				ИЗ
		|					ВТ_ГруппыСкладовМагазинов КАК ВТ_ГруппыСкладовМагазинов
		|			
		|				ОБЪЕДИНИТЬ ВСЕ
		|			
		|				ВЫБРАТЬ
		|					ВТ_ГруппыСкладовМагазинов.Организация,
		|					ВТ_ГруппыСкладовМагазинов.ТорговыйЗал
		|				ИЗ
		|					ВТ_ГруппыСкладовМагазинов КАК ВТ_ГруппыСкладовМагазинов)) КАК ЗапасыНаСкладахОстатки
		|ГДЕ
		|	ЗапасыНаСкладахОстатки.КоличествоОстаток > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыНаСкладахОстатки.Организация,
		|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница,
		|	ЗапасыНаСкладахОстатки.Номенклатура,
		|	ЗапасыНаСкладахОстатки.Характеристика,
		|	ЗапасыНаСкладахОстатки.Номенклатура.спРазмер.Наименование,
		|	ЗапасыНаСкладахОстатки.Номенклатура.спЦвет,
		|	ЗапасыНаСкладахОстатки.Номенклатура.Артикул,
		|	ЗапасыНаСкладахОстатки.Номенклатура.спАртикулПоставщика,
		|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница.Родитель,
		|	ЗапасыНаСкладахОстатки.Номенклатура.спРазмер.Рост,
		|	ЗапасыНаСкладахОстатки.Номенклатура.спРазмер.Сантиметры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.Организация КАК Организация,
		|	ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.ГруппаСкладов КАК ГруппаСкладов,
		|	ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.Артикул КАК Артикул,
		|	ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.АртикулПоставщика КАК АртикулПоставщика,
		|	ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.Размер КАК Размер,
		|	ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.Цвет КАК Цвет,
		|	ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.СкладМагазина КАК СкладМагазина,
		|	ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.Номенклатура КАК Номенклатура,
		|	ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.Характеристика КАК Характеристика,
		|	ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.КоличествоОстаток КАК КоличествоОстаток,
		|	ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.Рост КАК Рост,
		|	ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.Сантиметры КАК Сантиметры
		|ПОМЕСТИТЬ ВТ_ОстаткиНаСкладахМагазинов
		|ИЗ
		|	ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах КАК ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах
		|ГДЕ
		|	ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.СкладМагазина В
		|			(ВЫБРАТЬ
		|				ВТ_ГруппыСкладовМагазинов.СкладМагазина КАК СкладМагазина
		|			ИЗ
		|				ВТ_ГруппыСкладовМагазинов КАК ВТ_ГруппыСкладовМагазинов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыНаСкладахОбороты.Организация КАК Организация,
		|	ЗапасыНаСкладахОбороты.СтруктурнаяЕдиница.Родитель КАК ГруппаСкладов,
		|	ЗапасыНаСкладахОбороты.Номенклатура.Артикул КАК Артикул,
		|	ЗапасыНаСкладахОбороты.Номенклатура.спАртикулПоставщика КАК АртикулПоставщика,
		|	ЗапасыНаСкладахОбороты.Номенклатура.спРазмер.Наименование КАК Размер,
		|	ЗапасыНаСкладахОбороты.Номенклатура.спЦвет КАК Цвет,
		|	ЗапасыНаСкладахОбороты.СтруктурнаяЕдиница КАК ТорговыйЗал,
		|	ЗапасыНаСкладахОбороты.Номенклатура КАК Номенклатура,
		|	ЗапасыНаСкладахОбороты.Характеристика КАК Характеристика,
		|	СУММА(ЗапасыНаСкладахОбороты.КоличествоРасход) КАК КоличествоРасход,
		|	ЗапасыНаСкладахОбороты.Номенклатура.спРазмер.Рост КАК Рост,
		|	ЗапасыНаСкладахОбороты.Номенклатура.спРазмер.Сантиметры КАК Сантиметры
		|ПОМЕСТИТЬ ВТ_РасходыТовара
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Обороты(
		|			&НачалоПериода,
		|			&КонецПериода,
		|			Регистратор,
		|			(Организация, СтруктурнаяЕдиница) В
		|				(ВЫБРАТЬ
		|					ВТ_ГруппыСкладовМагазинов.Организация КАК Организация,
		|					ВТ_ГруппыСкладовМагазинов.ТорговыйЗал КАК ТорговыйЗал
		|				ИЗ
		|					ВТ_ГруппыСкладовМагазинов КАК ВТ_ГруппыСкладовМагазинов)) КАК ЗапасыНаСкладахОбороты
		|ГДЕ
		|	ЗапасыНаСкладахОбороты.КоличествоРасход > 0
		|	И НЕ ЗапасыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ПеремещениеЗапасов
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыНаСкладахОбороты.Организация,
		|	ЗапасыНаСкладахОбороты.СтруктурнаяЕдиница,
		|	ЗапасыНаСкладахОбороты.Номенклатура,
		|	ЗапасыНаСкладахОбороты.Характеристика,
		|	ЗапасыНаСкладахОбороты.Номенклатура.спРазмер.Наименование,
		|	ЗапасыНаСкладахОбороты.Номенклатура.спЦвет,
		|	ЗапасыНаСкладахОбороты.Номенклатура.Артикул,
		|	ЗапасыНаСкладахОбороты.Номенклатура.спАртикулПоставщика,
		|	ЗапасыНаСкладахОбороты.СтруктурнаяЕдиница.Родитель,
		|	ЗапасыНаСкладахОбороты.Номенклатура.спРазмер.Рост,
		|	ЗапасыНаСкладахОбороты.Номенклатура.спРазмер.Сантиметры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_РасходыТовара.Организация КАК Организация,
		|	ВТ_РасходыТовара.ГруппаСкладов КАК ГруппаСкладов,
		|	ВТ_РасходыТовара.Артикул КАК Артикул,
		|	ВТ_РасходыТовара.АртикулПоставщика КАК АртикулПоставщика,
		|	ВТ_РасходыТовара.Размер КАК Размер,
		|	ВТ_РасходыТовара.Цвет КАК Цвет,
		|	ВТ_РасходыТовара.ТорговыйЗал КАК ТорговыйЗал,
		|	ВТ_РасходыТовара.Номенклатура КАК Номенклатура,
		|	ВТ_РасходыТовара.Характеристика КАК Характеристика,
		|	ВТ_РасходыТовара.КоличествоРасход КАК КоличествоРасход,
		|	ВТ_РасходыТовара.Рост КАК Рост,
		|	ВТ_РасходыТовара.Сантиметры КАК Сантиметры
		|ПОМЕСТИТЬ ВТ_ПотребностьТовара
		|ИЗ
		|	ВТ_РасходыТовара КАК ВТ_РасходыТовара
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах КАК ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах
		|		ПО ВТ_РасходыТовара.Организация = ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.Организация
		|			И ВТ_РасходыТовара.ГруппаСкладов = ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.ГруппаСкладов
		|			И ВТ_РасходыТовара.Артикул = ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.Артикул
		|			И (ВТ_РасходыТовара.КоличествоРасход - ЕСТЬNULL(ВТ_ОстаткиНаСкладахМагазиновИТорговыхЗалах.КоличествоОстаток, 0) > 0)
		|ГДЕ
		|	ВТ_РасходыТовара.КоличествоРасход > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПотребностьТовара.Организация КАК Организация,
		|	ВТ_ПотребностьТовара.ТорговыйЗал КАК СтруктурнаяЕдиницаПолучатель,
		|	ВТ_ПотребностьТовара.Номенклатура КАК НоменклатураДляЗамены,
		|	ВТ_ПотребностьТовара.Характеристика КАК ХарактеристикаДляЗамены,
		|	ВТ_ПотребностьТовара.КоличествоРасход КАК КоличествоРасход,
		|	ЕСТЬNULL(ВТ_ОстаткиНаСкладахМагазинов.СкладМагазина, ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)) КАК СтруктурнаяЕдиницаРезерв,
		|	ЕСТЬNULL(ВТ_ОстаткиНаСкладахМагазинов.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
		|	ЕСТЬNULL(ВТ_ОстаткиНаСкладахМагазинов.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК Характеристика,
		|	ЕСТЬNULL(ВТ_ОстаткиНаСкладахМагазинов.КоличествоОстаток, 0) КАК ОстатокНаСкладе,
		|	ВТ_НастройкиАвтоподсорта.Порядок КАК ПриоритетПоиска
		|ПОМЕСТИТЬ ВТ_ПодобранныеТовары
		|ИЗ
		|	ВТ_ОстаткиНаСкладахМагазинов КАК ВТ_ОстаткиНаСкладахМагазинов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НастройкиАвтоподсорта КАК ВТ_НастройкиАвтоподсорта
		|		ПО ВТ_ОстаткиНаСкладахМагазинов.СкладМагазина = ВТ_НастройкиАвтоподсорта.СкладМагазина
		|		ПРАВОЕ СОЕДИНЕНИЕ ВТ_ПотребностьТовара КАК ВТ_ПотребностьТовара
		|		ПО (ВТ_ПотребностьТовара.Организация = ВТ_ОстаткиНаСкладахМагазинов.Организация)
		|			И (ВТ_ПотребностьТовара.ГруппаСкладов = ВТ_ОстаткиНаСкладахМагазинов.ГруппаСкладов)
		|			И (ВЫБОР
		|				КОГДА ВТ_НастройкиАвтоподсорта.ИмяРеквизита = ""Артикул""
		|					ТОГДА ВТ_ПотребностьТовара.Артикул = ВТ_ОстаткиНаСкладахМагазинов.Артикул
		|				ИНАЧЕ ВТ_ПотребностьТовара.АртикулПоставщика = ВТ_ОстаткиНаСкладахМагазинов.АртикулПоставщика
		|						И ВТ_ПотребностьТовара.Цвет = ВТ_ОстаткиНаСкладахМагазинов.Цвет
		|						И ВЫБОР
		|							КОГДА ВТ_НастройкиАвтоподсорта.ИмяРеквизита = ""Размер""
		|								ТОГДА ВЫБОР
		|										КОГДА НЕ(ВТ_НастройкиАвтоподсорта.ГруппаНоменклатуры <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|													И ВТ_ПотребностьТовара.Номенклатура.Родитель <> ВТ_НастройкиАвтоподсорта.ГруппаНоменклатуры
		|													И ВТ_ПотребностьТовара.Номенклатура.Родитель.Родитель <> ВТ_НастройкиАвтоподсорта.ГруппаНоменклатуры
		|													И ВТ_ПотребностьТовара.Номенклатура.Родитель.Родитель.Родитель <> ВТ_НастройкиАвтоподсорта.ГруппаНоменклатуры
		|													И ВТ_ПотребностьТовара.Номенклатура.Родитель.Родитель.Родитель.Родитель <> ВТ_НастройкиАвтоподсорта.ГруппаНоменклатуры)
		|											ТОГДА ВЫБОР
		|													КОГДА ВТ_ПотребностьТовара.Рост <> 0
		|														ТОГДА ВЫБОР
		|																КОГДА ВТ_НастройкиАвтоподсорта.ВидСравнения = ""<""
		|																	ТОГДА ВТ_ПотребностьТовара.Рост > ВТ_ОстаткиНаСкладахМагазинов.Рост
		|																КОГДА ВТ_НастройкиАвтоподсорта.ВидСравнения = "">""
		|																	ТОГДА ВТ_ПотребностьТовара.Рост < ВТ_ОстаткиНаСкладахМагазинов.Рост
		|																КОГДА ВТ_НастройкиАвтоподсорта.ВидСравнения = ""=""
		|																	ТОГДА ВТ_ПотребностьТовара.Рост = ВТ_ОстаткиНаСкладахМагазинов.Рост
		|															КОНЕЦ
		|													КОГДА ВТ_ПотребностьТовара.Сантиметры <> 0
		|														ТОГДА ВЫБОР
		|																КОГДА ВТ_НастройкиАвтоподсорта.ВидСравнения = ""<""
		|																	ТОГДА ВТ_ПотребностьТовара.Сантиметры > ВТ_ОстаткиНаСкладахМагазинов.Сантиметры
		|																КОГДА ВТ_НастройкиАвтоподсорта.ВидСравнения = "">""
		|																	ТОГДА ВТ_ПотребностьТовара.Сантиметры < ВТ_ОстаткиНаСкладахМагазинов.Сантиметры
		|																КОГДА ВТ_НастройкиАвтоподсорта.ВидСравнения = ""=""
		|																	ТОГДА ВТ_ПотребностьТовара.Сантиметры = ВТ_ОстаткиНаСкладахМагазинов.Сантиметры
		|															КОНЕЦ
		|													ИНАЧЕ ВТ_ПотребностьТовара.Размер = ВТ_ОстаткиНаСкладахМагазинов.Размер
		|												КОНЕЦ
		|										ИНАЧЕ ЛОЖЬ
		|									КОНЕЦ
		|							ИНАЧЕ ЛОЖЬ
		|						КОНЕЦ
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПодобранныеТовары.Организация КАК Организация,
		|	ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
		|	ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
		|	АВТОНОМЕРЗАПИСИ() КАК ГруппировкаДокумент
		|ПОМЕСТИТЬ ВТ_ГруппировкаДокумент
		|ИЗ
		|	ВТ_ПодобранныеТовары КАК ВТ_ПодобранныеТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаРезерв,
		|	ВТ_ПодобранныеТовары.Организация,
		|	ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаПолучатель
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПодобранныеТовары.Организация КАК Организация,
		|	ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
		|	ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
		|	ВТ_ПодобранныеТовары.НоменклатураДляЗамены КАК НоменклатураДляЗамены,
		|	ВТ_ПодобранныеТовары.ХарактеристикаДляЗамены КАК ХарактеристикаДляЗамены,
		|	АВТОНОМЕРЗАПИСИ() КАК ГруппировкаТовар
		|ПОМЕСТИТЬ ВТ_ГруппировкаТовар
		|ИЗ
		|	ВТ_ПодобранныеТовары КАК ВТ_ПодобранныеТовары
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаРезерв,
		|	ВТ_ПодобранныеТовары.Организация,
		|	ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаПолучатель,
		|	ВТ_ПодобранныеТовары.НоменклатураДляЗамены,
		|	ВТ_ПодобранныеТовары.ХарактеристикаДляЗамены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ПодобранныеТовары.Организация КАК Организация,
		|	ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
		|	ВТ_ПодобранныеТовары.НоменклатураДляЗамены КАК НоменклатураДляЗамены,
		|	ВТ_ПодобранныеТовары.ХарактеристикаДляЗамены КАК ХарактеристикаДляЗамены,
		|	ВТ_ПодобранныеТовары.КоличествоРасход КАК КоличествоРасход,
		|	ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
		|	ВТ_ПодобранныеТовары.Номенклатура КАК Номенклатура,
		|	ВТ_ПодобранныеТовары.Характеристика КАК Характеристика,
		|	СУММА(ВТ_ПодобранныеТовары.ОстатокНаСкладе) КАК ОстатокНаСкладе,
		|	ВТ_ПодобранныеТовары.ПриоритетПоиска КАК ПриоритетПоиска,
		|	ВТ_ГруппировкаДокумент.ГруппировкаДокумент КАК ГруппировкаДокумент,
		|	ВТ_ГруппировкаТовар.ГруппировкаТовар КАК ГруппировкаТовар,
		|	ВТ_ПодобранныеТовары.Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТ_Результат
		|ИЗ
		|	ВТ_ПодобранныеТовары КАК ВТ_ПодобранныеТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГруппировкаДокумент КАК ВТ_ГруппировкаДокумент
		|		ПО ВТ_ПодобранныеТовары.Организация = ВТ_ГруппировкаДокумент.Организация
		|			И ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаПолучатель = ВТ_ГруппировкаДокумент.СтруктурнаяЕдиницаПолучатель
		|			И ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаРезерв = ВТ_ГруппировкаДокумент.СтруктурнаяЕдиницаРезерв
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ГруппировкаТовар КАК ВТ_ГруппировкаТовар
		|		ПО ВТ_ПодобранныеТовары.Организация = ВТ_ГруппировкаТовар.Организация
		|			И ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаПолучатель = ВТ_ГруппировкаТовар.СтруктурнаяЕдиницаПолучатель
		|			И ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаРезерв = ВТ_ГруппировкаТовар.СтруктурнаяЕдиницаРезерв
		|			И ВТ_ПодобранныеТовары.НоменклатураДляЗамены = ВТ_ГруппировкаТовар.НоменклатураДляЗамены
		|			И ВТ_ПодобранныеТовары.ХарактеристикаДляЗамены = ВТ_ГруппировкаТовар.ХарактеристикаДляЗамены
		|ГДЕ
		|	ВТ_ПодобранныеТовары.ОстатокНаСкладе > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ПодобранныеТовары.Организация,
		|	ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаПолучатель,
		|	ВТ_ПодобранныеТовары.НоменклатураДляЗамены,
		|	ВТ_ПодобранныеТовары.ХарактеристикаДляЗамены,
		|	ВТ_ПодобранныеТовары.КоличествоРасход,
		|	ВТ_ПодобранныеТовары.СтруктурнаяЕдиницаРезерв,
		|	ВТ_ПодобранныеТовары.Номенклатура,
		|	ВТ_ПодобранныеТовары.Характеристика,
		|	ВТ_ПодобранныеТовары.ПриоритетПоиска,
		|	ВТ_ГруппировкаДокумент.ГруппировкаДокумент,
		|	ВТ_ГруппировкаТовар.ГруппировкаТовар,
		|	ВТ_ПодобранныеТовары.Номенклатура.ЕдиницаИзмерения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Результат.Организация КАК Организация,
		|	ВТ_Результат.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
		|	ВТ_Результат.НоменклатураДляЗамены КАК НоменклатураДляЗамены,
		|	ВТ_Результат.ХарактеристикаДляЗамены КАК ХарактеристикаДляЗамены,
		|	ВТ_Результат.КоличествоРасход КАК КоличествоРасход,
		|	ВТ_Результат.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
		|	ВТ_Результат.Номенклатура КАК Номенклатура,
		|	ВТ_Результат.Характеристика КАК Характеристика,
		|	ВТ_Результат.ОстатокНаСкладе КАК ОстатокНаСкладе,
		|	МИНИМУМ(ВТ_Результат.ПриоритетПоиска) КАК ПриоритетПоиска,
		|	ВТ_Результат.ГруппировкаДокумент КАК ГруппировкаДокумент,
		|	ВТ_Результат.ГруппировкаТовар КАК ГруппировкаТовар,
		|	ВТ_Результат.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	ВТ_Результат КАК ВТ_Результат
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Результат.Номенклатура,
		|	ВТ_Результат.Организация,
		|	ВТ_Результат.Характеристика,
		|	ВТ_Результат.ХарактеристикаДляЗамены,
		|	ВТ_Результат.СтруктурнаяЕдиницаПолучатель,
		|	ВТ_Результат.СтруктурнаяЕдиницаРезерв,
		|	ВТ_Результат.ЕдиницаИзмерения,
		|	ВТ_Результат.НоменклатураДляЗамены,
		|	ВТ_Результат.КоличествоРасход,
		|	ВТ_Результат.ОстатокНаСкладе,
		|	ВТ_Результат.ГруппировкаДокумент,
		|	ВТ_Результат.ГруппировкаТовар
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация,
		|	СтруктурнаяЕдиницаПолучатель,
		|	ПриоритетПоиска
		|ИТОГИ
		|	МАКСИМУМ(Организация),
		|	МАКСИМУМ(СтруктурнаяЕдиницаПолучатель),
		|	МАКСИМУМ(НоменклатураДляЗамены),
		|	МАКСИМУМ(ХарактеристикаДляЗамены),
		|	МАКСИМУМ(КоличествоРасход),
		|	МАКСИМУМ(СтруктурнаяЕдиницаРезерв)
		|ПО
		|	ГруппировкаДокумент,
		|	ГруппировкаТовар";
	#КонецОбласти

	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", ДатаОбработки);
	Запрос.УстановитьПараметр("Организация", Справочники.Организации.ОрганизацияПоУмолчанию());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокумент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокумент.Следующий() Цикл
		
		Заказ = Документы.ЗаказНаПеремещение.СоздатьДокумент();
		Заказ.Заполнить(Неопределено);
		ЗаполнитьЗначенияСвойств(Заказ, ВыборкаДокумент);  
		Заказ.Дата = ДатаОбработки;
		Заказ.ДатаПеремещения = ДатаОбработки;
		Заказ.Автор = Автор;
		Заказ.Комментарий = Комментарий;
		Заказ.Ответственный = Неопределено;
		
		ВыборкаТовар = ВыборкаДокумент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаТовар.Следующий() Цикл
			
			КРаспределению = ВыборкаТовар.КоличествоРасход;
		
			ВыборкаПодобранныеТовары = ВыборкаТовар.Выбрать();
			Пока ВыборкаПодобранныеТовары.Следующий() И КРаспределению > 0 Цикл
				
				Если Не ЗначениеЗаполнено(ВыборкаПодобранныеТовары.Номенклатура) Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = Заказ.Запасы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаПодобранныеТовары);
				
				НоваяСтрока.Количество 	= Мин(КРаспределению, ВыборкаПодобранныеТовары.ОстатокНаСкладе);
				
				КРаспределению = КРаспределению - НоваяСтрока.Количество;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если Заказ.Запасы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Заказ.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			спЛогированиеСобытийИБ.ЛогироватьСобытиеИБ("РегламентныеЗадания.АвтоподсортТоваровВТорговыйЗал", "Ошибка",,, Ошибка);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик регламентного задания "Формирование дерева сайта (Tnext)"
//
Процедура спФормированиеДереваСайта() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.спФормированиеДереваСайта);
	
	РегистрыСведений.спНастройкиФормированияДереваСайта.СформироватьДеревоСайта();
	
КонецПроцедуры

// Обработчик регламентного задания "Загрузка подсчета посетителей (Tnext)"
//
Процедура спЗагрузкаПодсчетаПосетителей() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.спЗагрузкаПодсчетаПосетителей);
	
	ДатаОбработки = ТекущаяДатаСеанса();
	
	спПодсчетПосетителей.ЗагрузитьМетрикиПосетителей(ДатаОбработки);
	
КонецПроцедуры

#КонецОбласти