
#Область ПрограммныйИнтерфейс  

// Функция - Получить объект потокового чтения
//
// Параметры:
//	ЧитаемаяСтрока - данные, которые необходимо последовательно прочитать.
// 
// Возвращаемое значение:
//	ЧтениеJSON - объект чтения JSON данных.
//
Функция ПолучитьОбъектПотоковогоЧтения(ЧитаемаяСтрока) Экспорт
	
	ТекЧтение = Новый ЧтениеJSON;
	ТекЧтение.УстановитьСтроку(ЧитаемаяСтрока);
	
	Возврат ТекЧтение;
	
КонецФункции

// Функция - Получить объект потоковой записи
//
// Параметры:
//	ПараметрыЗаписи - входящие параметры записи XML.
//
// Возвращаемое значение:
//	ЗаписьXML - объект записи XML данных.
//
Функция ПолучитьОбъектПотоковойЗаписи(ПараметрыЗаписи = Неопределено) Экспорт
	
	ТекЗапись = Новый ЗаписьJSON;
	
	Если ПараметрыЗаписи = Неопределено Тогда
		
		ПараметрыЗаписи = ТекЗапись.Параметры;
	
	КонецЕсли;	
	
	ТекЗапись.УстановитьСтроку(ПараметрыЗаписи);
	
	Возврат ТекЗапись;

КонецФункции

 // Функция - Сериализовать объект
 // 
 // Параметры:
 //  Источник Источник
 // 
 // Возвращаемое значение:
 //  Строка - Результат сериализации объекта.
 // Результат сериализации объекта.
Функция СериализоватьОбъект(Источник) Экспорт
	
	ТекОбъектЗаписи = ПолучитьОбъектПотоковойЗаписи();
	СериализаторXDTO.ЗаписатьJSON(текОбъектЗаписи, Источник, НазначениеТипаXML.Явное);
	
	Возврат текОбъектЗаписи.Закрыть();
	
КонецФункции 

// Функция - Десериализовать объект
//
// Параметры:
//	Источник - объект, который необходимо десериализовать.
// 
// Возвращаемое значение:
//	Результат десериализации объекта.	
//
Функция ДесериализоватьОбъект(Источник) Экспорт
	
	РезультатОбъект = Неопределено;
	
	ПотокЧтение = ПолучитьОбъектПотоковогоЧтения(Источник);
	РезультатОбъект = СериализаторXDTO.ПрочитатьJSON(потокЧтение);
	ПотокЧтение.Закрыть();
	
	Возврат результатОбъект;
	
КонецФункции

// Функция - Прочитать объект из потока
// 
// Параметры:
//  Поток - 
// - объект чтения JSON, которых нужно прочитать.
//  ТипОбъекта - 
// - тип объекта для чтения.
// 
// Возвращаемое значение:
//  
// Результат чтения объекта.
Функция ПрочитатьОбъектИзПотока(Поток, ТипОбъекта) Экспорт
	
	Возврат ФабрикаXDTO.ПрочитатьJSON(Поток, ТипОбъекта);
	
КонецФункции

#КонецОбласти
