
#Область СлужебныйПрограммныйИнтерфейс

Функция ИспользоватьПрограммуЛояльности(ВходящиеПараметры) Экспорт
	
	Возврат ВходящиеПараметры <> Неопределено
		И ВходящиеПараметры.НастройкиМодуля <> Неопределено
		И ВходящиеПараметры.НастройкиМодуля.ИспользоватьПрограммыЛояльности;
	
КонецФункции

Процедура ОбновитьФорму(Форма) Экспорт
	
	#Если Не Сервер Тогда
		Форма.спОбновитьДоступностьОпросаКлиента();
	#КонецЕсли
	
	ГруппаОперации = Форма.Элементы.Найти("maxma_ГруппаОперации");
	
	Если Форма.Элементы.Найти("maxma_ГруппаОперации") = Неопределено Тогда
		Возврат;
	Иначе
		Форма.Элементы.maxma_ГруппаОперации.Видимость = ИспользоватьПрограммуЛояльности(Форма.Объект.maxma_СтруктураПолей);
	КонецЕсли;
	
	Если Форма.Объект.ВидОперации = ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств") Тогда
		Форма.Элементы.maxma_ГруппаОперации.Видимость = Ложь;
	Иначе
		Форма.Элементы.maxma_ГруппаОперации.Видимость = Истина;
	КонецЕсли;
	
	ПараметрыПродажи = Форма.Объект.maxma_СтруктураПолей.ПараметрыПродажи;
	СтруктураБаллов = Форма.Объект.maxma_СтруктураПолей.СтруктураБаллов;
	
	Если ЗначениеЗаполнено(ПараметрыПродажи.ВладелецБонуснойКарты) Тогда
		
		Владелец = "Карта: " + ПараметрыПродажи.ВладелецБонуснойКарты;
		Доступно = "Баланс: " + СтруктураБаллов.Доступно;
		ДоступноДляОплаты = "Доступно для оплаты: " + СтруктураБаллов.ДоступноДляОплаты;
		Начислено = "Будет начислено: " + СтруктураБаллов.Начислено;
		
		ЦветТекстаЗаголовка = WebЦвета.Зеленый;
	
	ИначеЕсли ЗначениеЗаполнено(ПараметрыПродажи.КодКартыНомерТелефона) Тогда
		
		Владелец = "Карта: " + ПараметрыПродажи.КодКартыНомерТелефона + " (не заполнены ФИО в личном кабинете!)";
		Доступно = "Баланс: " + СтруктураБаллов.Доступно;
		ДоступноДляОплаты = "Доступно для оплаты: " + СтруктураБаллов.ДоступноДляОплаты;
		Начислено = "Будет начислено: " + СтруктураБаллов.Начислено;
		
		ЦветТекстаЗаголовка = WebЦвета.Красный;
		
	Иначе
		
		Владелец = НСтр("ru = 'Бонусная карта: не предъявлена'");
		Доступно = "";
		ДоступноДляОплаты = "";
		Начислено = "";
		
		ЦветТекстаЗаголовка = WebЦвета.Красный;
		
	КонецЕсли;
	
	Форма.Элементы.maxma_НадписьБонуснаяКарта.Заголовок = Владелец;
	Форма.Элементы.maxma_НадписьДоступно.Заголовок = Доступно;
	Форма.Элементы.maxma_НадписьДоступноДляОплаты.Заголовок = ДоступноДляОплаты;
	Форма.Элементы.maxma_НадписьНачислено.Заголовок = Начислено;
	
	Форма.Элементы.maxma_НадписьБонуснаяКарта.ЦветТекста = ЦветТекстаЗаголовка;
	
КонецПроцедуры

#КонецОбласти
