
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий   

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Автор) Тогда  
		Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;  
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	Если Ссылка = Справочники.спЗнакиУходаПрисоединенныеФайлы.ПустаяСсылка() Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	спЗнакиУходаПрисоединенныеФайлы.Ссылка КАК Ссылка,
		|	спЗнакиУходаПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла
		|ИЗ
		|	Справочник.спЗнакиУходаПрисоединенныеФайлы КАК спЗнакиУходаПрисоединенныеФайлы
		|ГДЕ
		|	спЗнакиУходаПрисоединенныеФайлы.ВладелецФайла = &ВладелецФайла";
		
		Запрос.УстановитьПараметр("ВладелецФайла", ВладелецФайла);
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		УстановитьПривилегированныйРежим(Истина);
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл

			ПрисоединенныеФайлыОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект(); 
			ПрисоединенныеФайлыОбъект.Удалить();
		КонецЦикла;
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли