//<<<--- Tnext Козык К.А. 15.08.2026 - адаптация под УНФ 3.0.14.115
&ИзменениеИКонтроль("ДополнитьТоварамиПараметрыПриПробитииЧека")
Процедура спДополнитьТоварамиПараметрыПриПробитииЧека(ДокументОбъект, ОбщиеПараметры, ТаблицаТоваровЧека, ПризнакСпособаРасчета)

	ИспользоватьОплатуСертификатамиНСПК = ПолучитьФункциональнуюОпцию("ИспользоватьОплатуСертификатамиНСПК");
	ЭтоАванс = ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.Аванс
			   Или ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПредоплатаПолная
			   Или ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.ПредоплатаЧастичная;

	Если ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.Аванс Тогда

		СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека();
		Если ОбщиеПараметры.ТипРасчета = Перечисления.ТипыРасчетаДенежнымиСредствами.ВозвратДенежныхСредств Тогда
			СтрокаПозицииЧека.Наименование = НСтр("ru = 'Возврат от:'") + " " + ДокументОбъект.Контрагент;
		Иначе
			СтрокаПозицииЧека.Наименование = НСтр("ru = 'Оплата от:'") + " " + ДокументОбъект.Контрагент;
		КонецЕсли;
		СтрокаПозицииЧека.Количество     = 1;
		СтрокаПозицииЧека.Цена           = ДокументОбъект.СуммаДокумента;
		СтрокаПозицииЧека.ЦенаСоСкидками = ДокументОбъект.СуммаДокумента;
		СтрокаПозицииЧека.Сумма          = ДокументОбъект.СуммаДокумента;
		СтрокаПозицииЧека.НомерСекции    = 2;
		Если ОбщиеПараметры.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.ОСН Тогда

			Если ДокументОбъект.Дата > '20260101' Тогда
				Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
					ЧекПродажи = ДокументОбъект.ЧекККМ;
					Если ЗначениеЗаполнено(ЧекПродажи) И ЧекПродажи.Дата < '20260101' Тогда  //Возврат аванса за 2025 год.
						СтрокаПозицииЧека.СтавкаНДС = 120;
						СтрокаПозицииЧека.СуммаНДС = СтрокаПозицииЧека.Сумма / 120 * 20;
					Иначе
						СтрокаПозицииЧека.СтавкаНДС = 122;
						СтрокаПозицииЧека.СуммаНДС = СтрокаПозицииЧека.Сумма / 122 * 22;
					КонецЕсли;
				Иначе
					СтрокаПозицииЧека.СтавкаНДС = 122;
					СтрокаПозицииЧека.СуммаНДС = СтрокаПозицииЧека.Сумма / 122 * 22;
				КонецЕсли;
			ИначеЕсли ДокументОбъект.Дата > '20190101' Тогда
				Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
					ЧекПродажи = ДокументОбъект.ЧекККМ;
					Если ЗначениеЗаполнено(ЧекПродажи) И ЧекПродажи.Дата < '20190101' Тогда  //Возврат аванса за 2018 год.
						СтрокаПозицииЧека.СтавкаНДС = 118;
						СтрокаПозицииЧека.СуммаНДС = СтрокаПозицииЧека.Сумма / 118 * 18;
					Иначе
						СтрокаПозицииЧека.СтавкаНДС = 120;
						СтрокаПозицииЧека.СуммаНДС = СтрокаПозицииЧека.Сумма / 120 * 20;
					КонецЕсли;
				Иначе
					СтрокаПозицииЧека.СтавкаНДС = 120;
					СтрокаПозицииЧека.СуммаНДС = СтрокаПозицииЧека.Сумма / 120 * 20;
				КонецЕсли;
			Иначе
				СтрокаПозицииЧека.СтавкаНДС = 118;
			КонецЕсли;
		
		ИначеЕсли ОбщиеПараметры.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоход ИЛИ
			ОбщиеПараметры.СистемаНалогообложения = Перечисления.ТипыСистемНалогообложенияККТ.УСНДоходРасход Тогда
			
			СтрокаПозицииЧека.СтавкаНДС = Неопределено;
			
			ДатаНалогообложения = ДокументОбъект.Дата;
			Если ТипЗнч(ДокументОбъект.Ссылка) = Тип("ДокументСсылка.ЧекККМВозврат") Тогда
				ЧекПродажи = ДокументОбъект.ЧекККМ;
				Если ЗначениеЗаполнено(ЧекПродажи) Тогда
					ДатаНалогообложения = ЧекПродажи.Дата;
				КонецЕсли;
			КонецЕсли;
				
			НастройкиНДС = НалогиУНФ.НастройкиНДСОрганизации(ДокументОбъект.Организация,, ДатаНалогообложения);
			Если НастройкиНДС.ТипНалогообложения = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС Тогда
				СтавкаНДСУСН = Справочники.СтавкиНДС.СтавкаНДС(НастройкиНДС.ВидСтавкиНДС, ДатаНалогообложения);
				
				Если ЗначениеЗаполнено(СтавкаНДСУСН) Тогда
					СтрокаПозицииЧека.СтавкаНДС = 100 + СтавкаНДСУСН.Ставка;
					СтрокаПозицииЧека.СуммаНДС = СтрокаПозицииЧека.Сумма / (100 + СтавкаНДСУСН.Ставка) * СтавкаНДСУСН.Ставка;
				КонецЕсли;
				
			КонецЕсли;
		
		Иначе
			СтрокаПозицииЧека.СтавкаНДС      = Неопределено;
		КонецЕсли;
		СтрокаПозицииЧека.ПризнакСпособаРасчета = ПризнакСпособаРасчета;
		СтрокаПозицииЧека.ПризнакПредметаРасчета = Перечисления.ПризнакиПредметаРасчета.ПлатежВыплата;

		ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);

	Иначе

		ДанныеДляИСМП = РозничныеПродажиСервер.ДанныеДляИСМП(ДокументОбъект, ОбщиеПараметры);

		ОперацияСДенежнымиСредствами = Ложь;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДокументОбъект,
			"ОперацияСДенежнымиСредствами") Тогда
			ОперацияСДенежнымиСредствами = ДокументОбъект.ОперацияСДенежнымиСредствами;
		КонецЕсли;

		Для Каждого СтрокаТЧ Из ТаблицаТоваровЧека Цикл

			МассивСтрокДляДобавленияВЧек = Новый Массив;
			МассивСтрокДляДобавленияВЧек.Добавить(СтрокаТЧ);

			Если СтрокаТЧ.ПродукцияИС И ДанныеДляИСМП.Количество() > 0 Тогда
				ОбщиеПараметры.ЧасоваяЗона = ДокументОбъект.ЧасоваяЗона;
				СтрокиИСМП = ДанныеДляИСМП.НайтиСтроки(Новый Структура("НомерСтроки", СтрокаТЧ.НомерСтроки));
				Если СтрокиИСМП.Количество() > 0 Тогда
					МассивСтрокДляДобавленияВЧек = СтрокиИСМП;
				КонецЕсли;
			КонецЕсли;

			Для Каждого СтрокаДляДобавленияВЧек Из МассивСтрокДляДобавленияВЧек Цикл

				СтрокаТаблицыТоваров = Новый СписокЗначений();
				РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
					СтрокаТЧ.Номенклатура, "НаименованиеПолное,ТипНоменклатуры,ЭтоНабор,ВидМаркировки,АлкогольнаяПродукция,ПодакцизныйТовар,
										   |КодМедицинскогоИзделия, ПризнакПредметаРасчета, ПродаетсяВРозлив, Ссылка");
				Если ЗначениеЗаполнено(СтрокаТЧ.Характеристика) Тогда
					НаименованиеХарактеристикиДляПечати = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
						СтрокаТЧ.Характеристика, "НаименованиеДляПечати");
					НаименованиеТовара = РеквизитыНоменклатуры.НаименованиеПолное
										 + " ("
										 + НаименованиеХарактеристикиДляПечати
										 + ")";
				Иначе
					НаименованиеТовара = РеквизитыНоменклатуры.НаименованиеПолное;
				КонецЕсли;
				#Вставка
				//<<<--- Tnext Козык К.А. 15.08.2026
				// Добавляем в наименование позиции чека артикул и бренд товара.
				НаименованиеТовара = Строка(СтрокаТЧ.Номенклатура);
				//--->>> Tnext Козык К.А. 15.08.2026
				#КонецВставки

				СтрокаПозицииЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыФискальнойСтрокиЧека();
				СтрокаПозицииЧека.Наименование = НаименованиеТовара;
				СтрокаПозицииЧека.Количество   = СтрокаДляДобавленияВЧек.Количество;
				СтрокаПозицииЧека.Цена         = СтрокаДляДобавленияВЧек.Цена + ?(ДокументОбъект.СуммаВключаетНДС, 0,
					СтрокаДляДобавленияВЧек.СуммаНДС / ?(СтрокаДляДобавленияВЧек.Количество = 0, 1,
					СтрокаДляДобавленияВЧек.Количество)); //  5 - Цена за позицию без скидки;
				СуммаПозицииВключаяНДС = (СтрокаДляДобавленияВЧек.Сумма + ?(ДокументОбъект.СуммаВключаетНДС, 0, СтрокаДляДобавленияВЧек.СуммаНДС));
				СуммаСкидкиБезОкругления = СтрокаПозицииЧека.Цена * СтрокаПозицииЧека.Количество - СуммаПозицииВключаяНДС;
				СуммаСкидки = Окр(СуммаСкидкиБезОкругления, 2);
				СтрокаПозицииЧека.ЦенаСоСкидками = Окр(СтрокаПозицииЧека.Цена - СуммаСкидки / ?(
					СтрокаДляДобавленияВЧек.Количество = 0, 1, СтрокаДляДобавленияВЧек.Количество), 2);
				Если СтрокаТЧ.Всего = СтрокаДляДобавленияВЧек.Сумма Тогда
					СтрокаПозицииЧека.Сумма = СтрокаТЧ.Всего;
				ИначеЕсли ДокументОбъект.СуммаВключаетНДС Тогда
					СтрокаПозицииЧека.Сумма = СтрокаДляДобавленияВЧек.Сумма;
				Иначе
					СтрокаПозицииЧека.Сумма = СтрокаДляДобавленияВЧек.Сумма + СтрокаДляДобавленияВЧек.СуммаНДС;
				КонецЕсли;
				СтрокаПозицииЧека.СуммаСкидок = СуммаСкидки;
				СтрокаПозицииЧека.НомерСекции  = 1;
				СтрокаПозицииЧека.СуммаНДС = СтрокаДляДобавленияВЧек.СуммаНДС;
				Если Не ОперацияСДенежнымиСредствами Тогда
					СтрокаПозицииЧека.Штрихкод = СтрокаДляДобавленияВЧек.Штрихкод;
				КонецЕсли;
				СтрокаПозицииЧека.ПризнакПредметаРасчета = РозничныеПродажиСервер.ПолучитьПризнакПредметаРасчета(
					РеквизитыНоменклатуры);
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДляДобавленияВЧек,
					"ЕдиницаИзмерения") И ЗначениеЗаполнено(СтрокаДляДобавленияВЧек.ЕдиницаИзмерения) Тогда
					Если ТипЗнч(СтрокаДляДобавленияВЧек.ЕдиницаИзмерения) = Тип("СправочникСсылка.ЕдиницыИзмерения") Тогда
						ЕдиницаИзмеренияПозицииЧека = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
							СтрокаДляДобавленияВЧек.ЕдиницаИзмерения, "ЕдиницаИзмеренияПоКлассификатору");
					ИначеЕсли ТипЗнч(СтрокаДляДобавленияВЧек.ЕдиницаИзмерения) = Тип(
						"СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
						ЕдиницаИзмеренияПозицииЧека = СтрокаДляДобавленияВЧек.ЕдиницаИзмерения;
					Иначе
						ЕдиницаИзмеренияПозицииЧека = Неопределено;
					КонецЕсли;
					Если ЗначениеЗаполнено(ЕдиницаИзмеренияПозицииЧека) Тогда
						КодЕдиницыИзмеренияПозицииЧека = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
							ЕдиницаИзмеренияПозицииЧека, "Код");
						СтрокаПозицииЧека.КодЕдиницыИзмерения = КодЕдиницыИзмеренияПозицииЧека;
					КонецЕсли;
				КонецЕсли;
				Если ЗначениеЗаполнено(СтрокаТЧ.Партия)
					 И СтрокаТЧ.Партия.Статус <> Перечисления.СтатусыПартий.СобственныеЗапасы Тогда
					СтруктураРеквизитов = Новый Структура();
					СтруктураРеквизитов.Вставить("НаименованиеПолное", "ВладелецПартии.НаименованиеПолное");
					СтруктураРеквизитов.Вставить("ИНН", "ВладелецПартии.ИНН");
					СтруктураРеквизитов.Вставить("ВладелецПартии", "ВладелецПартии");
					РеквизитыВладельца = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТЧ.Партия,
						СтруктураРеквизитов);
					СтрокаПозицииЧека.ДанныеПоставщика.Наименование = РеквизитыВладельца.НаименованиеПолное;
					СтрокаПозицииЧека.ДанныеПоставщика.ИНН = РеквизитыВладельца.ИНН;
					Если СтрокаТЧ.Партия.Статус = Перечисления.СтатусыПартий.ТоварыНаКомиссии Тогда
						СтрокаПозицииЧека.ПризнакАгентаПоПредметуРасчета = Перечисления.ПризнакиАгента.Комиссионер;
					КонецЕсли;
					Телефон = Справочники.Контрагенты.ПолучитьТелефонКонтрагента(РеквизитыВладельца.ВладелецПартии);
					Телефон = РозничныеПродажиСервер.УбратьРазделителиВНомереТелефона(Телефон);
					СтрокаПозицииЧека.ДанныеПоставщика.Телефон = Телефон;
				КонецЕсли;

				СтрокаПозицииЧека.Вставить("РезультатРаспределенияШтрихкодов");
				Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаДляДобавленияВЧек,
					"РезультатРаспределенияШтрихкодов") И ЗначениеЗаполнено(
					СтрокаДляДобавленияВЧек.РезультатРаспределенияШтрихкодов) Тогда

					РезультатРаспределенияШтрихкодов = СтрокаДляДобавленияВЧек.РезультатРаспределенияШтрихкодов;

					СтрокаПозицииЧека.РезультатРаспределенияШтрихкодов = РезультатРаспределенияШтрихкодов;

					ПолныйКодМаркировки = РезультатРаспределенияШтрихкодов.ПолныйКодМаркировки;
					Если ЗначениеЗаполнено(ПолныйКодМаркировки) Тогда
						Если ОбщегоНазначенияРМК.ПризнакИспользованияКМПоНоменклатуре(СтрокаТЧ.Номенклатура) Тогда
							СтрокаПозицииЧека.ШтрихкодBase64 = ПолныйКодМаркировки;
							СтрокаПозицииЧека.КонтрольнаяМарка = ПолныйКодМаркировки;
						Иначе
							Если КонструкторИСОбщегоНазначенияКлиентСервер.ЭтоПродукцияМЕХ(СтрокаТЧ.КлючВидовПродукции) Тогда
								СтрокаПозицииЧека.Штрихкод = ПолныйКодМаркировки;
							ИначеЕсли Не КонструкторИСМПОбщегоНазначенияКлиентСервер.ИспользоватьЧислительИЗнаменательПриЧастичномВыбытииНаККТ(СтрокаТЧ.КлючВидовПродукции) Тогда
								СтрокаПозицииЧека.КонтрольнаяМарка = ПолныйКодМаркировки;
							Иначе
								СтрокаПозицииЧека.Штрихкод = СтрокаТЧ.Штрихкод;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					СтрокаПозицииЧека.НормализованныйКодМаркировки = РезультатРаспределенияШтрихкодов.КодИдентификации;
					
					Если РезультатРаспределенияШтрихкодов.ЧастичноеВыбытие Тогда
						Если Не КонструкторИСМПОбщегоНазначенияКлиентСервер.ИспользоватьЧислительИЗнаменательПриЧастичномВыбытииНаККТ(СтрокаТЧ.КлючВидовПродукции) Тогда
							Если СтрокаПозицииЧека.ПризнакПредметаРасчета  = Перечисления.ПризнакиПредметаРасчета.ТоварМаркируемыйСИИмеющийКМ Тогда
								СтрокаПозицииЧека.ПризнакПредметаРасчета  = Перечисления.ПризнакиПредметаРасчета.ТоварМаркируемыйСИНеИмеющийКМ;
							КонецЕсли;
							
							СтрокаПозицииЧека.Штрихкод = "";
							СтрокаПозицииЧека.ШтрихкодBase64 = "";
						Иначе
							Если РезультатРаспределенияШтрихкодов.Количество = РезультатРаспределенияШтрихкодов.ЕмкостьПотребительскойУпаковки Тогда
								СтрокаПозицииЧека.КодЕдиницыИзмерения = "796";
							Иначе
								Если СтрокаПозицииЧека.ПризнакПредметаРасчета  = Перечисления.ПризнакиПредметаРасчета.ТоварМаркируемыйСИИмеющийКМ Тогда
									СтрокаПозицииЧека.ПризнакПредметаРасчета  = Перечисления.ПризнакиПредметаРасчета.ТоварМаркируемыйСИНеИмеющийКМ;
								КонецЕсли;
								
								СтрокаПозицииЧека.ДробноеКоличество.Числитель   = РезультатРаспределенияШтрихкодов.Количество;
								СтрокаПозицииЧека.ДробноеКоличество.Знаменатель = РезультатРаспределенияШтрихкодов.ЕмкостьПотребительскойУпаковки;
								
								Если РезультатРаспределенияШтрихкодов.Количество > 1 Тогда
									Упаковка = СтрокаДляДобавленияВЧек.ЕдиницаИзмерения;
									Если Не ЗначениеЗаполнено(Упаковка) Тогда
										Упаковка = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
											СтрокаДляДобавленияВЧек.Номенклатура, "ЕдиницаИзмерения");
									КонецЕсли;
									УпаковкаНаименование = "ед";
									Если ЗначениеЗаполнено(Упаковка) Тогда
										УпаковкаНаименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Упаковка,
											"Наименование");
									КонецЕсли;
									УпаковкаНаименование = УпаковкаНаименование + ".";
									Валюта = ДокументОбъект.ВалютаДокумента;
									ЦенаЕдиницы = Окр(СтрокаДляДобавленияВЧек.Цена
													  / РезультатРаспределенияШтрихкодов.Количество, 2);
									ОписаниеЧастичногоВыбытия = СтрШаблон(
										НСтр("ru = ' (%1 %2, цена: %3 %4/%5)'"), РезультатРаспределенияШтрихкодов.Количество,
										УпаковкаНаименование, ЦенаЕдиницы, Валюта, УпаковкаНаименование);
									СтрокаПозицииЧека.Наименование = СтрокаПозицииЧека.Наименование
																	 + ОписаниеЧастичногоВыбытия;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					
					Если Не РезультатРаспределенияШтрихкодов.ЧастичноеВыбытие Тогда
						СтрокаПозицииЧека.КодЕдиницыИзмерения = "796";
					КонецЕсли;
					
					Если ЗначениеЗаполнено(
						РезультатРаспределенияШтрихкодов.РазрешительныйРежимИдентификаторЗапросаГИСМТ) Тогда
						СтрокаПозицииЧека.ЗапросПроверкиКода.ИдентификаторЗапроса
							= РезультатРаспределенияШтрихкодов.РазрешительныйРежимИдентификаторЗапросаГИСМТ;
						СтрокаПозицииЧека.ЗапросПроверкиКода.ВременнаяМетка
							= РезультатРаспределенияШтрихкодов.РазрешительныйРежимДатаЗапросаГИСМТ;
					КонецЕсли;
					
					Если ЗначениеЗаполнено(
						РезультатРаспределенияШтрихкодов.РазрешительныйРежимИдентификаторЭкземпляраПО) Тогда
						СтрокаПозицииЧека.ЗапросПроверкиКода.ИдентификаторЭкземпляра
							= РезультатРаспределенияШтрихкодов.РазрешительныйРежимИдентификаторЭкземпляраПО;
						СтрокаПозицииЧека.ЗапросПроверкиКода.ВерсияБазы
							= РезультатРаспределенияШтрихкодов.РазрешительныйРежимВерсияБазы;
					КонецЕсли;

				КонецЕсли;

				Если РеквизитыНоменклатуры.ПодакцизныйТовар И ЗначениеЗаполнено(ДокументОбъект.Контрагент) Тогда
					ВидКонтрагента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбъект.Контрагент,
						"ВидКонтрагента");

					Если ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо
						 Или ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель Тогда
						СтрокаПозицииЧека.СуммаАкциза = 0;
					КонецЕсли;
				КонецЕсли;

				СтрокаПозицииЧека.НомерСтрокиТовара = СтрокаТЧ.НомерСтроки;
				СтрокаПозицииЧека.КодВидаНоменклатурнойКлассификации = РеквизитыНоменклатуры.КодМедицинскогоИзделия;

				Если СтрокаТЧ.Номенклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
					СтрокаПозицииЧека.ПризнакСпособаРасчета = Перечисления.ПризнакиСпособаРасчета.Аванс;
					СтрокаПозицииЧека.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДСДляККТ(
						СтрокаТЧ.СтавкаНДС, Истина);
				Иначе
					СтрокаПозицииЧека.ПризнакСпособаРасчета = ПризнакСпособаРасчета;
					СтрокаПозицииЧека.СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДСДляККТ(
						СтрокаТЧ.СтавкаНДС, ЭтоАванс);
				КонецЕсли;

				Если СтрокаТЧ.ПродукцияИС И ДанныеДляИСМП.Количество() > 0 Тогда
					ВидыПродукцииКлюча = КонструкторИСОбщегоНазначенияКлиентСервер.ВидыПродукцииКлюча(СтрокаТЧ.КлючВидовПродукции);
					Для Каждого ВидПродукцииКлюча Из ВидыПродукцииКлюча Цикл
						ТипМаркировкиККТ = ИнтеграцияИСКлиентСервер.ТипМаркировкиККТПоВидуПродукции(ВидПродукцииКлюча);
						Если ЗначениеЗаполнено(ТипМаркировкиККТ) Тогда
							ДанныеРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(
								СтрокаДляДобавленияВЧек.Штрихкод, ВидПродукцииКлюча);
							Если Не ДанныеРазбора = Неопределено Тогда
								СтрокаПозицииЧека.ДанныеКодаТоварнойНоменклатуры.ТипМаркировки                          = ТипМаркировкиККТ;
								СтрокаПозицииЧека.ДанныеКодаТоварнойНоменклатуры.ГлобальныйИдентификаторТорговойЕдиницы = ДанныеРазбора.СоставКодаМаркировки.GTIN;
								СтрокаПозицииЧека.ДанныеКодаТоварнойНоменклатуры.СерийныйНомер                          = ДанныеРазбора.СоставКодаМаркировки.СерийныйНомер;
								Прервать;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
					
				ИначеЕсли СтрокаТЧ.АлкогольнаяПродукция И Не ОперацияСДенежнымиСредствами Тогда
					Если СтрокаТЧ.Количество > 1 Тогда
						СтрокаПозицииЧека.Штрихкод = СтрокаТЧ.Штрихкод;
					Иначе
						Если ЗначениеЗаполнено(СтрокаТЧ.КодМаркировки) Тогда
							СтрокаПозицииЧека.Штрихкод = СтрокаТЧ.КодМаркировки;
						Иначе
							СтрокаПозицииЧека.Штрихкод = СтрокаТЧ.Штрихкод;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				
				Если КонструкторИСМПКлиентСервер.ВидПродукцииИспользуетВетеринарныйСертификат(СтрокаТЧ.КлючВидовПродукции) Тогда
					СтрокаПозицииЧека.ВетеринарныйПрепарат = Истина;
					СтрокаПозицииЧека.ВетеринарноеТребование = СтрокаДляДобавленияВЧек.ЭтоВетТребование;
					Если ЗначениеЗаполнено(СтрокаДляДобавленияВЧек.НомерРецепта) Тогда
						СтрокаПозицииЧека.РецептНомер = СтрокаДляДобавленияВЧек.НомерРецепта;
					КонецЕсли;
					Если ЗначениеЗаполнено(СтрокаДляДобавленияВЧек.ДатаРецепта) Тогда
						СтрокаПозицииЧека.РецептДата = СтрокаДляДобавленияВЧек.ДатаРецепта;
					КонецЕсли;
				КонецЕсли;
				
				АгентскиеПлатежиУНФ.ЗаполнитьПараметрыПлатежногоДоговораВСтроке(ОбщиеПараметры, СтрокаПозицииЧека,
					СтрокаТЧ);
					
				Если ИспользоватьОплатуСертификатамиНСПК И Не ПустаяСтрока(СтрокаТЧ.КодТРУ) Тогда
					
					СтрокаТекста = СтрШаблон(НСтр("ru = 'ТРУ (КОД): %1'"), СтрокаТЧ.КодТРУ);
					ТекстоваяСтрокаЧека = ОборудованиеЧекопечатающиеУстройстваКлиентСервер.ПараметрыТекстовойСтрокиЧека(
						СтрокаТекста);
					ОбщиеПараметры.ПозицииЧека.Добавить(ТекстоваяСтрокаЧека);
					
				КонецЕсли;
				СтрокаПозицииЧека.ИспользованСертификатФСС = СтрокаТЧ.ИспользованСертификатФСС;
				
				
				ОбщиеПараметры.ПозицииЧека.Добавить(СтрокаПозицииЧека);

			КонецЦикла;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
//--->>> Tnext Козык К.А. 15.08.2026 - адаптация под УНФ 3.0.14.115
