#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ПараметрыФормы = Новый Структура("Основание", ПараметрКоманды); 
	
	ОткрытьФорму("Документ.спПриемкаТовара.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник,
		ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЕстьПриемка(ПараметрКоманды)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказНаПеремещениеЗапасы.Номенклатура КАК Номенклатура,
		|	СУММА(ЗаказНаПеремещениеЗапасы.Количество) КАК Количество,
		|	ЗаказНаПеремещениеЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТ_ДанныеЗаказа
		|ИЗ
		|	Документ.ЗаказНаПеремещение.Запасы КАК ЗаказНаПеремещениеЗапасы
		|ГДЕ
		|	ЗаказНаПеремещениеЗапасы.Ссылка = &ЗаказНаПеремещение
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаказНаПеремещениеЗапасы.Номенклатура,
		|	ЗаказНаПеремещениеЗапасы.ЕдиницаИзмерения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	спПриемкаТовараЗапасы.Номенклатура КАК Номенклатура,
		|	СУММА(спПриемкаТовараЗапасы.Количество) КАК Количество,
		|	спПриемкаТовараЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	спПриемкаТовара.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_ДанныеПриемки
		|ИЗ
		|	Документ.спПриемкаТовара КАК спПриемкаТовара
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.спПриемкаТовара.Запасы КАК спПриемкаТовараЗапасы
		|		ПО спПриемкаТовара.Ссылка = спПриемкаТовараЗапасы.Ссылка
		|ГДЕ
		|	спПриемкаТовара.ДокументОснование = &ЗаказНаПеремещение
		|
		|СГРУППИРОВАТЬ ПО
		|	спПриемкаТовараЗапасы.Номенклатура,
		|	спПриемкаТовараЗапасы.ЕдиницаИзмерения,
		|	спПриемкаТовара.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеЗаказа.Номенклатура КАК Номенклатура,
		|	ВТ_ДанныеЗаказа.Количество КАК Количество,
		|	ВТ_ДанныеЗаказа.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ЕСТЬNULL(ВТ_ДанныеПриемки.Количество, 0) КАК КоличествоПриемки,
		|	ВТ_ДанныеПриемки.Ссылка КАК Ссылка
		|ИЗ
		|	ВТ_ДанныеЗаказа КАК ВТ_ДанныеЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДанныеПриемки КАК ВТ_ДанныеПриемки
		|		ПО ВТ_ДанныеЗаказа.Номенклатура = ВТ_ДанныеПриемки.Номенклатура
		|			И ВТ_ДанныеЗаказа.ЕдиницаИзмерения = ВТ_ДанныеПриемки.ЕдиницаИзмерения
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДанныеЗаказа.Номенклатура,
		|	ВТ_ДанныеЗаказа.ЕдиницаИзмерения,
		|	ВТ_ДанныеЗаказа.Количество,
		|	ЕСТЬNULL(ВТ_ДанныеПриемки.Количество, 0),
		|	ВТ_ДанныеПриемки.Ссылка
		|
		|ИМЕЮЩИЕ
		|	СУММА(ВТ_ДанныеЗаказа.Количество) > СУММА(ЕСТЬNULL(ВТ_ДанныеПриемки.Количество, 0))";
	
	Запрос.УстановитьПараметр("ЗаказНаПеремещение", ЗаказНаПеремещение);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
	КонецЦикла;
	
	
КонецФункции
 
#КонецОбласти
