
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаПраваяКлавиатура;
	Элементы.СтраницыВвода.ТекущаяСтраница  = Элементы.СтраницаВводимоеЧисло;
	
	ТекущийЭлемент = Элементы.ПолеВводимоеЧисло;
	
	НастройкиМодуля = Параметры.НастройкиМодуля;
	
	Если Не НастройкиМодуля.ИспользоватьПрограммыЛояльности Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Параметры.Свойство("РежимПоискаКарты", РежимПоискаКартыСтрока);
	Параметры.Свойство("Операция", 		   Операция);
	Параметры.Свойство("КодСтраны", 	   КодСтраны);
	Параметры.Свойство("КассаККМ", 		   КассаККМ);
	Параметры.Свойство("Организация", 	   Организация);
	
	Если РежимПоискаКартыСтрока = "НомерТелефона" Тогда
		МобильныйТелефон = Параметры.ВведенноеЧисло;
		РежимПоискаКарты = 1;
	ИначеЕсли РежимПоискаКартыСтрока = "КодКарты" Тогда
		ВводимоеЧисло 	 = Параметры.ВведенноеЧисло;
		РежимПоискаКарты = 0;
	Иначе
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	РеквизитыКлиентаДо = Новый Структура;
	РеквизитыКлиентаДо.Вставить("МобильныйТелефонДо", 	"");
	РеквизитыКлиентаДо.Вставить("НомерКартыДо", 	  	"");
	РеквизитыКлиентаДо.Вставить("ИмяДо", 			  	"");
	РеквизитыКлиентаДо.Вставить("ФамилияДо", 		  	"");
	РеквизитыКлиентаДо.Вставить("ОтчествоДо", 		  	"");
	РеквизитыКлиентаДо.Вставить("ПолДо", 			  	"");
	РеквизитыКлиентаДо.Вставить("ДатаРожденияДо", 	  	Дата(1,1,1));
	РеквизитыКлиентаДо.Вставить("EmailДо", 			  	"");
	РеквизитыКлиентаДо.Вставить("СогласенНаРассылкуДо", Ложь);
	РеквизитыКлиентаДо.Вставить("КодСтраны", 			"");
	РеквизитыКлиентаДо.Вставить("КодТелефона"	  	 ,  "");
	РеквизитыКлиентаДо.Вставить("НомерТелефонаЧасть1",  "");
	РеквизитыКлиентаДо.Вставить("НомерТелефонаЧасть2",  "");
	РеквизитыКлиентаДо.Вставить("НомерТелефонаЧасть3",  "");
		
	Если Операция = "ВыдачаКарты" Тогда
		
		Элементы.ВыдатьКарту.Заголовок = "Выдать карту";
		Элементы.ГруппаШапка.Заголовок = "Выдача карты лояльности";	
		
		СогласенНаРассылку = Истина;
		
		Если ЗначениеЗаполнено(МобильныйТелефон) Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, maxma_ИнтеграцияССервисомВызовСервера.РаспарситьНомерТелефона(МобильныйТелефон, КодСтраны));
		КонецЕсли;

	ИначеЕсли Операция = "РедактированиеКарты" Тогда	
		
		Элементы.ВыдатьКарту.Заголовок = "Редактировать карту";
		Элементы.ГруппаШапка.Заголовок = "Редактирование карты лояльности";
				
		Если НЕ (РежимПоискаКартыСтрока = "НомерТелефона"
			ИЛИ РежимПоискаКартыСтрока = "КодКарты") Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		
		ПолучитьБалансНаСервереРедактированиеКарты(РежимПоискаКартыСтрока, Параметры.ВведенноеЧисло, ДополнительныеПараметры, Истина);

		Если ЗначениеЗаполнено(МобильныйТелефон) Тогда
			ЗаполнитьЗначенияСвойств(ЭтотОбъект, maxma_ИнтеграцияССервисомВызовСервера.РаспарситьНомерТелефона(МобильныйТелефон, КодСтраны));
		КонецЕсли;
		
	Иначе
		Элементы.ВыдатьКарту.Заголовок = "Неизвестный режим";
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(НастройкиМодуля.ВыдачаЗаменаКарты_ОбязательныеПоляХранилище) Тогда	
		ВыдачаЗаменаКарты_ОбязательныеПоля.ЗагрузитьЗначения(СтрРазделить(НастройкиМодуля.ВыдачаЗаменаКарты_ОбязательныеПоляХранилище, ","));	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(ОповещенияПриПодключении, ЭтотОбъект, "СканерШтрихкода, СчитывательМагнитныхКарт");
	// Конец ПодключаемоеОборудование
	АктивироватьКнопкуОтправитьСМС();
	ОбновитьЦветТекстаПол();
	
	maxma_ИнтеграцияССервисомКлиент.УстановитьМаскуНомераТелефона(ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование

КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ВводДоступен() Тогда
		
		Если Событие = "Штрихкод" Или Событие = "ПолученШтрихкод" Или Событие = "ScanData" Тогда
			ВыполнитьПоискШтрихкода(Данные);
		ИначеЕсли Событие = "TracksData" Или Событие = "ДанныеКарты" Тогда
			ВыполнитьПоискМагнитнойКарты(Данные);
		Иначе
			Возврат;
		КонецЕсли; 
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда0(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда0ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтереть(Команда)
	ВводимоеЧисло = "";
	КодТелефона = "";
	НомерТелефонаЧасть1 = "";
	НомерТелефонаЧасть2 = "";
	НомерТелефонаЧасть3 = "";
	Если РежимПоискаКарты = 1 Тогда
		ПервыйВвод = Истина;
	Иначе
		ПервыйВвод = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаEnter(Команда)
	
	ЗакрытьСПередачейРезультата();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыдатьКарту(Команда)
		
	Если ПроверкаЗаполнения() Тогда
		
		Если Операция = "ВыдачаКарты" Тогда
			
			ДополнительныеПараметры = Новый Структура;
			
			Если РежимПоискаКартыСтрока = "КодКарты" И ЗначениеЗаполнено(НомерКарты) Тогда
				РежимПоискаКартыСтрока = "КодКарты";
				НомерКартыТелефон 	   = НомерКарты;
			ИначеЕсли РежимПоискаКартыСтрока = "КодКарты" И Не ЗначениеЗаполнено(НомерКарты) И ЗначениеЗаполнено(МобильныйТелефонБезКодаСтраны) Тогда
				РежимПоискаКартыСтрока = "НомерТелефона";
				НомерКартыТелефон 	   = МобильныйТелефон;
			ИначеЕсли РежимПоискаКартыСтрока = "НомерТелефона" И ЗначениеЗаполнено(МобильныйТелефонБезКодаСтраны) Тогда
				РежимПоискаКартыСтрока = "НомерТелефона";
				НомерКартыТелефон 	   = МобильныйТелефон;
			ИначеЕсли РежимПоискаКартыСтрока = "НомерТелефона" И Не ЗначениеЗаполнено(МобильныйТелефонБезКодаСтраны) И ЗначениеЗаполнено(НомерКарты) Тогда
				РежимПоискаКартыСтрока = "КодКарты";
				НомерКартыТелефон 	   = НомерКарты;
			Иначе
				Возврат;
			КонецЕсли;
				
			ШаблонСообщения = Нстр("ru = '%1.
			|%2.'");
			
			Если ПолучитьБалансНаСервереВыдачаКарты(РежимПоискаКартыСтрока, НомерКартыТелефон, ДополнительныеПараметры) = Истина Тогда
				
				ДополнительныеПараметры.Вставить("ЗаголовокИнформации", НСтр("ru = 'Выдача карты лояльности'"));
				ДополнительныеПараметры.Вставить("ТекстИнформации", 	НСтр("ru = 'Уже существует карта лояльности, привязанная к введенному номеру карты/телефона.'"));
				
				maxma_ИнтеграцияССервисомКлиент.ОткрытьФормуИнформации(ДополнительныеПараметры);
				
			Иначе
				
				Если НЕ ДополнительныеПараметры.СетеваяОшибка Тогда
					
					Если СоздатьБонусныйСчетНаСервере(ДополнительныеПараметры) Тогда
						
						ДополнительныеПараметры.Вставить("ЗаголовокИнформации", НСтр("ru = 'Выдача карты лояльности'"));
						ДополнительныеПараметры.Вставить("ТекстИнформации", 	НСтр("ru = 'Карта успешно создана'"));
						ДополнительныеПараметры.Вставить("РежимПоиска", 	  	РежимПоискаКартыСтрока);
						ДополнительныеПараметры.Вставить("НомерКартыТелефон", 	НомерКартыТелефон);
						ДополнительныеПараметры.Вставить("КодСтраны",           КодСтраны);
						
						ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуИнформацииВыдачаКартыЛояльности", ЭтотОбъект, ДополнительныеПараметры);
						
						maxma_ИнтеграцияССервисомКлиент.ОткрытьФормуИнформации(ДополнительныеПараметры, ОбработчикОповещения);
						
					Иначе
						
						Если ДополнительныеПараметры.СетеваяОшибка = Ложь Тогда
							maxma_ИнтеграцияССервисомКлиент.ОткрытьФормуИнформации(ДополнительныеПараметры);
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли Операция = "РедактированиеКарты" Тогда 
			
			Если НЕ ЗначениеЗаполнено(МобильныйТелефонБезКодаСтраны) 
				И НЕ ЗначениеЗаполнено(НомерКарты) Тогда
				Возврат;
			КонецЕсли;
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("СетеваяОшибка", Ложь);
			
			ИзменилиТелефон    	   	   = СтрДлина(МобильныйТелефонБезКодаСтраны) = 10 И НЕ МобильныйТелефонБезКодаСтраны = РеквизитыКлиентаДо.МобильныйТелефонДо;
			ИзменилиНомерКарты 	   	   = НЕ НомерКарты = РеквизитыКлиентаДо.НомерКартыДо;
			ИзменилиИмя 	   	   	   = НЕ Имя = РеквизитыКлиентаДо.ИмяДо;
			ИзменилиФамилию 	   	   = НЕ Фамилия = РеквизитыКлиентаДо.ФамилияДо;
			ИзменилиОтчество 	   	   = НЕ Отчество = РеквизитыКлиентаДо.ОтчествоДо;
			ИзменилиПол    	   	   	   = НЕ Пол = РеквизитыКлиентаДо.ПолДо;
			ИзменилиДатуРождения   	   = НЕ ДатаРождения = РеквизитыКлиентаДо.ДатаРожденияДо;
			ИзменилиEmail 	  	   	   = НЕ Email = РеквизитыКлиентаДо.EmailДо;
			ИзменилиСогласенНаРассылку = НЕ СогласенНаРассылку = РеквизитыКлиентаДо.СогласенНаРассылкуДо;
			
			Если НЕ (ИзменилиТелефон ИЛИ ИзменилиНомерКарты ИЛИ ИзменилиИмя ИЛИ ИзменилиФамилию ИЛИ ИзменилиОтчество ИЛИ ИзменилиПол 
				ИЛИ ИзменилиДатуРождения ИЛИ ИзменилиEmail ИЛИ ИзменилиСогласенНаРассылку) Тогда
				
				ДополнительныеПараметры.Вставить("ЗаголовокИнформации", НСтр("ru = 'Редактирование карты лояльности'"));
				ДополнительныеПараметры.Вставить("ТекстИнформации"	  , НСтр("ru = 'Не изменено ни одного поля.'"));
				
				maxma_ИнтеграцияССервисомКлиент.ОткрытьФормуИнформации(ДополнительныеПараметры);
				
				Возврат;

			КонецЕсли;
			
			Если (ИзменилиТелефон И ЗначениеЗаполнено(МобильныйТелефонБезКодаСтраны))
				И (ИзменилиНомерКарты И ЗначениеЗаполнено(НомерКарты)) Тогда
				
				РежимПоискаКартыСтрока = "КодКарты";
				НомерКартыТелефон  = НомерКарты;
				
				Если НЕ КартаЛояльностиСуществует(ДополнительныеПараметры) Тогда
					
					РежимПоискаКартыСтрока = "НомерТелефона";
					НомерКартыТелефон  = МобильныйТелефон;
					
					Если НЕ КартаЛояльностиСуществует(ДополнительныеПараметры) Тогда
						ОбновитьИнформациюОКлиенте(ДополнительныеПараметры);
					КонецЕсли;
					
				КонецЕсли;
				
			ИначеЕсли ИзменилиТелефон И ЗначениеЗаполнено(МобильныйТелефонБезКодаСтраны) Тогда
				
				РежимПоискаКартыСтрока = "НомерТелефона";
				НомерКартыТелефон  = МобильныйТелефон;
				
				Если НЕ КартаЛояльностиСуществует(ДополнительныеПараметры) Тогда
					ОбновитьИнформациюОКлиенте(ДополнительныеПараметры);
				КонецЕсли;
				
			ИначеЕсли ИзменилиНомерКарты И ЗначениеЗаполнено(НомерКарты) Тогда
				
				РежимПоискаКартыСтрока = "КодКарты";
				НомерКартыТелефон  = НомерКарты;
				
				Если НЕ КартаЛояльностиСуществует(ДополнительныеПараметры) Тогда
					ОбновитьИнформациюОКлиенте(ДополнительныеПараметры);
				КонецЕсли;
				
			ИначеЕсли ИзменилиИмя ИЛИ ИзменилиФамилию ИЛИ ИзменилиОтчество ИЛИ ИзменилиПол ИЛИ ИзменилиДатуРождения 
				ИЛИ ИзменилиEmail ИЛИ ИзменилиСогласенНаРассылку Тогда
				
				Если РежимПоискаКартыСтрока = "КодКарты" И ЗначениеЗаполнено(НомерКарты) Тогда
					РежимПоискаКартыСтрока = "КодКарты";
					НомерКартыТелефон 	   = НомерКарты;
				ИначеЕсли РежимПоискаКартыСтрока = "КодКарты" И Не ЗначениеЗаполнено(НомерКарты) И ЗначениеЗаполнено(МобильныйТелефонБезКодаСтраны) Тогда
					РежимПоискаКартыСтрока = "НомерТелефона";
					НомерКартыТелефон 	   = МобильныйТелефон;
				ИначеЕсли РежимПоискаКартыСтрока = "НомерТелефона" И ЗначениеЗаполнено(МобильныйТелефонБезКодаСтраны) Тогда
					РежимПоискаКартыСтрока = "НомерТелефона";
					НомерКартыТелефон 	   = МобильныйТелефон;
				ИначеЕсли РежимПоискаКартыСтрока = "НомерТелефона" И Не ЗначениеЗаполнено(МобильныйТелефонБезКодаСтраны) И ЗначениеЗаполнено(НомерКарты) Тогда
					РежимПоискаКартыСтрока = "КодКарты";
					НомерКартыТелефон 	   = НомерКарты;
				Иначе
					Возврат;
				КонецЕсли;
				
				ОбновитьИнформациюОКлиенте(ДополнительныеПараметры);
				
			Иначе
				Возврат;
			КонецЕсли;	
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтправитьКодСМС(Команда)
	
	МобильныйТелефон = КодСтраны + КодТелефона + НомерТелефонаЧасть1 + НомерТелефонаЧасть2 + НомерТелефонаЧасть3;
	
	ДополнительныеПараметры = Новый Структура;
	ШаблонСообщения = Нстр("ru = '%1.
		|%2.'");
	Если ОтправитьКодСМСНаСервере(МобильныйТелефон, ДополнительныеПараметры) Тогда
		
		ДополнительныеПараметры.Вставить("ЗаголовокИнформации", НСтр("ru = 'Отправка код подтверждения'"));
		ДополнительныеПараметры.Вставить("ТекстИнформации"	  , НСтр("ru = 'Успешно отправлено'"));
		
		Элементы.СтраницаТелефон.Доступность   = Ложь;		
		Элементы.ОтправитьКодСМС.Доступность   = Ложь; 
		Элементы.ОтправитьКодСМС.Заголовок 	   = "Код отправлен";
		Элементы.КодИзСМС.Доступность 		   = Истина;
		Элементы.ПодтвердитьСМСКод.Доступность = Истина;
		
		maxma_ИнтеграцияССервисомКлиент.ОткрытьФормуИнформации(ДополнительныеПараметры);
		ВремяПовторнойОтправкиСМСКода = ТекущаяДата()+90;
		ПодключитьОбработчикОжидания("ТаймерОтправкиСМС", 5, Ложь);
		
	Иначе
		
		Если НЕ ДополнительныеПараметры.СетеваяОшибка Тогда
			
			Если ДополнительныеПараметры.СетеваяОшибка = Ложь Тогда
				maxma_ИнтеграцияССервисомКлиент.ОткрытьФормуИнформации(ДополнительныеПараметры);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодтвердитьСМСКод(Команда)
	
	Если КодИзСМС = КодПодтверждения Тогда
		Элементы.ПодтвердитьСМСКод.Заголовок = "Телефон подтвержден";
		ПодтверждениеПоСМС = Истина;
		ОтключитьОбработчикОжидания("ТаймерОтправкиСМС");
		НадписьПовторитьОтправку = "";
		Элементы.ПодтвердитьСМСКод.ЦветТекста = WebЦвета.Зеленый;
	Иначе
		Элементы.ПодтвердитьСМСКод.Заголовок = "Подтвердить";
		ПодтверждениеПоСМС = Ложь;
		Элементы.ПодтвердитьСМСКод.ЦветТекста = Новый Цвет();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КодСтраныПриИзменении(Элемент)
	
	СтруктураМаски = maxma_ИнтеграцияССервисомВызовСервера.ПолучитьМаскуНомераТелефона(КодСтраны);
	
	Элементы.КодТелефона.Маска 		   = СтруктураМаски.КодТелефона;
	Элементы.НомерТелефонаЧасть1.Маска = СтруктураМаски.НомерТелефонаЧасть1;
	Элементы.НомерТелефонаЧасть2.Маска = СтруктураМаски.НомерТелефонаЧасть2;
	Элементы.НомерТелефонаЧасть3.Маска = СтруктураМаски.НомерТелефонаЧасть3;
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПоискаКартыПриИзменении(Элемент)
	КомандаСтереть(Неопределено);
	УстановитьФокусВвода();
КонецПроцедуры

&НаКлиенте
Процедура КодТелефонаИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если СтрДлина(СокрЛП(Текст)) = СтрДлина(СтруктураМаски.КодТелефона) Тогда
		ТекущийЭлемент = Элементы.НомерТелефонаЧасть1;
	КонецЕсли; 
	
	АктивироватьКнопкуОтправитьСМС(); 
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаЧасть1ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если СтрДлина(СокрЛП(Текст)) = СтрДлина(СтруктураМаски.НомерТелефонаЧасть1) Тогда
		ТекущийЭлемент = Элементы.НомерТелефонаЧасть2;
	КонецЕсли;
	
	АктивироватьКнопкуОтправитьСМС();
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаЧасть2ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Если СтрДлина(СокрЛП(Текст)) = СтрДлина(СтруктураМаски.НомерТелефонаЧасть2) Тогда
		ТекущийЭлемент = Элементы.НомерТелефонаЧасть3;
	КонецЕсли;
	
	АктивироватьКнопкуОтправитьСМС();
	
КонецПроцедуры

&НаКлиенте
Процедура КодСтраныИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	АктивироватьКнопкуОтправитьСМС();
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаЧасть3ПриИзменении(Элемент)
	АктивироватьКнопкуОтправитьСМС();
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаЧасть3ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	АктивироватьКнопкуОтправитьСМС();
КонецПроцедуры

&НаКлиенте
Процедура ПолПриИзменении(Элемент)
	ОбновитьЦветТекстаПол();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПодключаемогоОборудования

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		
		ПараметрыИнформации = maxma_ИнтеграцияССервисомВызовСервера.ПолучитьСтруктуруВыводимойВРМКИнформации();
		ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'При подключении оборудования произошла ошибка:'");
		ПараметрыИнформации.ТекстИнформации     = РезультатВыполнения.ОписаниеОшибки;
		
		maxma_ИнтеграцияССервисомКлиент.ОткрытьФормуИнформации(ПараметрыИнформации);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоискШтрихкода(Штрихкод)
	
	Если НЕ ЗначениеЗаполнено(Штрихкод) Тогда
		Возврат;
	КонецЕсли;

	ВводимоеЧисло = Штрихкод;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПоискМагнитнойКарты(МагнитныйКод)
	
	Если НЕ ЗначениеЗаполнено(МагнитныйКод) Тогда
		Возврат;
	КонецЕсли;

	ВводимоеЧисло = МагнитныйКод;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ОбновитьИнформациюОКлиенте(ДополнительныеПараметры)
		
	Если НЕ ДополнительныеПараметры.СетеваяОшибка Тогда
		
		Если ОбновитьИнформациюОКлиентеНаСервере(ДополнительныеПараметры) Тогда
			
			ДополнительныеПараметры.Вставить("РежимПоиска", РежимПоискаКартыСтрока);
			
			Если РежимПоискаКартыСтрока = "НомерТелефона" Тогда
				ДополнительныеПараметры.Вставить("НомерКартыТелефон", МобильныйТелефон);
			ИначеЕсли РежимПоискаКартыСтрока = "КодКарты" Тогда
				ДополнительныеПараметры.Вставить("НомерКартыТелефон", ВводимоеЧисло);
			КонецЕсли;
								
			ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуИнформацииРедактированиеКартыЛояльности", ЭтотОбъект, ДополнительныеПараметры);
			
			maxma_ИнтеграцияССервисомКлиент.ОткрытьФормуИнформации(ДополнительныеПараметры, ОбработчикОповещения);
			
		Иначе
			
			Если ДополнительныеПараметры.СетеваяОшибка = Ложь Тогда
				maxma_ИнтеграцияССервисомКлиент.ОткрытьФормуИнформации(ДополнительныеПараметры);	
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ОповещениеОткрытьФормуИнформацииРедактированиеКартыЛояльности(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт

	Оповестить("ОтредактированаКартаЛояльности", ДополнительныеПараметры, ЭтотОбъект);
	
	Закрыть(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Функция КартаЛояльностиСуществует(ДополнительныеПараметры)
	
	ШаблонСообщения = Нстр("ru = '%1 %2.'");
	
	Результат = Ложь;
	
	Если ПолучитьБалансНаСервереРедактированиеКарты(РежимПоискаКартыСтрока, НомерКартыТелефон, ДополнительныеПараметры) Тогда
		
		Если РежимПоискаКартыСтрока = "НомерТелефона" Тогда
			ЧастьШаблона = НСтр("ru = 'номеру телефона'");
		ИначеЕсли РежимПоискаКартыСтрока = "КодКарты" Тогда
			ЧастьШаблона = НСтр("ru = 'номеру карты'");
		КонецЕсли;

		ДополнительныеПараметры.Вставить("ЗаголовокИнформации", НСтр("ru = 'Редактирование карты лояльности'"));
		ДополнительныеПараметры.Вставить("ТекстИнформации"	  , СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения,
																	НСтр("ru = 'Уже существует карта лояльности, привязанная к введенному'"), 
																	ЧастьШаблона));
	
		maxma_ИнтеграцияССервисомКлиент.ОткрытьФормуИнформации(ДополнительныеПараметры);
		
		Результат = Истина;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьЦифру(ВведеннаяЦифраСтрокой)	
	
	ТекущийЭлемент = Элементы.ГруппаСтраницаОсновная;
	
	Если ПервыйВвод Тогда
		ВводимоеЧисло 		= "";
		КодТелефона 		= "";
		НомерТелефонаЧасть1 = "";
		НомерТелефонаЧасть2 = "";
		НомерТелефонаЧасть3 = "";
		ПервыйВвод 			= Ложь;
	КонецЕсли;
	
	Если РежимПоискаКарты = 1 Тогда
		
		Если СтрДлина(КодТелефона) = СтрДлина(СтруктураМаски.КодТелефона) Тогда
			
			Если СтрДлина(НомерТелефонаЧасть1) = СтрДлина(СтруктураМаски.НомерТелефонаЧасть1) Тогда
				
				Если СтрДлина(НомерТелефонаЧасть2) = СтрДлина(СтруктураМаски.НомерТелефонаЧасть2) Тогда
					НомерТелефонаЧасть3 = НомерТелефонаЧасть3 + ВведеннаяЦифраСтрокой;
					Если СтрДлина(НомерТелефонаЧасть3) = СтрДлина(СтруктураМаски.НомерТелефонаЧасть3) Тогда
						ТекущийЭлемент = Элементы.КомандаEnterПраваяКлавиатура;
					КонецЕсли;
				Иначе
					НомерТелефонаЧасть2 = НомерТелефонаЧасть2 + ВведеннаяЦифраСтрокой;
				КонецЕсли;
				
			Иначе
				НомерТелефонаЧасть1 = НомерТелефонаЧасть1 + ВведеннаяЦифраСтрокой;
			КонецЕсли;
			
		Иначе
			КодТелефона = КодТелефона + ВведеннаяЦифраСтрокой;
		КонецЕсли;
		
		ВводимоеЧисло = КодСтраны + КодТелефона + НомерТелефонаЧасть1 + НомерТелефонаЧасть2 + НомерТелефонаЧасть3;

	Иначе
		ВводимоеЧисло = ВводимоеЧисло + ВведеннаяЦифраСтрокой;
	КонецЕсли;

	ТекущийЭлемент = Элементы.ГруппаСтраницаОсновная;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСПередачейРезультата()
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("ВведенноеЧисло", ВводимоеЧисло);
	Если РежимПоискаКарты = 1 Тогда
		СтруктураОтвета.Вставить("РежимПоискаКарты", "НомерТелефона");
	ИначеЕсли РежимПоискаКарты = 2 Тогда
		СтруктураОтвета.Вставить("РежимПоискаКарты", "ФИО");
	ИначеЕсли РежимПоискаКарты = 3 Тогда
		СтруктураОтвета.Вставить("РежимПоискаКарты", "Email");
	Иначе
		СтруктураОтвета.Вставить("РежимПоискаКарты", "КодКарты");
	КонецЕсли;
	
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФокусВвода()
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаПраваяКлавиатура;
	Если РежимПоискаКарты =1 Тогда
		ТекущийЭлемент = Элементы.Команда9ПраваяКлавиатура;
		Элементы.СтраницыВвода.ТекущаяСтраница = Элементы.СтраницаТелефон;
	Иначе
		Элементы.СтраницыВвода.ТекущаяСтраница = Элементы.СтраницаВводимоеЧисло;
		ТекущийЭлемент = Элементы.ПолеВводимоеЧисло;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаТипПоиска(Команда)
	
	КомандаСтереть(Неопределено);
	Если РежимПоискаКарты >= 3 Тогда
		РежимПоискаКарты = 0;
	Иначе
		РежимПоискаКарты = РежимПоискаКарты + 1;
	КонецЕсли;
	
	УстановитьФокусВвода();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЦветТекстаПол()
	
	Если Не ЗначениеЗаполнено(Пол) Тогда
		Элементы.Пол.ЦветТекста = WebЦвета.Красный;
	Иначе
		Элементы.Пол.ЦветТекста = Новый Цвет();
	КонецЕсли;
	
КонецПроцедуры
 
&НаКлиенте
Функция ПроверкаЗаполнения()
	
	ОчиститьСообщения();

	НомерКарты = ВводимоеЧисло;
	
	МобильныйТелефонБезКодаСтраны = КодТелефона + НомерТелефонаЧасть1 + НомерТелефонаЧасть2 + НомерТелефонаЧасть3;	
	МобильныйТелефон			  = КодСтраны + МобильныйТелефонБезКодаСтраны;	
	
	ФИО = "";
	
	Если ЗначениеЗаполнено(Имя) Тогда
		ФИО = ФИО + Имя;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Отчество) Тогда
		ФИО = ФИО + " " + Отчество;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Фамилия) Тогда
		ФИО = ФИО + " " + Фамилия;
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru = 'Не заполнены обязательные поля: ""%1"".'");
	
	Поля = "";
	
	Если ВыдачаЗаменаКарты_ОбязательныеПоля.Количество() Тогда
		
		Для Каждого ЭлементМассива Из ВыдачаЗаменаКарты_ОбязательныеПоля Цикл
			
			Если ЭлементМассива.Значение = "ПодтверждениеПоСМС" 
				ИЛИ ЭлементМассива.Значение = "СогласенНаРассылку" Тогда
				
				Если ЭтотОбъект[ЭлементМассива.Значение] = Ложь Тогда
					Поля = Поля + "," + ЭлементМассива.Значение;
				КонецЕсли;
				
			ИначеЕсли ЭлементМассива.Значение = "МобильныйТелефон" Тогда
				
				Если НЕ ЗначениеЗаполнено(ЭтотОбъект["МобильныйТелефонБезКодаСтраны"]) Тогда
					Поля = Поля + "," + ЭлементМассива.Значение;
				КонецЕсли;
				
			Иначе
				
				Если НЕ ЗначениеЗаполнено(ЭтотОбъект[ЭлементМассива.Значение]) Тогда
					Поля = Поля + "," + ЭлементМассива.Значение;
				КонецЕсли;
				
			КонецЕсли;	
			
		КонецЦикла;
		
	КонецЕсли;
	
	Поля = Сред(Поля, 2);
	
	Если ЗначениеЗаполнено(Поля) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, Поля));
		Возврат Ложь;
	КонецЕсли;
	
	ПараметрыИнформации = maxma_ИнтеграцияССервисомВызовСервера.ПолучитьСтруктуруВыводимойВРМКИнформации();
	
	// Проверка считанных данных
	Если ЗначениеЗаполнено(МобильныйТелефонБезКодаСтраны) И НЕ ДанныеКорректны(МобильныйТелефон, Истина) Тогда
		
		ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Введен некорректный номер телефона'");
		ПараметрыИнформации.ТекстИнформации 	= МобильныйТелефон;
		
		maxma_ИнтеграцияССервисомКлиент.ОткрытьФормуИнформации(ПараметрыИнформации);
				
		Возврат Ложь;
		
	КонецЕсли;
	
	// Проверка считанных данных
	Если ЗначениеЗаполнено(НомерКарты) И НЕ ДанныеКорректны(НомерКарты) Тогда
		
		ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Введен некорректный номер карты'");
		ПараметрыИнформации.ТекстИнформации 	= НомерКарты;
		
		maxma_ИнтеграцияССервисомКлиент.ОткрытьФормуИнформации(ПараметрыИнформации);
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Email) Тогда
		
		Если Не ОбщегоНазначенияКлиентСервер.АдресЭлектроннойПочтыСоответствуетТребованиям(Email) Тогда
			
			ТекстОшибки = НСтр("ru = 'Необходимо ввести корректный адрес электронной почты.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибки);
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	ОбновитьЦветТекстаПол(); 
	
	Элементы.СогласенНаРассылку.Доступность = Истина;
	Элементы.ВыдатьКарту.Доступность 		= Истина;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция СоздатьБонусныйСчетНаСервере(ДополнительныеПараметры)
	
	ПараметрыКлиента = Новый Структура;
	
	Если ЗначениеЗаполнено(МобильныйТелефонБезКодаСтраны) Тогда
		ПараметрыКлиента.Вставить("phoneNumber", МобильныйТелефон);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НомерКарты) Тогда
		ПараметрыКлиента.Вставить("card", НомерКарты);
	КонецЕсли;
	
	ФИО = maxma_ИнтеграцияССервисомВызовСервера.ПолучитьФИО(Имя, Фамилия, Отчество);
	
	Если ЗначениеЗаполнено(ФИО) Тогда
		ПараметрыКлиента.Вставить("fullName", ФИО);
		Если ЗначениеЗаполнено(Имя) Тогда
			ПараметрыКлиента.Вставить("name", Имя);
		КонецЕсли;
		Если ЗначениеЗаполнено(Отчество) Тогда
			ПараметрыКлиента.Вставить("patronymicName", Отчество);
		КонецЕсли;
		Если ЗначениеЗаполнено(Фамилия) Тогда
			ПараметрыКлиента.Вставить("surname", Фамилия);
		КонецЕсли;
	КонецЕсли;
	
	ПараметрыКлиента.Вставить("gender", Пол);
	
	Если ЗначениеЗаполнено(ДатаРождения) Тогда
		ПараметрыКлиента.Вставить("birthdate", ДатаРождения);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(email) Тогда
		ПараметрыКлиента.Вставить("email", email);
	КонецЕсли;
	
	ПараметрыКлиента.Вставить("isEmailSubscribed", СогласенНаРассылку);
	ПараметрыКлиента.Вставить("isPhoneSubscribed", СогласенНаРассылку);
	
	ПараметрыМагазина = Новый Структура;
	ПараметрыМагазина.Вставить("code", XMLСтрока(НастройкиМодуля.Магазин));
	ПараметрыМагазина.Вставить("name", Строка(НастройкиМодуля.Магазин));
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("client", ПараметрыКлиента);
	ПараметрыЗапроса.Вставить("shop",   ПараметрыМагазина);
	
	МетодNewClient = maxma_ИнтеграцияССервисомВызовСервера.МетодNewClient();
	
	ОтветСервера = maxma_ИнтеграцияССервисомВызовСервера.ОтветСервера(ПараметрыЗапроса, МетодNewClient, НастройкиМодуля);
	
	maxma_ИнтеграцияССервисомВызовСервера.ДополнитьДанныеКлиента(ОтветСервера);
	
	ТекстИнформации = "";
	ДисконтнаяКартаСсылка = Справочники.ДисконтныеКарты.ПустаяСсылка();
	
	Если ОтветСервера.ЕстьОшибки И ОтветСервера.Свойство("ТекстОшибки", ТекстИнформации) Тогда
		
		Результат = Ложь;
		
		maxma_ИнтеграцияССервисомВызовСервера.ЗаписатьДанныеВЖурналРегистрации(ТекстИнформации, УровеньЖурналаРегистрации.Ошибка);
		
	Иначе
		
		Результат = Истина;
		
		ДополнительныеПараметры.Вставить("Клиент", ОтветСервера.Данные.client);
		
		Если НастройкиМодуля.ДублироватьКлиентовВ1С Тогда
			
			Попытка
				
				НачатьТранзакцию();
				
				РеквизитыКлиента = Новый Структура();
				РеквизитыКлиента.Вставить("ФИО", 			  	 maxma_ИнтеграцияССервисомВызовСервера.ПолучитьФИО(Имя, Фамилия, Отчество));
				РеквизитыКлиента.Вставить("Фамилия", 		  	 Фамилия);
				РеквизитыКлиента.Вставить("Имя", 			  	 Имя);
				РеквизитыКлиента.Вставить("Отчество", 		  	 Отчество);
				РеквизитыКлиента.Вставить("КодСтраны", 			 КодСтраны);
				РеквизитыКлиента.Вставить("КодТелефона", 		 КодТелефона);
				РеквизитыКлиента.Вставить("НомерТелефонаЧасть1", НомерТелефонаЧасть1);
				РеквизитыКлиента.Вставить("НомерТелефонаЧасть2", НомерТелефонаЧасть2);
				РеквизитыКлиента.Вставить("НомерТелефонаЧасть3", НомерТелефонаЧасть3);
				РеквизитыКлиента.Вставить("НомерКарты", 	  	 НомерКарты);
				РеквизитыКлиента.Вставить("Email", 			  	 Email);
				РеквизитыКлиента.Вставить("ДатаРождения",     	 ДатаРождения);
				РеквизитыКлиента.Вставить("Пол", 			  	 Пол);
				
				ВладелецКартыСсылка   = maxma_ИнтеграцияССервисомВызовСервера.НайтиОбновитьКонтактноеЛицоВ1С(РеквизитыКлиента);
				ДисконтнаяКартаСсылка = maxma_ИнтеграцияССервисомВызовСервера.НайтиОбновитьИнформационнуюКартуВ1С(ВладелецКартыСсылка, НомерКарты);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ДополнительныеПараметры.Вставить("ЗаголовокИнформации", НСтр("ru = 'Не удалось создать бонусную карту в 1С'"));
				ТекстИнформации     = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				
			КонецПопытки;
			
		Иначе
			ДисконтнаяКартаСсылка = Справочники.ДисконтныеКарты.ПолучитьСсылку(Новый УникальныйИдентификатор(НастройкиМодуля.ДисконтнаяКартаИдентификатор));
		КонецЕсли;
		
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("ДисконтнаяКарта", ДисконтнаяКартаСсылка);
	ДополнительныеПараметры.Вставить("СетеваяОшибка", ОтветСервера.СетеваяОшибка);
	ДополнительныеПараметры.Вставить("ТекстИнформации", ТекстИнформации);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОбновитьИнформациюОКлиентеНаСервере(ДополнительныеПараметры)
	
	Результат 			  = Ложь;
	ДисконтнаяКартаСсылка = Справочники.ДисконтныеКарты.ПустаяСсылка();
	ЗаголовокИнформации   = "";
	ТекстИнформации 	  = "";
	ПараметрыЗапроса 	  = Новый Структура;
	
	Если ЗначениеЗаполнено(РеквизитыКлиентаДо.МобильныйТелефонДо) Тогда
		ПараметрыЗапроса.Вставить("phoneNumber", РеквизитыКлиентаДо.МобильныйТелефонДо);
	ИначеЕсли ЗначениеЗаполнено(РеквизитыКлиентаДо.НомерКартыДо) Тогда
		ПараметрыЗапроса.Вставить("card", РеквизитыКлиентаДо.НомерКартыДо);
	Иначе
		Возврат Результат;
	КонецЕсли;
			
	ОбновляемыеПоля = Новый Структура;
	
	Если НЕ МобильныйТелефонБезКодаСтраны = РеквизитыКлиентаДо.МобильныйТелефонДо Тогда
		ОбновляемыеПоля.Вставить("phoneNumber", МобильныйТелефон);	
	КонецЕсли;

	Если НЕ НомерКарты = РеквизитыКлиентаДо.НомерКартыДо Тогда
		ОбновляемыеПоля.Вставить("card", НомерКарты);	
	КонецЕсли;
	
	ОбновляемыеПоля.Вставить("name", Имя);
	ОбновляемыеПоля.Вставить("surname", Фамилия);
	ОбновляемыеПоля.Вставить("patronymicName", Отчество);
	
	ОбновляемыеПоля.Вставить("gender", Пол);
	
	Если НЕ ДатаРождения = РеквизитыКлиентаДо.ДатаРожденияДо Тогда
		ОбновляемыеПоля.Вставить("birthdate", ДатаРождения);
	КонецЕсли;

	Если НЕ email = РеквизитыКлиентаДо.emailДо Тогда
		ОбновляемыеПоля.Вставить("email", email);
	КонецЕсли;

	ОбновляемыеПоля.Вставить("isEmailSubscribed", СогласенНаРассылку);
	ОбновляемыеПоля.Вставить("isPhoneSubscribed", СогласенНаРассылку);

	ПараметрыЗапроса.Вставить("client", ОбновляемыеПоля);
	
	МетодUpdateClient = maxma_ИнтеграцияССервисомВызовСервера.МетодUpdateClient();
	
	ОтветСервера = maxma_ИнтеграцияССервисомВызовСервера.ОтветСервера(ПараметрыЗапроса, МетодUpdateClient, НастройкиМодуля);
	
	maxma_ИнтеграцияССервисомВызовСервера.ДополнитьДанныеКлиента(ОтветСервера);
		
	Если ОтветСервера.ЕстьОшибки И ОтветСервера.Свойство("ТекстОшибки", ТекстИнформации) Тогда
		maxma_ИнтеграцияССервисомВызовСервера.ЗаписатьДанныеВЖурналРегистрации(ТекстИнформации, УровеньЖурналаРегистрации.Ошибка);
	Иначе
		
		ДополнительныеПараметры.Вставить("Клиент", ОтветСервера.Данные.client);
		
		Результат = Истина;
		
		ЗаголовокИнформации	= НСтр("ru = 'Редактирование карты лояльности'");
		ТекстИнформации	  	= НСтр("ru = 'Карта лояльности успешно отредактирована'");
		
		Если НастройкиМодуля.ДублироватьКлиентовВ1С Тогда
			
			Попытка
				
				НачатьТранзакцию();
				
				РеквизитыНовые = Новый Структура();
				РеквизитыНовые.Вставить("ФИО", 			  	   maxma_ИнтеграцияССервисомВызовСервера.ПолучитьФИО(Имя, Фамилия, Отчество));
				РеквизитыНовые.Вставить("Фамилия", 		  	   Фамилия);
				РеквизитыНовые.Вставить("Имя", 			  	   Имя);
				РеквизитыНовые.Вставить("Отчество", 		   Отчество);
				РеквизитыНовые.Вставить("КодСтраны", 		   КодСтраны);
				РеквизитыНовые.Вставить("КодТелефона", 		   КодТелефона);
				РеквизитыНовые.Вставить("НомерТелефонаЧасть1", НомерТелефонаЧасть1);
				РеквизитыНовые.Вставить("НомерТелефонаЧасть2", НомерТелефонаЧасть2);
				РеквизитыНовые.Вставить("НомерТелефонаЧасть3", НомерТелефонаЧасть3);
				РеквизитыНовые.Вставить("НомерКарты", 	  	   НомерКарты);
				РеквизитыНовые.Вставить("Email", 			   Email);
				РеквизитыНовые.Вставить("ДатаРождения",        ДатаРождения);
				РеквизитыНовые.Вставить("Пол", 			  	   Пол);
				
				РеквизитыСтарые = Новый Структура();
				РеквизитыСтарые.Вставить("ФИО", 			    maxma_ИнтеграцияССервисомВызовСервера.ПолучитьФИО(РеквизитыКлиентаДо.ИмяДо, РеквизитыКлиентаДо.ФамилияДо, РеквизитыКлиентаДо.ОтчествоДо));
				РеквизитыСтарые.Вставить("Фамилия", 		  	РеквизитыКлиентаДо.ФамилияДо);
				РеквизитыСтарые.Вставить("Имя", 			  	РеквизитыКлиентаДо.ИмяДо);
				РеквизитыСтарые.Вставить("Отчество", 		    РеквизитыКлиентаДо.ОтчествоДо);
				РеквизитыСтарые.Вставить("КодСтраны", 		    РеквизитыКлиентаДо.КодСтраны);
				РеквизитыСтарые.Вставить("КодТелефона", 		РеквизитыКлиентаДо.КодТелефона);
				РеквизитыСтарые.Вставить("НомерТелефонаЧасть1", РеквизитыКлиентаДо.НомерТелефонаЧасть1);
				РеквизитыСтарые.Вставить("НомерТелефонаЧасть2", РеквизитыКлиентаДо.НомерТелефонаЧасть2);
				РеквизитыСтарые.Вставить("НомерТелефонаЧасть3", РеквизитыКлиентаДо.НомерТелефонаЧасть3);
				РеквизитыСтарые.Вставить("НомерКарты", 	  	    РеквизитыКлиентаДо.НомерКартыДо);
				РеквизитыСтарые.Вставить("Email", 			    РеквизитыКлиентаДо.EmailДо);
				РеквизитыСтарые.Вставить("ДатаРождения",        РеквизитыКлиентаДо.ДатаРожденияДо);
				РеквизитыСтарые.Вставить("Пол", 			  	РеквизитыКлиентаДо.ПолДо);	
				
				ВладелецКартыСсылка   = maxma_ИнтеграцияССервисомВызовСервера.НайтиОбновитьКонтактноеЛицоВ1С(РеквизитыНовые, РеквизитыСтарые);
				ДисконтнаяКартаСсылка = maxma_ИнтеграцияССервисомВызовСервера.НайтиОбновитьИнформационнуюКартуВ1С(ВладелецКартыСсылка, НомерКарты);
				
				ЗафиксироватьТранзакцию();
				
			Исключение
				
				ОтменитьТранзакцию();
				
				ЗаголовокИнформации = НСтр("ru = 'Не удалось обновить бонусную карту в 1С'");
				ТекстИнформации		= ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
				
			КонецПопытки;
			
		Иначе
			ДисконтнаяКартаСсылка = Справочники.ДисконтныеКарты.ПолучитьСсылку(Новый УникальныйИдентификатор(НастройкиМодуля.ДисконтнаяКартаИдентификатор));
		КонецЕсли;
		
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("СетеваяОшибка", 		ОтветСервера.СетеваяОшибка);
	ДополнительныеПараметры.Вставить("ЗаголовокИнформации", ЗаголовокИнформации);
	ДополнительныеПараметры.Вставить("ТекстИнформации", 	ТекстИнформации);
	ДополнительныеПараметры.Вставить("ДисконтнаяКарта",		ДисконтнаяКартаСсылка);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОповещениеОткрытьФормуИнформацииВыдачаКартыЛояльности(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
		
	Оповестить("ВыданаКартаЛояльности", ДополнительныеПараметры, ЭтотОбъект);
		
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Функция ДанныеКорректны(Данные, ЭтоТелефон = Ложь)
	
	Если Не ЗначениеЗаполнено(Данные) Тогда
		Возврат Ложь
	КонецЕсли;
	
	ДлинаСтроки = СтрДлина(Данные);
	
	Если ЭтоТелефон Тогда
		Если НЕ ДлинаСтроки = СтрДлина(КодСтраны + СтруктураМаски.КодТелефона + СтруктураМаски.НомерТелефонаЧасть1 + СтруктураМаски.НомерТелефонаЧасть2 + СтруктураМаски.НомерТелефонаЧасть3) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаСимволовЦифр = "1234567890";
	Для Индекс = 1 По 10 Цикл
		Символ = Сред(Данные, Индекс, 1);
		Если Найти(СтрокаСимволовЦифр, Символ) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаСервере
Функция ПолучитьБалансНаСервереВыдачаКарты(РежимПоискаКарты, ВведенныеДанные, ДополнительныеПараметры)
		
	Результат 			= Ложь;
	ЗаголовокИнформации = "";
	ТекстИнформации 	= "";
	
	ПараметрыЗапроса = Новый Структура;
	
	Если РежимПоискаКарты = "НомерТелефона" Тогда
		ПараметрыЗапроса.Вставить("phoneNumber", ВведенныеДанные);
	ИначеЕсли РежимПоискаКарты = "КодКарты" Тогда 
		ПараметрыЗапроса.Вставить("card", ВведенныеДанные);
	КонецЕсли; 
	
	МетодGetBalance = maxma_ИнтеграцияССервисомВызовСервера.МетодGetBalance();
	
	ОтветСервера = maxma_ИнтеграцияССервисомВызовСервера.ОтветСервера(ПараметрыЗапроса, МетодGetBalance, НастройкиМодуля);
	
	maxma_ИнтеграцияССервисомВызовСервера.ДополнитьДанныеКлиента(ОтветСервера);
		
	Если ОтветСервера.ЕстьОшибки И ОтветСервера.Свойство("ТекстОшибки", ТекстИнформации) Тогда
		maxma_ИнтеграцияССервисомВызовСервера.ЗаписатьДанныеВЖурналРегистрации(ТекстИнформации, УровеньЖурналаРегистрации.Ошибка);
	Иначе	
		Результат = Истина;	
	КонецЕсли;
		
	ДополнительныеПараметры.Вставить("СетеваяОшибка"	  , ОтветСервера.СетеваяОшибка);
	ДополнительныеПараметры.Вставить("ЗаголовокИнформации", ЗаголовокИнформации);
	ДополнительныеПараметры.Вставить("ТекстИнформации"	  , ТекстИнформации);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьБалансНаСервереРедактированиеКарты(РежимПоискаКартыСтрока, ВведенныеДанные, ДополнительныеПараметры, ПриОткрытии = Ложь)
		
	Результат 			= Ложь;
	ЗаголовокИнформации = "";
	ТекстИнформации 	= "";
		
	ПараметрыЗапроса = Новый Структура;
	
	Если РежимПоискаКартыСтрока = "НомерТелефона" Тогда
		ПараметрыЗапроса.Вставить("phoneNumber", ВведенныеДанные);
	ИначеЕсли РежимПоискаКартыСтрока = "КодКарты" Тогда 
		ПараметрыЗапроса.Вставить("card", ВведенныеДанные);
	КонецЕсли; 
	
	МетодGetBalance = maxma_ИнтеграцияССервисомВызовСервера.МетодGetBalance();
	
	ОтветСервера = maxma_ИнтеграцияССервисомВызовСервера.ОтветСервера(ПараметрыЗапроса, МетодGetBalance, НастройкиМодуля);
	
	maxma_ИнтеграцияССервисомВызовСервера.ДополнитьДанныеКлиента(ОтветСервера);
		
	Если ОтветСервера.ЕстьОшибки И ОтветСервера.Свойство("ТекстОшибки", ТекстИнформации) Тогда
		maxma_ИнтеграцияССервисомВызовСервера.ЗаписатьДанныеВЖурналРегистрации(ТекстИнформации, УровеньЖурналаРегистрации.Ошибка);
	Иначе
		
		Результат = Истина;
		
		Если ПриОткрытии Тогда
			
			Если ОтветСервера.Данные.client.Свойство("name") Тогда
				Имя = ОтветСервера.Данные.client.name;
				РеквизитыКлиентаДо.Вставить("ИмяДо", Имя);
			Иначе
				Имя = "";
			КонецЕсли;
			
			Если ОтветСервера.Данные.client.Свойство("surname") Тогда
				Фамилия = ОтветСервера.Данные.client.surname;
				РеквизитыКлиентаДо.Вставить("ФамилияДо", Фамилия);
			Иначе
				Фамилия = "";
			КонецЕсли;
			
			Если ОтветСервера.Данные.client.Свойство("patronymicName") Тогда
				Отчество = ОтветСервера.Данные.client.patronymicName;
				РеквизитыКлиентаДо.Вставить("ОтчествоДо", Отчество);
			Иначе
				Отчество = "";
			КонецЕсли;
			
			Если ОтветСервера.Данные.client.Свойство("phoneNumber") Тогда
				
				МобильныйТелефон = СтрЗаменить(СокрЛП(ОтветСервера.Данные.client.phoneNumber), "+", "");
				
				ЗаполнитьЗначенияСвойств(ЭтотОбъект, maxma_ИнтеграцияССервисомВызовСервера.РаспарситьНомерТелефона(МобильныйТелефон, КодСтраны));
				
				РеквизитыКлиентаДо.Вставить("МобильныйТелефонДо",  МобильныйТелефонБезКодаСтраны);
				РеквизитыКлиентаДо.Вставить("КодСтраны", 		   КодСтраны);
				РеквизитыКлиентаДо.Вставить("КодТелефона"	  	 , КодТелефона);
				РеквизитыКлиентаДо.Вставить("НомерТелефонаЧасть1", НомерТелефонаЧасть1);
				РеквизитыКлиентаДо.Вставить("НомерТелефонаЧасть2", НомерТелефонаЧасть2);
				РеквизитыКлиентаДо.Вставить("НомерТелефонаЧасть3", НомерТелефонаЧасть3);
				
			Иначе
				МобильныйТелефон = "";
			КонецЕсли;
			
			Если ОтветСервера.Данные.client.Свойство("cardString") Тогда
				НомерКарты = Формат(ОтветСервера.Данные.client.cardString, "ЧГ=");
				ВводимоеЧисло = НомерКарты;
				РеквизитыКлиентаДо.Вставить("НомерКартыДо", НомерКарты);
			Иначе
				НомерКарты = "";
			КонецЕсли;
			
			Если ОтветСервера.Данные.client.Свойство("gender") Тогда
				Пол = ОтветСервера.Данные.client.gender;
				РеквизитыКлиентаДо.Вставить("ПолДо", Пол);
			КонецЕсли;
			
			Если ОтветСервера.Данные.client.Свойство("birthdate") Тогда
				ДатаРождения = Дата(СтрЗаменить(ОтветСервера.Данные.client.birthdate, "-", ""));
				РеквизитыКлиентаДо.Вставить("ДатаРожденияДо", ДатаРождения);
			КонецЕсли;
			
			Если ОтветСервера.Данные.client.Свойство("email") Тогда
				email = ОтветСервера.Данные.client.email;
				РеквизитыКлиентаДо.Вставить("emailДо", email);
			КонецЕсли;
			
			Если ОтветСервера.Данные.client.Свойство("isEmailSubscribed") Тогда
				СогласенНаРассылку = ОтветСервера.Данные.client.isEmailSubscribed;
				РеквизитыКлиентаДо.Вставить("СогласенНаРассылкуДо", СогласенНаРассылку);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("СетеваяОшибка"	  , ОтветСервера.СетеваяОшибка);
	ДополнительныеПараметры.Вставить("ЗаголовокИнформации", ЗаголовокИнформации);
	ДополнительныеПараметры.Вставить("ТекстИнформации"	  , ТекстИнформации);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ТаймерОтправкиСМС()
	
	ОставшеесяВремя = Макс(ВремяПовторнойОтправкиСМСКода-ТекущаяДата(), 0);
	Если ОставшеесяВремя <= 0 Тогда
		ОтключитьОбработчикОжидания("ТаймерОтправкиСМС");
		НадписьПовторитьОтправку = "";
		Элементы.ОтправитьКодСМС.Доступность = Истина;
		Элементы.СтраницаТелефон.Доступность = Истина;		
		Элементы.ОтправитьКодСМС.Заголовок = "Отправить код СМС";
		Возврат;
	КонецЕсли; 
	
	НадписьПовторитьОтправку = "Повторить отправку через "+ОставшеесяВремя+" сек.";
		
КонецПроцедуры
 
&НаСервере
Функция ОтправитьКодСМСНаСервере(НомерТелефона, ДополнительныеПараметры)
	
	Результат 			= Ложь;
	ЗаголовокИнформации = "";
	ТекстИнформации 	= "";
	
	ПараметрыЗапроса = Новый Структура;
	
	Если Операция = "ВыдачаКарты" Тогда
		ПараметрыЗапроса.Вставить("isAnonymousClient", Истина);
		ПараметрыЗапроса.Вставить("to"		 		 , НомерТелефона);
	ИначеЕсли Операция = "РедактированиеКарты" Тогда
		
		Если ЗначениеЗаполнено(РеквизитыКлиентаДо.МобильныйТелефонДо) Тогда
			ПараметрыЗапроса.Вставить("phoneNumber", РеквизитыКлиентаДо.МобильныйТелефонДо);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(РеквизитыКлиентаДо.НомерКартыДо) Тогда
			ПараметрыЗапроса.Вставить("card", РеквизитыКлиентаДо.НомерКартыДо);
		КонецЕсли;
		
		ПараметрыЗапроса.Вставить("to", НомерТелефона);
		
	КонецЕсли;
	
	МетодSendConfirmationCode = maxma_ИнтеграцияССервисомВызовСервера.МетодSendConfirmationCode();
	
	ОтветСервера = maxma_ИнтеграцияССервисомВызовСервера.ОтветСервера(ПараметрыЗапроса, МетодSendConfirmationCode, НастройкиМодуля);
		
	Если ОтветСервера.ЕстьОшибки И ОтветСервера.Свойство("ТекстОшибки", ТекстИнформации) Тогда
		maxma_ИнтеграцияССервисомВызовСервера.ЗаписатьДанныеВЖурналРегистрации(ТекстИнформации, УровеньЖурналаРегистрации.Ошибка);
	Иначе
		Результат 		 = Истина; 
		КодПодтверждения = ОтветСервера.Данные.code;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("СетеваяОшибка"	  , ОтветСервера.СетеваяОшибка);
	ДополнительныеПараметры.Вставить("ЗаголовокИнформации", ЗаголовокИнформации);
	ДополнительныеПараметры.Вставить("ТекстИнформации"	  , ТекстИнформации);
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Процедура НомерТелефонаЧасть3ИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	 АктивироватьКнопкуОтправитьСМС();
КонецПроцедуры
 
&НаКлиенте
Процедура АктивироватьКнопкуОтправитьСМС()
	Элементы.ОтправитьКодСМС.Доступность = ЗначениеЗаполнено(КодСтраны) И ЗначениеЗаполнено(КодТелефона) И ЗначениеЗаполнено(НомерТелефонаЧасть1) И ЗначениеЗаполнено(НомерТелефонаЧасть2) И ЗначениеЗаполнено(НомерТелефонаЧасть3); 
КонецПроцедуры    

#КонецОбласти