
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура БезПроверкиПриИзменении(Элемент)
	
	ПроверитьДублиШтрихКодов();
	УсловноеОформлениеТаблицыЗагрузки();

КонецПроцедуры

&НаКлиенте
Процедура ДозагрузкаПриИзменении(Элемент)
	
	ПроверитьДублиШтрихКодов();
	УсловноеОформлениеТаблицыЗагрузки();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ПрочитатьExcel(Команда)
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите файл";
	ПараметрыДиалога.Фильтр = "Таблица Excel | *.xls; *.xlsx";
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога);
	Если ОписаниеФайла <> Неопределено Тогда  
		Попытка
			ПрочитатьExcelНаСервере(ОписаниеФайла.Адрес, ОписаниеФайла.СсылкаНаФайл.Расширение);  
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось записать данные из файла по причине: " + ОписаниеОшибки();
			Сообщение.Сообщить();   
		КонецПопытки;
	КонецЕсли; 
	
	
	УсловноеОформлениеТаблицыЗагрузки(); 
КонецПроцедуры

// dimedrol 25.01.2025
&НаКлиенте
Асинх Процедура ПрочитатьExcelУниверсальныйФормат(Команда)
	
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок = "Выберите файл";
	ПараметрыДиалога.Фильтр = "Таблица Excel | *.xls; *.xlsx";
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,,ПараметрыДиалога);
	Если ОписаниеФайла <> Неопределено Тогда  
		Попытка
			ПрочитатьExcelУниверсальныйФорматНаСервере(ОписаниеФайла.Адрес, ОписаниеФайла.СсылкаНаФайл.Расширение);
		Исключение
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось записать данные из файла по причине: " + ОписаниеОшибки();
			Сообщение.Сообщить();   
		КонецПопытки;
	КонецЕсли;
	
	УсловноеОформлениеТаблицыЗагрузки();
	
КонецПроцедуры 
// end of dimedrol 25.01.2025

#КонецОбласти

#Область ПроцедурыЧтенияФайлаExcel  

&НаСервере
Процедура УсловноеОформлениеТаблицыЗагрузки() 
	
	Для каждого СтрокаОбъектТабличнаяЗагрузки Из Объект.ТабличнаяЗагрузки Цикл  
		Если ЗначениеЗаполнено(СтрокаОбъектТабличнаяЗагрузки.Артикль) И НЕ ЗначениеЗаполнено(СтрокаОбъектТабличнаяЗагрузки.Номенклатура) Тогда
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияНоменклатуры = Истина; 
		Иначе 
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияНоменклатуры = Ложь;
		КонецЕсли;
		
		// dimedrol 25.01.2025
		Если ТипЗнч(СтрокаОбъектТабличнаяЗагрузки.Производитель) <> Тип("СправочникСсылка.Контрагенты") // dimedrol 15.05.2025 вернул проверку на ссылку, переименовал реквизит, был "Призводитель"
			ИЛИ СтрокаОбъектТабличнаяЗагрузки.Производитель = Справочники.Контрагенты.ПустаяСсылка() Тогда // dimedrol 15.05.2025 вернул проверку на ссылку, переименовал реквизит, был "Призводитель"
		//Если НЕ ЗначениеЗаполнено(СтрокаОбъектТабличнаяЗагрузки.Призводитель) Тогда // dimedrol 15.05.2025 вернул проверку.
		// end of dimedrol 25.01.2025
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияПроизводитель = Истина;
		Иначе 
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияПроизводитель = Ложь;
		КонецЕсли;	
		
		Если ТипЗнч(СтрокаОбъектТабличнаяЗагрузки.СтранаПроисхождения) <> Тип("СправочникСсылка.СтраныМира") 
			ИЛИ СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияСтранаПроисхождения = Справочники.СтраныМира.ПустаяСсылка() Тогда
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияСтранаПроисхождения = Истина;
		Иначе 
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияСтранаПроисхождения = Ложь;
		КонецЕсли;	
		
		// dimedrol 03.02.2025
		Если ТипЗнч(СтрокаОбъектТабличнаяЗагрузки.Цвет1С) <> Тип("СправочникСсылка.спЦвета")
			ИЛИ СтрокаОбъектТабличнаяЗагрузки.Цвет1С = Справочники.спЦвета.ПустаяСсылка() Тогда
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияЦвет1С = Истина;
		Иначе
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияЦвет1С = Ложь;
		КонецЕсли;
		
		Если ТипЗнч(СтрокаОбъектТабличнаяЗагрузки.Размер1С) <> Тип("СправочникСсылка.спРазмеры")
			ИЛИ СтрокаОбъектТабличнаяЗагрузки.Размер1С = Справочники.спРазмеры.ПустаяСсылка() Тогда
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияРазмер1С = Истина;
		Иначе
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияРазмер1С = Ложь;
		КонецЕсли;
		// end of dimedrol 03.02.2025
		
		Если НЕ ЗначениеЗаполнено(СтрокаОбъектТабличнаяЗагрузки.Артикль) Тогда
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияАртикль = Истина;
		Иначе 
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияАртикль = Ложь;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(СтрокаОбъектТабличнаяЗагрузки.Описание) Тогда
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияОписание = Истина;
		Иначе 
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияОписание = Ложь;
		КонецЕсли;
		
		Если ТипЗнч(СтрокаОбъектТабличнаяЗагрузки.ВидНоменклатуры) <> Тип("СправочникСсылка.КатегорииНоменклатуры") 
			ИЛИ СтрокаОбъектТабличнаяЗагрузки.ВидНоменклатуры = Справочники.КатегорииНоменклатуры.ПустаяСсылка() Тогда
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияВидНоменклатуры = Истина;
		Иначе 
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияВидНоменклатуры = Ложь;
		КонецЕсли;	
		
				
		Если ТипЗнч(СтрокаОбъектТабличнаяЗагрузки.КодТНВЭД) <> Тип("СправочникСсылка.КлассификаторТНВЭД") 
			ИЛИ СтрокаОбъектТабличнаяЗагрузки.КодТНВЭД = Справочники.КлассификаторТНВЭД.ПустаяСсылка() Тогда
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияКодТНВЭД = Истина; 
		Иначе 
			СтрокаОбъектТабличнаяЗагрузки.ОшибкаЗаполненияКодТНВЭД = Ложь;
		КонецЕсли;

		
	КонецЦикла; 
	
	// Номенклатура
	ЭлементУОНоменклатура = УсловноеОформление.Элементы.Добавить();				
	ЭлементУОНоменклатура.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	ЭлементУОНоменклатура.Использование = Истина;
	
	ЭлементУсловия = ЭлементУОНоменклатура.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТабличнаяЗагрузки.ОшибкаЗаполненияНоменклатуры");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина; 

	ОформляемоеПоле = ЭлементУОНоменклатура.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТабличнаяЗагрузкиНоменклатура");
	ОформляемоеПоле.Использование = Истина;	

	// Производитель 	
	ЭлементУОПроизводитель = УсловноеОформление.Элементы.Добавить();				
	ЭлементУОПроизводитель.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	ЭлементУОПроизводитель.Использование = Истина;
	
	ЭлементУсловия = ЭлементУОПроизводитель.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТабличнаяЗагрузки.ОшибкаЗаполненияПроизводитель");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ОформляемоеПоле = ЭлементУОПроизводитель.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТабличнаяЗагрузкиПроизводитель");
	ОформляемоеПоле.Использование = Истина;	
	
	// Страна происхождения 	
	ЭлементУОСтранаПроисхождения = УсловноеОформление.Элементы.Добавить();				
	ЭлементУОСтранаПроисхождения.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	ЭлементУОСтранаПроисхождения.Использование = Истина;
	
	ЭлементУсловия = ЭлементУОСтранаПроисхождения.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТабличнаяЗагрузки.ОшибкаЗаполненияСтранаПроисхождения");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ОформляемоеПоле = ЭлементУОСтранаПроисхождения.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТабличнаяЗагрузкиСтранаПроисхождения");
	ОформляемоеПоле.Использование = Истина;   
	
	// Артикль 	
	ЭлементУОАртикль = УсловноеОформление.Элементы.Добавить();				
	ЭлементУОАртикль.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	ЭлементУОАртикль.Использование = Истина;
	
	ЭлементУсловия = ЭлементУОАртикль.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТабличнаяЗагрузки.ОшибкаЗаполненияАртикль");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ОформляемоеПоле = ЭлементУОАртикль.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТабличнаяЗагрузкиАртикль");
	ОформляемоеПоле.Использование = Истина;
	
	// Описание 	
	ЭлементУООписание = УсловноеОформление.Элементы.Добавить();				
	ЭлементУООписание.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	ЭлементУООписание.Использование = Истина;
	
	ЭлементУсловия = ЭлементУООписание.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТабличнаяЗагрузки.ОшибкаЗаполненияОписание");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ОформляемоеПоле = ЭлементУООписание.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТабличнаяЗагрузкиОписание");
	ОформляемоеПоле.Использование = Истина;  
	
    // Вид номенклатуры	
	ЭлементУОВидНоменклатуры = УсловноеОформление.Элементы.Добавить();				
	ЭлементУОВидНоменклатуры.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	ЭлементУОВидНоменклатуры.Использование = Истина;
	
	ЭлементУсловия = ЭлементУОВидНоменклатуры.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТабличнаяЗагрузки.ОшибкаЗаполненияВидНоменклатуры");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ОформляемоеПоле = ЭлементУОВидНоменклатуры.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТабличнаяЗагрузкиВидНоменклатуры");
	ОформляемоеПоле.Использование = Истина;

    // КодТНВЭД
    ЭлементУОКодТНВЭД = УсловноеОформление.Элементы.Добавить();				
	ЭлементУОКодТНВЭД.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	ЭлементУОКодТНВЭД.Использование = Истина;
	
	ЭлементУсловия = ЭлементУОКодТНВЭД.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТабличнаяЗагрузки.ОшибкаЗаполненияКодТНВЭД");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ОформляемоеПоле = ЭлементУОКодТНВЭД.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТабличнаяЗагрузкиКодТНВЭД");
	ОформляемоеПоле.Использование = Истина;  
	
	// ШтрихКод
    ЭлементШтрихКод = УсловноеОформление.Элементы.Добавить();				
	ЭлементШтрихКод.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	ЭлементШтрихКод.Использование = Истина;
	
	ЭлементУсловия = ЭлементШтрихКод.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТабличнаяЗагрузки.ОшибкаШтрихКода");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ЭлементУсловия = ЭлементШтрихКод.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("БезПроверкиШтрихкодов");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Ложь;
	
	ОформляемоеПоле = ЭлементШтрихКод.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТабличнаяЗагрузкиШтрихКод");
	ОформляемоеПоле.Использование = Истина;
	
	// dimedrol 03.02.2025
	// Цвет 1С
	ЭлементЦвет1С = УсловноеОформление.Элементы.Добавить();
	ЭлементЦвет1С.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	ЭлементЦвет1С.Использование = Истина;
	
	ЭлементУсловия = ЭлементЦвет1С.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТабличнаяЗагрузки.ОшибкаЗаполненияЦвет1С");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ОформляемоеПоле = ЭлементЦвет1С.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТабличнаяЗагрузкиЦвет1С");
	ОформляемоеПоле.Использование = Истина;
	
	// Размер 1С
	ЭлементРазмер1С = УсловноеОформление.Элементы.Добавить();
	ЭлементРазмер1С.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	ЭлементРазмер1С.Использование = Истина;
	
	ЭлементУсловия = ЭлементРазмер1С.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ТабличнаяЗагрузки.ОшибкаЗаполненияРазмер1С");
	ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементУсловия.ПравоеЗначение = Истина;
	
	ОформляемоеПоле = ЭлементРазмер1С.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ТабличнаяЗагрузкиРазмер1С");
	ОформляемоеПоле.Использование = Истина;
	// end of dimedrol 03.02.2025
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьExcelНаСервере(АдресДанных, РасширениеФайла)
	ПутьКфайлу = ПолучитьИмяВременногоФайла(РасширениеФайла);         
	
	Данные = ПолучитьИзВременногоХранилища(АдресДанных);
	Данные.Записать(ПутьКфайлу);
	
	ПрочитатьExcel_ТабличныйДокумент(ПутьКфайлу);
	
КонецПроцедуры

// dimedrol 25.01.2025
&НаСервере
Процедура ПрочитатьExcelУниверсальныйФорматНаСервере(АдресДанных, РасширениеФайла)
	
	ПутьКфайлу = ПолучитьИмяВременногоФайла(РасширениеФайла);
	
	Данные = ПолучитьИзВременногоХранилища(АдресДанных);
	Данные.Записать(ПутьКфайлу);
	
	ПрочитатьExcel_ТабличныйДокументУниверсальныйФормат(ПутьКфайлу);
	
КонецПроцедуры
// end of dimedrol 25.01.2025

&НаСервере
Процедура ПрочитатьExcel_ТабличныйДокумент(ПутьКФайлу)
	
	Объект.ТабличнаяЗагрузки.Очистить();
	ТабДок.Очистить();
	
	Попытка
		ТабДок.Прочитать(ПутьКФайлу);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();                                                        
		Возврат;
	КонецПопытки;
	
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	КоличествоКолонок = ТабДок.ШиринаТаблицы;
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		
		Если НомерСтроки < ЧитатьСоСтроки Тогда
			Продолжить;			
		КонецЕсли;
		
		СтрокаТаблицы = Объект.ТабличнаяЗагрузки.Добавить();  
		
		АдресКартинки = "";
		КартинкаДобавлена = Ложь;	
		АдресОбластиРисунка = "R" + НомерСтроки + "C1:R" + НомерСтроки + "C" + 1;
		Для Каждого РисунокТД ИЗ ТабДок.ПолучитьОбласть(АдресОбластиРисунка).Рисунки Цикл  
			КартинкаДобавлена = Истина;
			Прервать;
		КонецЦикла;

		СтрокаТаблицы.Картинка					= АдресКартинки;
		СтрокаТаблицы.КартинкаДобавлена			= КартинкаДобавлена;
		СтрокаТаблицы.Покупатель				= ОчиститьСтроку(ТабДок.Область(НомерСтроки, 2).Текст);
		СтрокаТаблицы.Сезон						= ОчиститьСтроку(ТабДок.Область(НомерСтроки, 3).Текст);
		
		Попытка
			ДатаСтрокой = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 4).Текст);
			ДатаОтгрузки = ОбщегоНазначенияКлиентСервер.СтрокаВДату(ДатаСтрокой);
		Исключение
			ДатаОтгрузки = Дата("00010101");
		КонецПопытки;
		СтрокаТаблицы.ДатаОтгрузки				= ДатаОтгрузки;  
		
		Попытка
			ДатаСтрокой = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 5).Текст);
			ДатаПрибытия  = ОбщегоНазначенияКлиентСервер.СтрокаВДату(ДатаСтрокой);
		Исключение
			ДатаПрибытия  = Дата("00010101");
		КонецПопытки;
		СтрокаТаблицы.ДатаПрибытия				= ДатаПрибытия;   
		
		// dimedrol 15.05.2025 Переименовал реквизит, был "Призводитель"
		ПроизводительСтрокой 						= ОчиститьСтроку(СокрЛП(ТабДок.Область(НомерСтроки, 6).Текст));
		Если ЗначениеЗаполнено(ПроизводительСтрокой) Тогда
			Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(ПроизводительСтрокой); 
			Если ЗначениеЗаполнено(Контрагент) Тогда
				СтрокаТаблицы.Производитель = Контрагент;
			Иначе
				СтрокаТаблицы.Производитель = ПроизводительСтрокой;
			КонецЕсли;  
		КонецЕсли;
		СтрокаТаблицы.АдресПроизводителя        = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 7).Текст);
		
		СтранаПроисхожденияСтрокой				= ОчиститьСтроку(СокрЛП(ТабДок.Область(НомерСтроки, 8).Текст)); 
		Если ЗначениеЗаполнено(СтранаПроисхожденияСтрокой) Тогда
			СтранаПроисхождения = Справочники.СтраныМира.НайтиПоНаименованию(СтранаПроисхожденияСтрокой);
			Если ЗначениеЗаполнено(СтранаПроисхождения) Тогда
				СтрокаТаблицы.СтранаПроисхождения = СтранаПроисхождения;
			Иначе
				СтрокаТаблицы.СтранаПроисхождения = СтранаПроисхожденияСтрокой;
			КонецЕсли;
		КонецЕсли;
	
		СтрокаТаблицы.Бренд                     = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 9).Текст);
		СтрокаТаблицы.Артикль                   = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 10).Текст);
		СтрокаТаблицы.Пол                       = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 11).Текст);
		СтрокаТаблицы.Возраст                   = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 12).Текст);
		СтрокаТаблицы.Коллекция                 = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 13).Текст);
		СтрокаТаблицы.Описание                  = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 14).Текст);
		
		ИмяТипаСтрокой                      	= ОчиститьСтроку(ТабДок.Область(НомерСтроки, 15).Текст);  
		Если ЗначениеЗаполнено(ИмяТипаСтрокой) Тогда
			ТипНоменклатуры = НайтиРодителя(ИмяТипаСтрокой); 
			Если ЗначениеЗаполнено(ТипНоменклатуры) Тогда
				СтрокаТаблицы.Тип = ТипНоменклатуры;
			Иначе
				СтрокаТаблицы.Тип = ИмяТипаСтрокой;
			КонецЕсли;
		КонецЕсли;
		
		СтрокаТаблицы.Состав                    = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 16).Текст); 
		СтрокаТаблицы.ТипМатериала              = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 17).Текст);
		СтрокаТаблицы.Масса                     = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 18).Текст);
		СтрокаТаблицы.Прокладка                 = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 19).Текст);
		СтрокаТаблицы.Подкладка                 = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 20).Текст);
	    СтрокаТаблицы.ВидУпаковки               = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 21).Текст);
			
		Цена 									= ПривестиСтрокуКЧислу(СокрЛП(ТабДок.Область(НомерСтроки, 22).Текст));
		Если ЗначениеЗаполнено(Цена) Тогда
			СтрокаТаблицы.Цена = Цена;
		Иначе
			СтрокаТаблицы.Цена             		= ОчиститьСтроку(ТабДок.Область(НомерСтроки, 22).Текст);
		КонецЕсли;	
		
		СтрокаТаблицы.ДопКомментарии            = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 23).Текст);
		//СтрокаТаблицы.Характеристика            = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 24).Текст);
		
		ЕдИзмСтрокой                     		= ОчиститьСтроку(ТабДок.Область(НомерСтроки, 25).Текст); 
		Если ЗначениеЗаполнено(ЕдИзмСтрокой) Тогда
			ЕдИзмСтрокой = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ЕдИзмСтрокой);
			Если ЗначениеЗаполнено(ЕдИзмСтрокой) Тогда
				СтрокаТаблицы.ЕдИзм = ЕдИзмСтрокой;
			Иначе
				СтрокаТаблицы.ЕдИзм             = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 25).Текст)
			КонецЕсли;
		КонецЕсли;
 
		
		СтрокаТаблицы.ГлавныйЦвет               = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 26).Текст);
		СтрокаТаблицы.КОД                       = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 27).Текст);  
		
		DDP                       				= ПривестиСтрокуКЧислу(ОчиститьСтроку(ТабДок.Область(НомерСтроки, 28).Текст));
		Если ЗначениеЗаполнено(DDP) Тогда
			СтрокаТаблицы.DDP = DDP;
		Иначе
			СтрокаТаблицы.DDP                   = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 28).Текст);
		КонецЕсли;
		
		Всего                       			= ПривестиСтрокуКЧислу(ОчиститьСтроку(ТабДок.Область(НомерСтроки, 29).Текст));
		Если ЗначениеЗаполнено(Всего) Тогда
			СтрокаТаблицы.Всего = Всего;
		Иначе
			СтрокаТаблицы.Всего                 = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 29).Текст);
		КонецЕсли; 
		
		НДС                       				= ОчиститьСтроку(ТабДок.Область(НомерСтроки, 30).Текст);
		Если ЗначениеЗаполнено(НДС) Тогда
			СтрокаТаблицы.НДС = НайтиСтавкуНДС(НДС);
		Иначе
			СтрокаТаблицы.НДС                   = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 30).Текст);
		КонецЕсли;
		
		СтрокаТаблицы.Штрихкод                  = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 31).Текст);
				
		КодТНВЭД                  				= НайтиТНВЭД(ОчиститьСтроку(ТабДок.Область(НомерСтроки, 32).Текст));
		Если ЗначениеЗаполнено(КодТНВЭД) Тогда
			СтрокаТаблицы.КодТНВЭД = КодТНВЭД;
		Иначе
			СтрокаТаблицы.КодТНВЭД              = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 32).Текст);
		КонецЕсли;
		
		СтрокаТаблицы.КодОКПД2                  = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 33).Текст);
		СтрокаТаблицы.GPCБлок                   = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 34).Текст);
		
		КатегорииНоменклатуры                   = НайтиКатегорииНоменклатуры(ОчиститьСтроку(ТабДок.Область(НомерСтроки, 35).Текст));
		Если ЗначениеЗаполнено(КатегорииНоменклатуры) Тогда
			СтрокаТаблицы.ВидНоменклатуры = КатегорииНоменклатуры;
		Иначе
			СтрокаТаблицы.ВидНоменклатуры       = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 35).Текст);
		КонецЕсли;
		
		Стирка                   				= НайтиЗнакУхода(ОчиститьСтроку(ТабДок.Область(НомерСтроки, 36).Текст));
		Если ЗначениеЗаполнено(Стирка) Тогда
			СтрокаТаблицы.Стирка = Стирка;
		Иначе
			СтрокаТаблицы.Стирка                = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 36).Текст);
		КонецЕсли;
		
		Отбеливание                   			= НайтиЗнакУхода(ОчиститьСтроку(ТабДок.Область(НомерСтроки, 37).Текст));
		Если ЗначениеЗаполнено(Отбеливание) Тогда
			СтрокаТаблицы.Отбеливание = Отбеливание;
		Иначе
			СтрокаТаблицы.Отбеливание           = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 37).Текст);
		КонецЕсли;
		
		Глажженье                   		    = НайтиЗнакУхода(ОчиститьСтроку(ТабДок.Область(НомерСтроки, 38).Текст));
		Если ЗначениеЗаполнено(Глажженье) Тогда
			СтрокаТаблицы.Глажженье = Глажженье;
		Иначе
			СтрокаТаблицы.Глажженье             = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 38).Текст);
		КонецЕсли;

		
		Сушка                   				= НайтиЗнакУхода(ОчиститьСтроку(ТабДок.Область(НомерСтроки, 39).Текст));
		Если ЗначениеЗаполнено(Сушка) Тогда
			СтрокаТаблицы.Сушка = Сушка;
		Иначе
			СтрокаТаблицы.Сушка                 = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 39).Текст);
		КонецЕсли;


		УходЗаТекстилем                   	    = НайтиЗнакУхода(ОчиститьСтроку(ТабДок.Область(НомерСтроки, 40).Текст));
		Если ЗначениеЗаполнено(УходЗаТекстилем) Тогда
			СтрокаТаблицы.УходЗаТекстилем = УходЗаТекстилем;
		Иначе
			СтрокаТаблицы.УходЗаТекстилем       = ОчиститьСтроку(ТабДок.Область(НомерСтроки, 40).Текст);
		КонецЕсли;

	КонецЦикла;
	
	ПроверитьДублиШтрихКодов();
	
	НайтиНоменклатуруХарактеристику();
КонецПроцедуры // ПрочитатьExcel_ТабличныйДокумент()

// dimedrol 25.01.2025
&НаСервере
Процедура ПрочитатьExcel_ТабличныйДокументУниверсальныйФормат(ПутьКФайлу)
	
	Объект.ТабличнаяЗагрузки.Очистить();
	ТабДок.Очистить();
	
	СоответствиеЗаголовковКолонок = Новый Соответствие;
	
	//Варианты заголовков Покупатель
	СоответствиеЗаголовковКолонок.Вставить("Покупатель",                              "Покупатель");
	//Варианты заголовков Сезон
	СоответствиеЗаголовковКолонок.Вставить("Season / Сезон",                          "Сезон");
	//Варианты заголовков Дата отгрузки
	СоответствиеЗаголовковКолонок.Вставить("Shipment date, FCA / Дата отгрузки, FCA", "ДатаОтгрузки");
	//Варианты заголовков Дата прибытия
	СоответствиеЗаголовковКолонок.Вставить("In store date / Дата прибытия",           "ДатаПрибытия");
	//Варианты заголовков Производитель
	СоответствиеЗаголовковКолонок.Вставить("Supplier / Призводитель",                 "Производитель");
	СоответствиеЗаголовковКолонок.Вставить("Supplier / Производитель",                "Производитель");// dimedrol 15.05.2025
	СоответствиеЗаголовковКолонок.Вставить("Производитель",                           "Производитель");
	//Варианты заголовков Адрес производителя
	СоответствиеЗаголовковКолонок.Вставить("Адрес производителя",                     "АдресПроизводителя");
	СоответствиеЗаголовковКолонок.Вставить("Производитель, адрес (инвойс)",           "АдресПроизводителя");
	//Варианты заголовков Страна происхождения
	СоответствиеЗаголовковКолонок.Вставить("Country of origin / Страна происхождения","СтранаПроисхождения");
	СоответствиеЗаголовковКолонок.Вставить("Страна производства"                     ,"СтранаПроисхождения");
	СоответствиеЗаголовковКолонок.Вставить("Страна производитель"                    ,"СтранаПроисхождения");
	//Варианты заголовков Бренд
	СоответствиеЗаголовковКолонок.Вставить("Бренд",                                   "Бренд");
	СоответствиеЗаголовковКолонок.Вставить("Brand / Бренд",                           "Бренд");
	СоответствиеЗаголовковКолонок.Вставить("Brand",                                   "Бренд");
	//Варианты заголовков Артикул поставщика
	СоответствиеЗаголовковКолонок.Вставить("Артикул",                                 "Артикул");
	СоответствиеЗаголовковКолонок.Вставить("Article / Артикль",                       "Артикул");
	//Варианты заголовков Артикул 1С
	СоответствиеЗаголовковКолонок.Вставить("Артикул 1С",                              "Артикул1С");
	//Варианты заголовков Пол
	СоответствиеЗаголовковКолонок.Вставить("Муж/Жен",                                 "Пол");
	СоответствиеЗаголовковКолонок.Вставить("Sex / Пол",                               "Пол");
	СоответствиеЗаголовковКолонок.Вставить("Пол",                                     "Пол");
	//Варианты заголовков Возраст
	СоответствиеЗаголовковКолонок.Вставить("Age / Возраст (характеристика)",          "Возраст");
	//Варианты заголовков Коллекция
	СоответствиеЗаголовковКолонок.Вставить("Collection / Коллекция",                  "Коллекция");
	СоответствиеЗаголовковКолонок.Вставить("Коллекция",                               "Коллекция");
	//Варианты заголовков Коллекция
	СоответствиеЗаголовковКолонок.Вставить("Description / Описание",                  "Описание");
	СоответствиеЗаголовковКолонок.Вставить("Наим рус",                                "Описание");
	СоответствиеЗаголовковКолонок.Вставить("Наименование",                            "Описание");
	//Варианты заголовков Тип (Группа номенклатуры)
	СоответствиеЗаголовковКолонок.Вставить("Type of clothes / Тип",                   "Тип");
	СоответствиеЗаголовковКолонок.Вставить("В группе",                                "Тип");
	//Варианты заголовков Состав
	СоответствиеЗаголовковКолонок.Вставить("Composition / Состав",                    "Состав");
	СоответствиеЗаголовковКолонок.Вставить("Состав",                                  "Состав");
	//Варианты заголовков Тип материала
	СоответствиеЗаголовковКолонок.Вставить("Тип материала",                           "ТипМатериала");
	//Варианты заголовков Масса
	СоответствиеЗаголовковКолонок.Вставить("Weight , gsm / Масса, gsm",               "Масса");
	//Варианты заголовков Прокладка
	СоответствиеЗаголовковКолонок.Вставить("Padding , gsm / Прокладка, gsm",          "Прокладка");
	//Варианты заголовков Подкладка
	СоответствиеЗаголовковКолонок.Вставить("Lining / Подкладка",                      "Подкладка");
	//Варианты заголовков Вид упаковки
	СоответствиеЗаголовковКолонок.Вставить("Type of package / Вид упаковки",          "ВидУпаковки");
	//Варианты заголовков Цена
	СоответствиеЗаголовковКолонок.Вставить("Price, FCA, RMB / Цена, FCA, RMB",        "Цена");
	СоответствиеЗаголовковКолонок.Вставить("Стоимость евро (инвойс)",                 "Цена");
	СоответствиеЗаголовковКолонок.Вставить("Цена",                                    "Цена");
	//Варианты заголовков Доп комментарии (Размер поставщика)
	СоответствиеЗаголовковКолонок.Вставить("Additional comments / Доп. комментарии",  "ДопКомментарии");
	СоответствиеЗаголовковКолонок.Вставить("Размер",                                  "ДопКомментарии");
	//Варианты заголовков Доп комментарии (Размер 1С)
	СоответствиеЗаголовковКолонок.Вставить("Размер 1С",                               "Размер1С");
	//Варианты заголовков Характеристика
	СоответствиеЗаголовковКолонок.Вставить("Характеристика,см",                       "Характеристика");
	//Варианты заголовков Единицы измерения
	СоответствиеЗаголовковКолонок.Вставить("PCS/pack / ед изм. шт.",                  "ЕдИзм");
	СоответствиеЗаголовковКолонок.Вставить("Ед",                                      "ЕдИзм");
	//Варианты заголовков Главный цвет (цвет поставщика)
	СоответствиеЗаголовковКолонок.Вставить("Main color / Главный цвет",               "ГлавныйЦвет");
	СоответствиеЗаголовковКолонок.Вставить("Цвет",                                    "ГлавныйЦвет");
	СоответствиеЗаголовковКолонок.Вставить("(Подкладка/ГОСТ)/Цвет",                   "ГлавныйЦвет");
	//Варианты заголовков Доп комментарии (Цвет 1С)
	СоответствиеЗаголовковКолонок.Вставить("Цвет 1С",                                 "Цвет1С");
	//Варианты заголовков Код
	СоответствиеЗаголовковКолонок.Вставить("Код по каталогу",                         "Код");
	//Варианты заголовков DDP
	СоответствиеЗаголовковКолонок.Вставить("DDP, rub / Цена DDP, руб.",               "DDP");
	//Варианты заголовков Всего
	СоответствиеЗаголовковКолонок.Вставить("Total , pcs / всего шт.",                 "Всего");
	СоответствиеЗаголовковКолонок.Вставить("Количество",                              "Всего");
	//Варианты заголовков НДС
	СоответствиеЗаголовковКолонок.Вставить("НДС",                                     "НДС");
	СоответствиеЗаголовковКолонок.Вставить("Ставка НДС",                              "НДС");
	//Варианты заголовков Штрих код
	СоответствиеЗаголовковКолонок.Вставить("Штрихкод",                                "Штрихкод");
	СоответствиеЗаголовковКолонок.Вставить("Штри хкод",                               "Штрихкод");
	СоответствиеЗаголовковКолонок.Вставить("EAN",                                     "Штрихкод");
	//Варианты заголовков GTIN
	СоответствиеЗаголовковКолонок.Вставить("GTIN",                                    "GTIN");
	//Варианты заголовков Код ТНВЭД
	СоответствиеЗаголовковКолонок.Вставить("Код ТН ВЭД",                              "КодТНВЭД");
	СоответствиеЗаголовковКолонок.Вставить("Код товара",                              "КодТНВЭД");
	СоответствиеЗаголовковКолонок.Вставить("Код ТНВЭД (рус)",                         "КодТНВЭД");
	//Варианты заголовков Код ОКПД2
	СоответствиеЗаголовковКолонок.Вставить("Код ОКПД2",                               "КодОКПД2");
	//Варианты заголовков GPC Блок
	СоответствиеЗаголовковКолонок.Вставить("GPC Блок",                                "GPCБлок");
	//Варианты заголовков Вид номенклатуры
	СоответствиеЗаголовковКолонок.Вставить("Вид номенклатуры (категория)",            "ВидНоменклатуры");
	СоответствиеЗаголовковКолонок.Вставить("Вид номенклатуры",                        "ВидНоменклатуры");
	//Варианты заголовков Стирка
	СоответствиеЗаголовковКолонок.Вставить("Стирка",                                  "Стирка");
	//Варианты заголовков Отбеливание
	СоответствиеЗаголовковКолонок.Вставить("Отбеливание",                             "Отбеливание");
	//Варианты заголовков Глажженье
	СоответствиеЗаголовковКолонок.Вставить("Глажженье",                               "Глажженье");
	//Варианты заголовков Сушка
	СоответствиеЗаголовковКолонок.Вставить("Сушка",                                   "Сушка");
	//Варианты заголовков Уход за текстилем
	СоответствиеЗаголовковКолонок.Вставить("Проф. Уход за текстилем",                 "УходЗаТекстилем");
	
	//Варианты заголовков Свойство_ТоварнаяГруппа
	СоответствиеЗаголовковКолонок.Вставить("Товарная Группа",                         "ТоварнаяГруппа"); // dimedrol 15.05.2025
	СоответствиеЗаголовковКолонок.Вставить("Товарная группа",                         "ТоварнаяГруппа"); // dimedrol 15.05.2025
	
	ДанныеФайла = Новый ТабличныйДокумент;
	Попытка
		ДанныеФайла.Прочитать(ПутьКФайлу);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не удалось прочитать файл по причине: " + ОписаниеОшибки();
		Сообщение.Сообщить();                                                        
		Возврат;
	КонецПопытки;
	Область = ДанныеФайла.Область();
	Область.Разъединить();
	
	// Убираем из табличного документа пустые колонки
	ВысотаТаблицы = ДанныеФайла.ВысотаТаблицы;
	ШиринаТаблицы = ДанныеФайла.ШиринаТаблицы;
	РезультатОбработки = Новый ТабличныйДокумент;
	СоответствиеКолонок = Новый Соответствие;
	Для НомерСтроки = 1 По ВысотаТаблицы Цикл
		
		Для НомерКолонки = 1 По ШиринаТаблицы Цикл
			
			Ячейка = ДанныеФайла.Область(НомерСтроки, НомерКолонки);
			Если Не ПустаяСтрока(Ячейка.Текст) Тогда
				
				НомерКолонкиРезультатОбработки = СоответствиеКолонок.Получить(НомерКолонки);
				Если НомерКолонкиРезультатОбработки = Неопределено Тогда
					
					НомерКолонкиРезультатОбработки = СоответствиеКолонок.Количество() + 1;
					СоответствиеКолонок.Вставить(НомерКолонки, НомерКолонкиРезультатОбработки);
					
				КонецЕсли;
				РезультатОбработки.Область(НомерСтроки, НомерКолонкиРезультатОбработки).Текст = СокрЛП(Ячейка.Текст);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ВысотаТаблицы = РезультатОбработки.ВысотаТаблицы;
	ШиринаТаблицы = РезультатОбработки.ШиринаТаблицы;
	
	// Если веб-клиент, то заполняем пробелами пустые ячейки для прорисовки границ ячеек
	Если ОбщегоНазначенияКлиентСервер.ЭтоВебКлиент() Тогда
		
		Для НомерСтроки = 1 По ВысотаТаблицы Цикл
			
			Для НомерКолонки = 1 По ШиринаТаблицы Цикл
				
				Ячейка = РезультатОбработки.Область(НомерСтроки, НомерКолонки);
				Если ПустаяСтрока(Ячейка.Текст) Тогда
					
					Ячейка.Текст = " ";
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
	СоответствиеКолонок = Новый Соответствие;
	Для НомерКолонки = 1 По ШиринаТаблицы Цикл
		
		Для НомерСтроки = 1 По ВысотаТаблицы Цикл
			
			ТекОбласть = РезультатОбработки.Область(НомерСтроки, НомерКолонки);
			
			НайденнаяКолонка = СоответствиеЗаголовковКолонок.Получить(ТекОбласть.Текст);
			Если НайденнаяКолонка <> Неопределено Тогда
				ТекстЗаголовка = НайденнаяКолонка;
				СоответствиеКолонок.Вставить(ТекстЗаголовка, НомерКолонки);
				Для Каждого ЭлементСоответствия Из СоответствиеЗаголовковКолонок Цикл
					Если НайденнаяКолонка = ЭлементСоответствия.Значение Тогда
						СоответствиеЗаголовковКолонок.Удалить(ЭлементСоответствия.Ключ);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	ТабДок = РезультатОбработки;
	КоличествоСтрок = ТабДок.ВысотаТаблицы;
	КоличествоКолонок = ТабДок.ШиринаТаблицы;
	
	Для НомерСтроки = 1 По КоличествоСтрок Цикл
		
		Если НомерСтроки < ЧитатьСоСтроки Тогда
			Продолжить;			
		КонецЕсли;
		
		СтрокаТаблицы = Объект.ТабличнаяЗагрузки.Добавить();
		
		// Картинка
		АдресКартинки = "";
		КартинкаДобавлена = Ложь;	
		АдресОбластиРисунка = "R" + НомерСтроки + "C1:R" + НомерСтроки + "C" + 1;
		Для Каждого РисунокТД ИЗ ТабДок.ПолучитьОбласть(АдресОбластиРисунка).Рисунки Цикл
			КартинкаДобавлена = Истина;
			Прервать;
		КонецЦикла;
		
		СтрокаТаблицы.Картинка					= АдресКартинки;
		СтрокаТаблицы.КартинкаДобавлена			= КартинкаДобавлена;
		
		Если СоответствиеКолонок.Получить("Покупатель") <> Неопределено Тогда
			СтрокаТаблицы.Покупатель				= ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Покупатель")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Сезон") <> Неопределено Тогда
			СтрокаТаблицы.Сезон						= ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Сезон")).Текст);
		КонецЕсли;
			
		Попытка
			Если СоответствиеКолонок.Получить("ДатаОтгрузки") <> Неопределено Тогда
				ДатаСтрокой = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("ДатаОтгрузки")).Текст);
				ДатаОтгрузки = ОбщегоНазначенияКлиентСервер.СтрокаВДату(ДатаСтрокой);
			КонецЕсли;
		Исключение
			ДатаОтгрузки = Дата("00010101");
		КонецПопытки;
		
		СтрокаТаблицы.ДатаОтгрузки				= ДатаОтгрузки;
		
		Попытка
			Если СоответствиеКолонок.Получить("ДатаПрибытия") <> Неопределено Тогда
				ДатаСтрокой = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("ДатаПрибытия")).Текст);
				ДатаПрибытия  = ОбщегоНазначенияКлиентСервер.СтрокаВДату(ДатаСтрокой);
			КонецЕсли;
		Исключение
			ДатаПрибытия  = Дата("00010101");
		КонецПопытки;
		
		СтрокаТаблицы.ДатаПрибытия				= ДатаПрибытия;
		
		Если СоответствиеКолонок.Получить("Производитель") <> Неопределено Тогда
			ПроизводительСтрокой                      = ОчиститьСтроку(СокрЛП(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Производитель")).Текст));
			Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(ПроизводительСтрокой, Истина);
			Если ЗначениеЗаполнено(Контрагент) Тогда
				СтрокаТаблицы.Производитель = Контрагент;
			Иначе
				СтрокаТаблицы.Производитель = ПроизводительСтрокой;
			КонецЕсли;
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("АдресПроизводителя") <> Неопределено Тогда
			СтрокаТаблицы.АдресПроизводителя         = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("АдресПроизводителя")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("СтранаПроисхождения") <> Неопределено Тогда
			СтранаПроисхожденияСтрокой				= ОчиститьСтроку(СокрЛП(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("СтранаПроисхождения")).Текст));
			Если ЗначениеЗаполнено(СтранаПроисхожденияСтрокой) Тогда
				СтранаПроисхождения = Справочники.СтраныМира.НайтиПоНаименованию(СтранаПроисхожденияСтрокой);
				Если ЗначениеЗаполнено(СтранаПроисхождения) Тогда
					СтрокаТаблицы.СтранаПроисхождения = СтранаПроисхождения;
				Иначе
					СтрокаТаблицы.СтранаПроисхождения = СтранаПроисхожденияСтрокой;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Бренд") <> Неопределено Тогда
			СтрокаТаблицы.Бренд                     = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Бренд")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Артикул") <> Неопределено Тогда
			СтрокаТаблицы.Артикль                   = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Артикул")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Артикул1С") <> Неопределено Тогда
			СтрокаТаблицы.Артикул1С                 = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Артикул1С")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Цвет1С") <> Неопределено Тогда
			Цвет1ССтрокой                           = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Цвет1С")).Текст);
			Если ЗначениеЗаполнено(Цвет1ССтрокой) Тогда
				ЦветСсылка = НайтиЦветПоНаименованию(Цвет1ССтрокой);
				Если ЗначениеЗаполнено(ЦветСсылка) Тогда
					СтрокаТаблицы.Цвет1С = ЦветСсылка;
				Иначе
					СтрокаТаблицы.Цвет1С = Цвет1ССтрокой;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Размер1С") <> Неопределено Тогда
			Размер1ССтрокой                       = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Размер1С")).Текст);
			Если ЗначениеЗаполнено(Размер1ССтрокой) Тогда
				РазмерСсылка = Справочники.спРазмеры.НайтиПоНаименованию(Размер1ССтрокой, Истина);
				Если ЗначениеЗаполнено(РазмерСсылка) Тогда
					СтрокаТаблицы.Размер1С = РазмерСсылка;
				Иначе
					СтрокаТаблицы.Размер1С = Размер1ССтрокой;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Пол") <> Неопределено Тогда
			СтрокаТаблицы.Пол                       = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Пол")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Возраст") <> Неопределено Тогда
			СтрокаТаблицы.Возраст                   = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Возраст")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Коллекция") <> Неопределено Тогда
			СтрокаТаблицы.Коллекция                 = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Коллекция")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Описание") <> Неопределено Тогда
			СтрокаТаблицы.Описание                  = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Описание")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Тип") <> Неопределено Тогда
			ИмяТипаСтрокой                          = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Тип")).Текст);
			Если ЗначениеЗаполнено(ИмяТипаСтрокой) Тогда
				ТипНоменклатуры = НайтиРодителя(ИмяТипаСтрокой);
				Если ЗначениеЗаполнено(ТипНоменклатуры) Тогда
					СтрокаТаблицы.Тип = ТипНоменклатуры;
				Иначе
					СтрокаТаблицы.Тип = ИмяТипаСтрокой;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Состав") <> Неопределено Тогда
			СтрокаТаблицы.Состав                    = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Состав")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("ТипМатериала") <> Неопределено Тогда
			СтрокаТаблицы.ТипМатериала              = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("ТипМатериала")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Масса") <> Неопределено Тогда
			СтрокаТаблицы.Масса                     = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Масса")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Прокладка") <> Неопределено Тогда
			СтрокаТаблицы.Прокладка                 = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Прокладка")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Подкладка") <> Неопределено Тогда
			СтрокаТаблицы.Подкладка                 = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Подкладка")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("ВидУпаковки") <> Неопределено Тогда
			СтрокаТаблицы.ВидУпаковки               = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("ВидУпаковки")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Цена") <> Неопределено Тогда
			Цена                                    = ПривестиСтрокуКЧислу(СокрЛП(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Цена")).Текст));
			Если ЗначениеЗаполнено(Цена) Тогда
				СтрокаТаблицы.Цена = Цена;
			Иначе
				СтрокаТаблицы.Цена                  = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Цена")).Текст);
			КонецЕсли;
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("ДопКомментарии") <> Неопределено Тогда
			СтрокаТаблицы.ДопКомментарии            = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("ДопКомментарии")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Характеристика") <> Неопределено Тогда
			СтрокаТаблицы.Характеристика            = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Характеристика")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("ЕдИзм") <> Неопределено Тогда
			ЕдИзмСтрокой                     		= ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("ЕдИзм")).Текст);
			Если ЗначениеЗаполнено(ЕдИзмСтрокой) Тогда
				ЕдИзмСтрокой = Справочники.КлассификаторЕдиницИзмерения.НайтиПоНаименованию(ЕдИзмСтрокой);
				Если ЗначениеЗаполнено(ЕдИзмСтрокой) Тогда
					СтрокаТаблицы.ЕдИзм = ЕдИзмСтрокой;
				Иначе
					СтрокаТаблицы.ЕдИзм             = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("ЕдИзм")).Текст)
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("ГлавныйЦвет") <> Неопределено Тогда
			СтрокаТаблицы.ГлавныйЦвет              = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("ГлавныйЦвет")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Код") <> Неопределено Тогда
			СтрокаТаблицы.КОД                      = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Код")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("DDP") <> Неопределено Тогда
			DDP                                   = ПривестиСтрокуКЧислу(ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("DDP")).Текст));
			Если ЗначениеЗаполнено(DDP) Тогда
				СтрокаТаблицы.DDP = DDP;
			Иначе
				СтрокаТаблицы.DDP                 = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("DDP")).Текст);
			КонецЕсли;
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Всего") <> Неопределено Тогда
			Всего                                 = ПривестиСтрокуКЧислу(ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Всего")).Текст));
			Если ЗначениеЗаполнено(Всего) Тогда
				СтрокаТаблицы.Всего = Всего;
			Иначе
				СтрокаТаблицы.Всего               = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Всего")).Текст);
			КонецЕсли;
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("НДС") <> Неопределено Тогда
			
			НДС                                   = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("НДС")).Текст);
			Если ЗначениеЗаполнено(НДС) Тогда
				СтрокаТаблицы.НДС = НайтиСтавкуНДС(НДС);
			Иначе
				СтрокаТаблицы.НДС                 = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("НДС")).Текст);
			КонецЕсли;
			
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Штрихкод") <> Неопределено Тогда
			СтрокаТаблицы.Штрихкод                  = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Штрихкод")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("GTIN") <> Неопределено Тогда
			СтрокаТаблицы.GTIN                      = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("GTIN")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("КодТНВЭД") <> Неопределено Тогда
			КодТНВЭД                                = НайтиТНВЭД(ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("КодТНВЭД")).Текст));
			Если ЗначениеЗаполнено(КодТНВЭД) Тогда
				СтрокаТаблицы.КодТНВЭД = КодТНВЭД;
			Иначе
				СтрокаТаблицы.КодТНВЭД              = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("КодТНВЭД")).Текст);
			КонецЕсли;
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("КодОКПД2") <> Неопределено Тогда
			СтрокаТаблицы.КодОКПД2                  = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("КодОКПД2")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("GPCБлок") <> Неопределено Тогда
			СтрокаТаблицы.GPCБлок                   = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("GPCБлок")).Текст);
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("ВидНоменклатуры") <> Неопределено Тогда
			КатегорииНоменклатуры                   = НайтиКатегорииНоменклатуры(ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("ВидНоменклатуры")).Текст));
			Если ЗначениеЗаполнено(КатегорииНоменклатуры) Тогда
				СтрокаТаблицы.ВидНоменклатуры = КатегорииНоменклатуры;
			Иначе
				СтрокаТаблицы.ВидНоменклатуры       = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("ВидНоменклатуры")).Текст);
			КонецЕсли;
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Стирка") <> Неопределено Тогда
			Стирка                                  = НайтиЗнакУхода(ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Стирка")).Текст));
			Если ЗначениеЗаполнено(Стирка) Тогда
				СтрокаТаблицы.Стирка = Стирка;
			Иначе
				СтрокаТаблицы.Стирка                = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Стирка")).Текст);
			КонецЕсли;
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Отбеливание") <> Неопределено Тогда
			
			Отбеливание                             = НайтиЗнакУхода(ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Отбеливание")).Текст));
			Если ЗначениеЗаполнено(Отбеливание) Тогда
				СтрокаТаблицы.Отбеливание = Отбеливание;
			Иначе
				СтрокаТаблицы.Отбеливание           = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Отбеливание")).Текст);
			КонецЕсли;
			
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Глажженье") <> Неопределено Тогда
			Глажженье                               = НайтиЗнакУхода(ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Глажженье")).Текст));
			Если ЗначениеЗаполнено(Глажженье) Тогда
				СтрокаТаблицы.Глажженье = Глажженье;
			Иначе
				СтрокаТаблицы.Глажженье             = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Глажженье")).Текст);
			КонецЕсли;
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("Сушка") <> Неопределено Тогда
			Сушка                                 = НайтиЗнакУхода(ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Сушка")).Текст));
			Если ЗначениеЗаполнено(Сушка) Тогда
				СтрокаТаблицы.Сушка = Сушка;
			Иначе
				СтрокаТаблицы.Сушка               = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("Сушка")).Текст);
			КонецЕсли;
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("УходЗаТекстилем") <> Неопределено Тогда
			УходЗаТекстилем                       = НайтиЗнакУхода(ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("УходЗаТекстилем")).Текст));
			Если ЗначениеЗаполнено(УходЗаТекстилем) Тогда
				СтрокаТаблицы.УходЗаТекстилем = УходЗаТекстилем;
			Иначе
				СтрокаТаблицы.УходЗаТекстилем      = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("УходЗаТекстилем")).Текст);
			КонецЕсли;
		КонецЕсли;
		
		// dimedrol 15.05.2025
		Если ЗначениеЗаполнено(РеквизитПодстановкиПоставщик) Тогда
			СтрокаТаблицы.Поставщик = РеквизитПодстановкиПоставщик;
		КонецЕсли;
		
		Если СоответствиеКолонок.Получить("ТоварнаяГруппа") <> Неопределено Тогда
			СтрокаТаблицы.ТоварнаяГруппа                   = ОчиститьСтроку(ТабДок.Область(НомерСтроки, СоответствиеКолонок.Получить("ТоварнаяГруппа")).Текст);
		КонецЕсли;
		// end of dimedrol 15.05.2025
		
	КонецЦикла;
	
	ПроверитьДублиШтрихКодов();
	
	НайтиНоменклатуруХарактеристику();
	
КонецПроцедуры // ПрочитатьExcel_ТабличныйДокументУниверсальныйФормат()
// end of dimedrol 25.01.2025

&НаСервере
Процедура ПроверитьДублиШтрихКодов() 
	
	ШтрихкодыДляПроверки = Объект.ТабличнаяЗагрузки.Выгрузить(,"Штрихкод");
	ШтрихкодыДляПроверки.Колонки.Добавить("КоличествоДублей", Новый ОписаниеТипов("Число"));
	Для каждого СтрокаШтрихкод Из ШтрихкодыДляПроверки Цикл
		СтрокаШтрихкод.КоличествоДублей = 1;
	КонецЦикла; 
	ШтрихкодыДляПроверки.Свернуть("Штрихкод", "КоличествоДублей");  
	Для каждого СтрокаШтрихкод Из ШтрихкодыДляПроверки Цикл
	     Если СтрокаШтрихкод.КоличествоДублей > 1 Тогда
		 	 НайденыеСтроки = Объект.ТабличнаяЗагрузки.НайтиСтроки(Новый Структура("Штрихкод", СтрокаШтрихкод.Штрихкод));
			 Если НайденыеСтроки.Количество() > 1 Тогда 
				  Для каждого НайденаяСтрока Из НайденыеСтроки Цикл
				  	НайденаяСтрока.ОшибкаШтрихКода = Не БезПроверкиШтрихкодов;
				  КонецЦикла;	 
			 КонецЕсли;
		 КонецЕсли;
	 КонецЦикла;
	 
КонецПроцедуры 

&НаСервере
Процедура НайтиНоменклатуруХарактеристику()
	
	Для каждого СтрокаТабличнаяЗагрузки Из Объект.ТабличнаяЗагрузки Цикл 
		
		ЗаполнитьНоменклатуру(СтрокаТабличнаяЗагрузки); 
		
		Если (Дозагрузка Или НЕ ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки.Номенклатура)) 
			И СоздатьНоменклатуруХарактеристикуПослеПрочтенияExcel Тогда
			СоздатьПерезаполнитьНоменклатуру(СтрокаТабличнаяЗагрузки)
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура СоздатьПерезаполнитьНоменклатуру(СтрокаТабличнаяЗагрузки) 
	Перем НоваяНоменклатура;  
	
	Если Не Дозагрузка И ТипЗнч(СтрокаТабличнаяЗагрузки.Номенклатура) = Тип("СправочникСсылка.Номенклатура") И СтрокаТабличнаяЗагрузки.Номенклатура <> Справочники.Номенклатура.ПустаяСсылка() Тогда 
		Возврат;
	КонецЕсли;
	
	// { Иванов С.С. (TNext) - 04.06.2025 - Задача №2502 
	Если Не ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки.Штрихкод) И Не БезПроверкиШтрихкодов Тогда
		
		ОбщегоНазначения.СообщитьПользователю("Не заполнены обязательные данные реквизита ""Штрихкод"" в строке №" + СтрокаТабличнаяЗагрузки.НомерСтроки );
		Возврат;
		
	КонецЕсли;
	// }
	
	// dimedrol 25.01.2025
	Если ТипЗнч(СтрокаТабличнаяЗагрузки.Производитель) <> Тип("СправочникСсылка.Контрагенты") // dimedrol 15.05.2025 Вернул проверку на заполнение ссылки
		ИЛИ СтрокаТабличнаяЗагрузки.Производитель = Справочники.Контрагенты.ПустаяСсылка() Тогда // dimedrol 15.05.2025
	//Если НЕ ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки.Призводитель) Тогда // dimedrol 15.05.2025
	// end of dimedrol 25.01.2025
		ОбщегоНазначения.СообщитьПользователю("Не заполнены обязательные данные реквизита ""Производитель"" в строке №" + СтрокаТабличнаяЗагрузки.НомерСтроки );
		Возврат;
	КонецЕсли;	
	
	Если ТипЗнч(СтрокаТабличнаяЗагрузки.СтранаПроисхождения) <> Тип("СправочникСсылка.СтраныМира") 
		ИЛИ СтрокаТабличнаяЗагрузки.ОшибкаЗаполненияСтранаПроисхождения = Справочники.СтраныМира.ПустаяСсылка() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнены обязательные данные реквизита страна происхождения в строке №" + СтрокаТабличнаяЗагрузки.НомерСтроки );
		Возврат;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки.Артикль) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнены обязательные данные реквизита артикль в строке №" + СтрокаТабличнаяЗагрузки.НомерСтроки );
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки.Описание) Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнены обязательные данные реквизита описание в строке №" + СтрокаТабличнаяЗагрузки.НомерСтроки );
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаТабличнаяЗагрузки.ВидНоменклатуры) <> Тип("СправочникСсылка.КатегорииНоменклатуры") 
		ИЛИ СтрокаТабличнаяЗагрузки.ВидНоменклатуры = Справочники.КатегорииНоменклатуры.ПустаяСсылка() Тогда 
		ОбщегоНазначения.СообщитьПользователю("Не заполнены обязательные данные реквизита вид номенклатуры в строке №" + СтрокаТабличнаяЗагрузки.НомерСтроки );
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(СтрокаТабличнаяЗагрузки.КодТНВЭД) <> Тип("СправочникСсылка.КлассификаторТНВЭД") 
		ИЛИ СтрокаТабличнаяЗагрузки.КодТНВЭД = Справочники.КлассификаторТНВЭД.ПустаяСсылка() Тогда 
		ОбщегоНазначения.СообщитьПользователю("Не заполнены обязательные данные реквизита вид номенклатуры в строке №" + СтрокаТабличнаяЗагрузки.НомерСтроки );
		Возврат;
	КонецЕсли;  
	
	Если СтрокаТабличнаяЗагрузки.ОшибкаШтрихКода Тогда 
		ОбщегоНазначения.СообщитьПользователю("Значение штрихкода не уникально в строке №" + СтрокаТабличнаяЗагрузки.НомерСтроки );
		Возврат;
	КонецЕсли;
	
	// dimedrol 31.01.2025
	Если ТипЗнч(СтрокаТабличнаяЗагрузки.Цвет1С) <> Тип("СправочникСсылка.спЦвета") 
		ИЛИ СтрокаТабличнаяЗагрузки.Цвет1С = Справочники.спЦвета.ПустаяСсылка() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнены обязательные данные реквизита цвет 1С в строке №" + СтрокаТабличнаяЗагрузки.НомерСтроки);
		Возврат;
	КонецЕсли;

	Если ТипЗнч(СтрокаТабличнаяЗагрузки.Размер1С) <> Тип("СправочникСсылка.спРазмеры") 
		ИЛИ СтрокаТабличнаяЗагрузки.Размер1С = Справочники.спРазмеры.ПустаяСсылка() Тогда
		ОбщегоНазначения.СообщитьПользователю("Не заполнены обязательные данные реквизита размер 1С в строке №" + СтрокаТабличнаяЗагрузки.НомерСтроки);
		Возврат;
	КонецЕсли;
	// end of dimedrol 31.01.2025
	
	Попытка    
		
		Если Дозагрузка И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки.Номенклатура) Тогда
			НоваяНоменклатура = СтрокаТабличнаяЗагрузки.Номенклатура.ПолучитьОбъект();
		Иначе
			НоваяНоменклатура = Справочники.Номенклатура.СоздатьЭлемент();
			// Артикул
			НоваяНоменклатура.Артикул = СтрШаблон("%1_%2_%3", СтрокаТабличнаяЗагрузки.Артикул1С, СтрокаТабличнаяЗагрузки.Цвет1С.Значение, СтрокаТабличнаяЗагрузки.Размер1С.Наименование);
		КонецЕсли;
		
		// dimedrol 30.01.2025
		//НоваяНоменклатура.Наименование = СтрШаблон("%1 %2", СтрокаТабличнаяЗагрузки.Описание, СтрокаТабличнаяЗагрузки.Артикль); 
		//НоваяНоменклатура.НаименованиеПолное = СтрШаблон("%1 %2", СтрокаТабличнаяЗагрузки.Описание, СтрокаТабличнаяЗагрузки.Артикль);
		НоваяНоменклатура.Наименование       = СтрокаТабличнаяЗагрузки.Описание;
		НоваяНоменклатура.НаименованиеПолное = СтрокаТабличнаяЗагрузки.Описание;
		// end of dimedrol 30.01.2025
		
		// dimedrol 30.01.2025
		//Если ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки.ГлавныйЦвет) Тогда 
		//	НоваяНоменклатура.Артикул = СтрШаблон("%1-%2-%3", СтрокаТабличнаяЗагрузки.Артикль, СтрокаТабличнаяЗагрузки.ДопКомментарии, СтрокаТабличнаяЗагрузки.ГлавныйЦвет); 
		//Иначе
		//	НоваяНоменклатура.Артикул = СтрШаблон("%1-%2", СтрокаТабличнаяЗагрузки.Артикль, СтрокаТабличнаяЗагрузки.ДопКомментарии);
		//КонецЕсли;
		
		// Цвет
		НоваяНоменклатура.спЦвет   = СтрокаТабличнаяЗагрузки.Цвет1С;
		
		// Размер
		НоваяНоменклатура.спРазмер = СтрокаТабличнаяЗагрузки.Размер1С;
		// end of dimedrol
	
		НоваяНоменклатура.спАртикулПоставщика = СтрокаТабличнаяЗагрузки.Артикль;

		НоваяНоменклатура.ЕдиницаИзмерения = ?(ТипЗнч(СтрокаТабличнаяЗагрузки.ЕдИзм) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения"), СтрокаТабличнаяЗагрузки.ЕдИзм, Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка());
		// dimedrol 25.01.2025
		//НоваяНоменклатура.Производитель = ?(ТипЗнч(СтрокаТабличнаяЗагрузки.Производитель) = Тип("СправочникСсылка.Контрагенты"), СтрокаТабличнаяЗагрузки.Призводитель, Справочники.Контрагенты.ПустаяСсылка()); 
		Если  ТипЗнч(СтрокаТабличнаяЗагрузки.Производитель) = Тип("СправочникСсылка.Контрагенты")
			И СтрокаТабличнаяЗагрузки.Производитель <> Справочники.Контрагенты.ПустаяСсылка() Тогда
			ПроизводительСсылка = СтрокаТабличнаяЗагрузки.Производитель;
		// dimedrol 15.05.2025
		// Алена:Добавить проверку при загрузке реквизита Номенклатура.Производитель - искать по наименованию в справочнике Контрагенты, если такого нет, 
		// то не загружать номенклатуру, подсвечивать красным в табличной части товаров после чтения внешнего файла (например, как страна или код тн вэд)
			
		// Закомментировал создание, вернул проверку в условном оформлении, переименовал реквизит табличной части бал "Призводитель"
		//Иначе
		//	ПроизводительСсылка = НайтиСоздатьКонтрагента(СтрокаТабличнаяЗагрузки.Призводитель, СтрокаТабличнаяЗагрузки.АдресПроизводителя);
		// end of dimedrol 15.05.2025
			
			НоваяНоменклатура.Производитель = ПроизводительСсылка;
		КонецЕсли;
		
		// end of dimedrol 25.01.2025
		НоваяНоменклатура.Родитель = ?(ТипЗнч(СтрокаТабличнаяЗагрузки.Тип) = Тип("СправочникСсылка.Номенклатура"), СтрокаТабличнаяЗагрузки.Тип, Справочники.Номенклатура.ПустаяСсылка());                                                                                                               
		НоваяНоменклатура.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Запас;  
		НоваяНоменклатура.КатегорияНоменклатуры = ?(ТипЗнч(СтрокаТабличнаяЗагрузки.ВидНоменклатуры) = Тип("СправочникСсылка.КатегорииНоменклатуры"), СтрокаТабличнаяЗагрузки.ВидНоменклатуры, Справочники.КатегорииНоменклатуры.ПустаяСсылка()); 
		// dimedrol 30.01.2025
		ОбновитьРеквизиты = Истина;
		КатегорииНоменклатурыСервер.ЗаполнитьСвойстваНоменклатурыПоКатегории(НоваяНоменклатура, ОбновитьРеквизиты);
		// end of dimedrol 30.01.2025
		
		НоваяНоменклатура.СтранаПроисхождения = ?(ТипЗнч(СтрокаТабличнаяЗагрузки.СтранаПроисхождения) = Тип("СправочникСсылка.СтраныМира"), СтрокаТабличнаяЗагрузки.СтранаПроисхождения, Справочники.СтраныМира.ПустаяСсылка()); 
		
		Если ТипЗнч(СтрокаТабличнаяЗагрузки.НДС) = Тип("СправочникСсылка.СтавкиНДС") Тогда  
			НоваяНоменклатура.ВидСтавкиНДС = СтрокаТабличнаяЗагрузки.НДС.ВидСтавкиНДС;
		КонецЕсли;
		
		НоваяНоменклатура.ТоварнаяНоменклатураВЭД = ?(ТипЗнч(СтрокаТабличнаяЗагрузки.КодТНВЭД) = Тип("СправочникСсылка.КлассификаторТНВЭД"), 
														СтрокаТабличнаяЗагрузки.КодТНВЭД, Справочники.КлассификаторТНВЭД.ПустаяСсылка());
		
		// dimedrol 24.02.2025
		// Алена Коваль: Переделать бренд в реквизит со справочником коэффициента цен - загрузка номенклатуры чтобы грузилось и то то, 
		// сделать справочник, скрыть доп реквизит, добавить в расширение заполнение реквизита (как цвет и размер), в справчоник подготовить таблицу для загрузки.
		//
		// Реквизит "Бренд" табличной части обработки - строка. Для единообразия его нужно переделать в справочник "спБренды" и заполнять при чтении Excel.
		// Но нужно созранить и доп. реквизит. Пока будем искать элемент тут.
		Если ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["Бренд"]) Тогда
			БрендСтрокой = СтрокаТабличнаяЗагрузки["Бренд"];
			БрендСсылка  = Справочники.спБренды.НайтиПоНаименованию(БрендСтрокой, Истина);
			Если НЕ ЗначениеЗаполнено(БрендСсылка) Тогда
				БрендОбъект = Справочники.спБренды.СоздатьЭлемент();
				БрендОбъект.Наименование = БрендСтрокой;
				БрендОбъект.Записать();
				БрендСсылка = БрендОбъект.Ссылка;
			КонецЕсли;
			НоваяНоменклатура.спБренд = БрендСсылка;
		КонецЕсли;
		// end of dimedrol 24.02.202
		
		// dimedrol 15.05.2025
		Если ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["Поставщик"]) Тогда
			НоваяНоменклатура.Поставщик = СтрокаТабличнаяЗагрузки["Поставщик"];
		КонецЕсли;
		// end of dimedrol 15.05.2025
		
		НоваяНоменклатура.Записать();
	Исключение
		// dimedrol 30.01.2025
		//ОбщегоНазначения.СообщитьПользователю("Ошибка создания номенклатуры");
		ТекстСообщения = НСтр("ru = 'Ошибка создания номенклатуры: %ИнформацияОбОшибке%'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИнформацияОбОшибке%", ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		// end of dimedrol 30.01.2025
		Возврат;
	КонецПопытки;  
	
	Если ТипЗнч(НоваяНоменклатура) = Тип("СправочникОбъект.Номенклатура") Тогда 
		   
		// dimedrol 30.01.2025
		// Заполнил ревизиты выше "КатегорииНоменклатурыСервер.ЗаполнитьСвойстваНоменклатурыПоКатегории"
		//Попытка
		//	ЗаполнитьРеквизитыПоКатегории(НоваяНоменклатура); 
		//Исключение
		//	ОбщегоНазначения.СообщитьПользователю("Ошибка заполнения реквизитов заполняемых из категории");
		//	Возврат;
		//КонецПопытки;
		// end of dimedrol 30.01.2025
		
		Попытка
			ЗаполнитьДополнительныеРеквизитыНоменклатуры(НоваяНоменклатура, СтрокаТабличнаяЗагрузки); 
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка заполнения дополнительных свойств номенклатуры");
			Возврат;
		КонецПопытки;  
		
		Попытка
			ЗагрузитьИзображениеНаСервере(НоваяНоменклатура, СтрокаТабличнаяЗагрузки); 
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка добавления изображения номенклатуры");
			Возврат;
		КонецПопытки; 
		
		Попытка
			ЗагрузитьЗнакиУхода(НоваяНоменклатура, СтрокаТабличнаяЗагрузки); 
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка добавления знаков ухода номенклатуры");
			Возврат;
		КонецПопытки; 
		
		Попытка
			Если Не БезПроверкиШтрихкодов Тогда
				ЗаполнитьШтрихКодНоменклатуры(НоваяНоменклатура, СтрокаТабличнаяЗагрузки);
			КонецЕсли;
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка заполнения штрихкода номенклатуры");
		КонецПопытки; 
		
		// dimedrol 30.01.2025
		Попытка
			ЗаполнитьGTINНоменклатуры(НоваяНоменклатура, СтрокаТабличнаяЗагрузки);
		Исключение
			ОбщегоНазначения.СообщитьПользователю("Ошибка заполнения GTIN номенклатуры");
		КонецПопытки;
		// end of dimedrol 30.01.2025
		
	КонецЕсли;
	
	Если ТипЗнч(НоваяНоменклатура) = Тип("СправочникОбъект.Номенклатура") И НоваяНоменклатура.Ссылка <> Справочники.Номенклатура.ПустаяСсылка() Тогда 
		СтрокаТабличнаяЗагрузки.Номенклатура = НоваяНоменклатура.Ссылка; 
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ЗагрузитьИзображениеНаСервере(Номенклатура, СтрокаТабличнаяЗагрузки)  
	ИмяФайла = ""; 
	НомерСтроки = СтрокаТабличнаяЗагрузки.НомерСтроки;
	НомерСтроки = НомерСтроки + 2;
	
	АдресОбластиРисунка = "R" + НомерСтроки + "C1:R" + НомерСтроки + "C" + 1;
	Для Каждого РисунокТД ИЗ ТабДок.ПолучитьОбласть(АдресОбластиРисунка).Рисунки Цикл  
		ИмяФайла = КаталогВременныхФайлов() + Новый УникальныйИдентификатор() + ".jpg";
		РисунокТД.Картинка.Записать(ИмяФайла); 
		Прервать;
	КонецЦикла;
	
	
	Если ЗначениеЗаполнено(ИмяФайла) Тогда
		
		Файл = Новый Файл(ИмяФайла);
		Если Файл.Существует() Тогда
			
			ПрисоединенныйФайлНайден = Ложь;
			
			Если Не Номенклатура.Ссылка.Пустая() Тогда
				
				Запрос = Новый Запрос;
				Запрос.Текст =
				"ВЫБРАТЬ
				|    НоменклатураПрисоединенныеФайлы.Ссылка КАК Ссылка
				|ИЗ
				|    Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
				|ГДЕ
				|    НоменклатураПрисоединенныеФайлы.ВладелецФайла = &Номенклатура
				|    И НоменклатураПрисоединенныеФайлы.Наименование = &ИмяБезРасширения
				|    И НЕ НоменклатураПрисоединенныеФайлы.ПометкаУдаления";
				
				Запрос.УстановитьПараметр("Номенклатура", Номенклатура.Ссылка);
				Запрос.УстановитьПараметр("ИмяБезРасширения", Файл.ИмяБезРасширения);
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					
					ПрисоединенныйФайлНайден = Истина;
					ПрисоединенныйФайл = Выборка.Ссылка;
					
					Если ПрисоединенныйФайл.ДатаМодификацииУниверсальная <> Файл.ПолучитьУниверсальноеВремяИзменения() Тогда
						
						ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
						
						ИнформацияОФайле = Новый Структура;
						ИнформацияОФайле.Вставить("АдресФайлаВоВременномХранилище", ПоместитьВоВременноеХранилище(ДвоичныеДанные));
						ИнформацияОФайле.Вставить("АдресВременногоХранилищаТекста", "");
						
						РаботаСФайлами.ОбновитьФайл(ПрисоединенныйФайл, ИнформацияОФайле);
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;
			
			Если Не ПрисоединенныйФайлНайден Тогда
				
				СсылкаНаОбъект = Номенклатура.Ссылка;
				Если СсылкаНаОбъект.Пустая() Тогда
					СсылкаНаОбъект = Номенклатура.ПолучитьСсылкуНового();
					Если СсылкаНаОбъект.Пустая() Тогда
						СсылкаНаОбъект = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Номенклатура.Ссылка).ПолучитьСсылку();
						Номенклатура.УстановитьСсылкуНового(СсылкаНаОбъект);
					КонецЕсли;
				КонецЕсли;
				
				ПараметрыФайла = РаботаСФайлами.ПараметрыДобавленияФайла();
				ПараметрыФайла.ВладелецФайлов = СсылкаНаОбъект;
				ПараметрыФайла.ВремяИзмененияУниверсальное = Файл.ПолучитьУниверсальноеВремяИзменения();
				ПараметрыФайла.ИмяБезРасширения = Файл.ИмяБезРасширения;
				ПараметрыФайла.РасширениеБезТочки = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(Файл.Расширение);
				
				ДвоичныеДанные = Новый ДвоичныеДанные(ИмяФайла);
				АдресФайлаВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
				
				ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла, АдресФайлаВоВременномХранилище, "");
				
				Номенклатура.ФайлКартинки = ПрисоединенныйФайл;
				
			КонецЕсли;    
			
		КонецЕсли;
		
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДополнительныеРеквизитыНоменклатуры(Номенклатура, СтрокаТабличнаяЗагрузки) 
	
	СсылкаНаОбъект = Номенклатура.Ссылка;
	Если СсылкаНаОбъект.Пустая() Тогда
		СсылкаНаОбъект = Номенклатура.ПолучитьСсылкуНового();
		Если СсылкаНаОбъект.Пустая() Тогда
			СсылкаНаОбъект = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Номенклатура.Ссылка).ПолучитьСсылку();
			Номенклатура.УстановитьСсылкуНового(СсылкаНаОбъект);
		КонецЕсли;
	КонецЕсли;
	
	ТЗДополнительныеРеквизиты = Новый ТаблицаЗначений;
	ТЗДополнительныеРеквизиты.Колонки.Добавить("Свойство", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
	ТЗДополнительныеРеквизиты.Колонки.Добавить("Значение"); 
	
	// dimedrol 03.02.2025
	//ДополнительнйРеквизитЦвет = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Цвет", Истина);	
	ДополнительнйРеквизитЦвет = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Свойство_Цвет");
	// end of dimedrol 03.02.2025
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитЦвет) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["ГлавныйЦвет"]) Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитЦвет;     
		
		Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["ГлавныйЦвет"],,, ТЗРеквизитНоваяСтрока.Свойство);
		Если ТипЗнч(Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И ЗначениеЗаполнено(Значение) Тогда 	
			ТЗРеквизитНоваяСтрока.Значение = Значение;    
		Иначе  
			Попытка
				НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент(); 
				НовоеЗначение.Владелец = ДополнительнйРеквизитЦвет;
				НовоеЗначение.Наименование = СтрокаТабличнаяЗагрузки["ГлавныйЦвет"];
				НовоеЗначение.Записать();  
			Исключение
			КонецПопытки;    
				ТЗРеквизитНоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["ГлавныйЦвет"],,, ТЗРеквизитНоваяСтрока.Свойство);	
		КонецЕсли;
		
	КонецЕсли; 
	
	// dimedrol 25.01.2025
	Если ЗначениеЗаполнено(РеквизитПодстановкиСезон) Тогда
		
		ДополнительнйРеквизитСезон = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Сезон", Истина);
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитСезон;
		ТЗРеквизитНоваяСтрока.Значение = РеквизитПодстановкиСезон;
		
	Иначе
	// end of dimedrol 25.01.2025
		
		ДополнительнйРеквизитСезон = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Сезон", Истина);	
		
		Если ЗначениеЗаполнено(ДополнительнйРеквизитСезон) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["Сезон"]) Тогда 
			ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
			ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитСезон;
			Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["Сезон"],,, ТЗРеквизитНоваяСтрока.Свойство);
			Если ТипЗнч(Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И ЗначениеЗаполнено(Значение) Тогда 	
				ТЗРеквизитНоваяСтрока.Значение = Значение;    
			Иначе  
				Попытка
					НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент(); 
					НовоеЗначение.Владелец = ДополнительнйРеквизитСезон;
					НовоеЗначение.Наименование = СтрокаТабличнаяЗагрузки["Сезон"];
					НовоеЗначение.Записать();  
				Исключение
				КонецПопытки;    
					ТЗРеквизитНоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["Сезон"],,, ТЗРеквизитНоваяСтрока.Свойство);	
			КонецЕсли;
		
		КонецЕсли; 
		
	// dimedrol 25.01.2025
	КонецЕсли;
	// end of dimedrol 25.01.2025
	
	ДополнительнйРеквизитБренд = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Бренд", Истина);	
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитБренд) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["Бренд"]) Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитБренд;
		Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["Бренд"],,, ТЗРеквизитНоваяСтрока.Свойство);
		Если ТипЗнч(Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И ЗначениеЗаполнено(Значение) Тогда 	
			ТЗРеквизитНоваяСтрока.Значение = Значение;    
		Иначе  
			Попытка
				НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент(); 
				НовоеЗначение.Владелец = ДополнительнйРеквизитБренд;
				НовоеЗначение.Наименование = СтрокаТабличнаяЗагрузки["Бренд"];
				НовоеЗначение.Записать();  
			Исключение
			КонецПопытки;    
				ТЗРеквизитНоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["Бренд"],,, ТЗРеквизитНоваяСтрока.Свойство);	
		КонецЕсли;
	КонецЕсли; 
	
	ДополнительнйРеквизитПол = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Пол", Истина);	
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитПол) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["Пол"]) Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитПол;
		// dimedrol 30.01.2025
		//Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["Пол"],,, ТЗРеквизитНоваяСтрока.Свойство);
		СтрокаПоискаПола = ОбработатьСтрокуПоискаПола(СтрокаТабличнаяЗагрузки["Пол"]);
		Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаПоискаПола,,, ТЗРеквизитНоваяСтрока.Свойство);
		// end of dimedrol 30.01.2025
		Если ТипЗнч(Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И ЗначениеЗаполнено(Значение) Тогда 	
			ТЗРеквизитНоваяСтрока.Значение = Значение;    
		Иначе  
			Попытка
				НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент(); 
				НовоеЗначение.Владелец = ДополнительнйРеквизитПол;
				НовоеЗначение.Наименование = СтрокаТабличнаяЗагрузки["Пол"];
				НовоеЗначение.Записать();  
			Исключение
			КонецПопытки;    
				ТЗРеквизитНоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["Пол"],,, ТЗРеквизитНоваяСтрока.Свойство);	
		КонецЕсли;
	КонецЕсли;
	
	ДополнительнйРеквизитКоллекция = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Коллекция", Истина);
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитКоллекция) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["Коллекция"]) Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитКоллекция;
		Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["Коллекция"],,, ТЗРеквизитНоваяСтрока.Свойство);
		Если ТипЗнч(Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И ЗначениеЗаполнено(Значение) Тогда 	
			ТЗРеквизитНоваяСтрока.Значение = Значение;    
		Иначе  
			Попытка
				НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент(); 
				НовоеЗначение.Владелец = ДополнительнйРеквизитКоллекция;
				НовоеЗначение.Наименование = СтрокаТабличнаяЗагрузки["Коллекция"];
				НовоеЗначение.Записать();  
			Исключение
			КонецПопытки;    
				ТЗРеквизитНоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["Коллекция"],,, ТЗРеквизитНоваяСтрока.Свойство);	
		КонецЕсли;

	КонецЕсли;  
	
	ДополнительнйРеквизитСостав = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Состав", Истина);
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитСостав) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["Состав"])Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитСостав;
		ТЗРеквизитНоваяСтрока.Значение = СтрокаТабличнаяЗагрузки["Состав"];
		
	КонецЕсли; 
	
	ДополнительнйРеквизитМасса = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Масса, gsm", Истина);
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитМасса) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["Масса"]) Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитМасса;
		ТЗРеквизитНоваяСтрока.Значение = СтрокаТабличнаяЗагрузки["Масса"];
		
	КонецЕсли;
	
	ДополнительнйРеквизитПрокладка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Прокладка, gsm", Истина);
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитПрокладка) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["Прокладка"]) Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитПрокладка;
		ТЗРеквизитНоваяСтрока.Значение = СтрокаТабличнаяЗагрузки["Прокладка"];
		
	КонецЕсли;
	
	ДополнительнйРеквизитПодкладка = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Подкладка", Истина);
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитПодкладка) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["Подкладка"]) Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитПодкладка;
		ТЗРеквизитНоваяСтрока.Значение = СтрокаТабличнаяЗагрузки["Подкладка"];
		
	КонецЕсли;

	ДополнительнйРеквизитGPCБлок = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("GPC Блок", Истина);
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитGPCБлок) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["GPCБлок"]) Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитGPCБлок;
		Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["GPCБлок"],,, ТЗРеквизитНоваяСтрока.Свойство);
		Если ТипЗнч(Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И ЗначениеЗаполнено(Значение) Тогда 	
			ТЗРеквизитНоваяСтрока.Значение = Значение;    
		Иначе  
			Попытка
				НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент(); 
				НовоеЗначение.Владелец = ДополнительнйРеквизитGPCБлок;
				НовоеЗначение.Наименование = СтрокаТабличнаяЗагрузки["GPCБлок"];
				НовоеЗначение.Записать();  
			Исключение
			КонецПопытки;    
				ТЗРеквизитНоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["GPCБлок"],,, ТЗРеквизитНоваяСтрока.Свойство);	
		КонецЕсли;

	КонецЕсли;  
	
	ДополнительнйРеквизитТипМатериала = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Тип материала", Истина);	
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитТипМатериала) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["ТипМатериала"]) Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитТипМатериала;     
		
		Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["ТипМатериала"],,, ТЗРеквизитНоваяСтрока.Свойство);
		Если ТипЗнч(Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И ЗначениеЗаполнено(Значение) Тогда 	
			ТЗРеквизитНоваяСтрока.Значение = Значение;    
		Иначе  
			Попытка
				НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент(); 
				НовоеЗначение.Владелец = ДополнительнйРеквизитТипМатериала;
				НовоеЗначение.Наименование = СтрокаТабличнаяЗагрузки["ТипМатериала"];
				НовоеЗначение.Записать();  
			Исключение
			КонецПопытки;    
				ТЗРеквизитНоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["ТипМатериала"],,, ТЗРеквизитНоваяСтрока.Свойство);	
		КонецЕсли;
		
	КонецЕсли;  
	
	// dimedrol 25.01.2025
	Если ЗначениеЗаполнено(РеквизитПодстановкиПокупатель) Тогда
		
		ДополнительнйРеквизитПокупатель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Покупатель", Истина);
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитПокупатель;
		ТЗРеквизитНоваяСтрока.Значение = РеквизитПодстановкиПокупатель;
		
	Иначе
	// end of dimedrol 25.01.2025
	
		ДополнительнйРеквизитПокупатель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Покупатель", Истина);	
		
		Если ЗначениеЗаполнено(ДополнительнйРеквизитПокупатель) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["Покупатель"]) Тогда 
			ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
			ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитПокупатель;     
			
			Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["Покупатель"],,, ТЗРеквизитНоваяСтрока.Свойство);
			Если ТипЗнч(Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И ЗначениеЗаполнено(Значение) Тогда 	
				ТЗРеквизитНоваяСтрока.Значение = Значение;    
			Иначе  
				Попытка
					НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент(); 
					НовоеЗначение.Владелец = ДополнительнйРеквизитПокупатель;
					НовоеЗначение.Наименование = СтрокаТабличнаяЗагрузки["Покупатель"];
					НовоеЗначение.Записать();  
				Исключение
				КонецПопытки;    
					ТЗРеквизитНоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["Покупатель"],,, ТЗРеквизитНоваяСтрока.Свойство);	
			КонецЕсли;
			
		КонецЕсли;
	
	// dimedrol 25.01.2025
	КонецЕсли;
	// end of dimedrol 25.01.2025
	
	// ++ Терлецкий АВ 2025.01.14
	// dimedrol 03.02.2025
	//ДополнительнйРеквизитРазмер = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Размер", Истина);
	ДополнительнйРеквизитРазмер = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя","Размер_519c6e565cca491fae198d77092ae783", Истина);
	// end of dimedrol 03.02.2025
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитРазмер) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["ДопКомментарии"])Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитРазмер;
		ТЗРеквизитНоваяСтрока.Значение = СтрокаТабличнаяЗагрузки["ДопКомментарии"];
		
	КонецЕсли; 	
	
	ДополнительнйРеквизитАртикулПоставщика = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Артикул поставщика", Истина);
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитАртикулПоставщика) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["Артикль"])Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитАртикулПоставщика;
		ТЗРеквизитНоваяСтрока.Значение = СтрокаТабличнаяЗагрузки["Артикль"];
		
	КонецЕсли;
    // -- Терлецкий АВ 2025.01.14  
	
	// ++ Терлецкий АВ 25.01.22
	ДополнительнйРеквизитРазмерИД = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("SizeId", Истина);
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитРазмерИД) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["ДопКомментарии"])Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитРазмерИД;
		ТЗРеквизитНоваяСтрока.Значение = Номенклатура.Ссылка.УникальныйИдентификатор();
		
	КонецЕсли;
	// -- Терлецкий АВ 25.01.22
	
	// dimedrol 15.05.2025
	ДополнительнйРеквизитТоварнаяГруппа = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Свойство_ТоварнаяГруппа");
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитТоварнаяГруппа) И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки["ТоварнаяГруппа"]) Тогда 
		ТЗРеквизитНоваяСтрока = ТЗДополнительныеРеквизиты.Добавить();
		ТЗРеквизитНоваяСтрока.Свойство = ДополнительнйРеквизитТоварнаяГруппа;
		
		Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["ТоварнаяГруппа"],,, ТЗРеквизитНоваяСтрока.Свойство);
		Если ТипЗнч(Значение) = Тип("СправочникСсылка.ЗначенияСвойствОбъектов") И ЗначениеЗаполнено(Значение) Тогда
			ТЗРеквизитНоваяСтрока.Значение = Значение;
		Иначе
			Попытка
				НовоеЗначение = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
				НовоеЗначение.Владелец = ДополнительнйРеквизитТоварнаяГруппа;
				НовоеЗначение.Наименование = СтрокаТабличнаяЗагрузки["ТоварнаяГруппа"];
				НовоеЗначение.Записать();
			Исключение
			КонецПопытки;
			ТЗРеквизитНоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию(СтрокаТабличнаяЗагрузки["ТоварнаяГруппа"],,, ТЗРеквизитНоваяСтрока.Свойство);
		КонецЕсли;
		
	КонецЕсли;
	// end of dimedrol 15.05.2025
	
	УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(СсылкаНаОбъект, ТЗДополнительныеРеквизиты);
		
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьЗнакиУхода(Знач Номенклатура, СтрокаТабличнаяЗагрузки) 
	Если ТипЗнч(Номенклатура) = Тип("СправочникОбъект.Номенклатура") Тогда 
		Номенклатура = Номенклатура.Ссылка;
	КонецЕсли;
	Стирка           = СтрокаТабличнаяЗагрузки["Стирка"]; 
	Отбеливание      = СтрокаТабличнаяЗагрузки["Отбеливание"];
	Глажженье        = СтрокаТабличнаяЗагрузки["Глажженье"];
	Сушка            = СтрокаТабличнаяЗагрузки["Сушка"];
	УходЗаТекстилем  = СтрокаТабличнаяЗагрузки["УходЗаТекстилем"];
	
	Если ТипЗнч(Стирка) = Тип("СправочникСсылка.спЗнакиУхода") И Стирка <> Справочники.спЗнакиУхода.ПустаяСсылка() Тогда 
		ЗаполнитьРегистрЗнакиУходаВНоменклатуре(Номенклатура, Стирка);
	КонецЕсли;  
	
	Если ТипЗнч(Отбеливание) = Тип("СправочникСсылка.спЗнакиУхода") И Отбеливание <> Справочники.спЗнакиУхода.ПустаяСсылка() Тогда 
		ЗаполнитьРегистрЗнакиУходаВНоменклатуре(Номенклатура, Отбеливание);
	КонецЕсли;
	
	Если ТипЗнч(Глажженье) = Тип("СправочникСсылка.спЗнакиУхода") И Глажженье <> Справочники.спЗнакиУхода.ПустаяСсылка() Тогда 
		ЗаполнитьРегистрЗнакиУходаВНоменклатуре(Номенклатура, Глажженье);
	КонецЕсли;
	
	Если ТипЗнч(Сушка) = Тип("СправочникСсылка.спЗнакиУхода") И Сушка <> Справочники.спЗнакиУхода.ПустаяСсылка() Тогда 
		ЗаполнитьРегистрЗнакиУходаВНоменклатуре(Номенклатура, Сушка);
	КонецЕсли;
	
	Если ТипЗнч(УходЗаТекстилем) = Тип("СправочникСсылка.спЗнакиУхода") И УходЗаТекстилем <> Справочники.спЗнакиУхода.ПустаяСсылка() Тогда 
		ЗаполнитьРегистрЗнакиУходаВНоменклатуре(Номенклатура, УходЗаТекстилем);
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция НайтиЗнакУхода(ЗнакУхода)   
	ЗнакУходаСсылка = Справочники.спЗнакиУхода.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(ЗнакУхода) Тогда 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спЗнакиУхода.Ссылка КАК Ссылка,
		|	спЗнакиУхода.Наименование КАК Наименование
		|ИЗ
		|	Справочник.спЗнакиУхода КАК спЗнакиУхода
		|ГДЕ
		|	спЗнакиУхода.Наименование ПОДОБНО &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", ЗнакУхода);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗнакУходаСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		Прервать;
	КонецЦикла;
	КонецЕсли;

    Возврат ЗнакУходаСсылка;
КонецФункции

&НаСервере
Процедура ЗаполнитьРегистрЗнакиУходаВНоменклатуре(Номенклатура, ЗнакУхода) 
	НаборЗаписей = РегистрыСведений.спЗнакиУходаВНоменклатуре.СоздатьНаборЗаписей();
	Отбор = НаборЗаписей.Отбор;
	Отбор.Номенклатура.Установить(Номенклатура); 
	Отбор.ЗнакиУхода.Установить(ЗнакУхода);
	
	НаборЗаписей.Прочитать(); 
	
	Если НаборЗаписей.Количество() = 0 Тогда	
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Номенклатура 	= Номенклатура; 
		НоваяЗапись.ЗнакиУхода 		= ЗнакУхода; 
		НоваяЗапись.Использование 	= Истина; 
	ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
		НоваяЗапись = НаборЗаписей[0];
		НоваяЗапись.ЗнакиУхода 		= ЗнакУхода;	
	КонецЕсли; 
   	НаборЗаписей.Записать(); 	
КонецПроцедуры

&НаСервере
Функция НайтиРодителя(Группа)
	НайденнаяГруппа = Справочники.Номенклатура.ПустаяСсылка();
	Если ЗначениеЗаполнено(Группа) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.ЭтоГруппа
		|	И Номенклатура.Наименование ПОДОБНО &Наименование"; 
		Запрос.УстановитьПараметр("Наименование", Группа);
		Результат = Запрос.Выполнить();  
		ВыборкаРезультата = Результат.Выбрать(); 
		Пока ВыборкаРезультата.Следующий() Цикл 
			НайденнаяГруппа = ВыборкаРезультата.Ссылка;
			Прервать;
		КонецЦикла;
		
	КонецЕсли;
	Возврат НайденнаяГруппа;
КонецФункции

&НаСервере
Функция НайтиКатегорииНоменклатуры(Категория)    
	
	КатегорииНоменклатуры = Справочники.КатегорииНоменклатуры.ПустаяСсылка();
	Если ЗначениеЗаполнено(Категория) Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	КатегорииНоменклатуры.Ссылка КАК Ссылка,
		|	КатегорииНоменклатуры.Наименование КАК Наименование
		|ИЗ
		|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
		|ГДЕ
		|	КатегорииНоменклатуры.Наименование ПОДОБНО &Наименование"; 
		Запрос.УстановитьПараметр("Наименование", Категория);
		Результат = Запрос.Выполнить();  
		ВыборкаРезультата = Результат.Выбрать(); 
		Пока ВыборкаРезультата.Следующий() Цикл 
			КатегорииНоменклатуры = ВыборкаРезультата.Ссылка;
			Прервать;
		КонецЦикла;
		
	КонецЕсли;
	Возврат КатегорииНоменклатуры;

КонецФункции

&НаСервере
Функция НайтиСтавкуНДС(НДС) 
	
	СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(НДС) Тогда 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтавкиНДС.Ссылка КАК Ссылка,
		|	СтавкиНДС.Наименование КАК Наименование
		|ИЗ
		|	Справочник.СтавкиНДС КАК СтавкиНДС
		|ГДЕ
		|	СтавкиНДС.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование", НДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтавкаНДС = ВыборкаДетальныеЗаписи.Ссылка;
		Прервать;
		
	КонецЦикла;
	
	КонецЕсли;
	
	Возврат СтавкаНДС;

КонецФункции

&НаСервере
Функция ПривестиСтрокуКЧислу(ЧислоСтрокой)

    ОписаниеТипаЧисла = Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15, 2));
    ЗначениеЧисла = ОписаниеТипаЧисла.ПривестиЗначение(ЧислоСтрокой);

    Возврат ЗначениеЧисла;

КонецФункции

&НаСервере
Функция ПолучитьПеречислениеПоИмени(Знач Наименование, Знач Тип)  
	Если Тип <> "" Тогда	
		ПеречислениеСсылка = Неопределено;
		СтрокаВыполнить = "ПеречислениеСсылка = Перечисления." + Тип + "." + Наименование; 		 
		Попытка  		
			Выполнить СтрокаВыполнить; 		
		Исключение

		КонецПопытки; 		
	Иначе 
		ПеречислениеСсылка = Неопределено;	
	КонецЕсли;
	Возврат ПеречислениеСсылка;  	
КонецФункции

&НаКлиенте
Процедура ТабличнаяЗагрузкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	НомерСтроки = Элемент.ТекущиеДанные.НомерСтроки;
    НомерСтроки = НомерСтроки + 2;
	ФотоИзображение = ПолучитьКартинку(НомерСтроки);
КонецПроцедуры  

&НаСервере
Функция ПолучитьКартинку(НомерСтроки) 
	АдресКартинки = "";
	АдресОбластиРисунка = "R" + НомерСтроки + "C1:R" + НомерСтроки + "C" + 1;
	Для Каждого РисунокТД ИЗ ТабДок.ПолучитьОбласть(АдресОбластиРисунка).Рисунки Цикл  
		ИмяФайлаРисунка = КаталогВременныхФайлов() + Новый УникальныйИдентификатор() + ".jpg";
		РисунокТД.Картинка.Записать(ИмяФайлаРисунка); 
		ДД = Новый ДвоичныеДанные(ИмяФайлаРисунка);
		АдресКартинки = ПоместитьВоВременноеХранилище(ДД);
		Прервать;
	КонецЦикла;
	Возврат АдресКартинки;
КонецФункции

&НаКлиенте
Функция СоздатьУникальноеИмяФайла() 
	Префикс = "";
	ИмяДата = "";
	ИмяВремя = "";
	УИД = Новый УникальныйИдентификатор();
	
	ИмяДата = Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=yyyy-MM-dd");
	ИмяВремя = Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=ЧЧ:мм:сс"); 	
	
	МоеУникальноеИмяФайла = СтрЗаменить(ИмяДата,"-","") + "_" + СтрЗаменить(ИмяВремя,":","") + "_" + УИД; 
	Возврат МоеУникальноеИмяФайла;
КонецФункции 

&НаКлиенте
Функция СоздатьКаталогВыгрузки()
	//Каталог = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла(""));   
	Каталог = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогВременныхФайлов());
	СоздатьКаталог(Каталог);   
	Возврат Каталог;
КонецФункции

&НаСервере
Функция ОчиститьСтроку(ИсходнаяСтрока) 
	ИсходнаяСтрока = СокрЛП(ИсходнаяСтрока);
	ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока, Символы.ПС,"");
	ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока, Символы.ВК,"");   
	Возврат ИсходнаяСтрока;
КонецФункции

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы) 
	ТаблицаЗагрузкиНоменклатураХарактеристика = Новый Массив;
	Если Объект.ТабличнаяЗагрузки.Количество() > 0 Тогда 
		Для каждого СтрокаТаблицы Из Объект.ТабличнаяЗагрузки Цикл
			Если ТипЗнч(СтрокаТаблицы.Номенклатура) = Тип("СправочникСсылка.Номенклатура") 
				И СтрокаТаблицы.Номенклатура <> ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда 
				РезультатПодбора = Новый Структура;
				РезультатПодбора.Вставить("Номенклатура", СтрокаТаблицы.Номенклатура);
				РезультатПодбора.Вставить("Количество", СтрокаТаблицы.Всего);  
				РезультатПодбора.Вставить("Цена", СтрокаТаблицы.Цена); 
				ТаблицаЗагрузкиНоменклатураХарактеристика.Добавить(РезультатПодбора);  
			КонецЕсли;
		КонецЦикла;
		ОповеститьОВыборе(ТаблицаЗагрузкиНоменклатураХарактеристика); 
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьШтрихКодНоменклатуры(НоваяНоменклатура, СтрокаТабличнаяЗагрузки) 
	НоваяНоменклатураСсылка = НоваяНоменклатура.Ссылка; // ++ Терлецкий АВ 25.01.22
	
	Если ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки.Штрихкод) И НоваяНоменклатураСсылка <> Справочники.Номенклатура.ПустаяСсылка() Тогда // ++ Терлецкий АВ 25.01.22 
	
	НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
	Отбор = НаборЗаписей.Отбор;
	Отбор.Штрихкод.Установить(СтрокаТабличнаяЗагрузки.Штрихкод); 
	Отбор.Номенклатура.Установить(НоваяНоменклатураСсылка); // ++ Терлецкий АВ 25.01.22
	
	НаборЗаписей.Прочитать(); 
	
	Если НаборЗаписей.Количество() = 0 Тогда	
		НоваяЗапись = НаборЗаписей.Добавить(); 
		НоваяЗапись.Штрихкод			= СтрокаТабличнаяЗагрузки.Штрихкод; 
		НоваяЗапись.Номенклатура 		= НоваяНоменклатураСсылка; 	
	КонецЕсли; 
   	НаборЗаписей.Записать();  
	
	// dimedrol 30.01.2025
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() > 0 Тогда
		НоваяНоменклатураОбъект = НоваяНоменклатураСсылка.ПолучитьОбъект();
		НоваяНоменклатураОбъект.Штрихкод = СтрокаТабличнаяЗагрузки.Штрихкод;
		Попытка	
			НоваяНоменклатураОбъект.Записать();
		Исключение
			ТекстСообщения = НСтр("ru = 'Ошибка заполнения реквизита штрихкод номенклатуры: %ИнформацияОбОшибке%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%ИнформацияОбОшибке%", ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Возврат;
		КонецПопытки;
	КонецЕсли;
	// end of dimedrol 30.01.2022
	
	КонецЕсли;
КонецПроцедуры

// dimedrol 30.01.2025
&НаСервере
Процедура ЗаполнитьGTINНоменклатуры(НоваяНоменклатура, СтрокаТабличнаяЗагрузки) 
	
	НоваяНоменклатураСсылка = НоваяНоменклатура.Ссылка;
	
	GTIN = ШтрихкодEANИзGTIN(СтрокаТабличнаяЗагрузки.GTIN);
	
	Если ЗначениеЗаполнено(GTIN) И НоваяНоменклатураСсылка <> Справочники.Номенклатура.ПустаяСсылка() Тогда
		
		НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей();
		Отбор = НаборЗаписей.Отбор;
		Отбор.Штрихкод.Установить(GTIN);
		Отбор.Номенклатура.Установить(НоваяНоменклатураСсылка);
		
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() = 0 Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Штрихкод			= GTIN;
			НоваяЗапись.Номенклатура 		= НоваяНоменклатураСсылка;
		КонецЕсли; 
		НаборЗаписей.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Вычисляет штрихкод EAN из GTIN.
// 
// Параметры:
//  Штрихкод - Строка - GTIN.
// Возвращаемое значение:
//  Строка - Вычисленное значение EAN.
&НаСервере
Функция ШтрихкодEANИзGTIN(Знач Штрихкод) Экспорт
	
	Если Лев(Штрихкод, 1) = "0" Тогда
		Штрихкод = Сред(Штрихкод, 2); //EAN13
		Если Лев(Штрихкод, 5) = "00000" Тогда
			Штрихкод = Сред(Штрихкод, 6); //EAN8
		КонецЕсли;
	КонецЕсли;
	
	Возврат Штрихкод;
	
КонецФункции

&НаСервере
Функция НайтиЦветПоНаименованию(ПредставлениеЦвета)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	спЦвета.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.спЦвета КАК спЦвета
	|ГДЕ
	|	спЦвета.Наименование = &Наименование
	|	И НЕ спЦвета.ЭтоГруппа";
	
	Запрос.УстановитьПараметр("Наименование", ПредставлениеЦвета);
	Результат = Запрос.Выполнить();
	ВыборкаРезультата = Результат.Выбрать();
	
	Если ВыборкаРезультата.Следующий() Тогда
		ЦветСсылка = ВыборкаРезультата.Ссылка;
	Иначе
		ЦветСсылка = Справочники.спЦвета.ПустаяСсылка();
	КонецЕсли;
		
	Возврат ЦветСсылка;
	
КонецФункции

&НаСервере
Функция НайтиСоздатьКонтрагента(ПредставлениеКонтрагента, ПредставлениеАдреса)
	
	Контрагент = Справочники.Контрагенты.НайтиПоНаименованию(ПредставлениеКонтрагента, Истина);
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Возврат Контрагент;
	КонецЕсли;
	
	КонтрагентОбъект = Справочники.Контрагенты.СоздатьЭлемент();
	КонтрагентОбъект.Наименование = ПредставлениеКонтрагента;
	КонтрагентОбъект.Заполнить(Неопределено);
	КонтрагентОбъект.Поставщик = Истина;
	Если ЗначениеЗаполнено(ПредставлениеАдреса) Тогда
		
		ВидКИ = Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента;
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.Адрес;
		
		Значение = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияПоПредставлению(СокрЛП(ПредставлениеАдреса), ВидКИ);
		УправлениеКонтактнойИнформацией.ДобавитьКонтактнуюИнформацию(КонтрагентОбъект, Значение, ВидКИ, , Ложь);
		
	КонецЕсли;
	КонтрагентОбъект.Записать();
	
	Возврат КонтрагентОбъект.Ссылка;
	
КонецФункции

&НаСервере
Функция ОбработатьСтрокуПоискаПола(СтрокаПоискаПола)
	
	Если СтрокаПоискаПола = "дев" Тогда
		Возврат "девочки";
	ИначеЕсли СтрокаПоискаПола = "мал" Тогда
		Возврат "мальчики";
	Иначе
		Возврат СтрокаПоискаПола;
	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПроверитьЗаполнениеДанных()
	
	ОшибокНет = Истина;
	
	НомерСтроки = 0;
	Для Каждого СтрокаОбъектТабличнаяЗагрузки Из Объект.ТабличнаяЗагрузки Цикл
		
		НомерСтроки = НомерСтроки + 1;
		
		Если НЕ ЗначениеЗаполнено(СтрокаОбъектТабличнаяЗагрузки.Номенклатура) Тогда
			
			ТекстСообщения = НСтр("ru = 'В строке %НомерСтроки% не указана номенклатура.'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%НомерСтроки%", НомерСтроки);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ТабличнаяЗагрузки");
			
			ОшибокНет = Ложь;
			
		КонецЕсли
		
	КонецЦикла;
	
	Если Не ЗначениеЗаполнено(ВидЦены) Тогда
		
		ТекстСообщения = НСтр("ru = 'Не указан вид цены для установки.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "ВидЦены");
		
		ОшибокНет = Ложь;
		
	КонецЕсли;
	
	Возврат ОшибокНет;
	
КонецФункции

&НаСервере
Процедура СоздатьУстановкуЦенНоменклатурыНаСервере()
	
	Если НЕ ПроверитьЗаполнениеДанных() Тогда
		
		Возврат;
		
	КонецЕсли;
	
	ДокументУстановкаЦенНоменклатурыОбъект = Документы.УстановкаЦенНоменклатуры.СоздатьДокумент();
	
	ДокументУстановкаЦенНоменклатурыОбъект.Дата        = ТекущаяДатаСеанса();
	ДокументУстановкаЦенНоменклатурыОбъект.Автор       = Пользователи.АвторизованныйПользователь();
	ДокументУстановкаЦенНоменклатурыОбъект.Комментарий = "Документ цен создан программно";
	
	ДокументУстановкаЦенНоменклатурыОбъект.ПоказыватьДействующуюЦену  = Истина;
	ДокументУстановкаЦенНоменклатурыОбъект.ПоказыватьЕдиницыИзмерения = Истина;
	ДокументУстановкаЦенНоменклатурыОбъект.ПоказыватьХарактеристики   = Истина;
	ДокументУстановкаЦенНоменклатурыОбъект.ПоказыватьОтклонениеЦен    = Истина;
	ДокументУстановкаЦенНоменклатурыОбъект.ПоказыватьНовуюЦену        = Истина;
	
	ЗаписатьДокумент = Ложь;
	
	ТЧЗапасы = ДокументУстановкаЦенНоменклатурыОбъект.Запасы;
	Отбор = Новый Структура( "Номенклатура, Характеристика, ЕдиницаИзмерения, ВидЦены, Валюта" );
	Для Каждого ТоварыСтрока Из Объект.ТабличнаяЗагрузки Цикл
	
		Отбор.Номенклатура     = ТоварыСтрока.Номенклатура;
		Отбор.Номенклатура     = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		Отбор.ЕдиницаИзмерения = ТоварыСтрока.Номенклатура.ЕдиницаИзмерения;
		Отбор.ВидЦены          = ВидЦены;
		Отбор.Валюта           = ВидЦены.ВалютаЦены;
		
		ТЧЗапасыСтроки = ТЧЗапасы.НайтиСтроки(Отбор);
		Если ТЧЗапасыСтроки.Количество() = 0 Тогда
		
			ТЧЗапасыСтрока = ТЧЗапасы.Добавить();
			
			ТЧЗапасыСтрока.Номенклатура     = ТоварыСтрока.Номенклатура;
			ТЧЗапасыСтрока.Характеристика   = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
			ТЧЗапасыСтрока.ЕдиницаИзмерения = ТоварыСтрока.Номенклатура.ЕдиницаИзмерения;
			ТЧЗапасыСтрока.ВидЦены          = ВидЦены;
			ТЧЗапасыСтрока.Валюта           = ВидЦены.ВалютаЦены;
			
		Иначе
			ТЧЗапасыСтрока = ТЧЗапасыСтроки[0];
		КонецЕсли;
		
		Если ТЧЗапасыСтрока.Цена <> ТоварыСтрока.Цена Тогда
			ТЧЗапасыСтрока.Цена = ТоварыСтрока.Цена;
			ЗаписатьДокумент = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗаписатьДокумент = Истина Тогда
		ДокументУстановкаЦенНоменклатурыОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Комментарий = "Заполнен и записан документ: " + ДокументУстановкаЦенНоменклатурыОбъект;
		ОбщегоНазначения.СообщитьПользователю(Комментарий);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоздатьУстановкуЦенНоменклатуры(Команда)
	СоздатьУстановкуЦенНоменклатурыНаСервере();
КонецПроцедуры
// end of dimedrol 30.01.2025

&НаСервере
Функция НайтиТНВЭД(КодТНВЭД)
	
	КодТНВЭДСсылка = Справочники.КлассификаторТНВЭД.ПустаяСсылка();
	
	Если ЗначениеЗаполнено(КодТНВЭД) Тогда 
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КлассификаторТНВЭД.Ссылка КАК Ссылка,
		|	КлассификаторТНВЭД.Код КАК Код,
		|	КлассификаторТНВЭД.Наименование КАК Наименование
		|ИЗ
		|	Справочник.КлассификаторТНВЭД КАК КлассификаторТНВЭД
		|ГДЕ
		|	КлассификаторТНВЭД.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", КодТНВЭД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КодТНВЭДСсылка = ВыборкаДетальныеЗаписи.Ссылка;
		Прервать;
	КонецЦикла;
	КонецЕсли;

    Возврат КодТНВЭДСсылка;

КонецФункции

&НаСервере
Процедура ЗаполнитьНоменклатуру(СтрокаТабличнаяЗагрузки)
	
	Если ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки.Штрихкод) 
		Или (БезПроверкиШтрихкодов И ЗначениеЗаполнено(СтрокаТабличнаяЗагрузки.Артикул1С)) Тогда
		
		// { Иванов С.С. (TNext) - 02.06.2025 - Задача №2502 
		// Добавлен поиск по артикулу 1С для перезаписи существующих товаров
		// }
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Партия КАК Партия,
		|	ШтрихкодыНоменклатуры.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТ_Результат
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод ПОДОБНО &Штрихкод
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Номенклатура.Штрихкод,
		|	Номенклатура.Ссылка,
		|	НЕОПРЕДЕЛЕНО,
		|	Номенклатура.ЕдиницаИзмерения
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Артикул = &Артикул1С
		|	И Номенклатура.Артикул <> """"
		|	И НЕ Номенклатура.ПометкаУдаления
		|	И НЕ Номенклатура.ЭтоГруппа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Результат.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВТ_Результат КАК ВТ_Результат
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Результат.Номенклатура";
		
		Запрос.УстановитьПараметр("Штрихкод", СтрокаТабличнаяЗагрузки.Штрихкод); 
		Запрос.УстановитьПараметр("Артикул1С", ?(Дозагрузка, СтрокаТабличнаяЗагрузки.Артикул1С, ""));
		                   
		Результат = Запрос.Выполнить();  
		ВыборкаРезультата = Результат.Выбрать(); 
		Пока ВыборкаРезультата.Следующий() Цикл 
			СтрокаТабличнаяЗагрузки.Номенклатура = ВыборкаРезультата.Номенклатура;
			Прервать;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура СоздатьНоменклатуруХарактеристикуНаСервере() 
	
	Для каждого СтрокаОбъектТабличнаяЗагрузки Из Объект.ТабличнаяЗагрузки Цикл
	    ЗаполнитьНоменклатуру(СтрокаОбъектТабличнаяЗагрузки);  
		Если Дозагрузка Или (ЗначениеЗаполнено(СтрокаОбъектТабличнаяЗагрузки.Артикль)
			И ЗначениеЗаполнено(СтрокаОбъектТабличнаяЗагрузки.ДопКомментарии)
			И НЕ ЗначениеЗаполнено(СтрокаОбъектТабличнаяЗагрузки.Номенклатура)) Тогда
			СоздатьПерезаполнитьНоменклатуру(СтрокаОбъектТабличнаяЗагрузки);
		КонецЕсли;
		
	КонецЦикла;    
	
	УсловноеОформлениеТаблицыЗагрузки();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуруХарактеристику(Команда)
	СоздатьНоменклатуруХарактеристикуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЧитатьСоСтроки = 2;
	
	// dimedrol 25.01.2025
	// Установим отборы для реквизитов заполнения
	ДополнительнйРеквизитПокупатель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Покупатель", Истина);
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитПокупатель) Тогда
		ПараметрыВыбора = Новый Массив;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ДополнительнйРеквизитПокупатель));
		Элементы.РеквизитПодстановкиПокупатель.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	КонецЕсли;
	
	ДополнительнйРеквизитСезон = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Сезон", Истина);
	
	Если ЗначениеЗаполнено(ДополнительнйРеквизитСезон) Тогда
		ПараметрыВыбора = Новый Массив;
		ПараметрыВыбора.Добавить(Новый ПараметрВыбора("Отбор.Владелец", ДополнительнйРеквизитСезон));
		Элементы.РеквизитПодстановкиСезон.ПараметрыВыбора = Новый ФиксированныйМассив(ПараметрыВыбора);
	КонецЕсли;
	// end of dimedrol 25.01.2025
	
КонецПроцедуры

&НаКлиенте
Процедура ТабличнаяЗагрузкиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УсловноеОформлениеТаблицыЗагрузки(); 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыПоКатегории(НоваяНоменклатура)  
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КатегорииНоменклатуры.МетодОценки КАК МетодОценки,
		|	КатегорииНоменклатуры.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	КатегорииНоменклатуры.СпособПополнения КАК СпособПополнения,
		|	КатегорииНоменклатуры.СчетУчетаЗапасов КАК СчетУчетаЗапасов,
		|	КатегорииНоменклатуры.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
		|	КатегорииНоменклатуры.УдалитьВидПродукцииИС КАК ВидПродукцииИС
		|ИЗ
		|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
		|ГДЕ
		|	КатегорииНоменклатуры.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", НоваяНоменклатура.КатегорияНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		 НоваяНоменклатура.МетодОценки 				= ВыборкаДетальныеЗаписи.МетодОценки; 
		 НоваяНоменклатура.НаправлениеДеятельности 	= ВыборкаДетальныеЗаписи.НаправлениеДеятельности; 
		 НоваяНоменклатура.СпособПополнения 		= ВыборкаДетальныеЗаписи.СпособПополнения; 
		 НоваяНоменклатура.СчетУчетаЗапасов 		= ВыборкаДетальныеЗаписи.СчетУчетаЗапасов;
		 НоваяНоменклатура.СчетУчетаЗатрат  		= ВыборкаДетальныеЗаписи.СчетУчетаЗатрат;
		 НоваяНоменклатура.ВидПродукцииИС  			= ВыборкаДетальныеЗаписи.ВидПродукцииИС;
		 НоваяНоменклатура.Записать();
		 Прервать;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
