   
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Ссылка", Объект.Ссылка);
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Отказ = Истина;	
	КонецЕсли;
	
	КэшДанныхГОСИС = Новый Структура;
	
	ЗаполнитьПломбыПоДаннымРегистра();
	
	МассивНоменклатуры = ПолучитьНоменклатуруДокумента(Объект.Ссылка);
	НоменклатураДокумента = Новый ФиксированныйМассив(МассивНоменклатуры);
	Элементы.ПломбыНоменклатура.СписокВыбора.ЗагрузитьЗначения(МассивНоменклатуры);
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	// Конец ПодключаемоеОборудование	

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		Если ИмяСобытия = "ScanData" Тогда
			Данные = МенеджерОборудованияУНФКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			ПолученыШтрихкоды(Данные);
		КонецЕсли;
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблиц

&НаКлиенте
Процедура ПломбыНоменклатураПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Пломбы.ТекущиеДанные;
	ТекущиеДанные.НомерПломбы = "";
	
	Для каждого СтрокаПломбы Из Объект.Пломбы Цикл
		
		Если СтрокаПломбы.НомерСтроки = ТекущиеДанные.НомерСтроки Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаПломбы.Номенклатура = ТекущиеДанные.Номенклатура Тогда
			ПоказатьПредупреждение(, 
				СтрШаблон(НСтр("ru = 'Номенклатура ""%1"" уже выбрана в строке %2.'"), 
				ТекущиеДанные.Номенклатура, СтрокаПломбы.НомерСтроки));
				
			ТекущиеДанные.Номенклатура = "";
			Прервать;
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОчиститьНомерПломбы(Команда)
	
	ТекущиеДанные = Элементы.Пломбы.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекущиеДанные.НомерПломбы = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ТекШтрихкод = "";
	
	ОбработкаЗавершения = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект,
		Новый Структура("ТекШтрихкод", ТекШтрихкод));

	#Если МобильныйКлиент Тогда
	ОткрытьФорму("ОбщаяФорма.ФормаПоискаПоШтрихкоду", , , , , , ОбработкаЗавершения);
	#Иначе
	ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("Структура") Тогда
		Если Результат.Свойство("Штрихкод") Тогда
			ТекШтрихкод = Результат.Штрихкод;
		Иначе
			ТекШтрихкод = "";
		КонецЕсли;
	ИначеЕсли Результат <> Неопределено Тогда
		ТекШтрихкод = Результат;
	ИначеЕсли ТипЗнч(ДополнительныеПараметры) = Тип("Структура")
		И ДополнительныеПараметры.Свойство("ТекШтрихкод") Тогда
		ТекШтрихкод = ДополнительныеПараметры.ТекШтрихкод;
	Иначе
		ТекШтрихкод = "";
	КонецЕсли;
	
	ТекШтрихкод = СокрЛП(ТекШтрихкод);
	
	Если ПустаяСтрока(ТекШтрихкод) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеШтрихкодов = Новый Массив();
	ДанныеШтрихкодов.Добавить(Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1));
	
	ПолученыШтрихкоды(ДанныеШтрихкодов);
	
КонецПроцедуры // ПоискПоШтрихкодуЗавершение()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьПломбыПоДаннымРегистра()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спПломбы.Номенклатура КАК Номенклатура,
		|	спПломбы.НомерПломбы КАК НомерПломбы
		|ИЗ
		|	РегистрСведений.спПломбы КАК спПломбы
		|ГДЕ
		|	спПломбы.Объект = &Объект";
	
	Запрос.УстановитьПараметр("Объект", Объект.Ссылка);
	
	Объект.Пломбы.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкоды(ДанныеШтрихкодов) Экспорт
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли;
	
	ТипСсылки = ТипЗнч(Объект.Ссылка);
	Для Каждого Элемент Из МассивШтрихкодов Цикл
		
		ДополнительныеДанныеПоШтрихкоду = 
			ШтрихкодированиеУНФКлиент.ДополнительныеДанныеПоШтрихкоду(Элемент.Штрихкод, ТипСсылки);
			
		ОбработатьКакМаркировкуТоваров = ДополнительныеДанныеПоШтрихкоду.ЭтоКодМаркировки
			И (КэшДанныхГОСИС.Свойство("ИнтеграцияИСМП")
			ИЛИ КэшДанныхГОСИС.Свойство("ИнтеграцияЕГАИС"));
		
		Если ОбработатьКакМаркировкуТоваров Тогда
			//ОбработатьКодМаркировки(Элемент);
		ИначеЕсли ДополнительныеДанныеПоШтрихкоду.ЕстьРазделительGS1 Тогда
			Элемент.Штрихкод = ДополнительныеДанныеПоШтрихкоду.ПредставлениеШтрихкода;
			ПолученыШтрихкодыБезГОСИС(Элемент);
		Иначе
			ПолученыШтрихкодыБезГОСИС(Элемент);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПолученыШтрихкоды()

&НаКлиенте
Процедура ПолученыШтрихкодыБезГОСИС(ДанныеШтрихкодов)
	
	Модифицированность = Истина;
	
	НеДобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрихкодов);
	НеизвестныеШтрихкоды		= НеДобавленныеШтрихкоды.НеизвестныеШтрихкоды;
	ШтрихкодыНекорректногоТипа	= НеДобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
	
	ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	
	Если НеизвестныеШтрихкоды.Количество() > 0 Тогда
		
		Оповещение = Новый ОписаниеОповещения("ПолученыШтрихкодыЗавершение", ЭтотОбъект, НеизвестныеШтрихкоды);
		
		ОткрытьФорму(
			"РегистрСведений.ШтрихкодыНоменклатуры.Форма.РегистрацияШтрихкодовНоменклатуры",
			Новый Структура("НеизвестныеШтрихкоды", НеизвестныеШтрихкоды), ЭтотОбъект,,,,Оповещение);
		
		Возврат;
		
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыЗавершение(ВозвращаемыеПараметры, Параметры) Экспорт
	
	НеизвестныеШтрихкоды = Параметры;
	
	Если ВозвращаемыеПараметры <> Неопределено Тогда
		
		МассивШтрихкодов = Новый Массив;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ЗарегистрированныеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		Для каждого ЭлементМассива Из ВозвращаемыеПараметры.ПолученыНовыеШтрихкоды Цикл
			МассивШтрихкодов.Добавить(ЭлементМассива);
		КонецЦикла;
		
		НеДобавленныеШтрихкоды		= ЗаполнитьПоДаннымШтрихкодов(МассивШтрихкодов);
		НеизвестныеШтрихкоды		= НеДобавленныеШтрихкоды.НеизвестныеШтрихкоды;
		ШтрихкодыНекорректногоТипа	= НеДобавленныеШтрихкоды.ШтрихкодыНекорректногоТипа;
		ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа);
	КонецЕсли;
	
	ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыНекорректногоТипа(ШтрихкодыНекорректногоТипа) Экспорт
	
	Для каждого ТекНекорректныйШтрихкод Из ШтрихкодыНекорректногоТипа Цикл
		
		СтрокаСообщения = НСтр("ru = 'Введенный штрихкод %1 не соответствует формату EAN-13 и не подходит для этой табличной части'");
		СтрокаСообщения = СтрШаблон(СтрокаСообщения, ТекНекорректныйШтрихкод.Штрихкод);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолученыШтрихкодыФрагмент(НеизвестныеШтрихкоды) Экспорт
	
	Для каждого ТекНеизвестныйШтрихкод Из НеизвестныеШтрихкоды Цикл
		
		СтрокаСообщения = НСтр("ru = 'Данные по штрихкоду не найдены: %1%; количество: %2%'");
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%1%", ТекНеизвестныйШтрихкод.Штрихкод);
		СтрокаСообщения = СтрЗаменить(СтрокаСообщения, "%2%", ТекНеизвестныйШтрихкод.Количество);
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Функция ЗаполнитьПоДаннымШтрихкодов(ДанныеШтрихкодов)
	
	СписокОшибок = Новый Массив;
	
	НеизвестныеШтрихкоды = Новый Массив;
	ШтрихкодыНекорректногоТипа = Новый Массив;
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли; 
	
	ДанныеПоШтрихКодам = ПолучитьДанныеПоШтрихКодам(МассивШтрихкодов, Объект.Ссылка);
	
	Для каждого ТекШтрихкод Из МассивШтрихкодов Цикл
		
		Если Сред(ТекШтрихкод.Штрихкод, 3, 2) = "17" Тогда
			//Это пломба
			СтрокаПломбы = Элементы.Пломбы.ТекущиеДанные;
			Если Объект.Пломбы.Количество() = 0 Или СтрокаПломбы = Неопределено Тогда
				СписокОшибок.Добавить(НСтр("ru = 'Для ввода номера пломбы выберите строку с номенклатурой.'"));
			Иначе 
				Если Не ЗначениеЗаполнено(СтрокаПломбы.Номенклатура) Тогда
					СписокОшибок.Добавить(СтрШаблон(
						НСтр("ru = 'Не выбрана номенклатура в строке %1.'"), СтрокаПломбы.НомерСтроки));
				ИначеЕсли ЗначениеЗаполнено(СтрокаПломбы.НомерПломбы) Тогда
					СписокОшибок.Добавить(СтрШаблон(
						НСтр("ru = 'Номер пломбы в строке %1 заполнен. Необходимо удалить прежние данные.'"), СтрокаПломбы.НомерСтроки));
				Иначе
					Если Не НомерПомбыУникален(ТекШтрихкод.Штрихкод, СтрокаПломбы.НомерСтроки, СписокОшибок) Тогда
						Продолжить;	
					КонецЕсли; 
					
					ДанныеПоШтрихкоду = МенеджерОборудованияМаркировкаКлиент.РазобратьШтриховойКодТовара(ТекШтрихкод.Штрихкод);
					Если Не ДанныеПоШтрихкоду.ТипИдентификатораТовара = 
							ПредопределенноеЗначение("Перечисление.ТипыИдентификаторовТовараККТ.КодТовараВФорматеEAN13") Тогда
						СвойстваШтрихКода = Новый Структура;
						СвойстваШтрихКода.Вставить("Штрихкод", ТекШтрихкод.Штрихкод);
						ШтрихкодыНекорректногоТипа.Добавить(СвойстваШтрихКода);
						Продолжить;
					КонецЕсли;
						
					СтрокаПломбы.НомерПломбы = ТекШтрихкод.Штрихкод;
					
					ПараметрыЗаписи = Новый Структура;
					ПараметрыЗаписи.Вставить("Объект", Объект.Ссылка);
					ПараметрыЗаписи.Вставить("Номенклатура", СтрокаПломбы.Номенклатура);
					ПараметрыЗаписи.Вставить("НомерПломбы", ТекШтрихкод.Штрихкод);
					ПараметрыЗаписи.Вставить("ДатаСканирования", ТекущаяДата());
					ПараметрыЗаписи.Вставить("РабочееМесто", ИмяКомпьютера());
					
					ЗаписатьВводПломбы(ПараметрыЗаписи);
					Модифицированность = Ложь;
				КонецЕсли;
			КонецЕсли;
		Иначе
			// Это номенклатура
			ДанныеШтрихкода = ДанныеПоШтрихКодам[ТекШтрихкод.Штрихкод];
			
			Если ДанныеШтрихкода <> Неопределено И ДанныеШтрихкода.Количество() = 0 Тогда
				ДанныеПоШтрихкоду = МенеджерОборудованияМаркировкаКлиент.РазобратьШтриховойКодТовара(ТекШтрихкод.Штрихкод);
				Если ДанныеПоШтрихкоду.ТипИдентификатораТовара = 
						ПредопределенноеЗначение("Перечисление.ТипыИдентификаторовТовараККТ.КодТовараВФорматеEAN13") Тогда
					НеизвестныеШтрихкоды.Добавить(ТекШтрихкод);
				Иначе
					СвойстваШтрихКода = Новый Структура;
					СвойстваШтрихКода.Вставить("Штрихкод", ТекШтрихкод.Штрихкод);
				   	ШтрихкодыНекорректногоТипа.Добавить(СвойстваШтрихКода);
				КонецЕсли;
			Иначе
				СтрокаДобавлена = Ложь;
				Для каждого ТекДанныеШтрихкода Из ДанныеШтрихкода Цикл
					
					НоменклатураСтроки = НоменклатураДокумента.Найти(ТекДанныеШтрихкода.Номенклатура);
					Если Не НоменклатураСтроки = Неопределено Тогда
						
						СуществующиеСтроки = Объект.Пломбы.НайтиСтроки(Новый Структура("Номенклатура", ТекДанныеШтрихкода.Номенклатура));
						Если СуществующиеСтроки.Количество() = 0 Тогда 
					    	НоваяПломба = Объект.Пломбы.Добавить();
							НоваяПломба.Номенклатура = ТекДанныеШтрихкода.Номенклатура;
						КонецЕсли;
						
						СтрокаДобавлена = Истина;
						Прервать;
					КонецЕсли;
				
				КонецЦикла;
				
				Если Не СтрокаДобавлена Тогда
					СписокОшибок.Добавить(СтрШаблон(
						НСтр("ru = 'В документе отсутствует номенклатура с штрихкодом ""%1"".'"), ТекШтрихкод.Штрихкод));
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Для каждого Ошибка Из СписокОшибок Цикл
		ОбщегоНазначенияКлиент.СообщитьПользователю(Ошибка);	
	КонецЦикла;
	
	Возврат Новый Структура("НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа", НеизвестныеШтрихкоды, ШтрихкодыНекорректногоТипа);
	
КонецФункции

&НаСервере
Функция НомерПомбыУникален(НомерПломбы, НомерСтроки, СписокОшибок)
	
	КонтролироватьУникальностьПломб = спПломбыСервер.ЗначениеКонстанты("спКонтролироватьУникальностьПломб");
	Если Не КонтролироватьУникальностьПломб Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для каждого Пломба Из Объект.Пломбы Цикл
		Если Пломба.НомерСтроки = НомерСтроки Тогда
			Продолжить;
		КонецЕсли;
		Если Пломба.НомерПломбы = НомерПломбы Тогда 
			СписокОшибок.Добавить(СтрШаблон(
				НСтр("ru = 'Выбранная пломба уже использована в строке %1.'"), Пломба.НомерСтроки));
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;

	Возврат Истина;

КонецФункции // НомерПомбыУникален()

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоПродажа(ВидОперации)
	
	Возврат ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю")
		Или ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыОперацийРасходнаяНакладная.ВыкупТоваровКомиссионером");
	
КонецФункции 
	
&НаСервереБезКонтекста
Функция ПолучитьДанныеПоШтрихКодам(МассивШтрихкодов, Ссылка)
	
	Возврат РегистрыСведений.ШтрихкодыНоменклатуры.ПолучитьДанныеПоШтрихкодамВМассиве(МассивШтрихкодов);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНоменклатуруДокумента(Ссылка) 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура
		|ИЗ
		|	#ПолноеИмяТаблицы КАК ТаблицаНоменклатуры
		|ГДЕ
		|	ТаблицаНоменклатуры.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНоменклатуры.Номенклатура";
	
	ПолноеИмяДокумента = Ссылка.Метаданные().ПолноеИмя();
	ПолноеИмяТаблицы = ПолноеИмяДокумента + ".Запасы";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ПолноеИмяТаблицы", ПолноеИмяТаблицы); 
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Номенклатура");	
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьВводПломбы(ПараметрыЗаписи)
	
	УстановитьПривилегированныйРежим(Истина);
	
	МенеджерЗаписи = РегистрыСведений.спПломбы.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ПараметрыЗаписи);
	МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Записать(); 
	
КонецПроцедуры

#КонецОбласти
