#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеОтображениемЭлементовФормы();
	
	УсловноеОформлениеФормы();
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ТипыОборудования.СканерШтрихкода = Истина;
		МенеджерОборудования.ПриСозданииНаСервере(ЭтотОбъект, ТипыОборудования);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
	Автор = Пользователи.ТекущийПользователь();
    Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
	ВидимостьЭлементовФормы();
	
	Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
		СтруктурнаяЕдиница = ЗалИзНастроек();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда  
			
			Если ТипЗнч(Параметр) <> Тип("Массив") Тогда
				Параметр = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметр);
			КонецЕсли;
			
			Данные = МенеджерОборудованияУНФКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			ПолученШтрихкод(Данные); 
			
		КонецЕсли;  
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	ВидимостьЯчейки();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

&НаКлиенте
Процедура ЗапасыНоменклатураПриИзменении(Элемент)
	
	ДанныеСтроки = Элементы.Запасы.ТекущиеДанные;
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеНоменклатуры = ДанныеНоменклатуры(ДанныеСтроки.Номенклатура, СтруктурнаяЕдиница);
	ЗаполнитьЗначенияСвойств(ДанныеСтроки, ДанныеНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапасыПриАктивизацииСтроки(Элемент)

	ПодсчитатьИтоги();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// Процедура - обработчик команды командной панели табличной части.
&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ОчиститьСообщения();
	
	ТекШтрихкод = "";
	
	ОбработкаЗавершения = Новый ОписаниеОповещения(
		"ПоискПоШтрихкодуЗавершение",
		ЭтотОбъект, 
		Новый Структура("ТекШтрихкод", ТекШтрихкод));

	#Если МобильныйКлиент Тогда
	ОткрытьФорму("ОбщаяФорма.ФормаПоискаПоШтрихкоду", , , , , , ОбработкаЗавершения);
	#Иначе
	ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	ОчиститьСообщения();
	
	ЗаписатьИнвентаризацию();
	
	ВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОчиститьСообщения();
	
	ДоступныеДокументы = ДоступныеДокументы(ФильтрыФормы());
	Отбор = Новый Структура("Ссылка", ДоступныеДокументы);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("МножественныйВыбор", Ложь);
	
	ПослеВыбораДокумента = Новый ОписаниеОповещения("ЗаполнитьПоляПоВыбраннойИнвентаризации", ЭтотОбъект);
	
	ОткрытьФорму("Документ.ИнвентаризацияЗапасов.Форма.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,, 
							ПослеВыбораДокумента, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
							
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Инвентаризация) Тогда
		
		ТекстСообщения = НСтр("ru = 'Инвентаризация не выбрана'");
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	ЗаписатьИнвентаризацию(Инвентаризация);
	
	ВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Завершить(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Инвентаризация) Тогда
		
		ТекстСообщения = НСтр("ru = 'Инвентаризация не выбрана'");
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		
		Возврат;
		
	КонецЕсли;
	
	ЗаписатьИнвентаризацию(Инвентаризация, Истина);

	Инвентаризация = ПредопределенноеЗначение("Документ.ИнвентаризацияЗапасов.ПустаяСсылка");
	
	Объект.Запасы.Очистить();
	
	ВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстатки(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
		
	ИмяСхемыКомпоновкиДанных = "ТиповаяСхема" ;    
	СхемаКомпоновкиДанныхПриИзмененииНаСервере(Ложь);
	АдресСхемыДляРедактирования = ПоместитьКопиюСхемыВоВременноеХранилище(АдресСхемыКомпановкиДанных, УникальныйИдентификатор);
	АдресХранилищаНастройкиКомпоновщика = ПоместитьНастройкиСКДВоВременноеХранилище();
	ЗаполнитьОстаткиНаСервере(); 
	ПодсчитатьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОтбору(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСхемыКомпоновкиДанных = "ТиповаяСхема" ;    
	СхемаКомпоновкиДанныхПриИзмененииНаСервере(СхемаСКДМодифицированаВручную);
	АдресСхемыДляРедактирования = ПоместитьКопиюСхемыВоВременноеХранилище(АдресСхемыКомпановкиДанных, УникальныйИдентификатор);
	ПараметрыФормы = Новый Структура;
	ЗаголовокФормыНастройкиСхемыКомпоновкиДанных = НСтр(
		"ru = 'Настройте схему компоновки данных для Инвентаризации '");

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПомещатьНастройкиВСхемуКомпоновкиДанных", Ложь);
	ПараметрыФормы.Вставить("РедактироватьСхемуКомпоновкиДанных", Ложь);
	ПараметрыФормы.Вставить("ЗагрузитьСхемуИзФайла", Ложь);
	ПараметрыФормы.Вставить("НастраиватьОтбор", Истина);
	ПараметрыФормы.Вставить("НастраиватьПараметры", Ложь);
	ПараметрыФормы.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыФормы.Вставить("Ссылка", Инвентаризация);
	ПараметрыФормы.Вставить("АдресСхемыКомпоновкиДанных", АдресСхемыДляРедактирования);
	ПараметрыФормы.Вставить("АдресНастроекКомпоновкиДанных", ПоместитьНастройкиСКДВоВременноеХранилище());
	ПараметрыФормы.Вставить("Заголовок", ЗаголовокФормыНастройкиСхемыКомпоновкиДанных);
	
	ДополнительныеПараметры = Новый Структура("АдресСхемыДляРедактирования", АдресСхемыДляРедактирования);
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактироватьСхемуКомпоновкиДанныхЗавершение", ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФорму("ОбщаяФорма.УпрощеннаяНастройкаСхемыКомпоновкиДанных", ПараметрыФормы, , , , , ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьПоПроизвольномуОтбору(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСхемыКомпоновкиДанных = "ПроизвольныйОтбор" ;  
	СхемаКомпоновкиДанныхПриИзмененииНаСервере(СхемаСКДМодифицированаВручную);
	СхемаСКДМодифицированаВручную = Истина;
	
	АдресСхемыДляРедактирования = ПоместитьКопиюСхемыВоВременноеХранилище(АдресСхемыКомпановкиДанных, УникальныйИдентификатор);
	
	ПараметрыФормы = Новый Структура;
	ЗаголовокФормыНастройкиСхемыКомпоновкиДанных = НСтр(
		"ru = 'Настройте схему компоновки данных для Инвентаризации '");

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ПомещатьНастройкиВСхемуКомпоновкиДанных", Ложь);
	ПараметрыФормы.Вставить("РедактироватьСхемуКомпоновкиДанных", Истина);
	ПараметрыФормы.Вставить("ЗагрузитьСхемуИзФайла", Истина);
	ПараметрыФормы.Вставить("НастраиватьОтбор", Истина);
	ПараметрыФормы.Вставить("НастраиватьПараметры", Истина);
	ПараметрыФормы.Вставить("УникальныйИдентификатор", УникальныйИдентификатор);
	ПараметрыФормы.Вставить("Ссылка", Инвентаризация);
	ПараметрыФормы.Вставить("АдресСхемыКомпоновкиДанных", АдресСхемыДляРедактирования);
	ПараметрыФормы.Вставить("АдресНастроекКомпоновкиДанных", ПоместитьНастройкиСКДВоВременноеХранилище());
	ПараметрыФормы.Вставить("Заголовок", ЗаголовокФормыНастройкиСхемыКомпоновкиДанных);
	
	ДополнительныеПараметры = Новый Структура("АдресСхемыДляРедактирования", АдресСхемыДляРедактирования);
	ОписаниеОповещения = Новый ОписаниеОповещения("РедактироватьСхемуКомпоновкиДанныхЗавершение", ЭтотОбъект, ДополнительныеПараметры);

	ОткрытьФорму("ОбщаяФорма.УпрощеннаяНастройкаСхемыКомпоновкиДанных", ПараметрыФормы, , , , , ОписаниеОповещения,
		РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьОстаткиСОтборомПоЯчейке(Команда)
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяСхемыКомпоновкиДанных = "ОстаткиПоЯчейке" ;    
	СхемаКомпоновкиДанныхПриИзмененииНаСервере(Ложь);
	АдресСхемыДляРедактирования = ПоместитьКопиюСхемыВоВременноеХранилище(АдресСхемыКомпановкиДанных, УникальныйИдентификатор);
	АдресХранилищаНастройкиКомпоновщика = ПоместитьНастройкиСКДВоВременноеХранилище();
	ЗаполнитьОстаткиНаСервере(); 
	ПодсчитатьИтоги();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеФормой

&НаКлиенте
Процедура ПодсчитатьИтоги()
	
	Элементы.ЗапасыЧислится.ТекстПодвала = Объект.Запасы.Итог("КоличествоУчет");
	Элементы.ЗапасыНайдено.ТекстПодвала = Объект.Запасы.Итог("Количество");

КонецПроцедуры

&НаСервере
Процедура УправлениеОтображениемЭлементовФормы()
	
	Элементы.Запасы.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ВСтрокахТаблицы;
	Элементы.Запасы.АвтоМаксимальнаяВысотаВСтрокахТаблицы = Ложь;
	Элементы.Запасы.АвтоМаксимальнаяВысота = Ложь;
	Элементы.Запасы.Высота = 5;
	Элементы.Запасы.МаксимальнаяВысота = 5;
	Элементы.Запасы.ВысотаВСтрокахТаблицы = 5;
	Элементы.Запасы.МаксимальнаяВысотаВСтрокахТаблицы = 5;
    Элементы.Запасы.Подвал = Истина;
	
	Элементы.Запасы.РастягиватьПоВертикали = Ложь;
	
	Элементы.ЗапасыЧислится.ТекстПодвала = Объект.Запасы.Итог("КоличествоУчет");
	Элементы.ЗапасыНайдено.ТекстПодвала = Объект.Запасы.Итог("Количество");
	
	ВидимостьЯчейки();
	
КонецПроцедуры

&НаСервере
Процедура ВидимостьЯчейки()
	
	ЕстьЯчейки = спРаботаСЯчейкамиВызовСервера.ЕстьЯчейки(СтруктурнаяЕдиница);
	
	Элементы.Ячейка.Видимость = ЕстьЯчейки;
	Элементы.ЗапасыЗаполнитьОстаткиСОтборомПоЯчейке.Видимость = ЕстьЯчейки;
	
	Если Не ЕстьЯчейки Тогда
		Ячейка = Справочники.Ячейки.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УсловноеОформлениеФормы()
	
	// Цвет строки запасов
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных(Элементы.Запасы.Имя);
	
	Отбор = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.КоличествоУчет");
	Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
	Отбор.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Запасы.Количество");
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьЭлементовФормы()
	
	Элементы.ГруппаФильтры.Видимость = Не ЗначениеЗаполнено(Инвентаризация);
	Элементы.ГруппаНомерДата.Видимость = ЗначениеЗаполнено(Инвентаризация);
	ВидимостьЯчейки();
	
КонецПроцедуры

#КонецОбласти

#Область ПоискПоШтрихкоду

// Процедура обрабатывает полученные штрихкоды.
//
&НаКлиенте
Процедура ПолученШтрихкод(ДанныеШтрихкодов) Экспорт
	
	Для каждого ДанныеШтрихкода Из ДанныеШтрихкодов Цикл
		
		ДополнительныеДанныеПоШтрихкоду = ШтрихкодированиеУНФКлиент.ДополнительныеДанныеПоШтрихкоду(ДанныеШтрихкода.Штрихкод,
		"");
		Если ДополнительныеДанныеПоШтрихкоду.ЭтоКодМаркировки Тогда
			ДанныеШтрихкода.Штрихкод = ДополнительныеДанныеПоШтрихкоду.EAN;
		ИначеЕсли ДополнительныеДанныеПоШтрихкоду.ЕстьРазделительGS1 Тогда
			ДанныеШтрихкода.Штрихкод = ДополнительныеДанныеПоШтрихкоду.ПредставлениеШтрихкода;
		Иначе
			// Действие не требуется
		КонецЕсли;
		
		ДанныеПоШтрихКодам = ПолучитьДанныеПоШтрихкодамВМассиве(ДанныеШтрихкода);
		
		МассивДанных = ДанныеПоШтрихкодам.Получить(ДанныеШтрихкода.Штрихкод);
		
		Штрихкод = ДанныеШтрихкода.Штрихкод;
		
		Если Не МассивДанных = Неопределено И МассивДанных.Количество() Тогда
			
			Если МассивДанных.Количество() > 1 Тогда
				ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПоДаннымШтрихкодовЗавершение", ЭтотОбъект);
				ПараметрыОткрытия = Новый Структура("МассивНоменклатуры, ТекШтрихкод", МассивДанных, ДанныеШтрихкода);
				ОткрытьФорму("Справочник.Номенклатура.Форма.ДублиНоменклатурыПоШтрихКоду", ПараметрыОткрытия, ЭтаФорма,,,,
				ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				Возврат;
			КонецЕсли;
			
			Номенклатура = МассивДанных[0].Номенклатура;
			
			ВыполнитьДействиеПриСканировании(Номенклатура);
			
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПриСканировании(Номенклатура)
	
	Фильтр = Новый Структура("Номенклатура", Номенклатура);
	НайденныеСтроки = Объект.Запасы.НайтиСтроки(Фильтр);
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		
	    Строка = Объект.Запасы.Добавить();
		ДанныеСтроки = ДанныеНоменклатуры(Номенклатура, СтруктурнаяЕдиница);
	    ЗаполнитьЗначенияСвойств(Строка, ДанныеСтроки);
		 
	Иначе
		
		Строка = НайденныеСтроки[0];
		Строка.Количество = Строка.Количество + 1;
		
	КонецЕсли;
	
	Элементы.Запасы.ТекущаяСтрока = Строка.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СтруктураДанныхПоУмолчанию(Номенклатура)
	
	ДанныеНоменклатуры = Новый Структура;
	ДанныеНоменклатуры.Вставить("Номенклатура", Номенклатура);
	ДанныеНоменклатуры.Вставить("ЕдиницаИзмерения", Номенклатура.ЕдиницаИзмерения);
	ДанныеНоменклатуры.Вставить("Цена", 0);
	ДанныеНоменклатуры.Вставить("КоличествоУчет", 0);
	ДанныеНоменклатуры.Вставить("Количество", 1);

	Возврат ДанныеНоменклатуры;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеНоменклатуры(Номенклатура, СтруктурнаяЕдиница)
	
	ДанныеНоменклатуры = СтруктураДанныхПоУмолчанию(Номенклатура);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТ_Товар
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыОстатки.Номенклатура КАК Номенклатура,
		|	СУММА(ЗапасыОстатки.КоличествоОстаток) КАК КоличествоОстаток
		|ПОМЕСТИТЬ ВТ_Остатки
		|ИЗ
		|	РегистрНакопления.Запасы.Остатки(
		|			&Дата,
		|			Организация = &Организация
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Номенклатура = &Номенклатура) КАК ЗапасыОстатки
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыОстатки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
		|ПОМЕСТИТЬ ВТ_Цены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&Дата,
		|			ВидЦен = &ВидЦен
		|				И Номенклатура = &Номенклатура) КАК ЦеныНоменклатурыСрезПоследних
		|
		|СГРУППИРОВАТЬ ПО
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВТ_Товар.Ссылка КАК Номенклатура,
		|	ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, 0) КАК КоличествоУчет,
		|	1 КАК Количество,
		|	ЕСТЬNULL(ВТ_Цены.Цена, 0) КАК Цена,
		|	ВТ_Товар.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	ВТ_Товар КАК ВТ_Товар
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
		|		ПО ВТ_Товар.Ссылка = ВТ_Остатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
		|		ПО ВТ_Товар.Ссылка = ВТ_Цены.Номенклатура";
	
	Запрос.УстановитьПараметр("ВидЦен", Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи());
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Организация", Справочники.Организации.ОрганизацияПоУмолчанию());
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ДанныеНоменклатуры, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат ДанныеНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоДаннымШтрихкодовЗавершение(СтруктураНоменклатуры, Параметры) Экспорт 
	
	Если СтруктураНоменклатуры = Неопределено Тогда Возврат КонецЕсли;
	
	Номенклатура = СтруктураНоменклатуры.МассивНоменклатуры[0].Номенклатура;
	
	Если НЕ Номенклатура = Неопределено Тогда
		
		ВыполнитьДействиеПриСканировании(Номенклатура);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Результат = Неопределено, СокрЛП(ДополнительныеПараметры.ТекШтрихкод), СокрЛП(Результат));
	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда
		ДанныеШтрихкода = Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1);
		ПолученШтрихкод(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеШтрихкода));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеПоШтрихкодамВМассиве(ДанныеШтрихкода, СтруктурнаяЕдиница = Неопределено)
	
	РегистрыСведений.ШтрихкодыНоменклатуры.ПреобразоватьВесовойШтрихкод(ДанныеШтрихкода);
	
	Штрихкоды = Новый Массив;
	Штрихкоды.Добавить(ДанныеШтрихкода);
	
	ДанныеПоШтрихкодам = Новый Соответствие;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Рег.Штрихкод КАК Штрихкод,
	|	Рег.Номенклатура КАК Номенклатура,
	|	Рег.Характеристика КАК Характеристика,
	|	Рег.Партия КАК Партия,
	|	Рег.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Рег
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (&СерииНоменклатурыИспользуются)
	|			И Рег.Номенклатура = СерииНоменклатуры.Владелец
	|			И (Рег.Номенклатура.ИспользоватьСерииНоменклатуры)
	|			И Рег.Штрихкод = СерииНоменклатуры.Наименование
	|ГДЕ
	|	Рег.Штрихкод В(&МассивШтрихкодов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗДанныеОВесовомТоваре.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ТЗДанныеОВесовомТоваре.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ТЗДанныеОВесовомТоваре.ШтрихКод КАК ШтрихКод
	|ПОМЕСТИТЬ ВременнаяТаблицаВесовойТовар
	|ИЗ
	|	&ТЗДанныеОВесовомТоваре КАК ТЗДанныеОВесовомТоваре
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыТоваровSKU.Номенклатура КАК Номенклатура,
	|	КодыТоваровSKU.Характеристика КАК Характеристика,
	|	КодыТоваровSKU.Партия КАК Партия,
	|	КодыТоваровSKU.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВременнаяТаблицаВесовойТовар.ШтрихКод КАК ШтрихКод,
	|	ВременнаяТаблицаВесовойТовар.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	|	ЕСТЬNULL(КодыТоваровSKU.Номенклатура.ВидАлкогольнойПродукции.Маркируемый, ЛОЖЬ)
	|		ИЛИ КодыТоваровSKU.Номенклатура.УдалитьТабачнаяПродукция КАК МаркируемаяПродукция
	|ИЗ
	|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаВесовойТовар КАК ВременнаяТаблицаВесовойТовар
	|		ПО КодыТоваровSKU.SKU = ВременнаяТаблицаВесовойТовар.КодВесовогоТовара
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (&СерииНоменклатурыИспользуются)
	|			И КодыТоваровSKU.Номенклатура = СерииНоменклатуры.Владелец
	|			И (КодыТоваровSKU.Номенклатура.ИспользоватьСерииНоменклатуры)
	|			И (ВременнаяТаблицаВесовойТовар.ШтрихКод = СерииНоменклатуры.Наименование)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаВесовойТовар.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ШтрихКод КАК ШтрихКод
	|ИЗ
	|	ВременнаяТаблицаВесовойТовар КАК ВременнаяТаблицаВесовойТовар");
	
	МассивШтрихкодов = Новый Массив;
	ТЗДанныеОВесовомТоваре = Новый ТаблицаЗначений;
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("КодВесовогоТовара", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный)));
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("ПрефиксВесовогоТовара", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200)));
	
	Для каждого ТекШтрихкод Из Штрихкоды Цикл
		
		МассивШтрихкодов.Добавить(ТекШтрихкод.ШтрихКод);

		ДанныеПоШтрихкодам.Вставить(ТекШтрихкод.ШтрихКод, Новый Массив);
		
		Если ТекШтрихкод.Свойство("КодВесовогоТовара") Тогда
			НоваяСтрокаОВесовомТоваре = ТЗДанныеОВесовомТоваре.Добавить();
			НоваяСтрокаОВесовомТоваре.КодВесовогоТовара = ТекШтрихкод.КодВесовогоТовара;
			НоваяСтрокаОВесовомТоваре.ПрефиксВесовогоТовара = ТекШтрихкод.ПрефиксВесовогоТовара;
			НоваяСтрокаОВесовомТоваре.Штрихкод = ТекШтрихкод.Штрихкод;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("МассивШтрихкодов", МассивШтрихкодов);
	ИспользоватьСерииНоменклатуры = СерииНоменклатурыУНФ.ИспользоватьСерииНоменклатурыОстатки();
	Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
		Запрос.УстановитьПараметр("СерииНоменклатурыИспользуются", Истина);
	Иначе
	    Запрос.УстановитьПараметр("СерииНоменклатурыИспользуются", Ложь);
	КонецЕсли;
	Запрос.УстановитьПараметр("ТЗДанныеОВесовомТоваре", ТЗДанныеОВесовомТоваре);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МассивДанныхПоШтрихкоду = ДанныеПоШтрихкодам[Выборка.Штрихкод];
		
		ТекДанные = Новый Структура;
		МассивДанныхПоШтрихкоду.Добавить(ТекДанные);
		
		ТекДанные.Вставить("Номенклатура", Выборка.Номенклатура);
		ТекДанные.Вставить("Характеристика", Выборка.Характеристика);
		ТекДанные.Вставить("Партия", Выборка.Партия);
		ТекДанные.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
		ТекДанные.Вставить("КодВесовогоТовара", Выборка.КодВесовогоТовара);
		ТекДанные.Вставить("ПрефиксВесовогоТовара", Выборка.ПрефиксВесовогоТовара);
		ТекДанные.Вставить("МаркируемаяПродукция", Выборка.МаркируемаяПродукция);
		ТекДанные.Вставить("НоменклатураПоставщика", Неопределено);
		
		Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
			ТекДанные.Вставить("Серия", Выборка.Серия);
		КонецЕсли;
	КонецЦикла;
	
	Выборка = МассивРезультатов[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МассивДанныхПоШтрихкоду = ДанныеПоШтрихкодам[Выборка.Штрихкод];
		
		ТекДанные = Новый Структура;
		МассивДанныхПоШтрихкоду.Добавить(ТекДанные);
		
		Если НЕ ТекДанные.Свойство("КодВесовогоТовара") Тогда
			ТекДанные.Вставить("Номенклатура", Выборка.Номенклатура);
			ТекДанные.Вставить("Характеристика", Выборка.Характеристика);
			ТекДанные.Вставить("Партия", Выборка.Партия);
			ТекДанные.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
			ТекДанные.Вставить("НоменклатураПоставщика", Неопределено);
			
			Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
				ТекДанные.Вставить("Серия", Выборка.Серия);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат ДанныеПоШтрихкодам;

КонецФункции

&НаСервереБезКонтекста
Функция ЗалИзНастроек()

	Ключ  = "ОбщиеНастройкиАРМов";
	
	Настройки = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(Ключ, Ключ, Новый Структура,, ИмяПользователя());
	
	Если Настройки.Свойство("Зал") Тогда
		Возврат Настройки.Зал;
	Иначе
		Возврат Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти //ПоискПоШтрихкоду

#Область ФормированиеДокумента

&НаКлиенте
Функция ФильтрыФормы()
	
	ПоляФормы = "Автор, Организация, СтруктурнаяЕдиница, Период";
	ФильтрыФормы = Новый Структура(ПоляФормы);
	ЗаполнитьЗначенияСвойств(ФильтрыФормы, ЭтотОбъект);
	
	Возврат ФильтрыФормы;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьПоляПоВыбраннойИнвентаризации(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьПоляПоВыбраннойИнвентаризацииНаСервере(Результат);
	
	ВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоляПоВыбраннойИнвентаризацииНаСервере(Документ)
	
	Инвентаризация 					= Документ;
	СтруктурнаяЕдиница 				= Документ.СтруктурнаяЕдиница; 
	Организация 					= Документ.Организация;
	ИмяСхемыКомпоновкиДанных 		= Инвентаризация.ИмяСхемыКомпоновкиДанных;
	СхемаСКДМодифицированаВручную 	= Инвентаризация.СхемаСКДМодифицированаВручную;
	
	Объект.Запасы.Загрузить(Документ.Запасы.Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИнвентаризацию(ИнвентаризацияСсылка = Неопределено, Завершить = Ложь)
	
	Дата = ТекущаяДатаСеанса();
	
	Если ЗначениеЗаполнено(ИнвентаризацияСсылка) Тогда
		
		ИнвентаризацияОбъект = ИнвентаризацияСсылка.ПолучитьОбъект();
		
	Иначе
		
		ИнвентаризацияОбъект = Документы.ИнвентаризацияЗапасов.СоздатьДокумент();
		
		ИнвентаризацияОбъект.Дата = Дата;
		ИнвентаризацияОбъект.Организация = Организация;
		ИнвентаризацияОбъект.СтруктурнаяЕдиница = СтруктурнаяЕдиница;
        ИнвентаризацияОбъект.Ячейка = Ячейка;
		
	КонецЕсли;
	
	Если Завершить Тогда
		ИнвентаризацияОбъект.спСтатус = Перечисления.спСтатусыИнвентаризации.Завершена;
	Иначе
		ИнвентаризацияОбъект.спСтатус = Перечисления.спСтатусыИнвентаризации.ВРаботе;
	КонецЕсли;
	
	ИнвентаризацияОбъект.ИмяСхемыКомпоновкиДанных = ИмяСхемыКомпоновкиДанных;
	ИнвентаризацияОбъект.СхемаСКДМодифицированаВручную = СхемаСКДМодифицированаВручную;
	
	ИнвентаризацияОбъект.Автор = Автор;
	ИнвентаризацияОбъект.Комментарий = Комментарий;
	
	ИнвентаризацияОбъект.Запасы.Загрузить(Объект.Запасы.Выгрузить());
	
	Для каждого Строка Из ИнвентаризацияОбъект.Запасы Цикл
		ПересчитатьСтроку(Строка);		
	КонецЦикла;
	
	Если ИнвентаризацияОбъект.ПроверитьЗаполнение() Тогда
		
		ИнвентаризацияОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		СтруктурнаяЕдиница 	= ИнвентаризацияОбъект.СтруктурнаяЕдиница;
		Организация 		= ИнвентаризацияОбъект.Организация;
		Инвентаризация 		= ИнвентаризацияОбъект.Ссылка;
		
		Возврат;
		
	КонецЕсли;                          
   
КонецПроцедуры 

&НаСервере
Процедура ПересчитатьСтроку(СтрокаТабличнойЧасти);

	// Расчет отклонения.
	СтрокаТабличнойЧасти.Отклонение = СтрокаТабличнойЧасти.Количество - СтрокаТабличнойЧасти.КоличествоУчет;
	СтрокаТабличнойЧасти.Излишки = ?(СтрокаТабличнойЧасти.Отклонение < 0, 0,СтрокаТабличнойЧасти.Отклонение);
	СтрокаТабличнойЧасти.Недостача = ?(СтрокаТабличнойЧасти.Отклонение > 0, 0,-СтрокаТабличнойЧасти.Отклонение); 
	СтрокаТабличнойЧасти.ИзлишкиСоответствуетОтбору = ?(СтрокаТабличнойЧасти.Отклонение < 0, Ложь,Истина); 
	СтрокаТабличнойЧасти.НедостачаСоответствуетОтбору = ?(СтрокаТабличнойЧасти.Отклонение > 0, Ложь,Истина);  
	СтрокаТабличнойЧасти.ОтклонениеСоответствуетОтбору = ?(СтрокаТабличнойЧасти.Отклонение = 0, Ложь,Истина);
	
	// Расчет Сумм
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Цена;
	СтрокаТабличнойЧасти.СуммаУчет = СтрокаТабличнойЧасти.КоличествоУчет * СтрокаТабличнойЧасти.Цена;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаНаСервере(Ссылка, ИмяРеквизита)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);
	
КонецФункции

&НаСервереБезКонтекста
Функция ДоступныеДокументы(Параметры)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентаризацияЗапасов.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ИнвентаризацияЗапасов КАК ИнвентаризацияЗапасов
		|ГДЕ
		|	НЕ ИнвентаризацияЗапасов.ПометкаУдаления
		|	И ИнвентаризацияЗапасов.спСтатус = ЗНАЧЕНИЕ(Перечисление.спСтатусыИнвентаризации.ВРаботе)
		|	И &Фильтр";
	
		Фильтр = Новый Массив;
		Фильтр.Добавить("ИСТИНА");
		
		Для каждого Параметр Из Параметры Цикл
			
			Если Параметр.Ключ = "Период" Тогда
				
				ДатаНачала = Параметр.Значение.ДатаНачала;
				ДатаОкончания = Параметр.Значение.ДатаОкончания;
				
				Если Не ЗначениеЗаполнено(ДатаНачала) И Не ЗначениеЗаполнено(ДатаОкончания) Тогда
					Продолжить;
				КонецЕсли;
				
				Условие = "ИнвентаризацияЗапасов.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
				
				Фильтр.Добавить(Условие);
				
				Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
				Запрос.УстановитьПараметр("ДатаОкончания", ?(ЗначениеЗаполнено(ДатаОкончания), ДатаОкончания, ТекущаяДатаСеанса()));
				
				Продолжить; 
				
			КонецЕсли;
			
			Если ЗначениеЗаполнено(Параметр.Значение) Тогда
				
				Условие = СтрШаблон("ИнвентаризацияЗапасов.%1 = &%1", Параметр.Ключ);	
				
				Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
				
				Фильтр.Добавить(Условие);
				
			КонецЕсли;
			
		КонецЦикла;
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Фильтр", СтрСоединить(Фильтр, " И "));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Массив;
	Иначе
		Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	
КонецФункции

#КонецОбласти 

#Область ПредзаполнениеЗапасов

&НаСервере
Функция ПоместитьНастройкиСКДВоВременноеХранилище()
	Возврат ПоместитьВоВременноеХранилище(НастройкаКомпановкиДанных.ПолучитьНастройки(), УникальныйИдентификатор);
КонецФункции

&НаСервере
Процедура ЗаполнитьОстаткиНаСервере()
	
	НовыеНастройки = НастройкаКомпановкиДанных.ПолучитьНастройки();
	ТиповаяСхема = Обработки.спИнвентаризацияТСД.ПолучитьМакет(ИмяСхемыКомпоновкиДанных);
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
	
	НовыеНастройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ячейка", Ячейка);
	
    МакетКомпоновки = КомпоновщикМакета.Выполнить(ТиповаяСхема, НовыеНастройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

    ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКД.Инициализировать(МакетКомпоновки);

    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    ТаблицаЗначений = Новый ТаблицаЗначений;
    ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
    ПроцессорВывода.Вывести(ПроцессорКД);
	Объект.Запасы.Очистить();
	ТаблицаЗначений.ЗаполнитьЗначения(0, "Количество");
	Объект.Запасы.Загрузить(ТаблицаЗначений); 
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьСхемуКомпоновкиДанныхЗавершение(Результат, ДополнительныеПараметры) Экспорт

	РедактироватьСхемуКомпоновкиДанныхЗавершениеНаСервере(Результат, ДополнительныеПараметры);
	ПодсчитатьИтоги();
	
КонецПроцедуры

&НаСервере
Функция ПоместитьКопиюСхемыВоВременноеХранилище(АдресСхемы, УникальныйИдентификатор) 
	
	АдресСхемы = ?(ЗначениеЗаполнено(АдресСхемы), АдресСхемы, Обработки.спИнвентаризацияТСД.ПолучитьМакет(?(ЗначениеЗаполнено(ИмяСхемыКомпоновкиДанных),ИмяСхемыКомпоновкиДанных, "ТиповаяСхема")));
	Схема = ПолучитьИзВременногоХранилища(АдресСхемы);
	Возврат ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура РедактироватьСхемуКомпоновкиДанныхЗавершениеНаСервере(Результат, ДополнительныеПараметры) Экспорт
	
	АдресХранилищаНастройкиКомпоновщика = Результат;
	
	Если ЗначениеЗаполнено(АдресХранилищаНастройкиКомпоновщика) Тогда
		
		// Схема могла быть модифицирована
		АдресИзмененнойСхемы = Неопределено;
		Если ДополнительныеПараметры.Свойство("АдресСхемыДляРедактирования", АдресИзмененнойСхемы) Тогда
			ТиповаяСхема = Обработки.спИнвентаризацияТСД.ПолучитьМакет(ИмяСхемыКомпоновкиДанных);
			НоваяСхема = ПолучитьИзВременногоХранилища(АдресИзмененнойСхемы);
			Если ЦенообразованиеСервер.ПолучитьXML(НоваяСхема) = ЦенообразованиеСервер.ПолучитьXML(ТиповаяСхема) Тогда
				СхемаСКДМодифицированаВручную = Ложь;
			Иначе
				СхемаСКДМодифицированаВручную = Истина;
				ИмяСхемыСКДНаФорме = "Произвольная";
				ПоместитьВоВременноеХранилище(НоваяСхема, АдресСхемыКомпановкиДанных);
				ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпановкиДанных);
				НастройкаКомпановкиДанных.Инициализировать(ИсточникНастроек);
			КонецЕсли;
		КонецЕсли;
		
		НовыеНастройки = ПолучитьИзВременногоХранилища(АдресХранилищаНастройкиКомпоновщика);		
		НастройкаКомпановкиДанных.ЗагрузитьНастройки(НовыеНастройки);
		НастройкаКомпановкиДанных.Восстановить();
		Модифицированность = Истина;
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(?(СхемаСКДМодифицированаВручную, НоваяСхема, ТиповаяСхема), НовыеНастройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		
		ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКД.Инициализировать(МакетКомпоновки);
		
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		ТаблицаЗначений = Новый ТаблицаЗначений;
		ПроцессорВывода.УстановитьОбъект(ТаблицаЗначений);
		ПроцессорВывода.Вывести(ПроцессорКД);
		Объект.Запасы.Очистить();
		ТаблицаЗначений.ЗаполнитьЗначения(0, "Количество");
		Объект.Запасы.Загрузить(ТаблицаЗначений);
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОбработатьИзменениеСхемыСКД(СхемаКомпановкиДанныхУсловия, НастройкиДоИзменеиня = Неопределено)
	Если ЗначениеЗаполнено(АдресСхемыКомпановкиДанных) Тогда
		ПоместитьВоВременноеХранилище(СхемаКомпановкиДанныхУсловия, АдресСхемыКомпановкиДанных);
	Иначе
		АдресСхемыКомпановкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпановкиДанныхУсловия, УникальныйИдентификатор);
	КонецЕсли;
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпановкиДанных);
	НастройкаКомпановкиДанных.Инициализировать(ИсточникНастроек);
	Если ЗначениеЗаполнено(НастройкиДоИзменеиня) Тогда
		НастройкаКомпановкиДанных.ЗагрузитьНастройки(НастройкиДоИзменеиня);
		НастройкаКомпановкиДанных.Восстановить();
	Иначе
		НастройкаКомпановкиДанных.ЗагрузитьНастройки(СхемаКомпановкиДанныхУсловия.НастройкиПоУмолчанию);  
		Параметр = НастройкаКомпановкиДанных.Настройки.ПараметрыДанных.Элементы.Найти("Организация");
		Если Не Параметр = Неопределено Тогда
			Параметр.Значение = Организация;
		КонецЕсли;
		Параметр = НастройкаКомпановкиДанных.Настройки.ПараметрыДанных.Элементы.Найти("СтруктурнаяЕдиница");
		Если Не Параметр = Неопределено Тогда
			Параметр.Значение = СтруктурнаяЕдиница;
		КонецЕсли;
		Параметр = НастройкаКомпановкиДанных.Настройки.ПараметрыДанных.Элементы.Найти("Период");
		Если Не Параметр = Неопределено Тогда
			Параметр.Значение = ?(ЗначениеЗаполнено(Инвентаризация.Дата), Инвентаризация.Дата, ТекущаяДатаСеанса()) ;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СхемаКомпоновкиДанныхПриИзмененииНаСервере(СохранитьНастройки = Истина)
	НастройкиДоИзменения = Неопределено;
	Если СохранитьНастройки Тогда
		НастройкиДоИзменения = НастройкаКомпановкиДанных.ПолучитьНастройки();
	КонецЕсли;
	СхемаКомпановкиДанныхУсловия = Неопределено;
	Попытка
		СхемаКомпановкиДанныхУсловия = Обработки.спИнвентаризацияТСД.ПолучитьМакет(ИмяСхемыКомпоновкиДанных);		
		СхемаСКДМодифицированаВручную = Ложь;
	Исключение
		СхемаКомпановкиДанныхУсловия = Неопределено;
	КонецПопытки;
	Если Не СхемаКомпановкиДанныхУсловия = Неопределено Тогда
		ОбработатьИзменениеСхемыСКД(СхемаКомпановкиДанныхУсловия, НастройкиДоИзменения);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#КонецОбласти