
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс	
	
// Выполняет код указанного алгоритма.
//
// Параметры:
//  Ключ - Строка - см. реквизит КлючДляВызова справочника Алгоритмы.
//  Параметры - Произвольный - произвольные параметры для выполнения алгоритма.
//
// Возвращаемое значение:
//  Произвольный - значение, возвращенное вызванным алгоритмом. По умолчанию Неопределено.
//
Функция Вызвать(КлючДляВызова, Параметры = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	ДанныеАлгоритма = ДанныеАлгоритмаПоКлючу(КлючДляВызова);
	Если Не ЗначениеЗаполнено(ДанныеАлгоритма.Ссылка) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Выполнить(ДанныеАлгоритма.Выражение);
	
	Возврат Результат;
	
КонецФункции

// Обновляет предопределенные алгоритмы.
//
Процедура ЗаполнитьПредопределенные() Экспорт
	
	ТаблицаЭлементов = Новый ТаблицаЗначений;
	ТаблицаЭлементов.Колонки.Добавить("ИмяПредопределенного");
	ТаблицаЭлементов.Колонки.Добавить("КлючДляВызова");
	ТаблицаЭлементов.Колонки.Добавить("Выражение");
	
	Стр = ТаблицаЭлементов.Добавить();
	Стр.ИмяПредопределенного = "Округление";
	Стр.КлючДляВызова = "Округление";
	Стр.Выражение = 
		"Если ТипЗнч(Параметры) <> Тип(""Структура"") Тогда
		|    ВызватьИсключение(СтрШаблон(
		|        НСтр(""ru = 'Неверный тип """"%1"""" переменной """"Параметры"""". Ожидается Структура.'""),
		|        ТипЗнч(Параметры)));
		|КонецЕсли;
		|
		|Если Не Параметры.Свойство(""ТЧНоменклатура"") Тогда
		|    ВызватьИсключение(
		|        НСтр(""ru = 'В параметрах алгоритма отсутствует обязательное свойство """"ТЧНоменклатура""""'""));
		|КонецЕсли;
		|
		|ТЧНоменклатура = Параметры.ТЧНоменклатура;
		|
		|Для Каждого СтрокаТаблицы Из ТЧНоменклатура Цикл
		|	
		|	Число = СтрокаТаблицы.Цена;
		|	
		|	Если Число < 1000 Тогда
		|		
		|		// Этап 1: Округление по шагам
		|		Порядок = 50; // округляется до ближайшего кратного 50 руб.
		|		ОкруглятьВБольшуюСторону  = Ложь;
		|		
		|	Иначе
		|		
		|		// Этап 1: Округление по шагам
		|		Порядок = 100; // округляется до ближайшего кратного 50 руб.
		|		ОкруглятьВБольшуюСторону  = Ложь;
		|		
		|	КонецЕсли;
		|	
		|	// вычислим количество интервалов, входящих в число
		|	КоличествоИнтервал = СтрокаТаблицы.Цена / Порядок;
		|	
		|	// вычислим целое количество интервалов.
		|	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервал);
		|	
		|	Если КоличествоИнтервал = КоличествоЦелыхИнтервалов Тогда
		|		
		|		// Числа поделились нацело. Округлять не нужно.
		|		
		|	Иначе
		|		
		|		Если ОкруглятьВБольшуюСторону Тогда
		|			
		|			// При порядке округления 0.05 0.371 должно округлиться до 0.4
		|			Число = Порядок * (КоличествоЦелыхИнтервалов + 1);
		|			
		|		Иначе
		|			
		|			// При порядке округления 0.05 0.371 должно округлиться до 0.35,
		|			// а 0.376 до 0.4
		|			Число = Порядок * Окр(КоличествоИнтервал, 0, РежимОкругления.Окр15как20);
		|			
		|		КонецЕсли;
		|		
		|	КонецЕсли;
		|	
		|	//*Этап 2: Коррекция значений кратных 100 и 1000*
		|	//- После округления *если цена кратна 100*, то:
		|	//- Для *диапазона до 1000 руб.* – уменьшаем на *10 руб.*
		|	//- Пример: *100 → 90, 200 → 190, 300 → 290, 1000 → 990*.
		|	//- Для *диапазона от 1000 руб. и выше, если цена **кратна 1000, уменьшаем на **100 руб.*
		|	//- Пример: *2000 → 1900, 3000 → 2900, 4000 → 3900*.
		|	
		|	Если Число < 1000 Тогда
		|		Порядок = 100;
		|		ПсихологическоеОкругление = 10;
		|	Иначе
		|		Порядок = 1000;
		|		ПсихологическоеОкругление = 50;
		|	КонецЕсли;
		|	
		|	// вычислим количество интервалов, входящих в число
		|	КоличествоИнтервал = Число / Порядок;
		|		
		|	// вычислим целое количество интервалов.
		|	КоличествоЦелыхИнтервалов = Цел(КоличествоИнтервал);
		|	
		|	Если КоличествоИнтервал = КоличествоЦелыхИнтервалов Тогда
		|		Число = ЦенообразованиеКлиентСервер.ПрименитьПсихологическоеОкругление(Число, ПсихологическоеОкругление);
		|	КонецЕсли;
		|	
		|	СтрокаТаблицы.ЦенаНовая = Число;
		|	
		|КонецЦикла;
		|
		|//*Этап 3: Если на один артикул назначены разные цены по разным размерам, нужно установить максимальную
		|//*3. Группировка по артикулу и нахождение максимальной цены*
		|//- Первая часть артикула (до пробела) используется как ключ для группировки.
		|//- Для каждой группы товаров (с одинаковым *Артикул_группа) определяется **максимальная округленная цена*.
		|//- Эту цену записываем в поле *Финал* у всех товаров этой группы.
		|
		|ТЧНоменклатура.Колонки.Добавить(""АртикулПоставщика"", ОбщегоНазначения.ОписаниеТипаСтрока(100));
		|
		|Для Каждого СтрокаТаблицы Из ТЧНоменклатура Цикл
		|	
		|	СтрокаТаблицы.АртикулПоставщика = СтрокаТаблицы.Номенклатура.спАртикулПоставщика;
		|	
		|КонецЦикла;
		|
		|Запрос = Новый Запрос;
		|Запрос.Текст = ""ВЫБРАТЬ
		|	|	Таблица.АртикулПоставщика КАК АртикулПоставщика,
		|	|	Таблица.ЦенаНовая КАК ЦенаНовая
		|	|ПОМЕСТИТЬ Таблица
		|	|ИЗ
		|	|	&Таблица КАК Таблица
		|	|;
		|	|
		|	|////////////////////////////////////////////////////////////////////////////////
		|	|ВЫБРАТЬ
		|	|	МАКСИМУМ(Таблица.ЦенаНовая) КАК ЦенаНовая,
		|	|	Таблица.АртикулПоставщика КАК АртикулПоставщика
		|	|ИЗ
		|	|	Таблица КАК Таблица
		|	|
		|	|СГРУППИРОВАТЬ ПО
		|	|	Таблица.АртикулПоставщика"";
		|
		|Запрос.УстановитьПараметр(""Таблица"", ТЧНоменклатура);
		|ВыборкаНоменклатура = Запрос.Выполнить().Выбрать();
		|
		|Отбор = Новый Структура(""АртикулПоставщика"");
		|
		|Пока ВыборкаНоменклатура.Следующий() Цикл
		|	
		|	Отбор.АртикулПоставщика = ВыборкаНоменклатура.АртикулПоставщика;
		|	
		|	ТЧНоменклатураСтроки = ТЧНоменклатура.НайтиСтроки(Отбор);
		|	
		|	Для Каждого Строка Из ТЧНоменклатураСтроки Цикл
		|		Строка.ЦенаНовая = ВыборкаНоменклатура.ЦенаНовая;
		|	КонецЦикла;
		|	
		|КонецЦикла;
		|
		|Результат = ТЧНоменклатура;";
		
	Для Каждого Стр Из ТаблицаЭлементов Цикл
		Попытка
			АлгоритмСсылка = Справочники.спАлгоритмыРасчетаЦен[Стр.ИмяПредопределенного];
			АлгоритмОбъект = АлгоритмСсылка.ПолучитьОбъект();
			Если АлгоритмОбъект.Выражение <> Стр.Выражение
				Или АлгоритмОбъект.КлючДляВызова <> Стр.КлючДляВызова Тогда
				АлгоритмОбъект.Выражение = Стр.Выражение;
				АлгоритмОбъект.КлючДляВызова = Стр.КлючДляВызова;
				ОбновлениеИнформационнойБазы.ЗаписатьДанные(АлгоритмОбъект);
			КонецЕсли;
		Исключение
			ТекстОшибки = СтрШаблон(
				НСтр("ru = 'Ошибка при обновлении предопределенного алгоритма ""%1"": %2'"),
				Стр.ИмяПредопределенного,
				ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ЗаписьЖурналаРегистрации(
				"(Вистерия) Алгоритмы расчета цен",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.спАлгоритмыРасчетаЦен,,
				ТекстОшибки);
		КонецПопытки;
	КонецЦикла;
	
КонецПроцедуры

// СтандартныеПодсистемы.ВерсионированиеОбъектов
// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
// Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
КонецПроцедуры
// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеАлгоритмаПоКлючу(КлючДляВызова)
	
	ДанныеАлгоритма = Новый Структура("Ссылка, Выражение", Неопределено, "");
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Алгоритмы.Ссылка КАК Ссылка,
		|	Алгоритмы.Выражение
		|ИЗ
		|	Справочник.спАлгоритмыРасчетаЦен КАК Алгоритмы
		|ГДЕ
		|	Алгоритмы.КлючДляВызова = &КлючДляВызова
		|	И НЕ Алгоритмы.ПометкаУдаления");
	Запрос.УстановитьПараметр("КлючДляВызова", КлючДляВызова);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ДанныеАлгоритма.Ссылка = Выборка.Ссылка;
		ДанныеАлгоритма.Выражение = Выборка.Выражение;
	КонецЕсли;
	
	Возврат ДанныеАлгоритма;
	
КонецФункции

#КонецОбласти

#КонецЕсли
