
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

&После("ОбработкаЗаполнения")
Процедура спОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	// { Иванов С.С. (TNext) - 04.03.2025 - Задача №1000 
	Если Не ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеПоЯчейкам")  
		И спРаботаСЯчейкамиВызовСервера.ЕстьЯчейки(ЭтотОбъект.СтруктурнаяЕдиница) Тогда
		
		ТаблицаЗапасы = ЭтотОбъект.Запасы.Выгрузить();
		спРаботаСЯчейкамиВызовСервера.ЗаполнитьЯчейкиВТЧПоОстаткам(ТаблицаЗапасы, ЭтотОбъект.Организация, ЭтотОбъект.СтруктурнаяЕдиница, ТипЗнч(Ссылка));
		ЭтотОбъект.Запасы.Загрузить(ТаблицаЗапасы);
		
		ПоложениеЯчейкиОтправителя = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти; 
		
	КонецЕсли;
	// }

КонецПроцедуры

#КонецОбласти

#КонецЕсли
