
#Область ПрограммныйИнтерфейс

Процедура ОповеститьОЗаказахНаПеремещение() Экспорт

     МассивОповещений = спОповещенияПользователейВызовСервера.ОповещенияОЗаказахНаПеремещение();
	 
	 Для каждого Оповещение Из МассивОповещений Цикл
		 
		 ПриНажатии = Новый ОписаниеОповещения("ОповещениеПриНажатии", ЭтотОбъект, Оповещение.Ссылка);
		 
		 ПоказатьОповещениеПользователя(Оповещение.Текст, ПриНажатии,,, СтатусОповещенияПользователя.Важное);  
		 
		 #Если Не ВебКлиент Тогда
			 Сигнал();
		 #КонецЕсли
		 
	 КонецЦикла;
	 
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОповещениеПриНажатии(Ссылка) Экспорт
	
	ПоказатьЗначение(, Ссылка);
	
КонецПроцедуры

#КонецОбласти