#Область ПрограммныйИнтерфейс 

Процедура ОтправитьСообщениеДокументовПоsFTP(ОтправкаДокументов = Неопределено) Экспорт 
	Если спОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("спОтключитьПотокиОбработкиДанных") Тогда  
		ОбщегоНазначенияКлиент.СообщитьПользователю("Отправка файла по FTP отключена");
		Возврат;
	КонецЕсли;

	
	Если ТипЗнч(ОтправкаДокументов) <> Тип("Массив") ИЛИ ОтправкаДокументов.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ПодключениеsFTP = спФункцииРаботыXMLВызовСервера.ПолучитьЗначенияКонстант();

	Попытка 
		//Создаем объект Session
		Сессия = Новый COMОбъект("WinSCP.Session");
		спВзаимодействиеСПодключениемКлиент.ПодключитьКоннектор(Сессия);	
	Исключение   

		Для каждого ДанныеСообщения Из ОтправкаДокументов Цикл
			
			ИдентификаторСообщения = ?(ДанныеСообщения.Свойство("ИдентификаторСобытия"), ДанныеСообщения.ИдентификаторСобытия, Неопределено);
			ЗаписьЖурнала = Новый Структура; 
			ЗаписьЖурнала.Вставить("Ошибка", Истина);
			ЗаписьЖурнала.Вставить("СтатусСообщения", ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.ОшибкаОтправки"));
			ЗаписьЖурнала.Вставить("Идентификатор", ИдентификаторСообщения);
			ЗаписьЖурнала.Вставить("СпособПередачи", ПредопределенноеЗначение("Перечисление.спСпособПередачи.FTP"));
			ЗаписьЖурнала.Вставить("Ссылка", ДанныеСообщения.СсылкаНаОбъект);
			ЗаписьЖурнала.Вставить("ИмяФайла", Неопределено);
			ЗаписьЖурнала.Вставить("ТипИнтеграции", ПредопределенноеЗначение("Перечисление.спТипыИнтеграции.Исходящая"));
			ЗаписьЖурнала.Вставить("ЗаписатьВОчередьИсходящих", Ложь);	
			спРаботаСДаннымиВызовСервера.ЗаписьВЖурнал(ЗаписьЖурнала);
		КонецЦикла;									
			
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка подключения к FTP");								
		ЗавершитьСессию(Сессия);												
		Возврат;
	КонецПопытки;
	
	Каталог = СоздатьКаталогВыгрузки(); 
    ФайлыОтправки = новый Массив; 
	МоеУникальноеИмяФайла = "";	
	Для каждого Ссылка Из ОтправкаДокументов Цикл
		ОшибкаДокумент = Ложь;	

		Если ТипЗнч(Ссылка.СсылкаНаОбъект) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда 
			ОшибкаДокумент = спСервисИнтеграцииВызовСервера.ПроверкаДокументаПриходнаяНакладная(Ссылка.СсылкаНаОбъект);  
		ИначеЕсли ТипЗнч(Ссылка.СсылкаНаОбъект) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда  
			ОшибкаДокумент = спСервисИнтеграцииВызовСервера.ПроверкаДокументаПеремещениеЗапасов(Ссылка.СсылкаНаОбъект);  
		КонецЕсли;
		
		Если ОшибкаДокумент Тогда 
			СообщениеОшибки = СтрШаблон("%1 не соответствует отправке, проверьте статус", Ссылка.СсылкаНаОбъект); 
			ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОшибки); 
			Возврат;
		КонецЕсли;

		
		Попытка
			ИсходящееСообщение = спФункцииРаботыXMLВызовСервера.ПолучитьСообщениеПоСсылке(Ссылка);
		Исключение 
			ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка получения сериализованных данных для отправки файла сообщения по FTP");
		КонецПопытки;   
		
		Попытка  
			Если ИсходящееСообщение.Свойство("ДвоичныеДанные") И ЗначениеЗаполнено(ИсходящееСообщение.ДвоичныеДанные) Тогда 
				
				МоеУникальноеИмяФайла = СоздатьУникальноеИмяФайла(ИсходящееСообщение);
				
				ИмяФайла = Строка(МоеУникальноеИмяФайла) + ".xml";
				ВременныйФайл = ПолучитьИмяВременногоФайла(ИмяФайла);
				ИмяВременногоФайла = Каталог + ИмяФайла;
				
				Данные = ПолучитьИзВременногоХранилища(ИсходящееСообщение.ДвоичныеДанные); 
				Данные.Записать(ИмяВременногоФайла);
								
				СсылкаИмяФайла = Новый Структура;
				СсылкаИмяФайла.Вставить("Ссылка", Ссылка);
				СсылкаИмяФайла.Вставить("ИмяФайла", ИмяВременногоФайла);
				СсылкаИмяФайла.Вставить("ИсходящееСообщение", ИсходящееСообщение); 
				СсылкаИмяФайла.Вставить("МоеУникальноеИмяФайла", МоеУникальноеИмяФайла);

                ФайлыОтправки.Добавить(СсылкаИмяФайла);
				
			Иначе 
				СообщениеОшибки = СтрШаблон("%1 не соответствует отправке, проверьте статус", Ссылка); 
				ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОшибки); 
			КонецЕсли;
		Исключение
						
			Для каждого ДанныеСообщения Из ОтправкаДокументов Цикл
				
				ИдентификаторСообщения = ?(ДанныеСообщения.Свойство("ИдентификаторСобытия"), ДанныеСообщения.ИдентификаторСобытия, Неопределено);
				ЗаписьЖурнала = Новый Структура; 
				ЗаписьЖурнала.Вставить("Ошибка", Истина);
				ЗаписьЖурнала.Вставить("СтатусСообщения", ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.ОшибкаОтправки"));
				ЗаписьЖурнала.Вставить("Идентификатор", ИдентификаторСообщения);
				ЗаписьЖурнала.Вставить("СпособПередачи", ПредопределенноеЗначение("Перечисление.спСпособПередачи.FTP"));
				ЗаписьЖурнала.Вставить("Ссылка", ДанныеСообщения.СсылкаНаОбъект);
				ЗаписьЖурнала.Вставить("ИмяФайла", Неопределено);
				ЗаписьЖурнала.Вставить("ТипИнтеграции", ПредопределенноеЗначение("Перечисление.спТипыИнтеграции.Исходящая"));
				ЗаписьЖурнала.Вставить("ЗаписатьВОчередьИсходящих", Ложь);	
				спРаботаСДаннымиВызовСервера.ЗаписьВЖурнал(ЗаписьЖурнала);
			КонецЦикла;		
						
			ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка отправки файла по FTP");
			
			ЗавершитьСессию(Сессия);												
			Возврат;
		КонецПопытки; 
		
	КонецЦикла;
	
	Попытка 
		Если ФайлыОтправки.Количество() > 0 Тогда 
			КаталогВАрхив = СоздатьКаталогВыгрузки();
			
			Для каждого ФайлОтправки Из ФайлыОтправки Цикл	
				ПоместитьВАрхив(КаталогВАрхив, ФайлОтправки.МоеУникальноеИмяФайла, ФайлОтправки);
			КонецЦикла;	
			
			ПутьВыгрузки = КаталогВАрхив + "*"; 
			// Поместить файл в каталог
			Результат = Сессия.PutFiles(ПутьВыгрузки, ПодключениеsFTP.sFTPПутьНаFTPPending);  
			
			//Проверяем результат на возможные ошибки
			Результат.Check();
			
		КонецЕсли; 
		
		УдалитьФайлы(Каталог); 
		УдалитьФайлы(КаталогВАрхив); 
		
	Исключение 
		Для каждого Файл Из ФайлыОтправки Цикл	
	
			ИдентификаторСообщения = ?(Файл.Ссылка.Свойство("ИдентификаторСобытия"), Файл.Ссылка.ИдентификаторСобытия, Неопределено);
			ЗаписьЖурнала = Новый Структура; 
			ЗаписьЖурнала.Вставить("Ошибка", Истина);
			ЗаписьЖурнала.Вставить("СтатусСообщения", ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.ОшибкаОтправки"));
			ЗаписьЖурнала.Вставить("Идентификатор", ИдентификаторСообщения);
			ЗаписьЖурнала.Вставить("СпособПередачи", ПредопределенноеЗначение("Перечисление.спСпособПередачи.FTP"));
			ЗаписьЖурнала.Вставить("Ссылка", Файл.Ссылка.СсылкаНаОбъект);
			ЗаписьЖурнала.Вставить("ИмяФайла", Неопределено);
			ЗаписьЖурнала.Вставить("ТипИнтеграции", ПредопределенноеЗначение("Перечисление.спТипыИнтеграции.Исходящая"));
			ЗаписьЖурнала.Вставить("ЗаписатьВОчередьИсходящих", Ложь);	
			спРаботаСДаннымиВызовСервера.ЗаписьВЖурнал(ЗаписьЖурнала); 	
		КонецЦикла;

		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка отправки файла по FTP");
		
		ЗавершитьСессию(Сессия);												
		Возврат;
		
	КонецПопытки;
	
	
	//Обрабатываем результат выгрузки  
	Если ТипЗнч(Результат) = Тип("COMОбъект") Тогда 
		ОтправкаФайла = Ложь;
		Для каждого ВыгруженныйФайл Из Результат.Transfers Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю("Выгружен файл: " + ВыгруженныйФайл.FileName);
			ОтправкаФайла = Истина;
		КонецЦикла; 
		Если ОтправкаФайла Тогда
			Для каждого Файл Из ФайлыОтправки Цикл							
				
			ИдентификаторСообщения = ?(Файл.Ссылка.Свойство("ИдентификаторСобытия"), Файл.Ссылка.ИдентификаторСобытия, Неопределено);
			ЗаписьЖурнала = Новый Структура; 
			ЗаписьЖурнала.Вставить("Ошибка", Ложь);
			ЗаписьЖурнала.Вставить("СтатусСообщения", ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.Отправлено"));
			ЗаписьЖурнала.Вставить("Идентификатор", ИдентификаторСообщения);
			ЗаписьЖурнала.Вставить("СпособПередачи", ПредопределенноеЗначение("Перечисление.спСпособПередачи.FTP"));
			ЗаписьЖурнала.Вставить("Ссылка", Файл.Ссылка.СсылкаНаОбъект);
			ЗаписьЖурнала.Вставить("ИмяФайла", МоеУникальноеИмяФайла + ".zip");
			ЗаписьЖурнала.Вставить("ТипИнтеграции", ПредопределенноеЗначение("Перечисление.спТипыИнтеграции.Исходящая"));
			ЗаписьЖурнала.Вставить("ЗаписатьВОчередьИсходящих", Истина);	
			спРаботаСДаннымиВызовСервера.ЗаписьВЖурнал(ЗаписьЖурнала);
			
			КонецЦикла
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю("Файла по FTP не оправлен");
		КонецЕсли;
	КонецЕсли; 
	
	Сессия.Dispose(); 
КонецПроцедуры

Процедура ОтправитьСообщениеНоменклатурыПоsFTP(ОтправкаНоменклатуры = Неопределено) Экспорт  
	
	Если спОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("спОтключитьПотокиОбработкиДанных") Тогда  
		ОбщегоНазначенияКлиент.СообщитьПользователю("Отправка файла по FTP отключена");
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ОтправкаНоменклатуры) <> Тип("Массив") ИЛИ ОтправкаНоменклатуры.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ПодключениеsFTP = спФункцииРаботыXMLВызовСервера.ПолучитьЗначенияКонстант();

	Попытка
		//Создаем объект Session
		Сессия = Новый COMОбъект("WinSCP.Session");
		спВзаимодействиеСПодключениемКлиент.ПодключитьКоннектор(Сессия);
	Исключение 
				
		Для каждого ДанныеСообщения Из ОтправкаНоменклатуры Цикл
			
			ИдентификаторСообщения = ?(ДанныеСообщения.Свойство("Идентификатор"), ДанныеСообщения.Идентификатор, Неопределено);
			ЗаписьЖурнала = Новый Структура; 
			ЗаписьЖурнала.Вставить("Ошибка", Истина);
			ЗаписьЖурнала.Вставить("СтатусСообщения", ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.ОшибкаОтправки"));
			ЗаписьЖурнала.Вставить("Идентификатор", ИдентификаторСообщения);
			ЗаписьЖурнала.Вставить("СпособПередачи", ПредопределенноеЗначение("Перечисление.спСпособПередачи.FTP"));
			ЗаписьЖурнала.Вставить("Ссылка", ДанныеСообщения.СсылкаНаОбъект);
			ЗаписьЖурнала.Вставить("ИмяФайла", Неопределено);
			ЗаписьЖурнала.Вставить("ТипИнтеграции", ПредопределенноеЗначение("Перечисление.спТипыИнтеграции.Исходящая"));
			ЗаписьЖурнала.Вставить("ЗаписатьВОчередьИсходящих", Ложь);	
			спРаботаСДаннымиВызовСервера.ЗаписьВЖурнал(ЗаписьЖурнала);
		КонецЦикла;	
	
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка подключения к FTP");								
		ЗавершитьСессию(Сессия);												
		Возврат;
	КонецПопытки;
	
	Попытка
		ИсходящееСообщение = спФункцииРаботыXMLВызовСервера.ПолучитьСообщениеПоСсылкам(ОтправкаНоменклатуры); 
	Исключение 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка получения сериализованных данных для отправки файла сообщения по FTP");
	КонецПопытки;   
			
	Попытка  
		Если ИсходящееСообщение.Свойство("ДвоичныеДанные") И ЗначениеЗаполнено(ИсходящееСообщение.ДвоичныеДанные) Тогда 
			Каталог = СоздатьКаталогВыгрузки(); 
			МоеУникальноеИмяФайла = СоздатьУникальноеИмяФайла(ИсходящееСообщение);
			
			ИмяФайла = Строка(МоеУникальноеИмяФайла) + ".xml";
			ВременныйФайл = ПолучитьИмяВременногоФайла(ИмяФайла);
			ИмяВременногоФайла = Каталог + ИмяФайла;
			
			Данные = ПолучитьИзВременногоХранилища(ИсходящееСообщение.ДвоичныеДанные); 
			Данные.Записать(ИмяВременногоФайла); 
			
			ПоместитьВАрхив(Каталог, МоеУникальноеИмяФайла, ИмяВременногоФайла);
			
			УдалитьФайлы(ИмяВременногоФайла);			
			
			
			ПутьВыгрузки = Каталог + "*"; 
			// Поместить файл в каталог
			Результат = Сессия.PutFiles(ПутьВыгрузки, ПодключениеsFTP.sFTPПутьНаFTPPending); 
			
			//Проверяем результат на возможные ошибки
			Результат.Check();
			
			УдалитьФайлы(Каталог); 
		Иначе  
			Для каждого Ссылка Из ОтправкаНоменклатуры Цикл
				СообщениеОшибки = СтрШаблон("%1 ошибка оправки", Ссылка); 
				ОбщегоНазначенияКлиент.СообщитьПользователю(СообщениеОшибки); 
			КонецЦикла;
		КонецЕсли;
		
		
		
	Исключение
		 
		Для каждого ДанныеСообщения Из ОтправкаНоменклатуры Цикл
			
			ИдентификаторСообщения = ?(ДанныеСообщения.Свойство("Идентификатор"), ДанныеСообщения.Идентификатор, Неопределено);
			ЗаписьЖурнала = Новый Структура; 
			ЗаписьЖурнала.Вставить("Ошибка", Истина);
			ЗаписьЖурнала.Вставить("СтатусСообщения", ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.ОшибкаОтправки"));
			ЗаписьЖурнала.Вставить("Идентификатор", ИдентификаторСообщения);
			ЗаписьЖурнала.Вставить("СпособПередачи", ПредопределенноеЗначение("Перечисление.спСпособПередачи.FTP"));
			ЗаписьЖурнала.Вставить("Ссылка", ДанныеСообщения.СсылкаНаОбъект);
			ЗаписьЖурнала.Вставить("ИмяФайла", Неопределено);
			ЗаписьЖурнала.Вставить("ТипИнтеграции", ПредопределенноеЗначение("Перечисление.спТипыИнтеграции.Исходящая"));
			ЗаписьЖурнала.Вставить("ЗаписатьВОчередьИсходящих", Ложь);	
			спРаботаСДаннымиВызовСервера.ЗаписьВЖурнал(ЗаписьЖурнала);
		КонецЦикла;	
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка отправки файла по FTP");
		ЗавершитьСессию(Сессия);		
		УдалитьФайлы(Каталог); 
		Возврат;
	КонецПопытки; 
	
	
	//Обрабатываем результат выгрузки  
	Если ТипЗнч(Результат) = Тип("COMОбъект") Тогда 
		ОтправкаФайла = Ложь;
		Для каждого ВыгруженныйФайл Из Результат.Transfers Цикл
			ОбщегоНазначенияКлиент.СообщитьПользователю("Выгружен файл: " + ВыгруженныйФайл.FileName);
			ОтправкаФайла = Истина;
		КонецЦикла; 
		Если ОтправкаФайла Тогда
			
			Для каждого ДанныеСообщения Из ОтправкаНоменклатуры Цикл
	
			ИдентификаторСообщения = ?(ДанныеСообщения.Свойство("ИдентификаторСобытия"), ДанныеСообщения.ИдентификаторСобытия, Неопределено);
			ЗаписьЖурнала = Новый Структура; 
			ЗаписьЖурнала.Вставить("Ошибка", Ложь);
			ЗаписьЖурнала.Вставить("СтатусСообщения", ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.Отправлено"));
			ЗаписьЖурнала.Вставить("Идентификатор", ИдентификаторСообщения);
			ЗаписьЖурнала.Вставить("СпособПередачи", ПредопределенноеЗначение("Перечисление.спСпособПередачи.FTP"));
			ЗаписьЖурнала.Вставить("Ссылка", ДанныеСообщения.СсылкаНаОбъект);
			ЗаписьЖурнала.Вставить("ИмяФайла", МоеУникальноеИмяФайла + ".zip");
			ЗаписьЖурнала.Вставить("ТипИнтеграции", ПредопределенноеЗначение("Перечисление.спТипыИнтеграции.Исходящая"));
			ЗаписьЖурнала.Вставить("ЗаписатьВОчередьИсходящих", Истина);	
			спРаботаСДаннымиВызовСервера.ЗаписьВЖурнал(ЗаписьЖурнала);
			
			КонецЦикла
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю("Файла по FTP не оправлен");
		КонецЕсли;
	КонецЕсли; 
	
	Сессия.Dispose(); 
КонецПроцедуры

Процедура ПроверитьОбработкуСообщенийНоменклатуры(ФайлыОтправки = Неопределено) Экспорт  
    РезультатPending 	= Ложь;
	РезультатProcessed 	= Ложь;
	РезультатErrors     = Ложь;
	
	Если ТипЗнч(ФайлыОтправки) <> Тип("Массив") ИЛИ ФайлыОтправки.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	ПодключениеsFTP = спФункцииРаботыXMLВызовСервера.ПолучитьЗначенияКонстант();
	
	Попытка
		//Создаем объект Session
		Сессия = Новый COMОбъект("WinSCP.Session");
		спВзаимодействиеСПодключениемКлиент.ПодключитьКоннектор(Сессия);  
		
	Исключение 										
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка подключения к FTP");								
		ЗавершитьСессию(Сессия);												
		Возврат;
	КонецПопытки;
	
	Для каждого Файл Из ФайлыОтправки Цикл  
		
		Попытка
			remotePath = ПодключениеsFTP.sFTPПутьНаFTPPending + Файл.ИмяФайла;
			РезультатPending = Сессия.FileExists(remotePath);
		Исключение 
			ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка проверки файла по FTP");
			Продолжить;
			//ЗавершитьСессию(Сессия);												
			
		КонецПопытки;
		
		Попытка
			remotePath = ПодключениеsFTP.sFTPПутьНаFTPProcessed + Файл.ИмяФайла;
			РезультатProcessed = Сессия.FileExists(remotePath);
		Исключение 
			ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка проверки файла по FTP");
			Продолжить;

			//ЗавершитьСессию(Сессия);												
			
		КонецПопытки;   
		
		Попытка
			remotePath = ПодключениеsFTP.sFTPПутьНаFTPErrors + Файл.ИмяФайла;
			РезультатErrors = Сессия.FileExists(remotePath);
		Исключение 
			ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка проверки файла по FTP");
			Продолжить;

			//ЗавершитьСессию(Сессия);												
			
		КонецПопытки;
		
				
		Если РезультатPending Тогда
			Продолжить; 
		ИначеЕсли РезультатProcessed Тогда 
			СтатусыСообщений = ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.ОтправкаПодтверждена");
		ИначеЕсли РезультатErrors Тогда 
			СтатусыСообщений = ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.ОшибкаПодтверждения");
		Иначе 
			Продолжить;
		КонецЕсли;

		
		ИдентификаторСобытия = ?(Файл.Свойство("ИдентификаторСобытия"), Файл.ИдентификаторСобытия, Неопределено);
		ЗаписьЖурнала = Новый Структура; 
		ЗаписьЖурнала.Вставить("Ошибка", Ложь);
		ЗаписьЖурнала.Вставить("СтатусСообщения", СтатусыСообщений);
		ЗаписьЖурнала.Вставить("Идентификатор", ИдентификаторСобытия);
		ЗаписьЖурнала.Вставить("СпособПередачи", ПредопределенноеЗначение("Перечисление.спСпособПередачи.FTP"));
		ЗаписьЖурнала.Вставить("Ссылка", Файл.СсылкаНаОбъект);
		ЗаписьЖурнала.Вставить("ИмяФайла", Файл.ИмяФайла);
		ЗаписьЖурнала.Вставить("ТипИнтеграции", ПредопределенноеЗначение("Перечисление.спТипыИнтеграции.Исходящая"));
		ЗаписьЖурнала.Вставить("ЗаписатьВОчередьИсходящих", Ложь);	
		спРаботаСДаннымиВызовСервера.ЗаписьВЖурнал(ЗаписьЖурнала);


	КонецЦикла;
	
	Сессия.Dispose();
КонецПроцедуры

#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

// Процедура - Завершить сессию
//
// Параметры:
//	Сессия -   
//
Процедура ЗавершитьСессию(Сессия)
	Если ТипЗнч(Сессия) = Тип("COMОбъект") Тогда
		Сессия.Dispose();
	КонецЕсли;	
КонецПроцедуры	

Функция СоздатьУникальноеИмяФайла(ИсходящееСообщение) 
	Префикс = "";
	ИмяДата = "";
	ИмяВремя = "";
	УИД = Новый УникальныйИдентификатор();
	
	Если ИсходящееСообщение.Префикс = "FE714" Тогда  
		Префикс = "FE714"; 
		ИмяДата = Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=yyyy-MM-dd");
		ИмяВремя = Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=ЧЧ:мм:сс"); 
		
	ИначеЕсли ИсходящееСообщение.Префикс = "FE720" Тогда 	
		Префикс = "FE720"; 
		ИмяДата = Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=yyyy-MM-dd");
		ИмяВремя = Формат(ОбщегоНазначенияКлиент.ДатаСеанса(), "ДФ=ЧЧ:мм:сс"); 
		
	КонецЕсли;
	
	МоеУникальноеИмяФайла = Префикс + "_" + СтрЗаменить(ИмяДата,"-","") + "_" + СтрЗаменить(ИмяВремя,":","") + "_" + УИД; 
	Возврат МоеУникальноеИмяФайла;
КонецФункции 

Функция СоздатьКаталогВыгрузки()
	Каталог = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(ПолучитьИмяВременногоФайла(""));
	СоздатьКаталог(Каталог);   
	Возврат Каталог;
КонецФункции

Процедура ПоместитьВАрхив(Каталог, МоеУникальноеИмяФайла, ФайлыОтправки = Неопределено)  
	Если ФайлыОтправки = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	ИмяАрхивногоФайла = Каталог + Строка(МоеУникальноеИмяФайла) + ".zip"; 
	
	// Создадим объект записи ZIP-архива
	ЗаписьZIP = Новый ЗаписьZipФайла(ИмяАрхивногоФайла,
	,
	,
	МетодСжатияZIP.Сжатие,
	УровеньСжатияZIP.Максимальный,
	МетодШифрованияZIP.Zip20); 
	
	// Добавим необходимые файлы в архив 
	
	Если ТипЗнч(ФайлыОтправки) = Тип("Массив") Тогда
		Для каждого Файл Из ФайлыОтправки Цикл
			ЗаписьZIP.Добавить(Файл.ИмяФайла, РежимСохраненияПутейZIP.НеСохранятьПути);
		КонецЦикла;   
		
	ИначеЕсли ТипЗнч(ФайлыОтправки) = Тип("Структура") И ФайлыОтправки.Свойство("ИмяФайла") Тогда
		ЗаписьZIP.Добавить(ФайлыОтправки.ИмяФайла, РежимСохраненияПутейZIP.НеСохранятьПути);
	Иначе 
		ЗаписьZIP.Добавить(ФайлыОтправки, РежимСохраненияПутейZIP.НеСохранятьПути);
	КонецЕсли;

	// Запишем архив на диск
	ЗаписьZIP.Записать(); 
	
КонецПроцедуры  

#КонецОбласти
