 
 #Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы
 
&НаКлиенте
&После("ЗапасыНоменклатураПриИзменении")
Процедура спЗапасыНоменклатураПриИзменении(Элемент)
	СтрокаТабличнойЧасти = Элементы.Запасы.ТекущиеДанные; 
	ДопРеквизиты = ЗаполнитьДопРеквизитыНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	СтрокаТабличнойЧасти.Бренд 		= ?(ЗначениеЗаполнено(ДопРеквизиты.Бренд),ДопРеквизиты.Бренд, Неопределено);
	СтрокаТабличнойЧасти.Размер 	= ?(ЗначениеЗаполнено(ДопРеквизиты.Размер),ДопРеквизиты.Размер, Неопределено);
	СтрокаТабличнойЧасти.Цвет 		= ?(ЗначениеЗаполнено(ДопРеквизиты.Цвет),ДопРеквизиты.Цвет, Неопределено);	
	
КонецПроцедуры

&НаКлиенте
&После("ПриОткрытии")
Процедура спПриОткрытии(Отказ) 
	ЗаполнитьТабличнуюЧастьНаФорме();	
КонецПроцедуры

&НаКлиенте
&После("ПослеЗаписи")
Процедура спПослеЗаписи(ПараметрыЗаписи)
	ЗаполнитьТабличнуюЧастьНаФорме();	
КонецПроцедуры
#КонецОбласти   

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ЗаполнитьДопРеквизитыНоменклатуры(Номенклатура) 
	
	ДопРеквизиты = Новый Структура();
    ДопРеквизиты.Вставить("Цвет", Номенклатура.спЦвет); 
	ДопРеквизиты.Вставить("Размер", Номенклатура.спРазмер); 
	
	ДополнительнйРеквизитБренд = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Бренд", Истина);	
	ЗначениеБренд = Номенклатура.ДополнительныеРеквизиты.Найти(ДополнительнйРеквизитБренд);  
	Бренд = Неопределено;
	Если ЗначениеБренд <> Неопределено Тогда 
	     Бренд = ЗначениеБренд["Значение"].Наименование
	КонецЕсли;
	ДопРеквизиты.Вставить("Бренд", Бренд);
	
	Возврат ДопРеквизиты;
КонецФункции

Процедура ЗаполнитьТабличнуюЧастьНаФорме() 
	Для каждого СтрокаЗапаса  Из Объект.Запасы Цикл
		ДопРеквизиты = ЗаполнитьДопРеквизитыНоменклатуры(СтрокаЗапаса.Номенклатура);
		СтрокаЗапаса.Бренд 		= ?(ЗначениеЗаполнено(ДопРеквизиты.Бренд),ДопРеквизиты.Бренд, Неопределено);
		СтрокаЗапаса.Размер 	= ?(ЗначениеЗаполнено(ДопРеквизиты.Размер),ДопРеквизиты.Размер, Неопределено);
		СтрокаЗапаса.Цвет 		= ?(ЗначениеЗаполнено(ДопРеквизиты.Цвет),ДопРеквизиты.Цвет, Неопределено);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура спОтменитьВернутьЗапасы(ДанныеЗапаса, ПричинаОтмены = Неопределено) Экспорт

	// { Иванов С.С. (TNext) - 05.05.2025 - Задача №1448 
	// процедура сделана экспортной, так как вызывается из процедуры общего модуля спПодключаемыеКомандыКлиент.ОбработчикКоманды
	ОтменитьВернутьЗапасы(ДанныеЗапаса, ПричинаОтмены);
	// }
КонецПроцедуры

#КонецОбласти   
 