
Функция ПолучитьТоварыБезДопРеквизитовGET(Запрос)
	
	Контекст = APIW_ОбщийМодульСервер.УведомитьОНачалеЗапроса(Запрос, "Товары (без доп. реквизитов)");
	
	Попытка
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
		СтрокаJSON = APIW_ОбщийМодульСервер.ПолучитьНоменклатуруБезДоп();
		Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Исключение
		APIW_ОбщийМодульСервер.УведомитьОбОшибкеЗапроса(Контекст, ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	APIW_ОбщийМодульСервер.УведомитьОбУспешномЗапросе(Контекст, "Размер ответа: " + СтрДлина(СтрокаJSON) + " симв.");
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьДопРеквизитыНоменклатурыGET(Запрос)
	
	Контекст = APIW_ОбщийМодульСервер.УведомитьОНачалеЗапроса(Запрос, "Товары (с доп. реквизитами)");
	
	Попытка
	  Ответ = Новый HTTPСервисОтвет(200);
	  Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	  СтрокаJSON = APIW_ОбщийМодульСервер.ПолучитьНоменклатуруCДоп();
	  Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Исключение
		APIW_ОбщийМодульСервер.УведомитьОбОшибкеЗапроса(Контекст, ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	APIW_ОбщийМодульСервер.УведомитьОбУспешномЗапросе(Контекст, "Размер ответа: " + СтрДлина(СтрокаJSON) + " симв.");
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьДеревоКатегорийGET(Запрос)
	
	Контекст = APIW_ОбщийМодульСервер.УведомитьОНачалеЗапроса(Запрос, "Дерево категорий");
	
	Попытка
	  Ответ = Новый HTTPСервисОтвет(200);
	  Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");

	  СтрокаJSON = APIW_ОбщийМодульСервер.ПостроитьДеревоКатегорий();
	  Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Исключение
		APIW_ОбщийМодульСервер.УведомитьОбОшибкеЗапроса(Контекст, ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	APIW_ОбщийМодульСервер.УведомитьОбУспешномЗапросе(Контекст, "Размер ответа: " + СтрДлина(СтрокаJSON) + " симв.");
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьЗаказПоНомеруGET(Запрос)
	
	Контекст = APIW_ОбщийМодульСервер.УведомитьОНачалеЗапроса(Запрос, "Заказ по номеру");
	
	Попытка
	  Ответ = Новый HTTPСервисОтвет(200);
	  Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	  ПолучитьОтбор = Запрос.ПараметрыURL["selection"];
	  ОписаниеПараметров = "ПоНомеру";
	  СтрокаJSON = APIW_ОбщийМодульСервер.ПолучитьВсеЗаказы();
	  Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Исключение
		APIW_ОбщийМодульСервер.УведомитьОбОшибкеЗапроса(Контекст, ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	APIW_ОбщийМодульСервер.УведомитьОбУспешномЗапросе(Контекст, "Размер ответа: " + СтрДлина(СтрокаJSON) + " симв.");
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьВсеЗаказыGET(Запрос)
	
	Контекст = APIW_ОбщийМодульСервер.УведомитьОНачалеЗапроса(Запрос, "Заказы");
	
	Попытка
	  Ответ = Новый HTTPСервисОтвет(200);
	  Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");

	  НомерЗаказа = Запрос.ПараметрыURL["selection"];

	  Если НомерЗаказа = "allorders" Тогда
	      Отбор = Неопределено;
	      ОписаниеПараметров = "";
	  Иначе
	      Отбор = НомерЗаказа;
	      ОписаниеПараметров = "ПоНомеру";
	  КонецЕсли;

	  СтрокаJSON = APIW_ОбщийМодульСервер.ПолучитьВсеЗаказы(Отбор, ОписаниеПараметров);
	  Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Исключение
		APIW_ОбщийМодульСервер.УведомитьОбОшибкеЗапроса(Контекст, ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	APIW_ОбщийМодульСервер.УведомитьОбУспешномЗапросе(Контекст, "Размер ответа: " + СтрДлина(СтрокаJSON) + " симв.");
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьОстаткиТоваровGET(Запрос)
	
	Контекст = APIW_ОбщийМодульСервер.УведомитьОНачалеЗапроса(Запрос, "Остатки (все)");
	
	Попытка
	  Ответ = Новый HTTPСервисОтвет(200);
	  Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	  ПолучитьОтбор = "";
	  ОписаниеПараметров = "Полный";
	  СтрокаJSON = APIW_ОбщийМодульСервер.ПолучитьОстаткиТоваров(ПолучитьОтбор,ОписаниеПараметров);
	  Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Исключение
		APIW_ОбщийМодульСервер.УведомитьОбОшибкеЗапроса(Контекст, ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	APIW_ОбщийМодульСервер.УведомитьОбУспешномЗапросе(Контекст, "Размер ответа: " + СтрДлина(СтрокаJSON) + " симв.");
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьОстаткиТоваровПоАртикулуGET(Запрос)
	
	Контекст = APIW_ОбщийМодульСервер.УведомитьОНачалеЗапроса(Запрос, "Остатки по артикулу");
	
	Попытка
	  Ответ = Новый HTTPСервисОтвет(200);
	  Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	  ПолучитьОтбор = Запрос.ПараметрыURL["selection"];
	  ОписаниеПараметров = "Артикул";
	  СтрокаJSON = APIW_ОбщийМодульСервер.ПолучитьОстаткиТоваров(ПолучитьОтбор, ОписаниеПараметров);
	  Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Исключение
		APIW_ОбщийМодульСервер.УведомитьОбОшибкеЗапроса(Контекст, ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	APIW_ОбщийМодульСервер.УведомитьОбУспешномЗапросе(Контекст, "Размер ответа: " + СтрДлина(СтрокаJSON) + " симв.");
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьОстаткиТоваровПакетGET(Запрос)
	
	Контекст = APIW_ОбщийМодульСервер.УведомитьОНачалеЗапроса(Запрос, "Остатки (постранично)");
	
	Попытка
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
		ПолучитьОтбор = Число(Запрос.ПараметрыURL["selection"]);
		//ПолучитьОтбор = 1000;
		// Получаем номер пакета из параметров запроса (1..4), по умолчанию 1
		НомерСтраницы = 1;
		СтрНомерСтраницы = Запрос.ПараметрыЗапроса["page"];
		Если СтрНомерСтраницы <> Неопределено Тогда
			НомерСтраницы = Число(СтрНомерСтраницы);
			Если НомерСтраницы < 1 Или НомерСтраницы > ПолучитьОтбор Тогда
				НомерСтраницы = 1;
			КонецЕсли;
		КонецЕсли;

		СтрокаJSON = APIW_ОбщийМодульСервер.ПолучитьОстаткиТоваровПакет(НомерСтраницы, ПолучитьОтбор);

		Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Исключение
		APIW_ОбщийМодульСервер.УведомитьОбОшибкеЗапроса(Контекст, ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	APIW_ОбщийМодульСервер.УведомитьОбУспешномЗапросе(Контекст, "Размер ответа: " + СтрДлина(СтрокаJSON) + " симв.");
	
	Возврат Ответ;
	
КонецФункции


Функция ПолучитьИзмененныеЗаказыДляСайтаGET(Запрос)
	
	//Контекст = APIW_ОбщийМодульСервер.УведомитьОНачалеЗапроса(Запрос, "Изменённые заказы для сайта");
	
	Попытка
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
		//ПолучитьОтбор = Запрос.ПараметрыURL["selection"];
		//ОписаниеПараметров = "Артикул";
		СтрокаJSON = APIW_ОбщийМодульСервер.ПолучитьДанныеПоЗаказам();
		Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Исключение
		//APIW_ОбщийМодульСервер.УведомитьОбОшибкеЗапроса(Контекст, ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	//APIW_ОбщийМодульСервер.УведомитьОбУспешномЗапросе(Контекст, "Размер ответа: " + СтрДлина(СтрокаJSON) + " симв.");
	
	Возврат Ответ;
	
КонецФункции





Функция ТестЗаказGET(Запрос) 
	
  Ответ = Новый HTTPСервисОтвет(200);
  Ответ.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
  //ПолучитьОтбор = Запрос.ПараметрыURL["selection"];
  СтрокаJSON = Тест();
  Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
  Возврат Ответ;
  
КонецФункции

&НаСервере
Функция Тест() Экспорт
	
	МассивЗаказов = Новый Массив;

   		ЗаказСоответствие = Новый Соответствие;
		ЗаказСоответствие.Вставить("number", "WK-999928"); 
		ЗаказСоответствие.Вставить("delivery_method", "Курьер"); //СпособДоставки
		ЗаказСоответствие.Вставить("delivery_services", "DALLI (Межгород)");  //СлужбаДоставки                              		
		ЗаказСоответствие.Вставить("cost_delivery", "500"); //СтоимостьДоставки
		ЗаказСоответствие.Вставить("time_delivery_s", "31.05.2026 12:00:00");  //ВремяДоставкиС
		ЗаказСоответствие.Вставить("time_delivery_po", "31.05.2026 18:00:00"); //ВремяДоставкиПо
		ЗаказСоответствие.Вставить("comment", "Тестовый комментарий"); //Комментарий                             		
		ЗаказСоответствие.Вставить("counterparty_naming", "Тест API"); //КонтрагентНаименование
		ЗаказСоответствие.Вставить("counterparty_pfone", "+79857771702");
		ЗаказСоответствие.Вставить("order_status", "Оплачен"); //СостояниеЗаказа 
		ЗаказСоответствие.Вставить("counterparty_country", "РОССИЯ"); //КонтрагентСтрана	
		ЗаказСоответствие.Вставить("counterparty_region", "77 г. Москва");	//Counterparty Region
		ЗаказСоответствие.Вставить("counterparty_city", "Москва"); //КонтрагентГород	
		ЗаказСоответствие.Вставить("counterparty_street", "Лесная"); //КонтрагентУлица				
		ЗаказСоответствие.Вставить("counterparty_house_number", "10");        //КонтрагентДом
		ЗаказСоответствие.Вставить("counterparty_building", "1");      //КонтрагентКорпус
		ЗаказСоответствие.Вставить("counterparty_index", "125047");  //КонтрагентИндекс 
		ЗаказСоответствие.Вставить("expected_delivery_date", "31.05.2026 00:00:00");  //ОжидаемаяДатаВручения
		    		                   			
		МассивТоваров = Новый Массив;
			ЗаказТоварыСоответствие = Новый Соответствие;
			ЗаказТоварыСоответствие.Вставить("product_id", "4bd70c61-31d1-11f0-bd38-0050568e9e4b"); //ТоварИД 
			ЗаказТоварыСоответствие.Вставить("price", "3000"); //Цена всегда отправлять полну стоимость товра без учета скидки
			ЗаказТоварыСоответствие.Вставить("quantity", "2"); //Количество 
			ЗаказТоварыСоответствие.Вставить("amount", "6000"); //Сумма
			ЗаказТоварыСоответствие.Вставить("discount_amount", "1000");	//СуммаСкидки		
            МассивТоваров.Добавить(ЗаказТоварыСоответствие);
		
		ЗаказСоответствие.Вставить("tovar", МассивТоваров);
		МассивЗаказов.Добавить(ЗаказСоответствие);
	
	                                                        
	ОтветJSON = Новый ЗаписьJSON;
	ОтветJSON.УстановитьСтроку();
	ЗаписатьJSON(ОтветJSON, МассивЗаказов);

	Возврат ОтветJSON.Закрыть();

КонецФункции 

Функция ПолучитьОстаткиТоваровТолькоРезервGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Возврат Ответ;
КонецФункции







