//#Область ПрограммныйИнтерфейс

//Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные) Экспорт

//	#Если МобильныйКлиент Тогда
//		
//		Если Источник = "CleverenceBarcodeScanner" И Событие = "Barcode" Тогда
//			
//			Если ТипЗнч(Данные) <> Тип("Массив") Тогда 
//				Параметр = Новый Массив;
//				Параметр.Добавить(Данные);
//				Параметр.Добавить(Неопределено);
//			Иначе
//				Параметр = Данные;
//			КонецЕсли;
//			
//			ИмяСобытия = "ScanData";
//			ИсточникСобытия = "ПодключаемоеОборудование";
//			
//			Если ТипЗнч(спТекущаяФорма) = Тип("ФормаКлиентскогоПриложения") Тогда
//				спТекущаяФорма.Активизировать();                                     
//			КонецЕсли;   
//			
//			Оповестить(ИмяСобытия, Параметр, ИсточникСобытия);
//			
//		КонецЕсли;
//		
//	#КонецЕсли

//КонецПроцедуры

//Процедура ПриОткрытии(Знач Форма) Экспорт
//	
//	#Если МобильныйКлиент Тогда  
//		ПодключениеСканераТСДАсинх(Форма, Истина);
//		спТекущаяФорма = Форма;
//	#КонецЕсли     
//	
//КонецПроцедуры 

//Процедура ПриЗакрытии(Форма) Экспорт
//	
//	#Если МобильныйКлиент Тогда  
//		
//		Если спСканерТСД = Неопределено Тогда
//			Возврат;
//		КонецЕсли;
//		
//		Попытка                                 
//			спСканерТСД.Отключить("Barcode");
//			спСканерТСД = Неопределено;
//		Исключение   
//			
//		КонецПопытки;
//		
//	#КонецЕсли 
//КонецПроцедуры

//#КонецОбласти  

//#Область СлужебныеПроцедурыИФункции

//Асинх Процедура ПодключениеСканераТСДАсинх(Форма, УстановитьЕслиНеПодключено)
//	
//	ДанныеДрайвера = спИнтеграцияТСДUrovoПовтИсп.ДанныеДрайвераТСД();
//	
//	АдресКомпоненты = СтрШаблон("ОбщийМакет.%1_ru", ?(ЗначениеЗаполнено(ДанныеДрайвера.ИмяМакетаДрайвера), ДанныеДрайвера.ИмяМакетаДрайвера, ДанныеДрайвера.ИмяПредопределенныхДанных));
//	ИмяКомпоненты = СтрЗаменить(ДанныеДрайвера.ИдентификаторОбъекта, "AddIn.", "");
//	
//	Подключено = Ждать ПодключитьВнешнююКомпонентуАсинх(АдресКомпоненты, ИмяКомпоненты);
//	
//	Если Подключено Тогда
//		
//		Попытка                                 
//			спСканерТСД = Новый(СтрШаблон("AddIn.%1.%1", ДанныеДрайвера.ИдентификаторОбъекта));
//		Исключение   

//		КонецПопытки; 
//		
//		Попытка                                 
//			спСканерТСД.Подключить("Barcode");
//		Исключение   

//		КонецПопытки;

//	ИначеЕсли УстановитьЕслиНеПодключено Тогда
//		
//		Ждать УстановитьВнешнююКомпонентуАсинх(АдресКомпоненты);
//		
//		ПодключениеСканераТСДАсинх(Форма, Ложь);
//		
//    КонецЕсли;
//	
//КонецПроцедуры

//#КонецОбласти
