
#Область ПрограммныйИнтерфейс

// Функция - ПеревестиДатувЧисло
// 
// Параметры:
//  ДатаИзменения - - Дата изменения
//  Задержка - Число - Задержка
// 
// Возвращаемое значение:
//  Число - Дата изменения + Задержка.
Функция ПеревестиДатуВЧисло(ДатаИзменения, Задержка = 0) Экспорт
	
	Возврат (ДатаИзменения - Дата(2000,1,1)) + Задержка;
	
КонецФункции

// Функция - Получить количество потоков
// 
// Параметры:
//  ИмяПараметра - Строка - имя параметра по которому выполняется поиск фоновых заданий.
//  ЗначениеПараметра - Массив - значения для отбора по параметру.
// 
// Возвращаемое значение:
//  Число - количество активных фоновых заданий.
Функция ПолучитьКоличествоПотоков(ИмяПараметра, ЗначениеПараметра) Экспорт
	
	УсловияПоиска = Новый Структура;
	УсловияПоиска.Вставить(ИмяПараметра, ЗначениеПараметра);
	УсловияПоиска.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	
	Обработчики = ФоновыеЗадания.ПолучитьФоновыеЗадания(УсловияПоиска);
	
	Возврат Обработчики.Количество();

КонецФункции

// Процедура - Ожидание
//
// Параметры:
//  Длительность - Число - длительность ожидания в секундах.
//
Процедура Ожидание(Длительность) Экспорт

	
	ВнешняяКомпонента = спКэшируемыеФункцииВызовСервера.ПолучитьКомпоненту();

	
	Если ВнешняяКомпонента = Неопределено Тогда 
		
		Идентификатор = Новый УникальныйИдентификатор;
		
		НачатьТранзакцию();
		
		Блокировка = Новый БлокировкаДанных;	
		Элемент = Блокировка.Добавить("РегистрСведений.спБлокировкаОчереди");
		Элемент.Режим = РежимБлокировкиДанных.Исключительный;
		Элемент.УстановитьЗначение("Идентификатор", Идентификатор);	
		
		Попытка
			Блокировка.Заблокировать();
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),  
			УровеньЖурналаРегистрации.Ошибка,,,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));  
		КонецПопытки;      
		
		МсвПараметров = Новый Массив;
		МсвПараметров.Добавить(Идентификатор);
		
		Задание = ФоновыеЗадания.Выполнить("спОбщегоНазначенияВызовСервера.ВыполнитьПаузу", МсвПараметров, , "Выполнить паузу " + Строка(Длительность) + " сек.");
		
		Попытка
			
			Задание.ОжидатьЗавершенияВыполнения(Длительность);
			
		Исключение
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),  
			УровеньЖурналаРегистрации.Ошибка,,,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));  
		КонецПопытки;             
		
		ОтменитьТранзакцию();
		
	Иначе  
		
		ВнешняяКомпонента.Sleep(Длительность*1000);
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура - Выполнить паузу
//
// Параметры:
//  Идентификатор - УникальныйИдентификатор - идентификатор сессии ожидания.
//
Процедура ВыполнитьПаузу(Идентификатор) Экспорт
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных;
	
	Элемент = Блокировка.Добавить("РегистрСведений.спБлокировкаОчереди");
	Элемент.Режим = РежимБлокировкиДанных.Исключительный;
	Элемент.УстановитьЗначение("Идентификатор", Идентификатор);
	
	Попытка
		
		Блокировка.Заблокировать();
		
	Исключение
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),  
    УровеньЖурналаРегистрации.Ошибка,,,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));  
	КонецПопытки;
	
	ОтменитьТранзакцию();
	
КонецПроцедуры

// Функция - Получить статус события
// 
// Параметры:
//  ИдентификаторСобытия - УникальныйИдентификатор - Идентификатор события
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.спСтатусыСообщений - Статус события
Функция ПолучитьСтатусСобытия(ИдентификаторСобытия) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	СостояниеСообщений.СтатусСообщения
	|ИЗ
	|	РегистрСведений.спСостояниеСообщений КАК СостояниеСообщений
	|ГДЕ
	|	СостояниеСообщений.ИдентификаторСобытия = &ИдентификаторСобытия";
	Запрос.УстановитьПараметр("ИдентификаторСобытия", ИдентификаторСобытия);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Возврат Результат.СтатусСообщения;
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
КонецФункции

// Процедура - Запустить обработчик очереди
//
// Параметры:
//  обработчикочереди - Строка - имя функции обработчика.
//  имямодуля - Строка - имя модуля в котором размещена функция обработчик.
//
Процедура ЗапуститьОбработчикОчереди(ОбработчикОчереди, ИмяМодуля = "спОбслуживаниеОчередей") Экспорт
		
		Попытка			
			ФоновыеЗадания.Выполнить(ИмяМодуля + "." + ОбработчикОчереди,, ОбработчикОчереди, ОбработчикОчереди);
		Исключение
			// Запускаем фоновое задание со статическим ключем. Запуск других экземпляров должен заканчиваться ошибкой (паттерн синглтон).
			ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"),  
    УровеньЖурналаРегистрации.Ошибка,,,ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));  
		КонецПопытки;
		
КонецПроцедуры

// Функция - Получает структуру описания обработчика
// 
// Возвращаемое значение:
// 	Структура - Структура описания обработчика
//
Функция ПолучитьСтруктуруОписанияОбработчика() Экспорт
	Возврат Новый Структура("ОбработчикНайден, Отключен, Наименование, ПроцедураОбработки, ИдентификаторШаблона, Версия, Статус", Ложь, Истина);
КонецФункции

// Функция - Дополнить текст ошибки 
// 
// Параметры:
// 	ТекстОшибки - Строка - Исходный текст ошибки
//	Обработчик - Структура - Структура описания обработчика
//	Объект - ЛюбаяСсылка - Объект ошибки
// 	
// Возвращаемое значение:
//  Строка - Дополненный текст ошибки
//
Функция ДополнитьТекстОшибки(ТекстОшибки, Обработчик, Объект) Экспорт
		
	Если ЗначениеЗаполнено(Объект) Тогда
		ТекстОбъекта = ", объект: " + Строка(Объект) + "/" + Объект.УникальныйИдентификатор();
	Иначе
		ТекстОбъекта = "";
	КонецЕсли;
		
	ТекстОшибки = "При выполнении обработчика " + Обработчик.Наименование + " [Версия: " + Обработчик.Версия + ТекстОбъекта + "]" + " произошла ошибка: " + ТекстОшибки;
	
	Возврат ТекстОшибки;
	
КонецФункции

// Функция - Десериализовать объект
//
// Параметры:
//  Формат - ПеречислениеСсылка.спФорматыСообщений - текущий формат сообщения.
//  ОбъектИсточник - Строка - описание объект в указанном формате.
// 
// Возвращаемое значение:
//  ЛюбаяСсылка, ЛюбойОбъект - объект десериализованный из указанного формата. 
//
Функция ДесериализоватьОбъект(Формат, ОбъектИсточник) Экспорт
	
	ТекОбъект = Неопределено;
	
	Попытка

			
	ТекОбъект = спФункцииРаботыJSON.ДесериализоватьОбъект(ОбъектИсточник);

	
	Исключение
		
		ЗаписьЖурналаРегистрации("Datareon. Десериализация объекта", УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));		
	
	КонецПопытки;
	
	Возврат текОбъект;

КонецФункции

// Функция - Получить текст ошибки обработчика
// 
// Параметры:
//  ОшибкаОбработчика - ИнформацияОбОшибке - результат функции ИнформацияОбОшибке()
// 
// Возвращаемое значение:
//  Строка - Получить текст ошибки обработчика
Функция ПолучитьТекстОшибкиОбработчика(Знач ОшибкаОбработчика) Экспорт
	
	Если Истина
		// WMS Начало изменений
		И Ложь
		// WMS Конец изменений
		И ТипЗнч(ОшибкаОбработчика.Причина) = Тип("ИнформацияОбОшибке") Тогда
	
		Возврат "Не удалось обработать сообщение " + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ОшибкаОбработчика.Причина);
			
	Иначе
		
		Возврат "Не удалось обработать сообщение " + ОбработкаОшибок.ПодробноеПредставлениеОшибки(ОшибкаОбработчика);
		
	КонецЕсли;
	
КонецФункции

// Процедура - Установить свойство поиска 
// 
// Параметры:
// 	ОбъектСобытия - ЛюбаяСсылка - Передаваемый объект
// 	РезультатОбработки - Структура - Результат обработки исходящего сообщения
//
Процедура УстановитьСвойствоПоиска(ОбъектСобытия, РезультатОбработки) Экспорт
	
	Если Не ТипЗнч(ОбъектСобытия) = Тип("Отбор") И 
		Не ТипЗнч(ОбъектСобытия) = Тип("Структура") И 
		Не ТипЗнч(ОбъектСобытия) = Тип("Строка") И
		Не ОбъектСобытия = Неопределено Тогда
		
		Попытка
		
			Если РезультатОбработки.Properties = Неопределено Тогда
				
				РезультатОбработки.Properties = Новый Структура();
							
			КонецЕсли;
			
			РезультатОбработки.Properties.Вставить("EntityId", Строка(ОбъектСобытия.Ссылка.УникальныйИдентификатор()));
			
		Исключение
			
			ЗаписьЖурналаРегистрации("Datareon. Установка свойства для поиска объекта", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось установить свойство для поиска объекта, по причине: " + ОписаниеОшибки());
			
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

// Функция - Получить объект XDTO
// 
// Параметры:
//  ФорматСообщения - ПеречислениеСсылка.спФорматыСообщений - текущий формат сообщения.
//  ТелоСообщения - Строка - Текстовое представление сообщения в указанном формате.
//  ТипОбъекта - Неопределено - Тип объекта
// 
// Возвращаемое значение:
//  ОбъектXDTO - объект сформированный фабрикойXDTO из исходного текста. В случае невозможности преобразования возвращается Неопределено. 
//
Функция ПолучитьОбъектXDTO(ФорматСообщения, ТелоСообщения, ТипОбъекта = Неопределено) Экспорт
	
	ТекОбъект = Неопределено;
	
	Попытка
		
		ТекЧтение = ПолучитьОбъектПотоковогоЧтения(ФорматСообщения, ТелоСообщения);
		
		Если Не ТекЧтение = Неопределено Тогда
		
			ТекОбъект = ПрочитатьОбъектИзПотока(ФорматСообщения, ТекЧтение, ТипОбъекта);
			
		КонецЕсли;
		
	Исключение
		
		Если Не ЗначениеЗаполнено(ТелоСообщения) Тогда
			
			ЗаписьЖурналаРегистрации("Datareon.ПолучитьОбъектСообщения", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось получить объект XDTO, поле Body не содержит значения!");
			
		Иначе
			
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("Datareon.ПолучитьОбъектСообщения", УровеньЖурналаРегистрации.Ошибка, Метаданные.ОбщиеМодули.спОбщегоНазначенияВызовСервера, ,  ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			
		КонецЕсли;
		
	КонецПопытки;
	
	Возврат ТекОбъект;
	
КонецФункции

// Функция - Получить объект потокового чтения
// 
// Параметры:
//  Формат - ПеречислениеСсылка.спФорматыСообщений - текущий формат сообщения.
//  ЧитаемаяСтрока -  - .
// 
// Возвращаемое значение:
//  ЧтениеXML, ЧтениеFastInfoset, ЧтениеJSON - объект потокового чтения заданного формата.
Функция ПолучитьОбъектПотоковогоЧтения(Формат, ЧитаемаяСтрока) Экспорт
	
	ТекОбъект = Неопределено;

	Если Формат = Перечисления.спФорматыСообщений.JSON Тогда

		ТекОбъект = спФункцииРаботыJSON.ПолучитьОбъектПотоковогоЧтения(ЧитаемаяСтрока);

	КонецЕсли;

	Возврат ТекОбъект;
	
КонецФункции

// Функция - Прочитать объект из потока
// 
// Параметры:
//  Формат - ПеречислениеСсылка.спФорматыСообщений - текущий формат сообщения.
//  Поток - Строка - строка описания объекта в заданном формате.
//  ТипОбъекта - Неопределено - Тип объекта
// 
// Возвращаемое значение:
//  ЛюбаяСсылка, ЛюбойОбъект - объект прочитанный фабрикой XDTO из указанного формата.
Функция ПрочитатьОбъектИзПотока(Формат, Поток, ТипОбъекта) Экспорт
	
	ТекОбъект = Неопределено;
	
	Попытка
		
		Если Формат = Перечисления.спФорматыСообщений.JSON Тогда
			
			ТекОбъект = спФункцииРаботыJSON.ПрочитатьОбъектИзПотока(Поток, ТипОбъекта);
			
		КонецЕсли;
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Datareon. Формирование объекта XDTO", УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));		
		
	КонецПопытки;
	
	Возврат ТекОбъект;

КонецФункции

// Функция - Получить количество попыток ожидания 
// 
// Параметры:
// 	ОбъектСообщение - ОбъектXDTO - Объект сообщения
// 	
// Возвращаемое значение:
//  Число - значение дополнительного свойства "DelayCount"
//
Функция ПолучитьКоличествоПопытокОжидания(ОбъектСообщение) Экспорт
	
	КоличествоПопытокОжидания = 0;
		
	Если Не ОбъектСообщение.Properties = Неопределено Тогда

		СтруктураСвойств = ПолучитьПараметрыСообщенияСтруктурой(ОбъектСообщение);
		
		Если Не СтруктураСвойств.Свойство("DelayCount", КоличествоПопытокОжидания) Тогда
			КоличествоПопытокОжидания = 0;
		КонецЕсли;
			
	КонецЕсли;
		
	Возврат КоличествоПопытокОжидания;
		
КонецФункции

// Функция - Получить параметры сообщения структурой
//
// Параметры:
//  Сообщение - ОбъектXDTO - объект типа Message1C 
// 
// Возвращаемое значение:
//  Структура - структура с дополнительными свойствами сообщения.
//
функция ПолучитьПараметрыСообщенияСтруктурой(Сообщение) Экспорт
	
	СтруктураПараметры = Новый Структура;
	Если Не Сообщение = Неопределено Тогда
		
		XdtoСвойства = Сообщение.Properties.Последовательность();
		
		Если XdtoСвойства = Неопределено тогда // В зависимости от вида сериализации это может быть список или последовательность.
			
			XdtoСвойства = Сообщение.Properties.ПолучитьСписок("MessageProperty");
			
			Для Каждого текПараметр Из XdtoСвойства Цикл
				
				СтруктураПараметры.Вставить(текПараметр.Name, ОбработкаОшибок.ПолучитьЗначениеСвойстваСообщения(текПараметр));
				 
			КонецЦикла;
			
		Иначе
			 	
			КоличествоПараметры = XdtoСвойства.Количество();
					
			Если КоличествоПараметры > 0 Тогда
				
				Для Индекс = 0 По количествоПараметры - 1 Цикл
					
					текПараметр = XdtoСвойства.ПолучитьЗначениеXDTO(Индекс);
					структураПараметры.Вставить(текПараметр.Name, ОбработкаОшибок.ПолучитьЗначениеСвойстваСообщения(текПараметр)); 
				
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СтруктураПараметры;
	
КонецФункции

Функция ПолучитьИдентификаторСообщенияПоСсылке(СсылкаНаОбъект, СпособПередачи) Экспорт  
    ИдентификаторСобытия = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	тбОчередь.ИдентификаторСобытия КАК ИдентификаторСобытия
	|ИЗ
	|	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
	|		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
	|			И (тбСостояние.ЗадержкаЧисло <= &ЗадержкаЧисло)
	|			И (тбОчередь.СсылкаНаОбъект = &СсылкаНаОбъект)
	|			И (тбОчередь.СпособПередачи = &СпособПередачи)";
	 
	Запрос.УстановитьПараметр("ЗадержкаЧисло", спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекущаяДатаСеанса()));  
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("СпособПередачи", СпособПередачи);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ИдентификаторСобытия = ВыборкаДетальныеЗаписи.ИдентификаторСобытия;
	КонецЦикла;
	
	Возврат ИдентификаторСобытия;
КонецФункции  

// Функция - Получить значение константы
// 
// Параметры:
//  ИмяКонстанты - Строка
// 
// Возвращаемое значение:
//  Произвольный - Значение константы, определённой по имени.
// Значение константы, определённой по имени.
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт
	
	Возврат спУправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты(ИмяКонстанты);
	
КонецФункции

#КонецОбласти
