#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НастройкиАРМов();
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ТипыОборудования.СканерШтрихкода = Истина;
		МенеджерОборудования.ПриСозданииНаСервере(ЭтотОбъект, ТипыОборудования);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда  
			
			Если ТипЗнч(Параметр) <> Тип("Массив") Тогда
				Параметр = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметр);
			КонецЕсли;
			
			Данные = МенеджерОборудованияУНФКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			ПолученШтрихкод(Данные); 
			
		КонецЕсли;  
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКорзина

&НаКлиенте
Процедура КорзинаТаблицаКоличествоПриИзменении(Элемент)
	
	ПересчитатьИтог();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьКорзину(Команда)
	
	ОчиститьСообщения();
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКорзину(Команда)
	
	ОчиститьСообщения();
	ВыполнитьОчисткуКорзины();

КонецПроцедуры

&НаКлиенте
Асинх Процедура СформироватьДокумент(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Зал) Тогда
		
		Подсказака = НСтр("ru = 'Укажите склад ""Зал""'");
		Ответ = Ждать ВвестиЗначениеАсинх(Зал, Подсказака, Тип("СправочникСсылка.СтруктурныеЕдиницы"));
		
		Если Ответ <> Неопределено Тогда
			Зал = Ответ;
		Иначе
			Возврат;	
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Кладовая) Тогда
		
		Подсказака = НСтр("ru = 'Укажите склад ""Кладовая""'");
		Ответ = Ждать ВвестиЗначениеАсинх(Кладовая, Подсказака, Тип("СправочникСсылка.СтруктурныеЕдиницы"));
		
		Если Ответ <> Неопределено Тогда
			Кладовая = Ответ;
		Иначе
			Возврат;	
		КонецЕсли;
		
	КонецЕсли;
	
	Заказ = СформироватьДокументНаСервере();
	
	Если ЗначениеЗаполнено(Заказ) Тогда
		ВыполнитьОчисткуКорзины();
	КонецЕсли;
	
КонецПроцедуры

// Процедура - обработчик команды командной панели табличной части.
&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ОчиститьСообщения();
	ТекШтрихкод = "";
	
	ОбработкаЗавершения = Новый ОписаниеОповещения(
		"ПоискПоШтрихкодуЗавершение",
		ЭтотОбъект, 
		Новый Структура("ТекШтрихкод", ТекШтрихкод));

	#Если МобильныйКлиент Тогда
	ОткрытьФорму("ОбщаяФорма.ФормаПоискаПоШтрихкоду", , , , , , ОбработкаЗавершения);
	#Иначе
	ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборТовара(Команда)
	
	ОткрытьФормуПодбораНоменклатуры();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеФормой

&НаСервере
Функция НастройкиАРМов()

	Ключ  = "ОбщиеНастройкиАРМов";
	
	Настройки = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(Ключ, Ключ, Новый Структура,, ИмяПользователя());
	
	Если Настройки.Свойство("Зал") Тогда
		Зал = Настройки.Зал;
	КонецЕсли;
	
	Если Настройки.Свойство("Кладовая") Тогда
		Кладовая = Настройки.Кладовая;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПересчитатьИтог()
	
	Элементы.КорзинаТаблицаКоличество.ТекстПодвала = Корзина.Итог("Количество");
	
КонецПроцедуры

#КонецОбласти

#Область ПодборТоваров

&НаКлиенте
Процедура ОткрытьФормуПодбораНоменклатуры()
	
	ЕстьПартииСНДС = Ложь;
	Контрагент = Неопределено;
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("ПериодЦен", Дата(1,1,1));
	ПараметрыПодбора.Вставить("ЭтоПодбор", Истина);
	ПараметрыПодбора.Вставить("ИмяТабличнойЧасти", "Корзина");
	ПараметрыПодбора.Вставить("ИмяФормыВладельца", ИмяФормы);
	ПараметрыПодбора.Вставить("ЕстьПартииСНДС", ЕстьПартииСНДС);
	ПараметрыПодбора.Вставить("Контрагент", Контрагент);
	ПараметрыПодбора.Вставить("ТипВладельца", Неопределено);
	ПараметрыПодбора.Вставить("УникальныйИдентификаторФормыВладельца", УникальныйИдентификатор);
	
	ОповещениеПриЗавершении = Новый ОписаниеОповещения("ПриЗакрытииПодбора", ЭтотОбъект);
		
	ОткрытьФорму("Справочник.Номенклатура.ФормаСписка", ПараметрыПодбора, ЭтотОбъект, Истина, , , ОповещениеПриЗавершении, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииПодбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПриЗакрытииПодбораНаСервере(Результат);
	ПересчитатьИтог();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииПодбораНаСервере(Результат)

	КорзинаХранилище = ПолучитьИзВременногоХранилища(Результат.АдресКорзиныВХранилище);
	
	Для каждого СтрокаКорзины Из КорзинаХранилище Цикл
		
		НайденныеСтроки = Корзина.НайтиСтроки(Новый Структура("Ссылка", СтрокаКорзины.Номенклатура));
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			НоваяСтрока = Корзина.Добавить();
			НоваяСтрока.Ссылка = СтрокаКорзины.Номенклатура;
			НоваяСтрока.Количество = СтрокаКорзины.Количество;
			
		Иначе
			
			НайденнаяСтрока = НайденныеСтроки[0];
			
			НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + СтрокаКорзины.Количество;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПоискПоШтрихкоду

// Процедура обрабатывает полученные штрихкоды.
//
&НаКлиенте
Процедура ПолученШтрихкод(ДанныеШтрихкодов) Экспорт
	
	Для каждого ДанныеШтрихкода Из ДанныеШтрихкодов Цикл
		
		ДополнительныеДанныеПоШтрихкоду = ШтрихкодированиеУНФКлиент.ДополнительныеДанныеПоШтрихкоду(ДанныеШтрихкода.Штрихкод,
		"");
		Если ДополнительныеДанныеПоШтрихкоду.ЭтоКодМаркировки Тогда
			ДанныеШтрихкода.Штрихкод = ДополнительныеДанныеПоШтрихкоду.EAN;
		ИначеЕсли ДополнительныеДанныеПоШтрихкоду.ЕстьРазделительGS1 Тогда
			ДанныеШтрихкода.Штрихкод = ДополнительныеДанныеПоШтрихкоду.ПредставлениеШтрихкода;
		Иначе
			// Действие не требуется
		КонецЕсли;
		
		ДанныеПоШтрихКодам = ПолучитьДанныеПоШтрихкодамВМассиве(ДанныеШтрихкода);
		
		МассивДанных = ДанныеПоШтрихкодам.Получить(ДанныеШтрихкода.Штрихкод);
		
		Штрихкод = ДанныеШтрихкода.Штрихкод;
		
		Если Не МассивДанных = Неопределено И МассивДанных.Количество() Тогда
			
			Если МассивДанных.Количество() > 1 Тогда
				ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПоДаннымШтрихкодовЗавершение", ЭтотОбъект);
				ПараметрыОткрытия = Новый Структура("МассивНоменклатуры, ТекШтрихкод", МассивДанных, ДанныеШтрихкода);
				ОткрытьФорму("Справочник.Номенклатура.Форма.ДублиНоменклатурыПоШтрихКоду", ПараметрыОткрытия, ЭтаФорма,,,,
				ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				Возврат;
			КонецЕсли;
			
			Номенклатура = МассивДанных[0].Номенклатура;
			
			ДобавитьТоварВКорзину(Номенклатура);
			
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымШтрихкодовЗавершение(СтруктураНоменклатуры, Параметры) Экспорт 
	
	Если СтруктураНоменклатуры = Неопределено Тогда Возврат КонецЕсли;
	
	Номенклатура = СтруктураНоменклатуры.МассивНоменклатуры[0].Номенклатура;
	
	Если НЕ Номенклатура = Неопределено Тогда
		
		ТекущаяСтрока = Номенклатура;
		Элементы.СписокЗапасы.ТекущаяСтрока = ТекущаяСтрока;

		ДобавитьТоварВКорзину(Номенклатура);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Результат = Неопределено, СокрЛП(ДополнительныеПараметры.ТекШтрихкод), СокрЛП(Результат));
	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда 
		ДанныеШтрихкода = Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1);
		ПолученШтрихкод(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеШтрихкода));
	КонецЕсли;
	
КонецПроцедуры // ПоискПоШтрихкодуЗавершение()

&НаСервере
Функция ПолучитьДанныеПоШтрихкодамВМассиве(ДанныеШтрихкода, СтруктурнаяЕдиница = Неопределено)
	
	РегистрыСведений.ШтрихкодыНоменклатуры.ПреобразоватьВесовойШтрихкод(ДанныеШтрихкода);
	
	Штрихкоды = Новый Массив;
	Штрихкоды.Добавить(ДанныеШтрихкода);
	
	ДанныеПоШтрихкодам = Новый Соответствие;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Рег.Штрихкод КАК Штрихкод,
	|	Рег.Номенклатура КАК Номенклатура,
	|	Рег.Характеристика КАК Характеристика,
	|	Рег.Партия КАК Партия,
	|	Рег.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Рег
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (&СерииНоменклатурыИспользуются)
	|			И Рег.Номенклатура = СерииНоменклатуры.Владелец
	|			И (Рег.Номенклатура.ИспользоватьСерииНоменклатуры)
	|			И Рег.Штрихкод = СерииНоменклатуры.Наименование
	|ГДЕ
	|	Рег.Штрихкод В(&МассивШтрихкодов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗДанныеОВесовомТоваре.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ТЗДанныеОВесовомТоваре.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ТЗДанныеОВесовомТоваре.ШтрихКод КАК ШтрихКод
	|ПОМЕСТИТЬ ВременнаяТаблицаВесовойТовар
	|ИЗ
	|	&ТЗДанныеОВесовомТоваре КАК ТЗДанныеОВесовомТоваре
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыТоваровSKU.Номенклатура КАК Номенклатура,
	|	КодыТоваровSKU.Характеристика КАК Характеристика,
	|	КодыТоваровSKU.Партия КАК Партия,
	|	КодыТоваровSKU.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВременнаяТаблицаВесовойТовар.ШтрихКод КАК ШтрихКод,
	|	ВременнаяТаблицаВесовойТовар.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	|	ЕСТЬNULL(КодыТоваровSKU.Номенклатура.ВидАлкогольнойПродукции.Маркируемый, ЛОЖЬ)
	|		ИЛИ КодыТоваровSKU.Номенклатура.УдалитьТабачнаяПродукция КАК МаркируемаяПродукция
	|ИЗ
	|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаВесовойТовар КАК ВременнаяТаблицаВесовойТовар
	|		ПО КодыТоваровSKU.SKU = ВременнаяТаблицаВесовойТовар.КодВесовогоТовара
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (&СерииНоменклатурыИспользуются)
	|			И КодыТоваровSKU.Номенклатура = СерииНоменклатуры.Владелец
	|			И (КодыТоваровSKU.Номенклатура.ИспользоватьСерииНоменклатуры)
	|			И (ВременнаяТаблицаВесовойТовар.ШтрихКод = СерииНоменклатуры.Наименование)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаВесовойТовар.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ШтрихКод КАК ШтрихКод
	|ИЗ
	|	ВременнаяТаблицаВесовойТовар КАК ВременнаяТаблицаВесовойТовар");
	
	МассивШтрихкодов = Новый Массив;
	ТЗДанныеОВесовомТоваре = Новый ТаблицаЗначений;
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("КодВесовогоТовара", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный)));
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("ПрефиксВесовогоТовара", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200)));
	
	Для каждого ТекШтрихкод Из Штрихкоды Цикл
		
		МассивШтрихкодов.Добавить(ТекШтрихкод.ШтрихКод);

		ДанныеПоШтрихкодам.Вставить(ТекШтрихкод.ШтрихКод, Новый Массив);
		
		Если ТекШтрихкод.Свойство("КодВесовогоТовара") Тогда
			НоваяСтрокаОВесовомТоваре = ТЗДанныеОВесовомТоваре.Добавить();
			НоваяСтрокаОВесовомТоваре.КодВесовогоТовара = ТекШтрихкод.КодВесовогоТовара;
			НоваяСтрокаОВесовомТоваре.ПрефиксВесовогоТовара = ТекШтрихкод.ПрефиксВесовогоТовара;
			НоваяСтрокаОВесовомТоваре.Штрихкод = ТекШтрихкод.Штрихкод;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("МассивШтрихкодов", МассивШтрихкодов);
	ИспользоватьСерииНоменклатуры = СерииНоменклатурыУНФ.ИспользоватьСерииНоменклатурыОстатки();
	Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
		Запрос.УстановитьПараметр("СерииНоменклатурыИспользуются", Истина);
	Иначе
	    Запрос.УстановитьПараметр("СерииНоменклатурыИспользуются", Ложь);
	КонецЕсли;
	Запрос.УстановитьПараметр("ТЗДанныеОВесовомТоваре", ТЗДанныеОВесовомТоваре);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МассивДанныхПоШтрихкоду = ДанныеПоШтрихкодам[Выборка.Штрихкод];
		
		ТекДанные = Новый Структура;
		МассивДанныхПоШтрихкоду.Добавить(ТекДанные);
		
		ТекДанные.Вставить("Номенклатура", Выборка.Номенклатура);
		ТекДанные.Вставить("Характеристика", Выборка.Характеристика);
		ТекДанные.Вставить("Партия", Выборка.Партия);
		ТекДанные.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
		ТекДанные.Вставить("КодВесовогоТовара", Выборка.КодВесовогоТовара);
		ТекДанные.Вставить("ПрефиксВесовогоТовара", Выборка.ПрефиксВесовогоТовара);
		ТекДанные.Вставить("МаркируемаяПродукция", Выборка.МаркируемаяПродукция);
		ТекДанные.Вставить("НоменклатураПоставщика", Неопределено);
		
		Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
			ТекДанные.Вставить("Серия", Выборка.Серия);
		КонецЕсли;
	КонецЦикла;
	
	Выборка = МассивРезультатов[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МассивДанныхПоШтрихкоду = ДанныеПоШтрихкодам[Выборка.Штрихкод];
		
		ТекДанные = Новый Структура;
		МассивДанныхПоШтрихкоду.Добавить(ТекДанные);
		
		Если НЕ ТекДанные.Свойство("КодВесовогоТовара") Тогда
			ТекДанные.Вставить("Номенклатура", Выборка.Номенклатура);
			ТекДанные.Вставить("Характеристика", Выборка.Характеристика);
			ТекДанные.Вставить("Партия", Выборка.Партия);
			ТекДанные.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
			ТекДанные.Вставить("НоменклатураПоставщика", Неопределено);
			
			Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
				ТекДанные.Вставить("Серия", Выборка.Серия);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат ДанныеПоШтрихкодам;

КонецФункции

#КонецОбласти //ПоискПоШтрихкоду

#Область ФормированиеДокументов

&НаКлиенте
Процедура УдалитьТоварИзКорзины(Строка)
	
	НайденныеСтроки = Корзина.НайтиСтроки(Новый Структура("Ссылка", Строка.Ссылка));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтрокаКорзины = НайденныеСтроки[0];
		СтрокаКорзины.Количество = СтрокаКорзины.Количество - 1;
		Количество = СтрокаКорзины.Количество;
	Иначе
		Количество = 0;
	КонецЕсли;
	
	Если Количество = 0 Тогда
			
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			Корзина.Удалить(НайденнаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	ПересчитатьИтог();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТоварВКорзину(Номенклатура)
	
	Если Не ЗначениеЗаполнено(Номенклатура) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Номенклатура не найдена'"));
		Возврат;
		
	КонецЕсли;
	
	НайденныеСтроки = Корзина.НайтиСтроки(Новый Структура("Ссылка", Номенклатура));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаКорзины = Корзина.Добавить();
		СтрокаКорзины.Ссылка = Номенклатура;
		СтрокаКорзины.Количество = 1; 
	Иначе
		СтрокаКорзины = НайденныеСтроки[0];
		СтрокаКорзины.Количество = СтрокаКорзины.Количество + 1;
	КонецЕсли;
	
	Элементы.КорзинаТаблица.ТекущаяСтрока = СтрокаКорзины.ПолучитьИдентификатор();
	ПересчитатьИтог();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОчисткуКорзины()
	
	Корзина.Очистить();
	ПересчитатьИтог();
	
КонецПроцедуры

&НаСервере
Функция СформироватьДокументНаСервере()
	
	ЗаказСсылка = Неопределено;
	
	Если Корзина.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Корзина пустая'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат ЗаказСсылка; 
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
		
	ЗаказСсылка = СформироватьЗаказНаПеремещение(Корзина.Выгрузить(), Зал, Кладовая);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ЗаказСсылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьЗаказНаПеремещение(Корзина, Отправитель, Получатель);
	
	ЗаказСсылка = Неопределено;
	
	ДанныеДляЗаполнения = ДанныеДляЗаполнения(Получатель, Отправитель);
	
	Заказ = Документы.ЗаказНаПеремещение.СоздатьДокумент();
	Заказ.Заполнить(Неопределено);
	ЗаполнитьЗначенияСвойств(Заказ, ДанныеДляЗаполнения);  
	  
	Для каждого СтрокаКорзины Из Корзина Цикл

		НоваяСтрока = Заказ.Запасы.Добавить();
		НоваяСтрока.Номенклатура 		= СтрокаКорзины.Ссылка;
		НоваяСтрока.Количество 			= СтрокаКорзины.Количество;
		НоваяСтрока.ЕдиницаИзмерения 	= СтрокаКорзины.Ссылка.ЕдиницаИзмерения;
		
	КонецЦикла;
	
	Если Заказ.ПроверитьЗаполнение() Тогда
		
		Попытка
			Заказ.Записать(РежимЗаписиДокумента.Проведение);
			ЗаказСсылка = Заказ.Ссылка;
			ТекстСообщения = СтрШаблон(НСтр("ru = '%1 успешно создан'"), ЗаказСсылка);
		Исключение
			ТекстСообщения = НСтр("ru = 'Ошибка при проведении заказа. См. Журнал регистрации'");
			Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			спЛогированиеСобытийИБ.ЛогироватьСобытиеИБ("АРМ_Работника_Зала", "Ошибка",,, Ошибка);
		КонецПопытки;
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЗаказСсылка);
		
	КонецЕсли;
	
	Возврат ЗаказСсылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеДляЗаполнения(Получатель, Отправитель, РозничныйПокупатель = Неопределено)
	
	Дата 			= ТекущаяДатаСеанса();
	Организация 	= Справочники.Организации.ОрганизацияПоУмолчанию();
	
	ДанныеДляЗаполнения = Новый Структура;
	
	// Общие
	ДанныеДляЗаполнения.Вставить("Дата", 						Дата);
	ДанныеДляЗаполнения.Вставить("Автор", 						Пользователи.ТекущийПользователь());
	ДанныеДляЗаполнения.Вставить("Организация", 				Организация);
	ДанныеДляЗаполнения.Вставить("Ответственный", 				Неопределено);
	ДанныеДляЗаполнения.Вставить("СтруктурнаяЕдиницаРезерв", 	Отправитель);
	
	// для заказа на перемещение
	ДанныеДляЗаполнения.Вставить("СтруктурнаяЕдиницаПолучатель", 	Получатель);
	ДанныеДляЗаполнения.Вставить("ДатаПеремещения", 				Дата);
	
	Возврат ДанныеДляЗаполнения;
	
КонецФункции

#КонецОбласти

#КонецОбласти