#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПКВ_ЗарегистрироватьКарту(Команда)

	ОткрытьФорму(
		"Обработка.ПКВ_ПодарочныеКарты.Форма.ФормаРегистрацииКарты",
		Новый Структура,
		ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПКВ_Администрирование(Команда)

	ОткрытьФорму(
		"ОбщаяФорма.ПКВ_АдминкаПодарочныхКарт",
		Новый Структура,
		ЭтотОбъект);

КонецПроцедуры

// Полный функционал для администратора и поддержки, не для кассира в зале.
&НаКлиенте
Процедура ПКВ_ОткрытьПанельКассира(Команда)

	ОткрытьФорму(
		"ОбщаяФорма.ПКВ_ФормаКассираАдмин",
		Новый Структура,
		ЭтотОбъект);

КонецПроцедуры

#КонецОбласти
