
#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура спПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//++ Tnext ivai 09.10.2025
	//Решено вернуть доп.реквизиты и скрыть основные.
	
	//<<<--- Tnext Козык К.А. 26.03.2026	
	//Элемент = Элементы.Найти("спАтрибутРаздела");
	//Если Не Элемент = Неопределено Тогда
	//	Элемент.Видимость = Ложь;
	//	Элемент.Доступность = Ложь;
	//	Элемент.ТолькоПросмотр = Истина;
	//КонецЕсли; 
	//--->>> Tnext Козык К.А. 26.03.2026
	
	Элемент = Элементы.Найти("спПодборка");
	Если Не Элемент = Неопределено Тогда
		Элемент.Видимость = Ложь;
		Элемент.Доступность = Ложь;
		Элемент.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	//// ++ Tnext Михеев С.В. 12.09.2025
	//ЕстьОписаниеДополнительныхРеквизитов = Ложь;
	//
	//РеквизитыФормы = ЭтотОбъект.ПолучитьРеквизиты();
	//Для Каждого РеквизитФормы Из РеквизитыФормы Цикл
	//	Если РеквизитФормы.Имя = "Свойства_ОписаниеДополнительныхРеквизитов" Тогда 
	//		ЕстьОписаниеДополнительныхРеквизитов = Истина;
	//		Прервать;
	//	КонецЕсли;
	//КонецЦикла;
	//
	//Если ЕстьОписаниеДополнительныхРеквизитов Тогда 
	//	ОписаниеДополнительныхРеквизитов = ЭтотОбъект["Свойства_ОписаниеДополнительныхРеквизитов"]; 
	//	
	//	ПараметрыЗапроса = Новый Структура;
	//	ПараметрыЗапроса.Вставить("ИдентификаторДляФормул", "АтрибутРаздела");
	//	
	//	Выборка = спОбщегоНазначения.ЗапросПоПараметрамДанных(
	//		ПараметрыЗапроса, "ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения");
	//		
	//	Если Выборка.Следующий() Тогда
	//		
	//		Свойство = Выборка.Ссылка;
	//		
	//		СтрокиАтрибутРаздела = ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", Свойство));
	//		Для Каждого СтрокаАтрибутРаздела Из СтрокиАтрибутРаздела Цикл
	//			ЭлементАтрибутРаздела = Элементы[СтрокаАтрибутРаздела.ИмяРеквизитаЗначение];
	//			ЭлементАтрибутРаздела.Видимость = Ложь;
	//		КонецЦикла;
	//		
	//	КонецЕсли;
	//	
	//	//++ Tnext ivai 15.09.2025 Задача _3720_
	//	ПараметрыЗапроса = Новый Структура;
	//	ПараметрыЗапроса.Вставить("ИдентификаторДляФормул", "спПодборка");
	//	
	//	Выборка = спОбщегоНазначения.ЗапросПоПараметрамДанных(
	//		ПараметрыЗапроса, "ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения");
	//		
	//	Если Выборка.Следующий() Тогда
	//		
	//		Свойство = Выборка.Ссылка;
	//		
	//		СтрокиАтрибутРаздела = ОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Свойство", Свойство));
	//		Для Каждого СтрокаАтрибутРаздела Из СтрокиАтрибутРаздела Цикл
	//			ЭлементАтрибутРаздела = Элементы[СтрокаАтрибутРаздела.ИмяРеквизитаЗначение];
	//			ЭлементАтрибутРаздела.Видимость = Ложь;
	//		КонецЦикла;
	//	КонецЕсли;
	//	//-- Tnext ivai
	//КонецЕсли;
	//
	//
	//
	//// -- Tnext Михеев С.В.
	//-- Tnext ivai
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//&НаСервере
//&Вместо("ОписаниеЗапросаОстатки")
//Функция спОписаниеЗапросаОстатки(Запрос, Области)
//		
//	РезультатФункции = Новый Структура;
//	
//	ЗапросТекстОстатки = 
//	"ВЫБРАТЬ
//	|	ЗапасыНаСкладахОстатки.Организация КАК Организация,
//	|	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
//	|	ЗапасыНаСкладахОстатки.Характеристика КАК Характеристика,
//	|	ЗапасыНаСкладахОстатки.Партия КАК Партия,
//	|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	ЗапасыНаСкладахОстатки.Ячейка КАК Ячейка,
//	|	ЗапасыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
//	|ПОМЕСТИТЬ ВТ_Остатки
//	|ИЗ
//	|	РегистрНакопления.ЗапасыНаСкладах.Остатки(, Номенклатура = &Номенклатура) КАК ЗапасыНаСкладахОстатки
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ОстаткиТоваров.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
//	|	ОстаткиТоваров.Характеристика КАК Характеристика,
//	|	ОстаткиТоваров.Партия КАК Партия,
//	|	СУММА(ОстаткиТоваров.Резерв) КАК Резерв,
//	|	ЕСТЬNULL(ВТ_Остатки.Ячейка, ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)) КАК Ячейка,
//	|	СУММА(ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, ОстаткиТоваров.Количество)) КАК Остаток
//	|ИЗ
//	|	РегистрСведений.ОстаткиТоваров КАК ОстаткиТоваров
//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
//	|		ПО ОстаткиТоваров.Организация = ВТ_Остатки.Организация
//	|			И ОстаткиТоваров.СтруктурнаяЕдиница = ВТ_Остатки.СтруктурнаяЕдиница
//	|			И ОстаткиТоваров.Номенклатура = ВТ_Остатки.Номенклатура
//	|			И ОстаткиТоваров.Характеристика = ВТ_Остатки.Характеристика
//	|			И ОстаткиТоваров.Партия = ВТ_Остатки.Партия
//	|ГДЕ
//	|	ОстаткиТоваров.Номенклатура = &Номенклатура
//	|	И (НЕ ОстаткиТоваров.Количество = 0
//	|			ИЛИ НЕ ОстаткиТоваров.Резерв = 0)
//	|
//	|СГРУППИРОВАТЬ ПО
//	|	ОстаткиТоваров.Партия,
//	|	ОстаткиТоваров.СтруктурнаяЕдиница,
//	|	ОстаткиТоваров.Характеристика,
//	|	ЕСТЬNULL(ВТ_Остатки.Ячейка, ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка))
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	Характеристика,
//	|	СтруктурнаяЕдиница,
//	|	Ячейка
//	|ИТОГИ
//	|	СУММА(Резерв),
//	|	СУММА(Остаток)
//	|ПО
//	|	Характеристика,
//	|	СтруктурнаяЕдиница,
//	|	Ячейка
//	|АВТОУПОРЯДОЧИВАНИЕ";
//	ЗапросТекстОстаткиНомерВПакете = 2;
//	
//	РезультатФункции.Вставить("ТекстЗапроса", ЗапросТекстОстатки);
//	РезультатФункции.Вставить("НомерВПакете", ЗапросТекстОстаткиНомерВПакете);
//	РезультатФункции.Вставить("Выводить", Истина);
//	Возврат РезультатФункции;

//КонецФункции

//&НаСервере
//&Вместо("ЗаполнитьОстатки")
//Процедура спЗаполнитьОстатки(Данные)
//		
//	Остатки.ПолучитьЭлементы().Очистить();
//	
//	ВыборкаХарактеристики = Данные.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//	
//	Если ВыборкаХарактеристики.Количество() = 0 Тогда
//		Элементы.ДекорацияНетОстатков.Видимость = Истина;
//		Возврат;
//	Иначе
//		Элементы.ДекорацияНетОстатков.Видимость = Ложь;
//	КонецЕсли;
//	
//	Элементы.Остатки.Видимость = Истина;
//	ДеревоХарактеристики = Остатки.ПолучитьЭлементы();
//	
//	Пока ВыборкаХарактеристики.Следующий() Цикл
//		
//		ЕстьХарактеристики = Справочники.ХарактеристикиНоменклатуры.Выбрать(, Объект.Ссылка).Следующий()
//		ИЛИ Справочники.ХарактеристикиНоменклатуры.Выбрать(, Объект.КатегорияНоменклатуры).Следующий();
//		
//		Если ЕстьХарактеристики Тогда
//			
//			ДеревоНоваяСтрокаХарактеристика = ДеревоХарактеристики.Добавить();
//			ДеревоНоваяСтрокаХарактеристика.Единица = ВыборкаХарактеристики.Характеристика;
//			
//			Остаток = "" + ВыборкаХарактеристики.Остаток;
//			Резерв = "";
//			Если ЗначениеЗаполнено(ВыборкаХарактеристики.Резерв) Тогда
//				Резерв = " / " + ВыборкаХарактеристики.Резерв;
//			КонецЕсли;
//			
//			ДеревоНоваяСтрокаХарактеристика.Остаток = Остаток + Резерв;
//			ДеревоНоваяСтрокаХарактеристика.ЭтоХарактеристика = Истина;
//			
//			ДеревоСклады = ДеревоНоваяСтрокаХарактеристика.ПолучитьЭлементы();
//		Иначе
//			ДеревоСклады = Остатки.ПолучитьЭлементы();
//		КонецЕсли;
//		
//		ВыборкаСклады = ВыборкаХарактеристики.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
//		Пока ВыборкаСклады.Следующий() Цикл
//			
//			ДеревоНоваяСтрокаСклад = ДеревоСклады.Добавить();
//			ДеревоНоваяСтрокаСклад.Единица = ВыборкаСклады.СтруктурнаяЕдиница;
//			
//			Остаток = "" + ВыборкаСклады.Остаток;
//			Резерв = "";
//			Если ЗначениеЗаполнено(ВыборкаСклады.Резерв) Тогда
//				Резерв = " / " + ВыборкаСклады.Резерв;
//			КонецЕсли;
//			
//			ДеревоНоваяСтрокаСклад.Остаток = Остаток + Резерв;
//			
//			// -->
//			ДеревоЯчейки = ДеревоНоваяСтрокаСклад.ПолучитьЭлементы();
//			
//			ВыборкаЯчейки = ВыборкаСклады.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
//			
//			Пока ВыборкаЯчейки.Следующий() Цикл
//				
//				ДеревоНоваяСтрокаЯчейка = ДеревоЯчейки.Добавить();
//				ДеревоНоваяСтрокаЯчейка.Единица = ВыборкаЯчейки.Ячейка;
//				
//				Остаток = "" + ВыборкаЯчейки.Остаток;
//				Резерв = "";
//				Если ЗначениеЗаполнено(ВыборкаЯчейки.Резерв) Тогда
//					Резерв = " / " + ВыборкаЯчейки.Резерв;
//				КонецЕсли;
//				
//				ДеревоНоваяСтрокаЯчейка.Остаток = Остаток + Резерв;
//				
//				ДеревоПартии = ДеревоНоваяСтрокаЯчейка.ПолучитьЭлементы();
//				
//				Если Объект.ИспользоватьПартии Тогда
//					ВыборкаПартии = ВыборкаЯчейки.Выбрать();
//					Пока ВыборкаПартии.Следующий() Цикл
//						
//						ДеревоНоваяСтрокаПартия = ДеревоПартии.Добавить();
//						ДеревоНоваяСтрокаПартия.Единица = ВыборкаПартии.Партия;
//						Остаток = "" + ВыборкаПартии.Остаток;
//						Резерв = "";
//						Если ЗначениеЗаполнено(ВыборкаПартии.Резерв) Тогда
//							Резерв = " / " + ВыборкаПартии.Резерв;
//						КонецЕсли;
//						
//						ДеревоНоваяСтрокаПартия.Остаток = ВыборкаПартии.Остаток;
//						ДеревоНоваяСтрокаПартия.ЭтоПартия = Истина;
//						
//					КонецЦикла;
//				КонецЕсли;
//				
//			КонецЦикла;
//			
//		КонецЦикла;    
//		
//	КонецЦикла;

//КонецПроцедуры 

//<<<--- Tnext Козык К.А. 18.06.2026 - вывод остатков номенклатуры по ячейкам

&НаСервере
&Вместо("ОписаниеЗапросаОстатки")
Функция спОписаниеЗапросаОстатки(Запрос, Области)
	
	РезультатФункции = Новый Структура;
	
	ЗапросТекстОстатки = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗапасыНаСкладахОстатки.Организация КАК Организация,
	|	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ЗапасыНаСкладахОстатки.Партия КАК Партия,
	|	ЗапасыНаСкладахОстатки.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ЕСТЬNULL(ЗапасыНаСкладахОстатки.Ячейка, ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)) КАК Ячейка,
	|	ЗапасыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_Остатки
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах.Остатки(, Номенклатура = &Номенклатура) КАК ЗапасыНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОстаткиТоваров.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ОстаткиТоваров.Характеристика КАК Характеристика,
	|	ОстаткиТоваров.Партия КАК Партия,
	|	СУММА(ОстаткиТоваров.Резерв) КАК Резерв,
	|	ЕСТЬNULL(ВТ_Остатки.Ячейка, ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)) КАК Ячейка,
	|	СУММА(ЕСТЬNULL(ВТ_Остатки.КоличествоОстаток, ОстаткиТоваров.Количество)) КАК Остаток
	|ИЗ
	|	РегистрСведений.ОстаткиТоваров КАК ОстаткиТоваров
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Остатки КАК ВТ_Остатки
	|		ПО ОстаткиТоваров.Организация = ВТ_Остатки.Организация
	|			И ОстаткиТоваров.СтруктурнаяЕдиница = ВТ_Остатки.СтруктурнаяЕдиница
	|			И ОстаткиТоваров.Номенклатура = ВТ_Остатки.Номенклатура
	|			И ОстаткиТоваров.Характеристика = ВТ_Остатки.Характеристика
	|			И ОстаткиТоваров.Партия = ВТ_Остатки.Партия
	|ГДЕ
	|	ОстаткиТоваров.Номенклатура = &Номенклатура
	|	И (НЕ ОстаткиТоваров.Количество = 0
	|			ИЛИ НЕ ОстаткиТоваров.Резерв = 0)
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваров.Партия,
	|	ОстаткиТоваров.СтруктурнаяЕдиница,
	|	ОстаткиТоваров.Характеристика,
	|	ЕСТЬNULL(ВТ_Остатки.Ячейка, ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка))
	|
	|УПОРЯДОЧИТЬ ПО
	|	Характеристика,
	|	СтруктурнаяЕдиница,
	|	Ячейка
	|ИТОГИ
	|	СУММА(Резерв),
	|	СУММА(Остаток)
	|ПО
	|	Характеристика,
	|	СтруктурнаяЕдиница,
	|	Ячейка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ЗапросТекстОстаткиНомерВПакете = 2;
	
	РезультатФункции.Вставить("ТекстЗапроса", ЗапросТекстОстатки);
	РезультатФункции.Вставить("НомерВПакете", ЗапросТекстОстаткиНомерВПакете);
	РезультатФункции.Вставить("Выводить", Истина);
	
	Возврат РезультатФункции;
	
КонецФункции

&НаСервере
&Вместо("ЗаполнитьОстатки")
Процедура спЗаполнитьОстатки(Данные)
	
	СформироватьЗаголовокДереваОстатков();
	
	Остатки.ПолучитьЭлементы().Очистить();
	
	ВыборкаХарактеристики = Данные.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаХарактеристики.Количество() = 0 Тогда
		Элементы.ДекорацияНетОстатков.Видимость = Истина;
		Возврат;
	Иначе
		Элементы.ДекорацияНетОстатков.Видимость = Ложь;
	КонецЕсли;
	
	Элементы.Остатки.Видимость = Истина;
	ДеревоХарактеристики = Остатки.ПолучитьЭлементы();
	
	ЕстьХарактеристики = Справочники.ХарактеристикиНоменклатуры.Выбрать(, Объект.Ссылка).Следующий()
		ИЛИ Справочники.ХарактеристикиНоменклатуры.Выбрать(, Объект.КатегорияНоменклатуры).Следующий();
	
	Пока ВыборкаХарактеристики.Следующий() Цикл
		
		Если ЕстьХарактеристики Тогда
			
			ДеревоНоваяСтрокаХарактеристика = ДеревоХарактеристики.Добавить();
			ДеревоНоваяСтрокаХарактеристика.Единица = ВыборкаХарактеристики.Характеристика;
			
			Остаток = "" + ВыборкаХарактеристики.Остаток;
			Резерв = "";
			Если ЗначениеЗаполнено(ВыборкаХарактеристики.Резерв) Тогда
				Резерв = " / " + ВыборкаХарактеристики.Резерв;
			КонецЕсли;
			
			ДеревоНоваяСтрокаХарактеристика.Остаток = Остаток + Резерв;
			ДеревоНоваяСтрокаХарактеристика.ЭтоХарактеристика = Истина;
			ДеревоНоваяСтрокаХарактеристика.ОстатокВсего = ВыборкаХарактеристики.Остаток + ВыборкаХарактеристики.Резерв;
			ДеревоНоваяСтрокаХарактеристика.ОстатокВРезерве = ВыборкаХарактеристики.Резерв;
			ДеревоНоваяСтрокаХарактеристика.ОстатокСвободно = ВыборкаХарактеристики.Остаток;
			
			ДеревоСклады = ДеревоНоваяСтрокаХарактеристика.ПолучитьЭлементы();
			
		Иначе
			
			ДеревоСклады = Остатки.ПолучитьЭлементы();
			
		КонецЕсли;
		
		ВыборкаСклады = ВыборкаХарактеристики.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаСклады.Следующий() Цикл
			
			ДеревоНоваяСтрокаСклад = ДеревоСклады.Добавить();
			ДеревоНоваяСтрокаСклад.Единица = ВыборкаСклады.СтруктурнаяЕдиница;
			
			Остаток = "" + ВыборкаСклады.Остаток;
			Резерв = "";
			Если ЗначениеЗаполнено(ВыборкаСклады.Резерв) Тогда
				Резерв = " / " + ВыборкаСклады.Резерв;
			КонецЕсли;
			
			ДеревоНоваяСтрокаСклад.Остаток = Остаток + Резерв;
			ДеревоНоваяСтрокаСклад.ОстатокВсего = ВыборкаСклады.Остаток + ВыборкаСклады.Резерв;
			ДеревоНоваяСтрокаСклад.ОстатокВРезерве = ВыборкаСклады.Резерв;
			ДеревоНоваяСтрокаСклад.ОстатокСвободно = ВыборкаСклады.Остаток;
			
			ДеревоЯчейки = ДеревоНоваяСтрокаСклад.ПолучитьЭлементы();
			ВыборкаЯчейки = ВыборкаСклады.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаЯчейки.Следующий() Цикл
				
				ДеревоНоваяСтрокаЯчейка = ДеревоЯчейки.Добавить();
				ДеревоНоваяСтрокаЯчейка.Единица = ВыборкаЯчейки.Ячейка;
				
				Остаток = "" + ВыборкаЯчейки.Остаток;
				Резерв = "";
				Если ЗначениеЗаполнено(ВыборкаЯчейки.Резерв) Тогда
					Резерв = " / " + ВыборкаЯчейки.Резерв;
				КонецЕсли;
				
				ДеревоНоваяСтрокаЯчейка.Остаток = Остаток + Резерв;
				ДеревоНоваяСтрокаЯчейка.ОстатокВсего = ВыборкаЯчейки.Остаток + ВыборкаЯчейки.Резерв;
				ДеревоНоваяСтрокаЯчейка.ОстатокВРезерве = ВыборкаЯчейки.Резерв;
				ДеревоНоваяСтрокаЯчейка.ОстатокСвободно = ВыборкаЯчейки.Остаток;
				
				Если Объект.ИспользоватьПартии Тогда
					
					ДеревоПартии = ДеревоНоваяСтрокаЯчейка.ПолучитьЭлементы();
					ВыборкаПартии = ВыборкаЯчейки.Выбрать();
					
					Пока ВыборкаПартии.Следующий() Цикл
						
						ДеревоНоваяСтрокаПартия = ДеревоПартии.Добавить();
						ДеревоНоваяСтрокаПартия.Единица = ВыборкаПартии.Партия;
						
						Остаток = "" + ВыборкаПартии.Остаток;
						Резерв = "";
						Если ЗначениеЗаполнено(ВыборкаПартии.Резерв) Тогда
							Резерв = " / " + ВыборкаПартии.Резерв;
						КонецЕсли;
						
						ДеревоНоваяСтрокаПартия.Остаток = Остаток + Резерв;
						ДеревоНоваяСтрокаПартия.ОстатокВсего = ВыборкаПартии.Остаток + ВыборкаПартии.Резерв;
						ДеревоНоваяСтрокаПартия.ОстатокВРезерве = ВыборкаПартии.Резерв;
						ДеревоНоваяСтрокаПартия.ОстатокСвободно = ВыборкаПартии.Остаток;
						ДеревоНоваяСтрокаПартия.ЭтоПартия = Истина;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
&Вместо("СформироватьЗаголовокДереваОстатков")
Процедура спСформироватьЗаголовокДереваОстатков()
	
	ХарактеристикиНоменклатуры = Объект.ИспользоватьХарактеристики;
	ПартииНоменклатуры = Объект.ИспользоватьПартии;
	
	Если ХарактеристикиНоменклатуры И Не ПартииНоменклатуры Тогда
		
		Элементы.ОстаткиЕдиница.Заголовок = НСтр("ru='Характеристика/Склад/Ячейка'");
		
	ИначеЕсли ХарактеристикиНоменклатуры И ПартииНоменклатуры Тогда
		
		Элементы.ОстаткиЕдиница.Заголовок = НСтр("ru='Характеристика/Склад/Ячейка/Партия'");
		
	ИначеЕсли Не ХарактеристикиНоменклатуры И ПартииНоменклатуры Тогда
		
		Элементы.ОстаткиЕдиница.Заголовок = НСтр("ru='Склад/Ячейка/Партия'");
		
	Иначе
		
		Элементы.ОстаткиЕдиница.Заголовок = НСтр("ru='Склад/Ячейка'");
		
	КонецЕсли;
	
КонецПроцедуры

//--->>> Tnext Козык К.А. 18.06.2026

#КонецОбласти
