
#Область ОписаниеПеременных

&НаКлиенте
Перем ТоварыКорзины; // массив ссылок товаров отобранных в корзину 

&НаКлиенте
Перем ФормаКарточкиТовара; // используется для хранения формы открытой карточки товара

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Полнотекстовый поиск
	ИспользоватьПолнотекстовыйПоиск = Константы.ИспользоватьПолнотекстовыйПоиск.Получить()
									И ПолнотекстовыйПоиск.ПолучитьРежимПолнотекстовогоПоиска() = РежимПолнотекстовогоПоиска.Разрешить;
									
	ИнформационнаяБазаФайловая = ОбщегоНазначения.ИнформационнаяБазаФайловая();
	
	Если ИспользоватьПолнотекстовыйПоиск Тогда
		
		ИндексПолнотекстовогоПоискаАктуален = ПолнотекстовыйПоиск.ИндексАктуален();
		Если НЕ ИндексПолнотекстовогоПоискаАктуален Тогда
			// Считаем актуальным индекс в пределах дня, так как для более частых обновлений можно настроить регламентное
			// задание.
			ИндексПолнотекстовогоПоискаАктуален = НачалоДня(ПолнотекстовыйПоиск.ДатаАктуальности()) = НачалоДня(ТекущаяДатаСеанса());
		КонецЕсли;
		
	КонецЕсли;								
	
	ИнициализацияФормыНаСервере();
	
	ВосстановитьНастройкиСпискаНаСервере();
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ТипыОборудования.СканерШтрихкода = Истина;
		МенеджерОборудования.ПриСозданииНаСервере(ЭтотОбъект, ТипыОборудования);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИнициализацияФормыНаКлиенте();
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.Страницы.ТекущаяСтраница <> Элементы.Номенклатура Тогда
		
		СтандартнаяОбработка = Ложь; 
		Отказ = Истина;
		ВернутьсяНаГлавную();
		Возврат;
		
	КонецЕсли;
	
	СохранитьНастройкиСписка();
	СохранитьНастройкиАРМов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда  
			
			Если ТипЗнч(Параметр) <> Тип("Массив") Тогда
				Параметр = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметр);
			КонецЕсли;
			
			Данные = МенеджерОборудованияУНФКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			ПолученШтрихкод(Данные); 
			
		КонецЕсли;  
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтрокаРасширенногоПоискаПриИзменении(Элемент)
	
	Если ПустаяСтрока(СтрокаРасширенногоПоиска) Тогда
		
		ОтключитьОтборыСписка();
		
	КонецЕсли;
	
	ПрименитьПоиск();
	ДобавитьВИсториюПоиска();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьКорзинаНажатие(Элемент)

	ОткрытьКорзину();

КонецПроцедуры

&НаКлиенте
Процедура ПереопределяемыйЭлементПриИзменении(Элемент)
	
    ИзменитьПрограммныйЭлементНаФорме(Элемент.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗалПриИзменении(Элемент)
	
	СохранитьНастройкиАРМов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

&НаКлиенте
Процедура СписокЗапасыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.СписокЗапасы.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьВыборДействияАсинх(Поле, ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыполнитьВыборДействияАсинх(Поле, ДанныеСтроки)

	#Если МобильныйКлиент Тогда
		
		Кнопки = Новый СписокЗначений;
		Кнопки.Добавить("ОткрытьКарточку", "Открыть карточку");
		Кнопки.Добавить("ДобавитьВКорзину", "Добавить в корзину");
		Кнопки.Добавить("УдалитьИзКорзины", "Удалить из корзины");
		Кнопки.Добавить("ПосмотретьДругиеРазмеры", "Посмотреть другие размеры");
		Кнопки.Добавить("Отмена", "Отмена");
		
		Ответ = Ждать ВопросАсинх("Выберите действие", Кнопки);
		
		Если Ответ = "ОткрытьКарточку" Тогда
			ОткрытьКарточкуТовара(ДанныеСтроки.Ссылка);
		ИначеЕсли Ответ = "ДобавитьВКорзину" Тогда
			ДобавитьТоварВКорзину(ДанныеСтроки);
			ПараметрыСписка = Новый Структура("ТоварыКорзины", ТоварыКорзины);
			УстановитьСвойстваСписка(ПараметрыСписка); 
		ИначеЕсли Ответ = "УдалитьИзКорзины" Тогда
			УдалитьТоварИзКорзины(ДанныеСтроки);
			ПараметрыСписка = Новый Структура("ТоварыКорзины", ТоварыКорзины);
			УстановитьСвойстваСписка(ПараметрыСписка);
		ИначеЕсли Ответ = "ПосмотретьДругиеРазмеры" Тогда
			ДобавитьВыбранныйТовар(ДанныеСтроки);
			ПараметрыСписка = Новый Структура("Номенклатура, спАртикулПоставщика", ДанныеСтроки.Ссылка, ЗначениеРеквизитаНаСервере(ДанныеСтроки.Ссылка, "спАртикулПоставщика"));
			УстановитьСвойстваСписка(ПараметрыСписка);
		Иначе
			Возврат;
		КонецЕсли;

	#Иначе 
		
		Если Поле.Имя = "Добавить" Тогда
			
			ДобавитьТоварВКорзину(ДанныеСтроки);
			
			ПараметрыСписка = Новый Структура("ТоварыКорзины", ТоварыКорзины);
			УстановитьСвойстваСписка(ПараметрыСписка);
			
		ИначеЕсли Поле.Имя = "Удалить" Тогда
			
			УдалитьТоварИзКорзины(ДанныеСтроки);
			
			ПараметрыСписка = Новый Структура("ТоварыКорзины", ТоварыКорзины);
			УстановитьСвойстваСписка(ПараметрыСписка);
			
		Иначе
			
			ОткрытьКарточкуТовара(ДанныеСтроки.Ссылка);
			
		КонецЕсли; 
		
	#КонецЕсли

	УправлениеСвойствамиЭлементовФормы();

КонецПроцедуры

&НаКлиенте
Процедура ДобавитьВыбранныйТовар(ДанныеСтроки)
	
	ДанныеВыбраннойНоменклатуры.Очистить();
	
	НоваяСтрока = ДанныеВыбраннойНоменклатуры.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеСтроки);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеВыбраннойНоменклатуры

&НаКлиенте
Процедура ДанныеВыбраннойНоменклатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущаяСтрока = Элементы.ДанныеВыбраннойНоменклатуры.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыполнитьВыборДействияВыбраннойНоменклатурыАсинх(Поле, ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ВыполнитьВыборДействияВыбраннойНоменклатурыАсинх(Поле, ДанныеСтроки)

	Кнопки = Новый СписокЗначений;
	Кнопки.Добавить("ОткрытьКарточку", "Открыть карточку");
	Кнопки.Добавить("ОтменитьВыбраннуюНоменклатуру", "Очистить выбранный товар");
	Кнопки.Добавить("Отмена", "Отмена");
	
	Ответ = Ждать ВопросАсинх("Выберите действие", Кнопки);
	
	Если Ответ = "ОткрытьКарточку" Тогда
		ОткрытьКарточкуТовара(ДанныеСтроки.Ссылка);
	ИначеЕсли Ответ = "ОтменитьВыбраннуюНоменклатуру" Тогда
		
		ТекСтрока = ДанныеСтроки.ПолучитьИдентификатор();
		УдаляемаяСтрока = ДанныеВыбраннойНоменклатуры.НайтиПоИдентификатору(ТекСтрока);
		ДанныеВыбраннойНоменклатуры.Удалить(УдаляемаяСтрока);
		
		ПараметрыСписка = Новый Структура("Номенклатура, спАртикулПоставщика", Неопределено, Неопределено);
		УстановитьСвойстваСписка(ПараметрыСписка);
		
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДанныеВыбраннойНоменклатурыПередУдалением(Элемент, Отказ)
	
	ПараметрыСписка = Новый Структура("Номенклатура, спАртикулПоставщика", Неопределено, Неопределено);
	УстановитьСвойстваСписка(ПараметрыСписка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКорзина

&НаКлиенте
Процедура КорзинаТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "КорзинаУдалить" Тогда
		
		СтандартнаяОбработка = Ложь;
	
		ТекущаяСтрока = Элементы.КорзинаТаблица.ТекущиеДанные;
		
		Если ТекущаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Идентификатор = ТекущаяСтрока.ПолучитьИдентификатор();
		УдаляемаяСтрока = Корзина.НайтиПоИдентификатору(Идентификатор);
		Корзина.Удалить(УдаляемаяСтрока);
		
		Индекс = ТоварыКорзины.Найти(ТекущаяСтрока.Ссылка);
		
		Если Индекс <> Неопределено Тогда
			ТоварыКорзины.Удалить(Индекс);
		КонецЕсли;    
		
		ПараметрыСписка = Новый Структура("ТоварыКорзины", ТоварыКорзины);
		УстановитьСвойстваСписка(ПараметрыСписка);
		
		УправлениеСвойствамиЭлементовФормы();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаТаблицаПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элементы.КорзинаТаблица.ТекущиеДанные;
	
	Индекс = ТоварыКорзины.Найти(ТекущаяСтрока.Ссылка);
	
	Если Индекс <> Неопределено Тогда
		ТоварыКорзины.Удалить(Индекс);
	КонецЕсли;    
	
	ПараметрыСписка = Новый Структура("ТоварыКорзины", ТоварыКорзины);
	УстановитьСвойстваСписка(ПараметрыСписка);
	
КонецПроцедуры

&НаКлиенте
Процедура КорзинаТаблицаПослеУдаления(Элемент)
	
	УправлениеСвойствамиЭлементовФормы();
	
КонецПроцедуры
             
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Настройки(Команда)
	
	ОчиститьСообщения();
	ОткрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьКорзину(Команда)
	
	ОчиститьСообщения();
	ВернутьсяНаГлавную();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКорзину(Команда)
	
	ОчиститьСообщения();
	ВыполнитьОчисткуКорзины();
	 
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДокумент(Команда)
	
	ОчиститьСообщения();
	Заказ = СформироватьДокументНаСервере();
	
	Если ЗначениеЗаполнено(Заказ) Тогда
		ВыполнитьОчисткуКорзины();
		ВернутьсяНаГлавную();              
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьСтрокуПоиска(Команда)            
	ОчиститьСообщения();
	ТекущийЭлемент = Элементы.СтрокаРасширенногоПоиска;
КонецПроцедуры

// Процедура - обработчик команды командной панели табличной части.
&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ОчиститьСообщения();
	ТекШтрихкод = "";
	
	ОбработкаЗавершения = Новый ОписаниеОповещения(
		"ПоискПоШтрихкодуЗавершение",
		ЭтотОбъект, 
		Новый Структура("ТекШтрихкод", ТекШтрихкод));

	#Если МобильныйКлиент Тогда
	ОткрытьФорму("ОбщаяФорма.ФормаПоискаПоШтрихкоду", , , , , , ОбработкаЗавершения);
	#Иначе
	ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияЗаказов(Команда)
	
	ТабличныйДокументИсторииЗаказов = Новый ТабличныйДокумент;
	
	ТабличныйДокументИсторииЗаказов.ОтображатьЗаголовки = Ложь;
	
	ИсторияЗаказовНаСервере(ТабличныйДокументИсторииЗаказов);
	
	ТабличныйДокументИсторииЗаказов.Показать(НСтр("ru = 'История заказов'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаНаСервере(Ссылка, ИмяРеквизита)

	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита);

КонецФункции

&НаСервереБезКонтекста
Функция ИдентификаторВПредставление(Иденитфикатор)
	
	ДлинаИдентификатора = СтрДлина(Иденитфикатор);
	
	МассивСимволов = Новый Массив;
	
	СимволКДобавлению = "";
	
	Для НомерСимвола = 1 По ДлинаИдентификатора Цикл
		
		Символ = Сред(Иденитфикатор, НомерСимвола, 1);
		
		Если СимволКДобавлению = " " Тогда
			
			СимволКДобавлению = ВРег(Символ);
			
		ИначеЕсли Символ = "_" Тогда
			
			СимволКДобавлению = " ";
			
		ИначеЕсли СимволКДобавлению = "" Тогда
			
			СимволКДобавлению = Символ;
			
		ИначеЕсли ВРег(Символ) = Символ Тогда
			
			МассивСимволов.Добавить(" ");
		    СимволКДобавлению = НРег(Символ);
			
		Иначе
			
			СимволКДобавлению = Символ;
			
		КонецЕсли;
		
		МассивСимволов.Добавить(СимволКДобавлению);
		
	КонецЦикла;
	
	Представление = СтрСоединить(МассивСимволов);
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти

#Область ОбщиеПроцедурыИФункции

&НаКлиенте
Процедура ВернутьсяНаГлавную()

	Элементы.Страницы.ТекущаяСтраница = Элементы.Номенклатура;
	
	УстановитьСвойстваСпискаСКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализацияФормыНаКлиенте()
	
	НачатьВыводРеквизитовФормыНоменклатуры();
	
	// Инициализация сохраненной корзины
	ТоварыКорзины = Новый Массив;
	
	Для каждого СтрокаКорзины Из Корзина Цикл
		
		ТоварыКорзины.Добавить(СтрокаКорзины.Ссылка);
		
	КонецЦикла;
	
	УстановитьСвойстваСпискаСКлиента();
	
	// Установка свойств элементов формы
	УправлениеСвойствамиЭлементовФормы();
	
	// Восстановление значений настроек
	ВосстановитьНастройкиСКлиента();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСвойстваСпискаСКлиента()

	// Установка параметров списка на клиенте
	ПараметрыСписка = Новый Структура;
	ПараметрыСписка.Вставить("ТоварыКорзины", ТоварыКорзины);
	ПараметрыСписка.Вставить("Зал", Зал);
	ПараметрыСписка.Вставить("Кладовая", Кладовая);
	ПараметрыСписка.Вставить("СкладыИсточники", ГруппаСкладовИсточников);
	
	УстановитьСвойстваСписка(ПараметрыСписка);

КонецПроцедуры

&НаСервере
Процедура ИнициализацияФормыНаСервере()
	
	// установка параметров списка на сервере
	ПараметрыСписка = Новый Структура;
	ПараметрыСписка.Вставить("ВидЦенПродажи", Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи());
	ПараметрыСписка.Вставить("Зал", Зал);
	ПараметрыСписка.Вставить("Кладовая", Кладовая);
	ПараметрыСписка.Вставить("Номенклатура", Неопределено);
	ПараметрыСписка.Вставить("Организация", Справочники.Организации.ОрганизацияПоУмолчанию());
	ПараметрыСписка.Вставить("ТоварыКорзины", Новый Массив);
	
	УстановитьСвойстваСписка(ПараметрыСписка);
	
	// установка списка выбора для документа корзины    
	ВидыДокументовКорзины = Новый Массив;
	ВидыДокументовКорзины.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.ЗаказНаПеремещение"));
	ВидыДокументовКорзины.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ.ЗаказПокупателя"));
	
	Элементы.ДокументКорзиныПоУмолчанию.СписокВыбора.ЗагрузитьЗначения(ВидыДокументовКорзины);
	
	// установка условного оформления формы
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСвойстваСписка(ПараметрыСписка)
	
	Номенклтатура = Неопределено;
	АртикулПоставщика = Неопределено;
	
	Для каждого ПараметрСписка Из ПараметрыСписка Цикл
		
		ИмяПоля = ПараметрСписка.Ключ;
		Значение = ПараметрСписка.Значение;
			
		Если ИмяПоля = "Номенклатура" Или ИмяПоля = "спАртикулПоставщика" Тогда
			
			Если ИмяПоля = "Номенклатура" Тогда
				
				Номенклатура = Значение;
				Отображение = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
				
			ИначеЕсли ИмяПоля = "спАртикулПоставщика" Тогда
				
				АртикулПоставщика = Значение;
				Отображение = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ;
				
			Иначе 
				
				Продолжить;	
				
			КонецЕсли;
			
			Если ТипЗнч(Значение) = Тип("Массив") Тогда
				ТипСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
			Иначе
				ТипСравнения = ВидСравненияКомпоновкиДанных.Равно;
			КонецЕсли;

			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗапасы, ИмяПоля, Значение,
			ТипСравнения,, ЗначениеЗаполнено(Значение), Отображение);
		
		Иначе
			ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(СписокЗапасы, ИмяПоля, Значение, Истина);
		КонецЕсли;
	
	КонецЦикла;
	
	Если ЗначениеЗаполнено(АртикулПоставщика) Тогда
		
        ИспользуемоеПоле = "спАртикулПоставщика";
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокЗапасы, "Номенклатура");
		
	ИначеЕсли ПараметрыСписка.Свойство("Номенклатура") И ЗначениеЗаполнено(Номенклатура) Тогда
		
		ИспользуемоеПоле = "Номенклатура";
		
	Иначе
		
		ИспользуемоеПоле = "";
		
	КонецЕсли;
	
	Если ТипЗнч(Номенклатура) = Тип("Массив") И Номенклатура.Количество() > 0 Тогда
		
		 НоменклатураДляОтбора = Номенклатура[0];
		 
	ИначеЕсли ТипЗнч(Номенклатура) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		НоменклатураДляОтбора = Номенклатура;
		
	Иначе
		
		НоменклатураДляОтбора = Справочники.Номенклатура.ПустаяСсылка();
		
	КонецЕсли;
	
	ОтключитьОтборыСписка(НоменклатураДляОтбора, ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ИспользуемоеПоле));
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеТовара(Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.*,
		|	НоменклатураДополнительныеРеквизиты.Значение КАК Бренд
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО Номенклатура.Ссылка = НоменклатураДополнительныеРеквизиты.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты.Свойство.Имя = ""Свойство_Бренд"")
		|ГДЕ
		|	Номенклатура.Ссылка В (&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура УправлениеСвойствамиЭлементовФормы()
	
	// Установка заголовка корзины
	КоличествоСтрок = Корзина.Количество();
	ОбщееКоличество = Корзина.Итог("Количество"); 
	
	Если КоличествоСтрок = 0 Тогда     
		ЗаголовокКорзины = НСтр("ru = '(0)'");
	Иначе
		ШаблонЗаголовкаКорзины = НСтр("ru = '(%1)'");
		ЗаголовокКорзины = СтрШаблон(ШаблонЗаголовкаКорзины, ОбщееКоличество);
	КонецЕсли;
	
	Элементы.НадписьКорзина.Заголовок = ЗаголовокКорзины;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ЭлементОформления = УсловноеОформление.Элементы.Добавить();
	
	ОформляемыеПоля = ЭлементОформления.Поля.Элементы.Добавить();
	ОформляемыеПоля.Поле = Новый ПолеКомпоновкиДанных(Элементы.СписокЗапасы.Имя);
	
	ОтборЭлемента = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("СписокЗапасы.ЕстьВКорзине");
	ОтборЭлемента.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение	= Истина;
	
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Бирюзовый);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПрограммныеЭлементыНаФорме()

	РеквизитыФормы = ПолучитьРеквизиты();
	
	Для каждого Реквизит Из РеквизитыФормы Цикл
		
		ИмяРеквизита = Реквизит.Имя;
		
		ИзменитьПрограммныйЭлементНаФорме(ИмяРеквизита);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПрограммныйЭлементНаФорме(ИмяЭлемента, ЗначениеПоля = Неопределено)
	
	Добавить = ЭтотОбъект[ИмяЭлемента];
	
	Если СтрНачинаетсяС(ИмяЭлемента, "ТЧ_") Тогда
		
		Родители = СтрРазделить("СписокЗапасыРеквизитыТовара, КорзинаРеквизитыТовара, ДанныеВыбраннойНоменклатурыРеквизитыТовара", ", ", Ложь); 
		
		Для каждого ИмяРодителя Из Родители Цикл
			
			Префикс = СтрЗаменить(ИмяРодителя, "РеквизитыТовара", "");
			
			ИмяПоля = СтрЗаменить(ИмяЭлемента, "ТЧ_", "");
			
			ИмяПоляФормы = Префикс + ИмяПоля;
			
			Если ИмяПоляФормы = "КорзинаБренд" Или ИмяПоляФормы = "ДанныеВыбраннойНоменклатурыБренд" Тогда
				Продолжить;
			КонецЕсли;
			
			ЭлементНаФорме = Элементы.Найти(ИмяПоляФормы);
			
			ЕстьЭлемент = ЭлементНаФорме <> Неопределено;
			
			НайденнаяСтрока = РеквизитыКВыводуВСписке.НайтиПоЗначению(ИмяПоля);
		
			Если Добавить И Не ЕстьЭлемент Тогда
				
				Родитель = Элементы.Найти(ИмяРодителя);
				
				ЭлементНаФорме = Элементы.Добавить(ИмяПоляФормы, Тип("ПолеФормы"), Родитель);
				ЭлементНаФорме.Вид = ВидПоляФормы.ПолеВвода;
				
				Если ИмяРодителя = "КорзинаРеквизитыТовара" Или ИмяРодителя = "ДанныеВыбраннойНоменклатурыРеквизитыТовара" Тогда
					
					ЭлементНаФорме.ПутьКДанным = СтрШаблон("%1.%2.%3", Префикс, "Ссылка", ИмяПоля);  
					
				Иначе
					
					ЭлементНаФорме.ПутьКДанным = СтрШаблон("%1.%2", Префикс, ИмяПоля);  
					
				КонецЕсли;
				
				Если НайденнаяСтрока = Неопределено Тогда
					
					РеквизитыКВыводуВСписке.Добавить(ИмяПоля);
					
				КонецЕсли;
		
			ИначеЕсли Не Добавить И ЕстьЭлемент Тогда
				
				Элементы.Удалить(ЭлементНаФорме);
				
				Если НайденнаяСтрока <> Неопределено Тогда
					
					РеквизитыКВыводуВСписке.Удалить(НайденнаяСтрока);  
					
				КонецЕсли;
		
			КонецЕсли;
			
		КонецЦикла;
	
	ИначеЕсли СтрНачинаетсяС(ИмяЭлемента, "Карточка_") Тогда
		
		ИмяПоля = СтрЗаменить(ИмяЭлемента, "Карточка_", "");
		
		НайденнаяСтрока = РеквизитыКВыводуВКарточке.НайтиПоЗначению(ИмяПоля);
		
		Если Добавить И НайденнаяСтрока = Неопределено Тогда
			
			РеквизитыКВыводуВКарточке.Добавить(ИмяПоля);
			
		ИначеЕсли Не Добавить И НайденнаяСтрока <> Неопределено Тогда
			
			РеквизитыКВыводуВКарточке.Удалить(НайденнаяСтрока);
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
		
	ИначеЕсли СтрНачинаетсяС(ИмяЭлемента, "Отбор_") Тогда
		
		ИмяПоля = СтрЗаменить(ИмяЭлемента, "Отбор_", "");
		
		НайденнаяСтрока = РеквизитыКВыводуВОтборе.НайтиПоЗначению(ИмяПоля);
		
		ПараметрыВыбраннойНоменклатуры = Новый Структура("Номенклатура", НоменклатураДляОтбора);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗапасы, 
							ИмяПоля, ЗначениеПоля, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ЗначениеПоля), 
							РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, ИмяПоля);
			
		Если Добавить И НайденнаяСтрока = Неопределено Тогда
			
			РеквизитыКВыводуВОтборе.Добавить(ИмяПоля);
			
							
		ИначеЕсли Не Добавить И НайденнаяСтрока <> Неопределено Тогда
			
			РеквизитыКВыводуВОтборе.Удалить(НайденнаяСтрока);
			
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокЗапасы, ИмяПоля);
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
		
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПервыйЗапасИБ()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Номенклатура.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И НЕ Номенклатура.ЭтоГруппа
		|	И Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура НачатьВыводРеквизитовФормыНоменклатуры()
	
	МассивЭлементов = Новый СписокЗначений;
	
	ПараметрыФормы = Новый Структура("Ключ", ПервыйЗапасИБ());
	ФормаКарточкиТовара = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект);

	ФормаКарточкиТовара.Открыть();
	
	Для каждого ЭлементФормы Из ФормаКарточкиТовара.Элементы Цикл
		
		Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") Тогда
			
			ИмяЭлемента = ЭлементФормы.Имя;
			
			МассивЭлементов.Добавить(ИмяЭлемента);  
			
		КонецЕсли;
		
	КонецЦикла;
	
	ФормаКарточкиТовара.Закрыть();
	
	ВывестиРеквизитыНоменклатуры(МассивЭлементов);
	
КонецПроцедуры

&НаСервере
Процедура ВывестиРеквизитыНоменклатуры(МассивЭлементовФормы)
	
	МассивЭлементовОбъекта = Новый СписокЗначений;
	
	ДобавляемыеРеквизиты = Новый Массив;
	ТипБулево = Новый ОписаниеТипов("Булево");
	
	РеквизитыОбъекта = Метаданные.Справочники.Номенклатура.Реквизиты;
	РеквизитыФормы = ПолучитьРеквизиты();
	
	ДопРеквизиты = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура_Общие").ДополнительныеРеквизиты;
	
	ИндексДопРеквизита = 0;
	
	Для каждого Элемент Из МассивЭлементовФормы Цикл
		
		ПутьКДаннымБезОбъекта = Элемент.Значение;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РеквизитыОбъекта, ПутьКДаннымБезОбъекта) Тогда 
			
			РеквизитОбъекта = РеквизитыОбъекта.Найти(ПутьКДаннымБезОбъекта);
			Представление = РеквизитОбъекта.Синоним;
			
		ИначеЕсли СтрНачинаетсяС(ПутьКДаннымБезОбъекта, "ДополнительныйРеквизит") Тогда
			
			Представление = СтрШаблон("Дополнительный реквизит (%1)", Строка(ДопРеквизиты[ИндексДопРеквизита].Свойство)); 
			
			ИндексДопРеквизита = ИндексДопРеквизита + 1;
			
		Иначе
			
			Представление = ИдентификаторВПредставление(ПутьКДаннымБезОбъекта);
			
		КонецЕсли;
		
		ИмяРеквизита = СтрШаблон(НСтр("ru = 'Карточка_%1'"), ПутьКДаннымБезОбъекта);
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РеквизитыФормы, ИмяРеквизита) Тогда
			НовыйРеквизитФормы = Новый РеквизитФормы(ИмяРеквизита, ТипБулево,, Представление);
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);
		КонецЕсли;
		
		Элемент.Значение = ИмяРеквизита;
		Элемент.Представление = Представление;
		
	КонецЦикла;
	
	Для каждого Реквизит Из РеквизитыОбъекта Цикл
		
		// добавляем реквизиты для ТЧ
		ИмяРеквизита = СтрШаблон(НСтр("ru = 'ТЧ_%1'"), Реквизит.Имя);
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РеквизитыФормы, ИмяРеквизита) Тогда
			НовыйРеквизитФормы = Новый РеквизитФормы(ИмяРеквизита, ТипБулево,, Реквизит.Синоним);
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);
		КонецЕсли;
		
		МассивЭлементовОбъекта.Добавить(ИмяРеквизита, Реквизит.Синоним);
		
		// добавляем реквизиты для отборов
		ИмяРеквизита = СтрШаблон(НСтр("ru = 'Отбор_%1'"), Реквизит.Имя);
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РеквизитыФормы, ИмяРеквизита) Тогда
			НовыйРеквизитФормы = Новый РеквизитФормы(ИмяРеквизита, ТипБулево,, Реквизит.Синоним);
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);
		КонецЕсли;
		
		МассивЭлементовОбъекта.Добавить(ИмяРеквизита, Реквизит.Синоним);
		
	КонецЦикла;
	
	ДопРеквизитыСтрокой = "Бренд";
	ДополнительныеРеквизитыКОтбору = СтрРазделить(ДопРеквизитыСтрокой, ", ");
	
	Для каждого Реквизит Из ДополнительныеРеквизитыКОтбору Цикл
		
		// добавляем реквизиты для ТЧ
		ИмяРеквизита = СтрШаблон(НСтр("ru = 'ТЧ_%1'"), Реквизит);
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РеквизитыФормы, ИмяРеквизита) Тогда
			НовыйРеквизитФормы = Новый РеквизитФормы(ИмяРеквизита, ТипБулево,, Реквизит);
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);
		КонецЕсли;
		
		МассивЭлементовОбъекта.Добавить(ИмяРеквизита, Реквизит);
		
		// добавляем реквизиты для отборов
		ИмяРеквизита = СтрШаблон(НСтр("ru = 'Отбор_%1'"), Реквизит);
		Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(РеквизитыФормы, ИмяРеквизита) Тогда
			НовыйРеквизитФормы = Новый РеквизитФормы(ИмяРеквизита, ТипБулево,, Реквизит);
			ДобавляемыеРеквизиты.Добавить(НовыйРеквизитФормы);
		КонецЕсли;
		
		МассивЭлементовОбъекта.Добавить(ИмяРеквизита, Реквизит);
		
	КонецЦикла;
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	МассивЭлементовФормы.СортироватьПоПредставлению();
	
	РеквизитыНоменклатурыДляВыводаВТЧ 		= Элементы.Найти("РеквизитыНоменклатурыДляВыводаВТЧ");
	РеквизитыНоменклатурыДляВыводаВОтборе 	= Элементы.Найти("РеквизитыНоменклатурыДляВыводаВОтборе");
	РеквизитыНоменклатурыДляВыводаВКарточке = Элементы.Найти("РеквизитыНоменклатурыДляВыводаВКарточке");
	
	Для каждого ДобавленныйРеквизит Из МассивЭлементовФормы Цикл
		
		ИмяРеквизита = ДобавленныйРеквизит.Значение;
		НовыйЭлемент = Элементы.Найти(ИмяРеквизита);
		Если НовыйЭлемент = Неопределено Тогда
			НовыйЭлемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), РеквизитыНоменклатурыДляВыводаВКарточке);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = ИмяРеквизита;
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПереопределяемыйЭлементПриИзменении");
		КонецЕсли;
	
	КонецЦикла;
	
	МассивЭлементовОбъекта.СортироватьПоПредставлению();
	
	Для каждого ДобавленныйРеквизит Из МассивЭлементовОбъекта Цикл
		
		ИмяРеквизита = ДобавленныйРеквизит.Значение;
		
		Если СтрНачинаетсяС(ИмяРеквизита, "ТЧ_") Тогда
			
			Родитель = РеквизитыНоменклатурыДляВыводаВТЧ;
			 
		ИначеЕсли СтрНачинаетсяС(ИмяРеквизита, "Отбор_") Тогда
			
			Родитель = РеквизитыНоменклатурыДляВыводаВОтборе;
			
		Иначе
			
			Продолжить;
			
		КонецЕсли;
		
		НовыйЭлемент = Элементы.Найти(ИмяРеквизита);
		Если НовыйЭлемент = Неопределено Тогда
			НовыйЭлемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Родитель);
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
			НовыйЭлемент.ПутьКДанным = ИмяРеквизита;
			НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПереопределяемыйЭлементПриИзменении");
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьОтборыСписка(Номенклатура = Неопределено, ИсключаемыеПоля = Неопределено)
	
	Если ИсключаемыеПоля = Неопределено Тогда
		ИсключаемыеПоля = Новый Массив;
	КонецЕсли;
	
	ДанныеТовара = ДанныеТовара(Номенклатура);
	
	Для каждого ЭлементНастройки Из СписокЗапасы.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		
		Если ТипЗнч(ЭлементНастройки) = Тип("ЭлементОтбораКомпоновкиДанных") Тогда
			
			ИмяПоля = ЭлементНастройки.ИдентификаторПользовательскойНастройки;
			
			ЭлементНастройки.Использование = ИсключаемыеПоля.Найти(ИмяПоля) <> Неопределено;
			
			Если Не ДанныеТовара = Неопределено Тогда
				ЭлементНастройки.ПравоеЗначение	= ДанныеТовара[ИмяПоля];  
			КонецЕсли
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуТовара(Номенклатура)

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", Номенклатура);       
	ПараметрыФормы.Вставить("НомерВерсииПереходаНаВерсиюИсторииДанных", РеквизитыКВыводуВКарточке);
	
	ФормаКарточкиТовара = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы, ЭтотОбъект);
	
	ФормаКарточкиТовара.Открыть();
	
	ПодключитьОбработчикОжидания("ПеречитатьФормуКарточки", 0.1, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуКарточки()
	
	Если ФормаКарточкиТовара = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФормаКарточкиТовара.Закрыть();
	
	ФормаКарточкиТовара = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьФормуКарточки()
	
	Если ФормаКарточкиТовара = Неопределено Тогда
		Возврат;
	КонецЕсли;        
	         
	ФормаКарточкиТовара.Прочитать();
	
	ФормаКарточкиТовара = Неопределено;
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСКорзиной

&НаКлиенте
Процедура ОткрытьКорзину()
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Корзина;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьТоварИзКорзины(Строка)
	
	НайденныеСтроки = Корзина.НайтиСтроки(Новый Структура("Ссылка", Строка.Ссылка));
	
	Если НайденныеСтроки.Количество() > 0 Тогда
		СтрокаКорзины = НайденныеСтроки[0];
		СтрокаКорзины.Количество = СтрокаКорзины.Количество - 1;
		Количество = СтрокаКорзины.Количество;
	Иначе
		Количество = 0;
	КонецЕсли;
	
	Если Количество = 0 Тогда
			
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			
			Корзина.Удалить(НайденнаяСтрока);
			
		КонецЦикла;
		
		Индекс = ТоварыКорзины.Найти(Строка.Ссылка);
	
		Если Индекс <> Неопределено Тогда
			ТоварыКорзины.Удалить(Индекс);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьТоварВКорзину(Строка)
	
	Если ТоварыКорзины.Найти(Строка.Ссылка) = Неопределено Тогда
		
		ТоварыКорзины.Добавить(Строка.Ссылка); 
	КонецЕсли;
	
	НайденныеСтроки = Корзина.НайтиСтроки(Новый Структура("Ссылка", Строка.Ссылка));
	
	Если НайденныеСтроки.Количество() = 0 Тогда
		СтрокаКорзины = Корзина.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаКорзины, Строка);
		СтрокаКорзины.Количество = 1; 
		СтрокаКорзины.Удалить = Истина;
	Иначе
		СтрокаКорзины = НайденныеСтроки[0];
		СтрокаКорзины.Количество = СтрокаКорзины.Количество + 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОчисткуКорзины()
	
	ТоварыКорзины = Новый Массив;
	
	Корзина.Очистить();
	Комментарий = "";
	
	ПараметрыСписка = Новый Структура("ТоварыКорзины", ТоварыКорзины);
	УстановитьСвойстваСписка(ПараметрыСписка);
	
	УправлениеСвойствамиЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиАРМ

&НаКлиенте
Процедура ОткрытьНастройки()
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Настройки;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСписка()
	
	Настройки = СписокЗапасы.КомпоновщикНастроек.ПолучитьНастройки();
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(ИмяФормы, "ФиксированныеНастройки", Настройки,, ИмяПользователя());
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиСКлиента()
	
	Для каждого ЭлементСписка Из РеквизитыКВыводуВКарточке Цикл
		
		Префикс = "Карточка_"; 
		ИмяНастройки = Префикс + ЭлементСписка.Значение;
		
		ЭтотОбъект[ИмяНастройки] = Истина;
		
	КонецЦикла;
	
	Для каждого ЭлементСписка Из РеквизитыКВыводуВОтборе Цикл
		
		Префикс = "Отбор_"; 
		ИмяНастройки = Префикс + ЭлементСписка.Значение;
		
		ЭтотОбъект[ИмяНастройки] = Истина;
		
	КонецЦикла;
	
	Для каждого ЭлементСписка Из РеквизитыКВыводуВСписке Цикл
		
		Префикс = "ТЧ_"; 
		ИмяНастройки = Префикс + ЭлементСписка.Значение;
		
		ЭтотОбъект[ИмяНастройки] = Истина;
		
		ИзменитьПрограммныйЭлементНаФорме(ИмяНастройки);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьНастройкиСпискаНаСервере()
	
	Настройки = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(ИмяФормы, "ФиксированныеНастройки", Новый НастройкиКомпоновкиДанных,, ИмяПользователя());
	Отборы = Настройки.Отбор.Элементы;
	
	Для каждого ЭлементОтбора Из Отборы Цикл
		
		ИмяПоля 		= Строка(Элементотбора.ЛевоеЗначение);
		ЗначениеПоля 	= ЭлементОтбора.ПравоеЗначение;
		
		Если ИмяПоля = "Номенклатура" Тогда
			Продолжить;
		КонецЕсли;
		
		Если ИмяПоля = "спАртикулПоставщика" Тогда
			Использование = Ложь;
		Иначе
			Использование = ЗначениеЗаполнено(ЗначениеПоля);
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(СписокЗапасы, ИмяПоля,
					ЗначениеПоля, ВидСравненияКомпоновкиДанных.Равно,, Использование, 
					РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ, ИмяПоля);
			
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиАРМов()
	
	Ключ  = "ОбщиеНастройкиАРМов";
	
	Настройки = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(Ключ, Ключ, Новый Структура,, ИмяПользователя());
	
	Настройки.Вставить("Зал", Зал);
	Настройки.Вставить("Кладовая", Кладовая);
	Настройки.Вставить("РеквизитыКВыводуВСписке", РеквизитыКВыводуВСписке);
	
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(Ключ, Ключ, Настройки,, ИмяПользователя());
      
КонецПроцедуры

#КонецОбласти

#Область РаботаСПоиском

&НаКлиенте
Процедура ПрименитьПоиск()
	
	Если НастройкиПоискаКакИскать = 0 Тогда
		
		ВыполнитьПолнотекстовыйПоискНаКлиенте();
		
	Иначе
		
		ПоискПоПодстроке();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоискПоПодстроке()
	
	Если НЕ НастройкиПоискаКакИскать = 1 Тогда 
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(СтрокаРасширенногоПоиска) Тогда
		
		ПодборПоискНеУдачный = Ложь;
		
		ПараметрыСписка = Новый Структура("Номенклатура, спАртикулПоставщика", Неопределено, Неопределено);
		УстановитьСвойстваСписка(ПараметрыСписка);
		
		Возврат;
		
	КонецЕсли;
	
	РезультатПоиска = РезультатПоискаПоПодстроке(СтрокаРасширенногоПоиска);
	
	ПараметрыСписка = Новый Структура("Номенклатура", РезультатПоиска);
	УстановитьСвойстваСписка(ПараметрыСписка);
		
КонецПроцедуры

&НаСервере
Функция РезультатПоискаПоПодстроке(СтрокаРасширенногоПоиска)
	
	МассивНоменклатуры = Новый Массив;
	
	// АПК:96 -выкл результат должен содержать уникальные значения
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СтрокаПоиска", "%" + СтрокаРасширенногоПоиска + "%");
	Запрос.УстановитьПараметр("МассивНоменклатуры", МассивНоменклатуры);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК НоменклатураСсылка
	|ПОМЕСТИТЬ Результат
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.Наименование ПОДОБНО &СтрокаПоиска
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.НаименованиеПолное ПОДОБНО &СтрокаПоиска
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.Артикул ПОДОБНО &СтрокаПоиска
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.Комментарий ПОДОБНО &СтрокаПоиска
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|ГДЕ
	|	СпрНоменклатура.ЦеноваяГруппа.Наименование ПОДОБНО &СтрокаПоиска
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	Результат.НоменклатураСсылка КАК Номенклатура
	|ИЗ
	|	Результат КАК Результат";
	
	// АПК:96 -вкл
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивНоменклатуры.Добавить(Выборка.Номенклатура);
	КонецЦикла;
	
	Если ПоискВШтрихКодах Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	НЕ ШтрихкодыНоменклатуры.Номенклатура В (&МассивНоменклатуры)
		|	И ШтрихкодыНоменклатуры.Штрихкод ПОДОБНО ""%"" + &СтрокаПоиска + ""%""";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивНоменклатуры.Добавить(Выборка.Номенклатура);
		КонецЦикла;
	КонецЕсли;
	
	Если ПоискВХарактеристиках Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ХарактеристикиНоменклатуры.Владелец КАК Номенклатура
		|ПОМЕСТИТЬ ВтНоменклатура
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	(ХарактеристикиНоменклатуры.Наименование ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|			ИЛИ ХарактеристикиНоменклатуры.НаименованиеДляПечати ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|			ИЛИ ХарактеристикиНоменклатуры.Артикул ПОДОБНО ""%"" + &СтрокаПоиска + ""%"")
		|	И НЕ ХарактеристикиНоменклатуры.Владелец В (&МассивНоменклатуры)
		|	И ТИПЗНАЧЕНИЯ(ХарактеристикиНоменклатуры.Владелец) = ТИП(Справочник.Номенклатура)
		|	И ХарактеристикиНоменклатуры.Владелец.ИспользоватьХарактеристики
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Номенклатура.Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО ХарактеристикиНоменклатуры.Владелец = Номенклатура.КатегорияНоменклатуры
		|ГДЕ
		|	(ХарактеристикиНоменклатуры.Наименование ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|			ИЛИ ХарактеристикиНоменклатуры.НаименованиеДляПечати ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|			ИЛИ ХарактеристикиНоменклатуры.Артикул ПОДОБНО ""%"" + &СтрокаПоиска + ""%"")
		|	И НЕ Номенклатура.Ссылка В (&МассивНоменклатуры)
		|	И ТИПЗНАЧЕНИЯ(ХарактеристикиНоменклатуры.Владелец) = ТИП(Справочник.КатегорииНоменклатуры)
		|	И Номенклатура.ИспользоватьХарактеристики
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВтНоменклатура.Номенклатура КАК Номенклатура
		|ИЗ
		|	ВтНоменклатура КАК ВтНоменклатура";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивНоменклатуры.Добавить(Выборка.Номенклатура);
		КонецЦикла;
	КонецЕсли;
	
	Если ПоискВДопСведениях Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДополнительныеСведения.Объект КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ДополнительныеСведения КАК ДополнительныеСведения
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(ДополнительныеСведения.Объект) = ТИП(Справочник.Номенклатура)
		|	И НЕ ДополнительныеСведения.Объект В (&МассивНоменклатуры)
		|	И ВЫБОР
		|			КОГДА ДополнительныеСведения.Значение.Наименование ЕСТЬ NULL
		|				ТОГДА ВЫРАЗИТЬ(ДополнительныеСведения.Значение КАК СТРОКА(150)) ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|			ИНАЧЕ ДополнительныеСведения.Значение.Наименование ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|		КОНЕЦ";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивНоменклатуры.Добавить(Выборка.Номенклатура);
		КонецЦикла;
	КонецЕсли;
	
	Если ПоискВДопРеквизитахИСведениях Тогда
		Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|ГДЕ
		|	НоменклатураДополнительныеРеквизиты.Значение.Наименование ПОДОБНО ""%"" + &СтрокаПоиска + ""%""
		|	И НЕ НоменклатураДополнительныеРеквизиты.Ссылка В (&МассивНоменклатуры)";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивНоменклатуры.Добавить(Выборка.Номенклатура);
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивНоменклатуры;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьПолнотекстовыйПоискНаКлиенте()
	
	Если Не ИндексПолнотекстовогоПоискаАктуален
		И ИнформационнаяБазаФайловая Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеОбновитьИндекс", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, НСтр("ru = 'Индекс полнотекстового поиска неактуален. Обновить индекс?'"), РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ПолнотекстовыйПоискНаКлиенте();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОбновитьИндекс(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		СтрокаПоиска = "";
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОбновлениеИндексаПолнотекстовогоПоискаДанных",0.2, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеИндексаПолнотекстовогоПоискаДанных()
	
	Состояние(НСтр("ru = 'Идет обновление индекса полнотекстового поиска ...'"));
	ОбновитьИндексПолнотекстовогоПоиска();
	Состояние(НСтр("ru = 'Обновление индекса полнотекстового поиска завершено...'"));
	
	ИндексПолнотекстовогоПоискаАктуален = Истина;
	ПолнотекстовыйПоискНаКлиенте();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбновитьИндексПолнотекстовогоПоиска()
	
	УстановитьПривилегированныйРежим(Истина);
	ПолнотекстовыйПоиск.ОбновитьИндекс();
	
КонецПроцедуры

&НаКлиенте
Процедура ПолнотекстовыйПоискНаКлиенте()
	
	ЭлементыОтбора = СписокЗапасы.КомпоновщикНастроек.Настройки.Отбор.Элементы;
	
	Если НЕ ЗначениеЗаполнено(СокрЛП(СтрокаРасширенногоПоиска)) Тогда
		
		ПодборПоискНеУдачный = Ложь;
		
		ПараметрыСписка = Новый Структура("Номенклатура, спАртикулПоставщика", Неопределено, Неопределено);
		УстановитьСвойстваСписка(ПараметрыСписка);
	
	Иначе
		
		РезультатПоиска = Неопределено;
		
		СтруктураНастроекПоиска = Новый Структура("ПоискВДопРеквизитахИСведениях, ПоискВДопСведениях, ПоискВШтрихКодах, ПоискВХарактеристиках"
		, ПоискВДопРеквизитахИСведениях, ПоискВДопСведениях, ПоискВШтрихКодах, ПоискВХарактеристиках);
		
		ПодборПоискНеУдачный = ПолнотекстовыйПоискНаСервереБезКонтекста(СтрокаРасширенногоПоиска, РезультатПоиска, СтруктураНастроекПоиска);
		
		Если Не ПодборПоискНеУдачный Тогда
			
			Использование = Истина;
			
			ПравоеЗначение = ?(Использование, РезультатПоиска.Номенклатура, Неопределено);
			
			ПараметрыСписка = Новый Структура("Номенклатура", ПравоеЗначение);
			УстановитьСвойстваСписка(ПараметрыСписка);

		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолнотекстовыйПоискНаСервереБезКонтекста(СтрокаПоиска, РезультатПоиска, СтруктураНастроекПоиска)
	
	ОписаниеОшибки = "";
	РезультатПоиска = ПоискТоваров(СтрокаПоиска, ОписаниеОшибки, СтруктураНастроекПоиска);
	
	Если НЕ ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции

&НаСервереБезКонтекста
// Полнотекстовый поиск товаров.
//
// Параметры:
//  СтрокаПоиска - Строка - строка для поиска товаров.
//  ОписаниеОшибки - Строка - сообщение об ошибке.
//
Функция ПоискТоваров(СтрокаПоиска, ОписаниеОшибки, СтруктураНастроекПоиска)
	
	РезультатПоиска = Новый Структура;
	РезультатПоиска.Вставить("Номенклатура", Новый Массив);
	
	Результат = ПолнотекстовыйПоискТоваров(СтрокаПоиска, РезультатПоиска, СтруктураНастроекПоиска);
	
	Если Результат = "ВыполненоУспешно" Тогда
		Возврат РезультатПоиска;
	ИначеЕсли Результат = "СлишкомМногоРезультатов" Тогда
		ОписаниеОшибки = НСтр("ru = 'Слишком много результатов. Уточните запрос.'");
		Возврат РезультатПоиска;
	ИначеЕсли Результат = "НичегоНеНайдено" Тогда
		Возврат РезультатПоиска;
	Иначе
		ВызватьИсключение НСтр("ru = 'Неизвестная ошибка'");
	КонецЕсли;
	
	ОписаниеОшибки = НСтр("ru = 'Ничего не найдено'");
	Возврат РезультатПоиска;
	
КонецФункции

&НаСервереБезКонтекста
// Полнотекстовый поиск товаров.
//
// Параметры:
//  СтрокаПоиска - Строка - строка для поиска товаров.
//  РезультатПоиска - ТаблицаЗначений - результат поиска.
//
Функция ПолнотекстовыйПоискТоваров(СтрокаПоиска, РезультатПоиска, СтруктураНастроекПоиска)
	
	МассивШтрихкодов = Новый Массив;
	МассивХарактеристик = Новый Массив;
	
	// Поиск данных
	РазмерПорции = 200;
	ОбластьПоиска = Новый Массив;
	ОбластьПоиска.Добавить(Метаданные.Справочники.Номенклатура);
	
	Если СтруктураНастроекПоиска.ПоискВДопСведениях Тогда
		ОбластьПоиска.Добавить(Метаданные.РегистрыСведений.ДополнительныеСведения);
	КонецЕсли;
	
	Если СтруктураНастроекПоиска.ПоискВШтрихКодах Тогда
		ОбластьПоиска.Добавить(Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры);
	КонецЕсли;
	
	Если СтруктураНастроекПоиска.ПоискВХарактеристиках Тогда
		ОбластьПоиска.Добавить(Метаданные.Справочники.ХарактеристикиНоменклатуры);
	КонецЕсли;
	
	СписокПоиска = ПолнотекстовыйПоиск.СоздатьСписок(СтрокаПоиска + "*", РазмерПорции);
	СписокПоиска.ПолучатьОписание = Ложь;
	СписокПоиска.ОбластьПоиска = ОбластьПоиска;
	СписокПоиска.ПерваяЧасть();
	
	Если СписокПоиска.СлишкомМногоРезультатов() Тогда
		Возврат "СлишкомМногоРезультатов";
	КонецЕсли;
	
	КоличествоНайденныхЭлементов = СписокПоиска.ПолноеКоличество();
	Если КоличествоНайденныхЭлементов = 0 Тогда
		Возврат "НичегоНеНайдено";
	КонецЕсли;
	
	// Обработка данных
	НачальнаяПозиция    = 0;
	КонечнаяПозиция     = ?(КоличествоНайденныхЭлементов > РазмерПорции, РазмерПорции, КоличествоНайденныхЭлементов) - 1;
	ЕстьСледующаяПорция = Истина;

	Пока ЕстьСледующаяПорция Цикл
		
		Для СчетчикЭлементов = 0 По КонечнаяПозиция Цикл
			
			Элемент       = СписокПоиска.Получить(СчетчикЭлементов);
			
			Если Элемент.Метаданные = Метаданные.Справочники.Номенклатура Тогда
				РезультатПоиска.Номенклатура.Добавить(Элемент.Значение);
			ИначеЕсли Элемент.Метаданные = Метаданные.РегистрыСведений.ДополнительныеСведения Тогда
				
				Если ТипЗнч(Элемент.Значение.Объект) = Тип("СправочникСсылка.Номенклатура") Тогда
					РезультатПоиска.Номенклатура.Добавить(Элемент.Значение.Объект);
				КонецЕсли;
				
			ИначеЕсли Элемент.Метаданные = Метаданные.РегистрыСведений.ШтрихкодыНоменклатуры Тогда
				МассивШтрихкодов.Добавить(Элемент.Значение.Штрихкод);
			ИначеЕсли Элемент.Метаданные = Метаданные.Справочники.ХарактеристикиНоменклатуры Тогда
				МассивХарактеристик.Добавить(Элемент.Значение);
			Иначе
				ВызватьИсключение НСтр("ru = 'Неизвестная ошибка'");
			КонецЕсли;
			
		КонецЦикла;
		
		НачальнаяПозиция    = НачальнаяПозиция + РазмерПорции;
		ЕстьСледующаяПорция = (НачальнаяПозиция < КоличествоНайденныхЭлементов - 1);
		
		Если ЕстьСледующаяПорция Тогда
			
			КонечнаяПозиция = ?(КоличествоНайденныхЭлементов > НачальнаяПозиция + РазмерПорции,
			                    РазмерПорции,
			                    КоличествоНайденныхЭлементов - НачальнаяПозиция) - 1;
			СписокПоиска.СледующаяЧасть();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если МассивШтрихкодов.Количество() > 0 Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	ШтрихкодыНоменклатуры.Штрихкод В(&МассивШтрихкодов)");
		Запрос.УстановитьПараметр("МассивШтрихкодов", МассивШтрихкодов);
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			РезультатПоиска.Номенклатура.Добавить(Выборка.Номенклатура);
		КонецЦикла;
		
	КонецЕсли;
	
	Если МассивХарактеристик.Количество() > 0 Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Владелец КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	НЕ ХарактеристикиНоменклатуры.Недействителен
		|	И ТИПЗНАЧЕНИЯ(ХарактеристикиНоменклатуры.Владелец) = ТИП(Справочник.Номенклатура)
		|	И ХарактеристикиНоменклатуры.Ссылка В (&МассивХарактеристик)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ХарактеристикиНоменклатуры.Владелец КАК Ссылка
		|ИЗ
		|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
		|ГДЕ
		|	НЕ ХарактеристикиНоменклатуры.Недействителен
		|	И ТИПЗНАЧЕНИЯ(ХарактеристикиНоменклатуры.Владелец) = ТИП(Справочник.КатегорииНоменклатуры)
		|	И ХарактеристикиНоменклатуры.Ссылка В (&МассивХарактеристик)";
		
		Запрос.УстановитьПараметр("МассивХарактеристик", МассивХарактеристик);
		Результат = Запрос.ВыполнитьПакет();
		
		РезультатПоНоменклатуре = Результат[0].Выбрать();
		
		Пока РезультатПоНоменклатуре.Следующий() Цикл
			РезультатПоиска.Номенклатура.Добавить(РезультатПоНоменклатуре.Ссылка);
		КонецЦикла;
		
		МассивКатегорий = Результат[1].Выгрузить().ВыгрузитьКолонку("Ссылка");
		
		Если МассивКатегорий.Количество() Тогда
			
			Запрос = Новый Запрос;
			
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.КатегорияНоменклатуры В(&МассивКатегорий)
			|	И НЕ Номенклатура.Недействителен";
			
			Запрос.УстановитьПараметр("МассивКатегорий", МассивКатегорий);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				РезультатПоиска.Номенклатура.Добавить(Выборка.Ссылка);
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "ВыполненоУспешно";
	
КонецФункции

&НаКлиенте
Процедура ДобавитьВИсториюПоиска()
	
	Если ЗначениеЗаполнено(СокрЛП(СтрокаРасширенногоПоиска)) Тогда
		
		НайденныйЭлементСписка = ИсторияПоискаСписок.НайтиПоЗначению(СокрЛП(СтрокаРасширенногоПоиска));
		
		Если Не НайденныйЭлементСписка = Неопределено Тогда
			ИсторияПоискаСписок.Удалить(НайденныйЭлементСписка);
		Иначе
			Если ИсторияПоискаСписок.Количество() = 5 Тогда
				ИсторияПоискаСписок.Удалить(4);
			КонецЕсли;
			
		КонецЕсли;
		
		ИсторияПоискаСписок.Вставить(0, СтрокаРасширенногоПоиска)
	КонецЕсли;
	
	Элементы.СтрокаРасширенногоПоиска.СписокВыбора.ЗагрузитьЗначения(ИсторияПоискаСписок.ВыгрузитьЗначения());
		
КонецПроцедуры

#КонецОбласти

#Область ПоискПоШтрихкоду

// Процедура обрабатывает полученные штрихкоды.
//
&НаКлиенте
Процедура ПолученШтрихкод(ДанныеШтрихкодов) Экспорт
	
	Для каждого ДанныеШтрихкода Из ДанныеШтрихкодов Цикл
		
		ДополнительныеДанныеПоШтрихкоду = ШтрихкодированиеУНФКлиент.ДополнительныеДанныеПоШтрихкоду(ДанныеШтрихкода.Штрихкод,
		"");
		Если ДополнительныеДанныеПоШтрихкоду.ЭтоКодМаркировки Тогда
			ДанныеШтрихкода.Штрихкод = ДополнительныеДанныеПоШтрихкоду.EAN;
		ИначеЕсли ДополнительныеДанныеПоШтрихкоду.ЕстьРазделительGS1 Тогда
			ДанныеШтрихкода.Штрихкод = ДополнительныеДанныеПоШтрихкоду.ПредставлениеШтрихкода;
		Иначе
			// Действие не требуется
		КонецЕсли;
		
		ДанныеПоШтрихКодам = ПолучитьДанныеПоШтрихкодамВМассиве(ДанныеШтрихкода);
		
		МассивДанных = ДанныеПоШтрихкодам.Получить(ДанныеШтрихкода.Штрихкод);
		
		Штрихкод = ДанныеШтрихкода.Штрихкод;
		
		Если Не МассивДанных = Неопределено И МассивДанных.Количество() Тогда
			
			ОтключитьОтборыСписка();
			
			Если МассивДанных.Количество() > 1 Тогда
				ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПоДаннымШтрихкодовЗавершение", ЭтотОбъект);
				ПараметрыОткрытия = Новый Структура("МассивНоменклатуры, ТекШтрихкод", МассивДанных, ДанныеШтрихкода);
				ОткрытьФорму("Справочник.Номенклатура.Форма.ДублиНоменклатурыПоШтрихКоду", ПараметрыОткрытия, ЭтаФорма,,,,
				ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
				Возврат;
			КонецЕсли;
			
			Номенклатура = МассивДанных[0].Номенклатура;
			
			Элементы.СписокЗапасы.ТекущаяСтрока = Номенклатура;
			
			ВыполнитьДействиеПриСканировании(Номенклатура);
			
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействиеПриСканировании(Номенклатура)

	// 0 - Позиционировать на строке в списке
	// 1 - Открывать карточку товара
	// 2 - Устанавливать отбор по найденному товару
	// 3 - Добавлять в корзину
	// 4 - Удалять из корзины
	// 5 - Подбирать по артикулу поставщика
	//
	Если ДействиеПриСканировании = 1 Тогда
		
		ОткрытьКарточкуТовара(Номенклатура);
		
	ИначеЕсли ДействиеПриСканировании = 2 Тогда
		
		ПараметрыСписка = Новый Структура("Номенклатура", Номенклатура);
		УстановитьСвойстваСписка(ПараметрыСписка);
		
	ИначеЕсли ДействиеПриСканировании = 3 Тогда
		
		ДобавитьТоварВКорзину(Элементы.СписокЗапасы.ТекущиеДанные);
		
		ПараметрыСписка = Новый Структура("ТоварыКорзины", ТоварыКорзины);
		УстановитьСвойстваСписка(ПараметрыСписка);
		УправлениеСвойствамиЭлементовФормы();
		
	ИначеЕсли ДействиеПриСканировании = 4 Тогда
		
		УдалитьТоварИзКорзины(Элементы.СписокЗапасы.ТекущиеДанные);
		
		ПараметрыСписка = Новый Структура("ТоварыКорзины", ТоварыКорзины);
		УстановитьСвойстваСписка(ПараметрыСписка);
		УправлениеСвойствамиЭлементовФормы();
		
	ИначеЕсли ДействиеПриСканировании = 5 Тогда
		
		ДанныеСтроки = Элементы.СписокЗапасы.ДанныеСтроки(Номенклатура);
		
		Если ДанныеСтроки <> Неопределено Тогда
			ДобавитьВыбранныйТовар(ДанныеСтроки);  
		КонецЕсли;
			
		ПараметрыСписка = Новый Структура("Номенклатура, спАртикулПоставщика", Номенклатура, ЗначениеРеквизитаНаСервере(Номенклатура, "спАртикулПоставщика"));
		УстановитьСвойстваСписка(ПараметрыСписка);
		
	Иначе
		
		Возврат;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымШтрихкодовЗавершение(СтруктураНоменклатуры, Параметры) Экспорт 
	
	Если СтруктураНоменклатуры = Неопределено Тогда Возврат КонецЕсли;
	
	Номенклатура = СтруктураНоменклатуры.МассивНоменклатуры[0].Номенклатура;
	
	Если НЕ Номенклатура = Неопределено Тогда
		
		ТекущаяСтрока = Номенклатура;
		Элементы.СписокЗапасы.ТекущаяСтрока = ТекущаяСтрока;

		ВыполнитьДействиеПриСканировании(Номенклатура);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Результат = Неопределено, СокрЛП(ДополнительныеПараметры.ТекШтрихкод), СокрЛП(Результат));
	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда 
		ДанныеШтрихкода = Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1);
		ПолученШтрихкод(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеШтрихкода));
	КонецЕсли;
	
КонецПроцедуры // ПоискПоШтрихкодуЗавершение()

&НаСервере
Функция ПолучитьДанныеПоШтрихкодамВМассиве(ДанныеШтрихкода, СтруктурнаяЕдиница = Неопределено)
	
	РегистрыСведений.ШтрихкодыНоменклатуры.ПреобразоватьВесовойШтрихкод(ДанныеШтрихкода);
	
	Штрихкоды = Новый Массив;
	Штрихкоды.Добавить(ДанныеШтрихкода);
	
	ДанныеПоШтрихкодам = Новый Соответствие;

	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Рег.Штрихкод КАК Штрихкод,
	|	Рег.Номенклатура КАК Номенклатура,
	|	Рег.Характеристика КАК Характеристика,
	|	Рег.Партия КАК Партия,
	|	Рег.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия
	|ИЗ
	|	РегистрСведений.ШтрихкодыНоменклатуры КАК Рег
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (&СерииНоменклатурыИспользуются)
	|			И Рег.Номенклатура = СерииНоменклатуры.Владелец
	|			И (Рег.Номенклатура.ИспользоватьСерииНоменклатуры)
	|			И Рег.Штрихкод = СерииНоменклатуры.Наименование
	|ГДЕ
	|	Рег.Штрихкод В(&МассивШтрихкодов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТЗДанныеОВесовомТоваре.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ТЗДанныеОВесовомТоваре.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ТЗДанныеОВесовомТоваре.ШтрихКод КАК ШтрихКод
	|ПОМЕСТИТЬ ВременнаяТаблицаВесовойТовар
	|ИЗ
	|	&ТЗДанныеОВесовомТоваре КАК ТЗДанныеОВесовомТоваре
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КодыТоваровSKU.Номенклатура КАК Номенклатура,
	|	КодыТоваровSKU.Характеристика КАК Характеристика,
	|	КодыТоваровSKU.Партия КАК Партия,
	|	КодыТоваровSKU.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВременнаяТаблицаВесовойТовар.ШтрихКод КАК ШтрихКод,
	|	ВременнаяТаблицаВесовойТовар.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ЕСТЬNULL(СерииНоменклатуры.Ссылка, ЗНАЧЕНИЕ(Справочник.СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	|	ЕСТЬNULL(КодыТоваровSKU.Номенклатура.ВидАлкогольнойПродукции.Маркируемый, ЛОЖЬ)
	|		ИЛИ КодыТоваровSKU.Номенклатура.УдалитьТабачнаяПродукция КАК МаркируемаяПродукция
	|ИЗ
	|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаВесовойТовар КАК ВременнаяТаблицаВесовойТовар
	|		ПО КодыТоваровSKU.SKU = ВременнаяТаблицаВесовойТовар.КодВесовогоТовара
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СерииНоменклатуры КАК СерииНоменклатуры
	|		ПО (&СерииНоменклатурыИспользуются)
	|			И КодыТоваровSKU.Номенклатура = СерииНоменклатуры.Владелец
	|			И (КодыТоваровSKU.Номенклатура.ИспользоватьСерииНоменклатуры)
	|			И (ВременнаяТаблицаВесовойТовар.ШтрихКод = СерииНоменклатуры.Наименование)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВременнаяТаблицаВесовойТовар.КодВесовогоТовара КАК КодВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ПрефиксВесовогоТовара КАК ПрефиксВесовогоТовара,
	|	ВременнаяТаблицаВесовойТовар.ШтрихКод КАК ШтрихКод
	|ИЗ
	|	ВременнаяТаблицаВесовойТовар КАК ВременнаяТаблицаВесовойТовар");
	
	МассивШтрихкодов = Новый Массив;
	ТЗДанныеОВесовомТоваре = Новый ТаблицаЗначений;
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("КодВесовогоТовара", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(15, 0, ДопустимыйЗнак.Неотрицательный)));
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("ПрефиксВесовогоТовара", Новый ОписаниеТипов("Число",,, Новый КвалификаторыЧисла(1, 0, ДопустимыйЗнак.Неотрицательный)));
	ТЗДанныеОВесовомТоваре.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200)));
	
	Для каждого ТекШтрихкод Из Штрихкоды Цикл
		
		МассивШтрихкодов.Добавить(ТекШтрихкод.ШтрихКод);

		ДанныеПоШтрихкодам.Вставить(ТекШтрихкод.ШтрихКод, Новый Массив);
		
		Если ТекШтрихкод.Свойство("КодВесовогоТовара") Тогда
			НоваяСтрокаОВесовомТоваре = ТЗДанныеОВесовомТоваре.Добавить();
			НоваяСтрокаОВесовомТоваре.КодВесовогоТовара = ТекШтрихкод.КодВесовогоТовара;
			НоваяСтрокаОВесовомТоваре.ПрефиксВесовогоТовара = ТекШтрихкод.ПрефиксВесовогоТовара;
			НоваяСтрокаОВесовомТоваре.Штрихкод = ТекШтрихкод.Штрихкод;
		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("МассивШтрихкодов", МассивШтрихкодов);
	ИспользоватьСерииНоменклатуры = СерииНоменклатурыУНФ.ИспользоватьСерииНоменклатурыОстатки();
	Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
		Запрос.УстановитьПараметр("СерииНоменклатурыИспользуются", Истина);
	Иначе
	    Запрос.УстановитьПараметр("СерииНоменклатурыИспользуются", Ложь);
	КонецЕсли;
	Запрос.УстановитьПараметр("ТЗДанныеОВесовомТоваре", ТЗДанныеОВесовомТоваре);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	Выборка = МассивРезультатов[2].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МассивДанныхПоШтрихкоду = ДанныеПоШтрихкодам[Выборка.Штрихкод];
		
		ТекДанные = Новый Структура;
		МассивДанныхПоШтрихкоду.Добавить(ТекДанные);
		
		ТекДанные.Вставить("Номенклатура", Выборка.Номенклатура);
		ТекДанные.Вставить("Характеристика", Выборка.Характеристика);
		ТекДанные.Вставить("Партия", Выборка.Партия);
		ТекДанные.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
		ТекДанные.Вставить("КодВесовогоТовара", Выборка.КодВесовогоТовара);
		ТекДанные.Вставить("ПрефиксВесовогоТовара", Выборка.ПрефиксВесовогоТовара);
		ТекДанные.Вставить("МаркируемаяПродукция", Выборка.МаркируемаяПродукция);
		ТекДанные.Вставить("НоменклатураПоставщика", Неопределено);
		
		Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
			ТекДанные.Вставить("Серия", Выборка.Серия);
		КонецЕсли;
	КонецЦикла;
	
	Выборка = МассивРезультатов[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МассивДанныхПоШтрихкоду = ДанныеПоШтрихкодам[Выборка.Штрихкод];
		
		ТекДанные = Новый Структура;
		МассивДанныхПоШтрихкоду.Добавить(ТекДанные);
		
		Если НЕ ТекДанные.Свойство("КодВесовогоТовара") Тогда
			ТекДанные.Вставить("Номенклатура", Выборка.Номенклатура);
			ТекДанные.Вставить("Характеристика", Выборка.Характеристика);
			ТекДанные.Вставить("Партия", Выборка.Партия);
			ТекДанные.Вставить("ЕдиницаИзмерения", Выборка.ЕдиницаИзмерения);
			ТекДанные.Вставить("НоменклатураПоставщика", Неопределено);
			
			Если ИспользоватьСерииНоменклатуры<>Неопределено Тогда
				ТекДанные.Вставить("Серия", Выборка.Серия);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Возврат ДанныеПоШтрихкодам;

КонецФункции

#КонецОбласти //ПоискПоШтрихкоду

#Область ФормированиеДокументов

&НаСервере
Функция СформироватьДокументНаСервере()
	
	ЗаказСсылка = Неопределено;
	
	Если Корзина.Количество() = 0 Тогда
		
		ТекстСообщения = НСтр("ru = 'Корзина пустая'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат ЗаказСсылка; 
		
	КонецЕсли;
	
	ТипДокумента = ТипЗнч(ДокументКорзиныПоУмолчанию.ЗначениеПустойСсылки);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ТипДокумента = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		
		ЗаказСсылка = СформироватьЗаказНаПеремещение(Корзина.Выгрузить(), Зал, Кладовая, Комментарий);
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		ЗаказСсылка = СформироватьЗаказПокупателя(Корзина.Выгрузить(), Зал, Кладовая, РозничныйПокупатель, Комментарий);
		
	Иначе
		
		ТекстСообщения = НСтр("ru = 'Тип документа не поддерживается'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Возврат ЗаказСсылка; 
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ЗаказСсылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьЗаказНаПеремещение(Корзина, Получатель, Отправитель, Комментарий);
	
	ЗаказСсылка = Неопределено;
	
	ДанныеДляЗаполнения = ДанныеДляЗаполнения(Получатель, Отправитель,, Комментарий);
	
	Заказ = Документы.ЗаказНаПеремещение.СоздатьДокумент();
	Заказ.Заполнить(Неопределено);
	ЗаполнитьЗначенияСвойств(Заказ, ДанныеДляЗаполнения);  
	  
	Для каждого СтрокаКорзины Из Корзина Цикл

		НоваяСтрока = Заказ.Запасы.Добавить();
		НоваяСтрока.Номенклатура 		= СтрокаКорзины.Ссылка;
		НоваяСтрока.Количество 			= СтрокаКорзины.Количество;
		НоваяСтрока.ЕдиницаИзмерения 	= СтрокаКорзины.Ссылка.ЕдиницаИзмерения;
		
	КонецЦикла;
	
	Если Заказ.ПроверитьЗаполнение() Тогда
		
		Попытка
			Заказ.Записать(РежимЗаписиДокумента.Проведение);
			ЗаказСсылка = Заказ.Ссылка;
			ТекстСообщения = СтрШаблон(НСтр("ru = '%1 успешно создан'"), ЗаказСсылка);
		Исключение
			ТекстСообщения = НСтр("ru = 'Ошибка при проведении заказа. См. Журнал регистрации'");
			Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			спЛогированиеСобытийИБ.ЛогироватьСобытиеИБ("АРМ_Работника_Зала", "Ошибка",,, Ошибка);
		КонецПопытки;
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЗаказСсылка);
		
	КонецЕсли;
	
	Возврат ЗаказСсылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция СформироватьЗаказПокупателя(Корзина, Получатель, Отправитель, РозничныйПокупатель = Неопределено, Комментарий = "");
	
	ЗаказСсылка = Неопределено;
	
	ДанныеДляЗаполнения = ДанныеДляЗаполнения(Получатель, Отправитель, РозничныйПокупатель, Комментарий);
	
	Заказ = Документы.ЗаказПокупателя.СоздатьДокумент();
	Заказ.Заполнить(Неопределено);
	ЗаполнитьЗначенияСвойств(Заказ, ДанныеДляЗаполнения);  
	  
	Для каждого СтрокаКорзины Из Корзина Цикл

		НоваяСтрока = Заказ.Запасы.Добавить();
		НоваяСтрока.Номенклатура 		= СтрокаКорзины.Ссылка;
		НоваяСтрока.Количество 			= СтрокаКорзины.Количество;
		НоваяСтрока.ЕдиницаИзмерения 	= СтрокаКорзины.Ссылка.ЕдиницаИзмерения;
		НоваяСтрока.Цена 				= СтрокаКорзины.Цена;
		НоваяСтрока.Сумма 				= НоваяСтрока.Цена * НоваяСтрока.Количество;      
		ВидСтавки						= НоваяСтрока.Номенклатура.ВидСтавкиНДС;
		НоваяСтрока.СтавкаНДС 			= Справочники.СтавкиНДС.СтавкаНДС(ВидСтавки, Заказ.Дата);
		НоваяСтрока.СуммаНДС            = НоваяСтрока.Сумма * НоваяСтрока.СтавкаНДС.Ставка / (НоваяСтрока.СтавкаНДС.Ставка + 100);
		НоваяСтрока.Всего 				= НоваяСтрока.Сумма;      
		НоваяСтрока.КодТНВЭД 			= НоваяСтрока.Номенклатура.ТоварнаяНоменклатураВЭД;      
		
	КонецЦикла;
	
	Если Заказ.ПроверитьЗаполнение() Тогда
		
		Попытка
			Заказ.Записать(РежимЗаписиДокумента.Проведение);
			ЗаказСсылка = Заказ.Ссылка;
			ТекстСообщения = СтрШаблон(НСтр("ru = '%1 успешно создан'"), ЗаказСсылка);
		Исключение
			ТекстСообщения = НСтр("ru = 'Ошибка при проведении заказа. См. Журнал регистрации'");
			Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			спЛогированиеСобытийИБ.ЛогироватьСобытиеИБ("АРМ_Работника_Зала", "Ошибка",,, Ошибка);
		КонецПопытки;
		
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЗаказСсылка);
		
	КонецЕсли;
	
	Возврат ЗаказСсылка;
	
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеДляЗаполнения(Получатель, Отправитель, РозничныйПокупатель = Неопределено, Комментарий = "")
	
	Дата 			= ТекущаяДатаСеанса();
	Организация 	= Справочники.Организации.ОрганизацияПоУмолчанию();
	
	Контрагент		= ?(РозничныйПокупатель = Неопределено, Справочники.Контрагенты.ПустаяСсылка(), РозничныйПокупатель);
	Договор 		= Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(Контрагент);
	Валюта 			= Справочники.ДоговорыКонтрагентов.ВалютаРасчетов(Договор);
	БанковскийСчет 	= Справочники.БанковскиеСчета.БанковскиеСчетаОрганизации(Организация, Валюта);
	Касса 			= Справочники.Кассы.ПолучитьКассуПоУмолчанию(Организация);
	
	ДанныеДляЗаполнения = Новый Структура;
	
	// Общие
	ДанныеДляЗаполнения.Вставить("Дата", 						Дата);
	ДанныеДляЗаполнения.Вставить("Автор", 						Пользователи.ТекущийПользователь());
	ДанныеДляЗаполнения.Вставить("Организация", 				Организация);
	ДанныеДляЗаполнения.Вставить("Комментарий", 				Комментарий);
	ДанныеДляЗаполнения.Вставить("Ответственный", 				Неопределено);
	ДанныеДляЗаполнения.Вставить("СтруктурнаяЕдиницаРезерв", 	Отправитель);
	
	// для заказа на перемещение
	ДанныеДляЗаполнения.Вставить("СтруктурнаяЕдиницаПолучатель", 	Получатель);
	ДанныеДляЗаполнения.Вставить("ДатаПеремещения", 				Дата);
	
	// для заказа покупателя
	ДанныеДляЗаполнения.Вставить("БанковскийСчет", 				БанковскийСчет);
	ДанныеДляЗаполнения.Вставить("ВалютаДокумента", 			Валюта);
	ДанныеДляЗаполнения.Вставить("СтруктурнаяЕдиницаПродажи", 	Получатель);
	ДанныеДляЗаполнения.Вставить("ВидЗаказа", 					Справочники.ВидыЗаказовПокупателей.Основной);
	ДанныеДляЗаполнения.Вставить("ВидОперации", 				Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПродажу);
	ДанныеДляЗаполнения.Вставить("ДатаОтгрузки", 				Дата);
	ДанныеДляЗаполнения.Вставить("Договор", 					Договор);
	ДанныеДляЗаполнения.Вставить("Касса", 						Касса);
	ДанныеДляЗаполнения.Вставить("НалогообложениеНДС", 			Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС);
	ДанныеДляЗаполнения.Вставить("НДСВключатьВСтоимость", 		Истина);
	ДанныеДляЗаполнения.Вставить("ДатаПоступления", 			Дата);
	ДанныеДляЗаполнения.Вставить("Контрагент", 					Контрагент);
	
	Возврат ДанныеДляЗаполнения;
	
КонецФункции

&НаСервере
Процедура ИсторияЗаказовНаСервере(ТабличныйДокументИсторииЗаказов)
	
	ТабличныйДокументИсторииЗаказов.Очистить();
	
	Обработка 					= РеквизитФормыВЗначение("Объект");
	Схема 						= Обработка.ПолучитьМакет("ИсторияЗаказовСКД");
	
	Настройки 					= Схема.НастройкиПоУмолчанию;
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Зал", Зал);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Кладовая", Кладовая);
	
	ДанныеРасшифровки 			= Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета 			= Новый КомпоновщикМакетаКомпоновкиДанных;
	ПроцессорКомпоновкиДанных 	= Новый ПроцессорКомпоновкиДанных;
	
	УстановитьПривилегированныйРежим(Истина);
	МакетКомпоновки 			= КомпоновщикМакета.Выполнить(Схема, Настройки, ДанныеРасшифровки);
    
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки, Истина);
		
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабличныйДокументИсторииЗаказов);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

#КонецОбласти

#КонецОбласти