&НаСервере
Процедура ПКВ_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Подсказка") Тогда
		Подсказка = Параметры.Подсказка;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПКВ_Подтвердить(Команда)
	
	Если Не ЗначениеЗаполнено(СокрЛП(Код)) Тогда
		ПоказатьПредупреждение(, "Введите код из SMS.", , "Внимание");
		ТекущийЭлемент = Элементы.Код;
		Возврат;
	КонецЕсли;
	
	Закрыть(СокрЛП(Код));
	
КонецПроцедуры

&НаКлиенте
Процедура ПКВ_ОтменаКода(Команда)
	
	Закрыть();
	
КонецПроцедуры