
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.Свойство("МаксимальнаяСуммаОплаты", МаксимальнаяСуммаОплаты);
	
	СуммаОплаты = МаксимальнаяСуммаОплаты;
	
	Элементы.СуммаОплаты.МаксимальноеЗначение = МаксимальнаяСуммаОплаты;
	Элементы.НадписьМаксимальнаяСуммаБонусов.Заголовок = "Максимум " + Формат(МаксимальнаяСуммаОплаты, "ЧГ=") + " бонусов";
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	maxma_СтруктураПолей = ВладелецФормы.Объект.maxma_СтруктураПолей;
	
	Элементы.Группа1.Видимость 		    = maxma_СтруктураПолей.НастройкиМодуля.ПодтверждатьСписаниеБалловПоСмс;
	Элементы.ПодтвердитьКод.Доступность = Не maxma_СтруктураПолей.НастройкиМодуля.ПодтверждатьСписаниеБалловПоСмс;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КомандаEnter(Команда)
	
	Закрыть(Новый Структура("СуммаОплатыБонусами", СуммаОплаты));
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьКод(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	ШаблонСообщения = Нстр("ru = '%1.
		|%2.'");
	
	Если Не ЗначениеЗаполнено(ОтправленныйКод) Тогда
		
		ПараметрыПродажи = maxma_СтруктураПолей.ПараметрыПродажи;
		НастройкиМодуля  = maxma_СтруктураПолей.НастройкиМодуля;
		
		Если Не ОтправитьКодСМСНаСервере(ПараметрыПродажи.КодКартыНомерТелефона, ПараметрыПродажи.РежимПоискаКарты, НастройкиМодуля, ДополнительныеПараметры) Тогда
			
			Если НЕ ДополнительныеПараметры.СетеваяОшибка Тогда
				
				СтруктураСообщения = Новый Структура("ТекстИнформации, ЗаголовокИнформации");
				СтруктураСообщения.ТекстИнформации     = ДополнительныеПараметры.ТекстИнформации;
				СтруктураСообщения.ЗаголовокИнформации = НСтр("ru = 'Не удалось отправить СМС с кодом подтверждения'");
				
				maxma_ИнтеграцияССервисомКлиент.ОткрытьФормуИнформации(СтруктураСообщения);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура КодПодтвержденияИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	Элементы.ПодтвердитьКод.Доступность = СтрДлина(Текст) > 0;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодтвердитьКод(Команда)
	
	Если КодПодтверждения <> Неопределено Тогда
		
		Если КодПодтверждения = ОтправленныйКод Тогда
			
			ПараметрыДанных = Новый Структура("СуммаОплатыБонусами", СуммаОплаты); 
			
			Закрыть(ПараметрыДанных);
			
			Оповестить("ОплатаБонуснымиБаллами", ПараметрыДанных, "ФормаОплатыБонуснымиБаллами");
			
		Иначе
			
			Элементы.КомандаEnter.Доступность = Ложь;
			
			СтруктураСообщения = Новый Структура("ТекстИнформации, ЗаголовокИнформации");
			СтруктураСообщения.ТекстИнформации     = НСтр("ru = 'Код подтверждения введен неверно!'");
			СтруктураСообщения.ЗаголовокИнформации = НСтр("ru = 'Ошибка ввода кода подтверждения из СМС'");
			
			maxma_ИнтеграцияССервисомКлиент.ОткрытьФормуИнформации(СтруктураСообщения, Истина);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОтправитьКодСМСНаСервере(КодНомерТелефона, РежимПоискаКарты, НастройкиМодуля, ДополнительныеПараметры)
	
	ПараметрыЗапроса = Новый Структура;
	
	Если РежимПоискаКарты = "НомерТелефона" Тогда
		ПараметрыЗапроса.Вставить("phoneNumber", КодНомерТелефона);
	Иначе
		ПараметрыЗапроса.Вставить("card", КодНомерТелефона);
	КонецЕсли;
	
	МетодSendConfirmationCode = maxma_ИнтеграцияССервисомВызовСервера.МетодSendConfirmationCode();
	
	ОтветСервера = maxma_ИнтеграцияССервисомВызовСервера.ОтветСервера(ПараметрыЗапроса, МетодSendConfirmationCode, НастройкиМодуля);
	
	ТекстИнформации = "";
	Если ОтветСервера.ЕстьОшибки И ОтветСервера.Свойство("ТекстОшибки", ТекстИнформации) Тогда
		Результат = Ложь;
		maxma_ИнтеграцияССервисомВызовСервера.ЗаписатьДанныеВЖурналРегистрации(ТекстИнформации, УровеньЖурналаРегистрации.Ошибка);
	Иначе
		Результат = Истина; 
		ОтправленныйКод = ОтветСервера.Данные.code;
	КонецЕсли;
	
	ДополнительныеПараметры.Вставить("СетеваяОшибка", ОтветСервера.СетеваяОшибка);
	ДополнительныеПараметры.Вставить("ТекстИнформации", ТекстИнформации);
	
	Возврат Результат;

КонецФункции

#КонецОбласти

