
#Область КомандыФормы

&НаКлиенте
Процедура ВыполнитьОтгрузку(Команда)

	ОткрытьФорму("Обработка.спАРМРаботникаСклада.Форма.спОтгрузкаСписокЗаказов", , ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьПриемку(Команда)

	ОткрытьФорму("Обработка.спАРМРаботникаСклада.Форма.спПриемкаСписокЗаказов", , ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗаказыПокупателей(Команда)

	ОткрытьФорму("Обработка.спАРМРаботникаСклада.Форма.спЗаказыПокупателей", , ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьИнформациюОТоваре(Команда)

	ОткрытьФорму("Обработка.спАРМРаботникаСклада.Форма.спИнформацияОТоваре", , ЭтаФорма);

КонецПроцедуры

#КонецОбласти

//<<<--- Tnext Козык К.А. 01.07.2026
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ОбщегоНазначенияКлиентПереопределяемый.спЭтоПользовательАРМСклад()
		И Не ЗавершениеРаботы Тогда
		
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры
//--->>> Tnext Козык К.А. 01.07.2026