
#Область ПрограммныйИнтерфейс

&Вместо("НачатьВыполнениеКоманды")
Процедура спНачатьВыполнениеКоманды(Форма, Команда, Знач Источник) Экспорт
	
	Если Форма.ИмяФормы = "Справочник.ХранилищеШаблонов.Форма.ФормаРедактированияШаблона" 
		И Команда.Имя = "спЗнакиУхода" Тогда
		Справочник_ХранилищеШаблонов_Форма_ФормаРедактированияШаблона_ВыболнитьКоманду_ЗнакиУхода(Форма);
	ИначеЕсли Форма.ИмяФормы = "Справочник.ХранилищеШаблонов.Форма.ФормаРедактированияШаблона" 
		И Команда.Имя = "спЗнакиУходаКартинка" Тогда
	    Справочник_ХранилищеШаблонов_Форма_ФормаРедактированияШаблона_ВыболнитьКоманду_ЗнакиУходаКартинка(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаДокумента" 
		И Команда.Имя = "спПечатьЭтикетокИЦенников" Тогда
	    Документ_ЗаказПоставщику_Форма_ФормаДокумента_ВыболнитьКомандуПечать_ЭтикетокИЦенников(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаДокумента" 
		И Команда.Имя = "спНоменклатураИзФайла" Тогда
	    Документ_ЗаказПоставщику_Форма_ФормаДокумента_ВыболнитьКоманду_НоменклатураИзФайла(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаСписка" 
		И Команда.Имя = "спПечатьЭтикетокИЦенников" Тогда
	    Документ_ЗаказПоставщику_Форма_ФормаСписка_ВыболнитьКоманду_ПечатьЭтикетокИЦенников(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ПеремещениеЗапасов.Форма.ФормаДокумента" 
		И Команда.Имя = "спПриемТоваров" Тогда
	    Документ_ПеремещениеЗапасов_Форма_ФормаДокумента_ВыболнитьКоманду_ПриемТоваров(Форма);
	// ++ Терлецкий АВ 25.02.18
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаДокумента" Тогда 
		Если Команда.Имя = "спОтправитьСообщение" Тогда 
			Документ_ЗаказНаПеремещение_Форма_ФормаДокумента_ВыболнитьКоманду_ОтправитьСообщение(Форма); 
		ИначеЕсли Команда.Имя = "спОтгрузкаТоваров" Тогда
			Документ_ЗаказНаПеремещение_Форма_ФормаДокумента_ВыболнитьКоманду_ОтгрузкаТоваров(Форма);
		ИначеЕсли Команда.Имя = "спПодсортСЦС" Тогда
			Документ_ЗаказНаПеремещение_Форма_ФормаДокумента_ВыболнитьКоманду_ПодсортССЦ(Форма);    
		//Евгений Начало. Фикс для печатной формы	
		ИначеЕсли Команда.Имя = "ПодменюПечатьОбычное__ОстаткиВразрезеЯчеек" Тогда
    	ПродолжитьВызов(Форма, Команда, Источник);
        //Евгений Конец
		КонецЕсли;
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаСписка" 
		И Команда.Имя = "спИнтервал" Тогда 
		Документ_ЗаказНаПеремещение_Форма_ФормаДокумента_УстановитьИнтервал(Форма);  
	// -- Терлецкий АВ 25.02.18
	// dimedrol 23.02.2025
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаДокумента" 
		И Команда.Имя = "спСоздатьУстановкуЦенПоАлгоритму" Тогда
		Документ_ЗаказПоставщику_Форма_ФормаДокумента_ВыболнитьКоманду_спСоздатьУстановкуЦенПоАлгоритму(Форма);
	// end of dimedrol 23.02.2025
	Иначе
		ПродолжитьВызов(Форма, Команда, Источник);
	КонецЕсли;

КонецПроцедуры  

&Перед("ПослеЗаписи")
Процедура спПослеЗаписи(Форма, Объект, ПараметрыЗаписи)
	
	
	Если Форма.ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаДокумента" Тогда
		
		ОшибкаОтправкиСообщения = Ложь; // ++ Терлецкий АВ 25.01.15 
		СтруктурнаяЕдиницаРезерв = спОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("спОтправлятьСообщениеДляПодсортировкиМагазина");
		
		Если Объект.Проведен И ЗначениеЗаполнено(СтруктурнаяЕдиницаРезерв) И Объект.СтруктурнаяЕдиницаРезерв = СтруктурнаяЕдиницаРезерв Тогда 
			
			ОтправкаДокументов = Новый Массив;
			ОтправкаДокументов.Добавить(Объект.Ссылка);  
			РезультатОтправки = спСервисИнтеграцииВызовСервера.ОтправитьСообщениеДокументовПоSOAP(ОтправкаДокументов);
			
			Если ТипЗнч(РезультатОтправки) = Тип("Структура") Тогда
				
				Если Не РезультатОтправки.Результат И РезультатОтправки.Свойство("СостояниеДанных") Тогда
					
					ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОтправки.СостояниеДанных);
					
					// ++ Терлецкий АВ 25.01.15
					Если РезультатОтправки.КодОшибки <> 699 Тогда 
						ОшибкаОтправкиСообщения = Истина; 
					ИначеЕсли РезультатОтправки.КодОшибки = 699 И Не ПроверитьСообщениеНаОтправкуВебСерверу(Объект) Тогда 
						ОшибкаОтправкиСообщения = Истина;
					КонецЕсли;
					// -- Терлецкий АВ 25.01.15
					
				ИначеЕсли Не РезультатОтправки.Результат И РезультатОтправки.Свойство("ОшибкаДанных") Тогда 
					
					ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОтправки.ОшибкаДанных); 
					
					ОшибкаОтправкиСообщения = Истина; // ++ Терлецкий АВ 25.01.15
					
				ИначеЕсли РезультатОтправки.Результат И РезультатОтправки.Свойство("СостояниеДанных") Тогда 
					
					ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОтправки.СостояниеДанных);
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли;  
		
		
		// ++ Терлецкий АВ 25.01.15
		Если ОшибкаОтправкиСообщения Тогда 
			ПараметрыЗаписи = Новый Структура("Объект, Форма", Объект, Форма);
			ПоказатьВопрос(Новый ОписаниеОповещения("ПредупрежедениеЗавершение", ЭтотОбъект, ПараметрыЗаписи),
			НСтр("ru = 'Отменить проведение документа?'"), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
		КонецЕсли;
		
		ОбновитьСостояниеСообщенияДокументЗаказНаПеремещения(Форма, Объект); 
		// -- Терлецкий АВ 25.01.15
		
		// ++ Терлецкий АВ 25.02.04
	ИначеЕсли Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда 
		Форма.Прочитать();
		// -- Терлецкий АВ 25.02.04
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Справочник_ХранилищеШаблонов

Процедура Справочник_ХранилищеШаблонов_Форма_ФормаРедактированияШаблона_ВыболнитьКоманду_ЗнакиУхода(Форма)
	
	ПолеТабличногоДокумента = Форма.ПолеТабличногоДокумента;
	
	ИмяПоляВШаблоне = "ЗнакиУхода" + СтрЗаменить(Новый УникальныйИдентификатор, "-", "_");
	
	// Перед началом добавления необходимо выделить область в табличном документе.
	Если ТипЗнч(ПолеТабличногоДокумента.ТекущаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для переноса поля шаблона нужно выделить ячейку или область ячеек!'"));
		Возврат;
	Иначе
		ТекущаяОбласть = ПолеТабличногоДокумента.ТекущаяОбласть;
		спПодключаемыеКомандыВызовСервера.ОбъединитьОбластьЯчеекШаблонаСервер(ПолеТабличногоДокумента, ТекущаяОбласть.Имя);
	КонецЕсли;
	
	ТекущаяОбласть.Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Шаблон;
	ТекущаяОбласть.Текст = ТекущаяОбласть.Текст + "["+ИмяПоляВШаблоне+"]";

КонецПроцедуры

Процедура Справочник_ХранилищеШаблонов_Форма_ФормаРедактированияШаблона_ВыболнитьКоманду_ЗнакиУходаКартинка(Форма)
	
	ПолеТабличногоДокумента = Форма.ПолеТабличногоДокумента;
	
	ИмяПоляВШаблоне = "ЗнакиУхода";
	ИмяТекущейОбласти = ПолеТабличногоДокумента.ТекущаяОбласть.Имя;
	
	// Получим рисунок штрихкода из дополнительного макета.
	спПодключаемыеКомандыВызовСервера.ВставитьВШаблонРисунокЗнакиУхода(ПолеТабличногоДокумента, ИмяТекущейОбласти, ИмяПоляВШаблоне);
	
	// Перед началом добавления необходимо выделить область в табличном документе.
	Если ТипЗнч(ПолеТабличногоДокумента.ТекущаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Для переноса поля шаблона нужно выделить ячейку или область ячеек!'"));
		Возврат;
	Иначе
		ТекущаяОбласть = ПолеТабличногоДокумента.ТекущаяОбласть;
		спПодключаемыеКомандыВызовСервера.ОбъединитьОбластьЯчеекШаблонаСервер(ПолеТабличногоДокумента, ТекущаяОбласть.Имя);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти 

#Область Документ_ЗаказПоставщику

Процедура Документ_ЗаказПоставщику_Форма_ФормаДокумента_ВыболнитьКомандуПечать_ЭтикетокИЦенников(Форма)

	НоменклатураПоставщика = спПодключаемыеКомандыВызовСервера.ЗаполнитьНоменклатураПоставщика(Форма.Объект.Запасы);
	
	ПараметрыФормы = Новый Структура("НоменклатураПоставщика", НоменклатураПоставщика);
	ОткрытьФорму("Обработка.ПечатьЭтикетокИЦенников.Форма.Форма", ПараметрыФормы,,Истина);

КонецПроцедуры

Процедура Документ_ЗаказПоставщику_Форма_ФормаДокумента_ВыболнитьКоманду_НоменклатураИзФайла(Форма)

	Обработчик = Новый ОписаниеОповещения("ПослеЗакрытияФормыЗагрузкаНоменклатуры", ЭтотОбъект, Форма);
	
	ОткрытьФорму("Обработка.спЗагрузкаНоменклатуры.Форма",, Форма, Форма.УникальныйИдентификатор,,, Обработчик);

КонецПроцедуры

Процедура ПослеЗакрытияФормыЗагрузкаНоменклатуры(Результат, Форма) Экспорт
	НовоеКоличество = 1;
	НовоеЦена = 0;
	Если ТипЗнч(Результат) = Тип("Массив") Тогда
		Для каждого ЭлементРезультата Из Результат Цикл
			Если ТипЗнч(ЭлементРезультата) = Тип("Структура") Тогда 
				Если ЭлементРезультата.Свойство("Номенклатура") 
					И ТипЗнч(ЭлементРезультата.Номенклатура) = Тип("СправочникСсылка.Номенклатура") 
					И ЭлементРезультата.Номенклатура <> ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка") Тогда 
					НоваяСтрока = Форма.Объект.Запасы.Добавить();
					НоваяСтрока.Номенклатура = ЭлементРезультата.Номенклатура; 
					Если ТипЗнч(ЭлементРезультата.Количество) = Тип("Число") И ЭлементРезультата.Количество > 0 Тогда  
						НовоеКоличество = ЭлементРезультата.Количество;
					КонецЕсли;  
					Если ТипЗнч(ЭлементРезультата.Цена) = Тип("Число") И ЭлементРезультата.Количество > 0 Тогда  
						НовоеЦена = ЭлементРезультата.Цена;
					КонецЕсли;

						ПриЗаполненииНоменклатуры(Форма, НоваяСтрока, , НовоеКоличество, НовоеЦена);
				КонецЕсли;
				
				Если ЭлементРезультата.Свойство("Характеристика") 
					И ТипЗнч(ЭлементРезультата.Характеристика) = Тип("СправочникСсылка.ХарактеристикиНоменклатуры") 
					И ЭлементРезультата.Характеристика <> ПредопределенноеЗначение("Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка") Тогда 
					Если ТипЗнч(НоваяСтрока) = Тип("ДанныеФормыЭлементКоллекции") Тогда 
					НоваяСтрока.Характеристика = ЭлементРезультата.Характеристика;  
					КонецЕсли;
				КонецЕсли; 
				
				РассчитатьСуммуВСтрокеТабличнойЧастиПриЗаполненииНоменклатуры(Форма, НоваяСтрока);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли; 
	
КонецПроцедуры 

Процедура ПриЗаполненииНоменклатуры(Форма, СтрокаТабличнойЧасти, НоменклатураПоставщика = Ложь, НовоеКоличество = 1, Цена = 0)
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("Организация", Форма.Объект.Организация);
	СтруктураДанные.Вставить("Номенклатура", СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("Характеристика", СтрокаТабличнойЧасти.Характеристика);
	СтруктураДанные.Вставить("НалогообложениеНДС", Форма.Объект.НалогообложениеНДС);
	СтруктураДанные.Вставить("ВидОперации", Форма.Объект.ВидОперации);
	СтруктураДанные.Вставить("ДатаОбработки", Форма.Объект.Дата);
	СтруктураДанные.Вставить("УчетНоменклатурыПоставщиков", Форма.УчетНоменклатурыПоставщиков);
	СтруктураДанные.Вставить("СтруктураВыбораНоменклатуры", Форма.СтруктураВыбораНоменклатуры);
	СтруктураДанные.Вставить("ПодборНоменклатурыИзСписка", Форма.ПодборНоменклатурыИзСписка);
	СтруктураДанные.Вставить("Контрагент", Форма.Объект.Контрагент);
	
	Если ЗначениеЗаполнено(Форма.Объект.ВидЦенКонтрагента) Тогда
		
		СтруктураДанные.Вставить("ДатаОбработки", Форма.Объект.Дата);
		СтруктураДанные.Вставить("ВалютаДокумента", Форма.Объект.ВалютаДокумента);
		СтруктураДанные.Вставить("СуммаВключаетНДС", Форма.Объект.СуммаВключаетНДС);
		СтруктураДанные.Вставить("ВидЦенКонтрагента", Форма.Объект.ВидЦенКонтрагента);
		СтруктураДанные.Вставить("Коэффициент", 1);
		
	КонецЕсли;
	
	СтруктураДанные = спПодключаемыеКомандыВызовСервера.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
	Если Не НоменклатураПоставщика Тогда
		СтрокаТабличнойЧасти.НоменклатураПоставщика = Неопределено;
		Если Форма.УчетНоменклатурыПоставщиков Тогда
			СтрокаТабличнойЧасти.НоменклатураПоставщика = СтруктураДанные.НоменклатураПоставщика;
		КонецЕсли;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.ЕдиницаИзмерения = СтруктураДанные.ЕдиницаИзмерения;
	СтрокаТабличнойЧасти.СтавкаНДС = СтруктураДанные.СтавкаНДС;
	СтрокаТабличнойЧасти.Содержание = "";
	СтрокаТабличнойЧасти.Спецификация = СтруктураДанные.Спецификация;
	СтрокаТабличнойЧасти.ТипНоменклатуры = СтруктураДанные.ТипНоменклатуры;
	СтрокаТабличнойЧасти.Количество = НовоеКоличество;
	//Вес и объем
	СтрокаТабличнойЧасти.ВесЕдиницыТовара = СтруктураДанные.ВесЕдиницыТовара;
	СтрокаТабличнойЧасти.Вес = СтрокаТабличнойЧасти.ВесЕдиницыТовара * СтрокаТабличнойЧасти.Количество;
	СтрокаТабличнойЧасти.ОбъемЕдиницыТовара = СтруктураДанные.ОбъемЕдиницыТовара;
	СтрокаТабличнойЧасти.Объем = СтрокаТабличнойЧасти.ОбъемЕдиницыТовара * СтрокаТабличнойЧасти.Количество;
		
	Если ЗначениеЗаполнено(Цена) Тогда
		СтрокаТабличнойЧасти.Цена = Цена;
	Иначе
		СтрокаТабличнойЧасти.Цена = СтруктураДанные.Цена;
	КонецЕсли;

	СтрокаТабличнойЧасти.ИспользоватьХарактеристики = СтруктураДанные.ИспользоватьХарактеристики;
	СтрокаТабличнойЧасти.ПроверятьЗаполнениеХарактеристики = СтруктураДанные.ПроверятьЗаполнениеХарактеристики;
	СтрокаТабличнойЧасти.ЗаполнениеХарактеристикиПроверено = Истина;
	
	Если СтруктураДанные.ИспользоватьХарактеристики Тогда
		СтрокаТабличнойЧасти.Характеристика = СтруктураДанные.Характеристика;
	КонецЕсли;
	
	СтрокаТабличнойЧасти.ЗапретитьВводДробногоКоличества = СтруктураДанные.ЗапретитьВводДробногоКоличества;
	
	Если СтруктураДанные.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
		СтрокаТабличнойЧасти.СтруктурнаяЕдиницаРезерв = ПредопределенноеЗначение("Справочник.СтруктурныеЕдиницы.ПустаяСсылка");
	ИначеЕсли Форма.Объект.ПоложениеСклада = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти") Тогда
		СтрокаТабличнойЧасти.СтруктурнаяЕдиницаРезерв = ?(ЗначениеЗаполнено(СтрокаТабличнойЧасти.СтруктурнаяЕдиницаРезерв) 
			И Форма.ПодборНоменклатурыИзСписка, СтрокаТабличнойЧасти.СтруктурнаяЕдиницаРезерв, СтруктураДанные.Склад);
	Иначе
		СтрокаТабличнойЧасти.СтруктурнаяЕдиницаРезерв = Форма.Объект.СтруктурнаяЕдиницаРезерв;
	КонецЕсли;
		
	Форма.ПодборНоменклатурыИзСписка = Ложь;
	
	//РассчитатьСуммуВСтрокеТабличнойЧасти();
    РассчитатьОбъемИВесЗаказа(Форма.Объект); 
	
КонецПроцедуры

Процедура РассчитатьСуммуВСтрокеТабличнойЧастиПриЗаполненииНоменклатуры(Форма, СтрокаТабличнойЧасти = Неопределено, ПараметрыРасчета = Неопределено)
	
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		СтрокаТабличнойЧасти = Форма.Элементы.Запасы.ТекущиеДанные;
	КонецЕсли;
	
	Если ПараметрыРасчета=Неопределено Тогда
		ПараметрыРасчета = Новый Структура();
	КонецЕсли;
	ПараметрыРасчета.Вставить("СуммаВключаетНДС", Форма.Объект.СуммаВключаетНДС);
	ТабличныеЧастиУНФКлиент.РассчитатьСуммыВСтрокеТЧ(СтрокаТабличнойЧасти, ПараметрыРасчета);
	
	// Ручная скидка - заполнение полей ввода на форме
	СкидкиНаценкиКлиентСервер.РассчитатьСуммуИПроцентСкидки(Форма);
	// Конец Ручная скидка
	
КонецПроцедуры

Процедура РассчитатьОбъемИВесЗаказа(Объект)
	
	Объект.Вес = 0;
	Объект.Объем = 0;	
	ВесИтог = 0;
	ОбъемИтог = 0;
	
	Для Каждого ТекСтрока Из Объект.Запасы Цикл
		ВесИтог = ВесИтог + ТекСтрока.Вес;
		ОбъемИтог = ОбъемИтог + ТекСтрока.Объем;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ВесИтог) Тогда
		Объект.Вес = ВесИтог;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъемИтог) Тогда
		Объект.Объем = ОбъемИтог;
	КонецЕсли;
	
КонецПроцедуры

Процедура Документ_ЗаказПоставщику_Форма_ФормаСписка_ВыболнитьКоманду_ПечатьЭтикетокИЦенников(Форма)
	
	ВыделенныеСтрокиСписока =  Новый Массив;
	
	Для Каждого ТекущаяВыделеннаяСтрока Из Форма.Элементы.Список.ВыделенныеСтроки Цикл
		ВыделенныеСтрокиСписока.Добавить(ТекущаяВыделеннаяСтрока);
	КонецЦикла;
	
	НоменклатураПоставщика = спПодключаемыеКомандыВызовСервера.ЗаполнитьНоменклатураПоставщикаФормаСписка(ВыделенныеСтрокиСписока);
	Если ТипЗнч(НоменклатураПоставщика) = Тип("Структура") Тогда 
		ПараметрыФормы = Новый Структура("НоменклатураПоставщика", НоменклатураПоставщика);
		ОткрытьФорму("Обработка.ПечатьЭтикетокИЦенников.Форма.Форма", ПараметрыФормы,,Истина);
	КонецЕсли;

КонецПроцедуры

// dimedrol 23.02.2025
Процедура Документ_ЗаказПоставщику_Форма_ФормаДокумента_ВыболнитьКоманду_спСоздатьУстановкуЦенПоАлгоритму(Форма)
		
	НовыйДокументУстановкаЦенПоАлгоритму = спПодключаемыеКомандыВызовСервера.СоздатьУстановкуЦенПоАлгоритму(Форма.Объект);
	
	Если НовыйДокументУстановкаЦенПоАлгоритму <> Неопределено Тогда
		ПараметрыОткрытия = Новый Структура("Ключ", НовыйДокументУстановкаЦенПоАлгоритму);
		ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.ФормаОбъекта", ПараметрыОткрытия,,Истина);
	КонецЕсли;
	
КонецПроцедуры
// end of dimedrol 23.02.2025

#КонецОбласти

#Область Документ_ЗаказНаПеремещения

// ++ Терлецкий АВ 25.01.15
Процедура ПредупрежедениеЗавершение(Результат, Параметры) Экспорт
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	спПодключаемыеКомандыВызовСервера.ОтменаПроведенияДокументЗаказНаПеремещения(Параметры.Объект);
	Параметры.Форма.Прочитать();
КонецПроцедуры 

Процедура ОбновитьСостояниеСообщенияДокументЗаказНаПеремещения(Форма, Объект) 
	
	РезультатОтправкиСообщения = Неопределено;
	ДекорацияФормыОтправкаСообщения = Неопределено;   
	
	СтруктурнаяЕдиницаРезерв = спОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("спОтправлятьСообщениеДляПодсортировкиМагазина");
	Если ЗначениеЗаполнено(СтруктурнаяЕдиницаРезерв) И Форма.Объект.СтруктурнаяЕдиницаРезерв = СтруктурнаяЕдиницаРезерв Тогда 
		
		Если ЗначениеЗаполнено(Объект.Ссылка) Тогда  
			РезультатОтправкиСообщения = спПодключаемыеКомандыВызовСервера.ОбновитьСостояниеСообщенияДокументЗаказНаПеремещения(Объект.Ссылка);
		КонецЕсли;
		
		ДекорацияФормыОтправкаСообщения = Форма.Элементы.Найти("ОтправкаСообщения");
		
		Если Не ТипЗнч(ДекорацияФормыОтправкаСообщения) = Тип("ДекорацияФормы") Тогда 
			Возврат;
		КонецЕсли;
		
		Если РезультатОтправкиСообщения = Истина Тогда 
			
			ДекорацияФормыОтправкаСообщения.Заголовок = "Сообщение отправлено";
			ДекорацияФормыОтправкаСообщения.ЦветТекста = WebЦвета.Зеленый;
			
		ИначеЕсли РезультатОтправкиСообщения = Ложь Тогда
			
			ДекорацияФормыОтправкаСообщения.Заголовок = "Ошибка отправки";
			ДекорацияФормыОтправкаСообщения.ЦветТекста = WebЦвета.Красный;
			
		Иначе
			ДекорацияФормыОтправкаСообщения.Заголовок = "Сообщение не отправлялось";
			ДекорацияФормыОтправкаСообщения.ЦветТекста = WebЦвета.Синий;
			
		КонецЕсли; 
		
	Иначе
		ДекорацияФормыОтправкаСообщения = Форма.Элементы.Найти("ОтправкаСообщения");
		
		Если Не ТипЗнч(ДекорацияФормыОтправкаСообщения) = Тип("ДекорацияФормы") Тогда 
			Возврат;
		КонецЕсли;
		ДекорацияФормыОтправкаСообщения.Заголовок = "";
		
	КонецЕсли;	
КонецПроцедуры  

Функция ПроверитьСообщениеНаОтправкуВебСерверу(Объект) 
	Возврат спПодключаемыеКомандыВызовСервера.ПроверитьСообщениеНаОтправкуВебСерверу(Объект.Ссылка);
КонецФункции
// -- Терлецкий АВ 25.01.15

// ++ Терлецкий АВ 25.02.18
Процедура Документ_ЗаказНаПеремещение_Форма_ФормаДокумента_ВыболнитьКоманду_ОтправитьСообщение(Форма) 
	Объект = Форма.Объект;
	Если Форма.ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаДокумента" Тогда
		
		ОшибкаОтправкиСообщения = Ложь;
		СтруктурнаяЕдиницаРезерв = спОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("спОтправлятьСообщениеДляПодсортировкиМагазина");
		
		Если Объект.Проведен И ЗначениеЗаполнено(СтруктурнаяЕдиницаРезерв) И Объект.СтруктурнаяЕдиницаРезерв = СтруктурнаяЕдиницаРезерв Тогда 
			
			ОтправкаДокументов = Новый Массив;
			ОтправкаДокументов.Добавить(Объект.Ссылка);  
			РезультатОтправки = спСервисИнтеграцииВызовСервера.ОтправитьСообщениеДокументовПоSOAP(ОтправкаДокументов);
			
			Если ТипЗнч(РезультатОтправки) = Тип("Структура") Тогда
				
				Если Не РезультатОтправки.Результат И РезультатОтправки.Свойство("СостояниеДанных") Тогда
					
					ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОтправки.СостояниеДанных);
					
					Если РезультатОтправки.КодОшибки <> 699 Тогда 
						ОшибкаОтправкиСообщения = Истина; 
					ИначеЕсли РезультатОтправки.КодОшибки = 699 И Не ПроверитьСообщениеНаОтправкуВебСерверу(Объект) Тогда 
						ОшибкаОтправкиСообщения = Истина; 
					КонецЕсли;   
					
				ИначеЕсли Не РезультатОтправки.Результат И РезультатОтправки.Свойство("ОшибкаДанных") Тогда 
					
					ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОтправки.ОшибкаДанных); 
					
					ОшибкаОтправкиСообщения = Истина;					
				ИначеЕсли РезультатОтправки.Результат И РезультатОтправки.Свойство("СостояниеДанных") Тогда 
					
					ОбщегоНазначенияКлиент.СообщитьПользователю(РезультатОтправки.СостояниеДанных);
					
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЕсли;  
		
		ОбновитьСостояниеСообщенияДокументЗаказНаПеремещения(Форма, Объект); 
	ИначеЕсли Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда 
		Форма.Прочитать();
		
	КонецЕсли;

КонецПроцедуры 
// -- Терлецкий АВ 25.02.18  

Процедура Документ_ЗаказНаПеремещение_Форма_ФормаДокумента_УстановитьИнтервал(Форма)
	
	Элементы = Форма.Элементы;
	ИмяФормы = Форма.ИмяФормы;
	Интервал = Форма["спИнтервал"];
	
	Элементы.Список.Автообновление = Интервал <> 0;
	Элементы.Список.ПериодАвтообновления = Интервал;
	Элементы.Список.Обновить();
	
	спПодключаемыеКомандыВызовСервера.СохранитьИнтервалОбновленияСписка(ИмяФормы, Интервал);

КонецПроцедуры

Асинх Процедура Документ_ЗаказНаПеремещение_Форма_ФормаДокумента_ВыболнитьКоманду_ОтгрузкаТоваров(Форма)
	
	// { Иванов С.С. (TNext) - 26.03.2025 - Задача №1096 
	Если Форма.Объект.Ссылка.Пустая() Или Форма.Модифицированность Тогда
		
		Ответ = Ждать ВопросАсинх(НСтр("ru = 'Для выполнения команды нужно записать документ. Продолжить?'"), РежимДиалогаВопрос.ДаНет);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			Форма.Записать();
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура("Заказ", Форма.Объект.Ссылка);
	ОткрытьФорму("Обработка.спОтгрузкаТоваров.Форма.Форма", ПараметрыФормы, ЭтотОбъект); 
	// }

КонецПроцедуры

Процедура Документ_ЗаказНаПеремещение_Форма_ФормаДокумента_ВыболнитьКоманду_ПодсортССЦ(Форма)
	
	// { Иванов С.С. (TNext) - 26.03.2025 - Задача №1412 
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Отправитель", Форма.Объект.СтруктурнаяЕдиницаРезерв);
	ПараметрыФормы.Вставить("Получатель", Форма.Объект.СтруктурнаяЕдиницаПолучатель);
	ПараметрыФормы.Вставить("Организация", Форма.Объект.Организация); 
	
	ПослеОбработки = Новый ОписаниеОповещения("ВыболнитьКоманду_ПодсортССЦ_Завершение", ЭтотОбъект, Форма);
	
	ОткрытьФорму("Обработка.спПодсортТоваровВМагазинИзЦС.Форма.Форма", ПараметрыФормы, ЭтотОбъект,,,, ПослеОбработки); 
	// }

КонецПроцедуры

Процедура ВыболнитьКоманду_ПодсортССЦ_Завершение(ПодобранныеТовары, Форма) Экспорт
	
	Если ПодобранныеТовары = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Форма.Модифицированность = ПодобранныеТовары.Количество() > 0;
	
	Запасы = Форма.Объект.Запасы;
	
	Для каждого Строка Из ПодобранныеТовары Цикл
		
		НоваяСтрока = Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область Документ_ПеремещениеЗапасов

Процедура Документ_ПеремещениеЗапасов_Форма_ФормаДокумента_ВыболнитьКоманду_ПриемТоваров(Форма)
	
	Объект = Форма.Объект;
	
	Если Форма.Модифицированность Или Объект.Ссылка = ПредопределенноеЗначение("Документ.ПеремещениеЗапасов.ПустаяСсылка") Тогда
		
		Форма.Записать();
		
	КонецЕсли;
	
	Если ЕстьАктОРасхожденияхПриПеремещении(Объект.ЗаказНаПеремещение) Тогда
		
		Оповещение = Новый ОписаниеОповещения("ВыполнитьПослеОкончания", ЭтотОбъект, Форма);
		ПараметрыФормы = Новый Структура("Основание", Объект.Ссылка);
		ОткрытьФорму("Обработка.спПриемкаТоваровПриПеремещенииЗапасов.Форма.Форма", ПараметрыФормы,,
			Истина,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	Иначе	
        
		Текст = НСтр("ru = 'На заказ на перемещение создан Акт  о расхождениях при перемещении'");
	    ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
	
	КонецЕсли;

КонецПроцедуры

Процедура ВыполнитьПослеОкончания(РезультатВопроса, Форма) Экспорт
	
	Форма.Прочитать();
	
КонецПроцедуры 

Функция ЕстьАктОРасхожденияхПриПеремещении(ЗаказНаПеремещение)
	
	Возврат спПодключаемыеКомандыВызовСервера.ЕстьАктОРасхожденияхПриПеремещении(ЗаказНаПеремещение);
	
КонецФункции

#КонецОбласти


#КонецОбласти