#Область ПрограммныйИнтерфейс

// Функция - Получить коннектор
// 
// Возвращаемое значение:
//  WSПрокси, HTTPСоединение - объект соединения с web-сервисом.
//
Функция ПолучитьКоннектор(типКоннектора) Экспорт
	
	коннектор = Неопределено;
	
	Если типКоннектора = Перечисления.спТипыКоннекторов.SOAP Тогда	
		коннектор = ПолучитьWSПрокси();
	Иначе 	
		ЗаписьЖурналаРегистрации("Взаимодействие с адаптером", УровеньЖурналаРегистрации.Ошибка, , , "Не определен тип коннектора");
	КонецЕсли;			
	Возврат коннектор;

КонецФункции

// Функция - Подключить коннектор
// 
// Возвращаемое значение:
//  WSПрокси, HTTPСоединение - объект соединения с web-сервисом.
//
Функция ПодключитьКоннектор(типКоннектора) Экспорт
	
	коннектор = Неопределено;
	
	Если типКоннектора = Перечисления.спТипыКоннекторов.SOAP Тогда	
		коннектор = ПодключитьWSПрокси();
	Иначе 	
		ЗаписьЖурналаРегистрации("Взаимодействие с адаптером", УровеньЖурналаРегистрации.Ошибка, , , "Не определен тип коннектора");
	КонецЕсли;			
	Возврат коннектор;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - Получить WSПрокси
//
// Параметры:
//  Адрес - Строка - строка с адресом web-сервиса. 
// 
// Возвращаемое значение:
// WSПрокси - сформированный объект WSПрокси с по заданному адресу web-сервиса.
//
Функция ПодключитьWSПрокси()
	WSПрокси = Неопределено;
	
	Попытка 		
		Настройки = ПолучитьНастройки();
		
		SSL = Новый ЗащищенноеСоединениеOpenSSL(); 
		
		ИнтернетПрокси = ПолучениеФайловИзИнтернета.ПолучитьПрокси("http");
		WSОпределение = Новый WSОпределения(Настройки.Местоположение, Настройки.ИмяПользователя, Настройки.Пароль, ИнтернетПрокси, 20);
		
		
		WSПрокси = Новый WSПрокси(WSОпределение, Настройки.ПространстваИменСервиса, Настройки.ИмяСервиса, Настройки.ИмяТочкиПодключения,,,SSL);
		WSПрокси.Пользователь = Настройки.ИмяПользователя;
		WSПрокси.Пароль = Настройки.Пароль;
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Взаимодействие с подключением", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось создать подключение по причине: " + ОписаниеОшибки());
	
	КонецПопытки;
	
	Возврат WSПрокси;

КонецФункции


// Функция - Получить WSПрокси
//
// Параметры:
//  Адрес - Строка - строка с адресом web-сервиса. 
// 
// Возвращаемое значение:
// WSПрокси - сформированный объект WSПрокси с по заданному адресу web-сервиса.
//
Функция ПолучитьWSПрокси()
	WSПрокси = Неопределено;
	
	Попытка 
		Настройки = ПолучитьНастройки();

		Адрес = Настройки.Местоположение;
		ПространстваИменСервиса  = Настройки.ПространстваИменСервиса;
	    soapСервис = WSСсылки.WSCreateOrderb2b.ПолучитьWSОпределения().Сервисы[0];
		WSПрокси =  WSСсылки.WSCreateOrderb2b.СоздатьWSПрокси(ПространстваИменСервиса, soapСервис.Имя, soapСервис.ТочкиПодключения[0].Имя, , 120, ЗащищенноеСоединение(Адрес), Адрес);

	Исключение
		
		ЗаписьЖурналаРегистрации("Взаимодействие с подключением", УровеньЖурналаРегистрации.Ошибка, , , "Не удалось создать подключение по причине: " + ОписаниеОшибки());
	
	КонецПопытки;
	
	Возврат WSПрокси;

КонецФункции

// Функция - Получить настройки
// 
// Возвращаемое значение:
//
Функция ПолучитьНастройки() 
	
	Настройки = Новый Структура;  
	
	Настройки.Вставить("ПространстваИменСервиса", 	спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спSOAPПространстваИменСервиса"));
	Настройки.Вставить("ИмяПользователя",			спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спSOAPИмяПользователя"));
	Настройки.Вставить("Пароль",					спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спSOAPПароль"));
	Настройки.Вставить("Местоположение",			спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спSOAPМестоположение"));
	Настройки.Вставить("ИмяСервиса",				спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спSOAPИмяСервиса"));
	Настройки.Вставить("ИмяТочкиПодключения",		спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спSOAPИмяТочкиПодключения"));
	
	Возврат Настройки;
	
КонецФункции

//Функция - защищенное соединение
//
// Параметры:
//  адрес - Строка - строка с адресом сервиса.
// 
// Возвращаемое значение:
// ЗащищенноеСоединениеOpenSSL - сформированный объект ЗащищенноеСоединениеOpenSSL.
//
Функция ЗащищенноеСоединение(Адрес)
	
	Если Лев(НРег(Адрес), 5) = "https" Тогда
		
		Возврат Новый ЗащищенноеСоединениеOpenSSL;
		
	Иначе
		
		Возврат Неопределено;
		
	КонецЕсли;
		
КонецФункции
#КонецОбласти