#Область ОбработчикиСобытийФормы

// ++ Терлецкий АВ №966
&НаСервере
&После("ПриСозданииНаСервере")
Процедура спПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если СтрНайти(ЭтотОбъект.ТаблицаЧековККМ.ТекстЗапроса,"Контрагент") > 0 Тогда 
		НовЭлемент = Элементы.Добавить("ТаблицаЧековККМКонтрагент", Тип("ПолеФормы"), Элементы.ТаблицаЧековККМ);
		НовЭлемент.Вид  = ВидПоляФормы.ПолеНадписи; 
		НовЭлемент.ПутьКДанным = "ТаблицаЧековККМ.Контрагент"; 
		НовЭлемент.Заголовок = "Контрагент"; 
		НовЭлемент.ШрифтЗаголовка = Новый Шрифт(ШрифтыСтиля.КрупныйШрифтТекста); 
	КонецЕсли;
	
	Если СтрНайти(ЭтотОбъект.ТаблицаЧековККМ.ТекстЗапроса,"НомерТелефона") > 0 Тогда 
		НовЭлемент = Элементы.Добавить("ТаблицаЧековККМНомерТелефона", Тип("ПолеФормы"), Элементы.ТаблицаЧековККМ);
		НовЭлемент.Вид  = ВидПоляФормы.ПолеНадписи; 
		НовЭлемент.ПутьКДанным = "ТаблицаЧековККМ.НомерТелефона"; 
		НовЭлемент.Заголовок = "Номер телефона"; 
		НовЭлемент.ШрифтЗаголовка = Новый Шрифт(ШрифтыСтиля.КрупныйШрифтТекста);   
	КонецЕсли;
	
	Если СтрНайти(ЭтотОбъект.ТаблицаЧековККМ.ТекстЗапроса,"ФормаОплаты") > 0 Тогда
		НовЭлемент = Элементы.Вставить("ТаблицаЧековФормаОплаты", Тип("ПолеФормы"), Элементы.ТаблицаЧековККМГруппаОсновныеДанные, Элементы.ТаблицаЧековККМГруппаОсновныеДанные.ПодчиненныеЭлементы["ТаблицаЧековККМСуммаДокумента"]); 
		НовЭлемент.Вид  = ВидПоляФормы.ПолеНадписи; 
		НовЭлемент.ПутьКДанным = "ТаблицаЧековККМ.ФормаОплаты"; 
		НовЭлемент.Заголовок = "Форма оплаты"; 
		НовЭлемент.ШрифтЗаголовка = Новый Шрифт(ШрифтыСтиля.КрупныйШрифтТекста);
	КонецЕсли;
	Если СтрНайти(ЭтотОбъект.ТаблицаЧековККМ.ТекстЗапроса,"КассаККМ") > 0 Тогда
		НовЭлемент = Элементы.Вставить("ТаблицаЧековККМКассаККМ", Тип("ПолеФормы"), Элементы.ТаблицаЧековККМ);
		НовЭлемент.Вид  = ВидПоляФормы.ПолеНадписи; 
		НовЭлемент.ПутьКДанным = "ТаблицаЧековККМ.КассаККМ"; 
		НовЭлемент.Заголовок = "Касса ККМ"; 
		НовЭлемент.ШрифтЗаголовка = Новый Шрифт(ШрифтыСтиля.КрупныйШрифтТекста);
	КонецЕсли;	
КонецПроцедуры 
// -- Терлецкий АВ №966
#КонецОбласти