
#Область ОбработчикиСобытийФормы
 
 &НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Интервал = НаборКонстант.спИнтервалАвтоподсорта;
	
	РегЗадание = РегламентныеЗадания.НайтиПредопределенное(Метаданные.РегламентныеЗадания.спАвтоподсортТоваровВТорговыйЗал);
	
	Если Интервал = 0 Тогда
		
		РегЗадание.Использование = Ложь;
        
	Иначе
		
		ПараметрыРасписания = Новый Структура("ПериодНедель, ПериодПовтораДней, ПериодПовтораВТечениеДня", 1, 1, Интервал * 60);
		
		Расписание = Новый РасписаниеРегламентногоЗадания;
		ЗаполнитьЗначенияСвойств(Расписание, ПараметрыРасписания);
		
		РегЗадание.Расписание = Расписание;
		РегЗадание.Использование = Истина;

	КонецЕсли;
	
	РегЗадание.Записать();
	
КонецПроцедуры

#КонецОбласти