#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТокенДоступаИзменен Тогда
		
		УстановитьПривилегированныйРежим(Истина); 
		ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(ТекущийОбъект.Ссылка, ТекущийОбъект.ТокенДоступа, "ТокенДоступа");
		УстановитьПривилегированныйРежим(Ложь);
		ТекущийОбъект.ТокенДоступа = ?(ЗначениеЗаполнено(ТекущийОбъект.ТокенДоступа), ЭтотОбъект.УникальныйИдентификатор, "");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТокенДоступаПриИзменении(Элемент)
	
	ТокенДоступаИзменен = Истина;
	
КонецПроцедуры

#КонецОбласти