#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Функция ДанныеЗаполненияЗапасов(Знач Запасы, ДокументОснование, Ячейка = Неопределено) Экспорт
	
	Если ТипЗнч(Запасы) = Тип("ТаблицаЗначений") Тогда
		ТаблицаЗапасы = Запасы;
	ИначеЕсли ТипЗнч(Запасы) = Тип("ДанныеФормыКоллекция") Тогда
		ТаблицаЗапасы = Запасы.Выгрузить();
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеЗапасов.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ВТ_Перемещения
		|ИЗ
		|	Документ.ПеремещениеЗапасов КАК ПеремещениеЗапасов
		|ГДЕ
		|	ПеремещениеЗапасов.ДокументОснование = &ДокументОснование
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Запасы.НомерСтроки КАК НомерСтроки,
		|	ВЫРАЗИТЬ(Запасы.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	Запасы.Количество КАК Количество,
		|	Запасы.КоличествоФакт КАК КоличествоФакт,
		|	Запасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&Запасы КАК Запасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗапасыНаСкладахОбороты.Номенклатура КАК Номенклатура,
		|	ЗапасыНаСкладахОбороты.Ячейка КАК Ячейка,
		|	СУММА(ЗапасыНаСкладахОбороты.КоличествоПриход) КАК Принято
		|ПОМЕСТИТЬ ВТ_Принятые
		|ИЗ
		|	РегистрНакопления.ЗапасыНаСкладах.Обороты(
		|			,
		|			,
		|			Регистратор,
		|			Организация = &Организация
		|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|				И Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТ_Запасы.Номенклатура КАК Номенклатура
		|					ИЗ
		|						ВТ_Запасы КАК ВТ_Запасы)) КАК ЗапасыНаСкладахОбороты
		|ГДЕ
		|	ЗапасыНаСкладахОбороты.Регистратор В
		|			(ВЫБРАТЬ
		|				ВТ_Перемещения.Ссылка КАК Ссылка
		|			ИЗ
		|				ВТ_Перемещения КАК ВТ_Перемещения)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗапасыНаСкладахОбороты.Номенклатура,
		|	ЗапасыНаСкладахОбороты.Ячейка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Запасы.Номенклатура.Штрихкод КАК Штрихкод,
		|	МАКСИМУМ(ЕСТЬNULL(ДополнительныеРеквизитыТовара.Значение, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))) КАК Бренд,
		|	ВТ_Запасы.НомерСтроки КАК НомерСтроки,
		|	ВТ_Запасы.Номенклатура КАК Номенклатура,
		|	СУММА(ВТ_Запасы.Количество) КАК Количество,
		|	ВТ_Запасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СУММА(ЕСТЬNULL(ВТ_Принятые.Принято, 0)) КАК Принято,
		|	ВТ_Принятые.Ячейка КАК Ячейка,
		|	СУММА(ВТ_Запасы.КоличествоФакт) КАК КоличествоФакт,
		|	-СУММА(ВТ_Запасы.Количество - ЕСТЬNULL(ВТ_Принятые.Принято, 0) - ВТ_Запасы.КоличествоФакт) КАК Отклонение
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ДополнительныеРеквизитыТовара
		|		ПО (ДополнительныеРеквизитыТовара.Свойство.Имя = ""Свойство_Бренд"")
		|			И ВТ_Запасы.Номенклатура = ДополнительныеРеквизитыТовара.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Принятые КАК ВТ_Принятые
		|		ПО ВТ_Запасы.Номенклатура = ВТ_Принятые.Номенклатура
		|			И (ВТ_Принятые.Ячейка = &Ячейка)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_Запасы.Номенклатура.Штрихкод,
		|	ВТ_Запасы.НомерСтроки,
		|	ВТ_Запасы.Номенклатура,
		|	ВТ_Запасы.ЕдиницаИзмерения,
		|	ВТ_Принятые.Ячейка";
	
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.УстановитьПараметр("Организация", ДокументОснование.Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ДокументОснование.СтруктурнаяЕдиницаПолучатель);
	Запрос.УстановитьПараметр("Ячейка", Ячейка);
	Запрос.УстановитьПараметр("Запасы", ТаблицаЗапасы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса;
	
КонецФункции 

Процедура ЗаполнитьПеремещениеНаОснованииПриемки(Перемещение, ПриемкаТовара) Экспорт

	ЗаполнитьЗначенияСвойств(Перемещение, ПриемкаТовара,, "Номер, Дата");
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спПриемкаТовараЗапасы.Номенклатура КАК Номенклатура,
		|	спПриемкаТовараЗапасы.Ячейка КАК Ячейка,
		|	спПриемкаТовараЗапасы.КоличествоФакт КАК Количество,
		|	спПриемкаТовараЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Документ.спПриемкаТовара.Запасы КАК спПриемкаТовараЗапасы
		|ГДЕ
		|	спПриемкаТовараЗапасы.Ссылка = &ПриемкаТовара
		|	И спПриемкаТовараЗапасы.КоличествоФакт > 0";
	
	Запрос.УстановитьПараметр("ПриемкаТовара", ПриемкаТовара);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЗапасы = РезультатЗапроса.Выгрузить();
	
    Перемещение.Запасы.Загрузить(ТаблицаЗапасы);
	
КонецПроцедуры

Процедура ЗаполнитьАктОРасхожденияхНаОснованииПриемки(АктОРасхождениях, ПриемкаТовара) Экспорт

	ЗаполнитьЗначенияСвойств(АктОРасхождениях, ПриемкаТовара,, "Номер, Дата");
	 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спПриемкаТовараЗапасы.Номенклатура КАК Номенклатура,
		|	спПриемкаТовараЗапасы.Количество КАК КоличествоПлан,
		|	спПриемкаТовараЗапасы.КоличествоФакт КАК КоличествоФакт,
		|	ВЫБОР
		|		КОГДА спПриемкаТовараЗапасы.Отклонение < 0
		|			ТОГДА спПриемкаТовараЗапасы.Отклонение
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Излишек,
		|	ВЫБОР
		|		КОГДА спПриемкаТовараЗапасы.Отклонение > 0
		|			ТОГДА спПриемкаТовараЗапасы.Отклонение
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Недостатча,
		|	спПриемкаТовараЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ИЗ
		|	Документ.спПриемкаТовара.Запасы КАК спПриемкаТовараЗапасы
		|ГДЕ
		|	спПриемкаТовараЗапасы.Ссылка = &ПриемкаТовара
		|	И спПриемкаТовараЗапасы.Отклонение <> 0";
	
	Запрос.УстановитьПараметр("ПриемкаТовара", ПриемкаТовара);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЗапасы = РезультатЗапроса.Выгрузить();
	
    АктОРасхождениях.Запасы.Загрузить(ТаблицаЗапасы);
	
	АктОРасхождениях.ЗаказНаПеремещение = ПриемкаТовара.ДокументОснование;
	АктОРасхождениях.ИтогоИзлишек		= ТаблицаЗапасы.Итог("Излишек");
	АктОРасхождениях.ИтогоНедостача		= ТаблицаЗапасы.Итог("Недостатча");
	
КонецПроцедуры

#Область ГосИС

Функция ОбработатьДанныеШтрихкода(Форма, ДанныеШтрихкода, ПараметрыСканирования,
	ВложенныеШтрихкоды = Неопределено) Экспорт
	
	// Подготовка параметров штрихкода для обработки.
	ПараметрыШтрихкодаДляОбработки = ИнтеграцияИСУНФ.ПараметрыШтрихкодаДляОбработки(Форма,
		ПараметрыСканирования, ДанныеШтрихкода);
	
	РезультатОбработки  = ПараметрыШтрихкодаДляОбработки.РезультатОбработки;
	НастройкиКэша       = ПараметрыШтрихкодаДляОбработки.НастройкиКэша;
	
	Если ДанныеШтрихкода.ВидУпаковки = Перечисления.ВидыУпаковокИС.Логистическая Тогда
		
		ДеревоУпаковок = Неопределено;
		Если ВложенныеШтрихкоды <> Неопределено Тогда
			ДеревоУпаковок = ВложенныеШтрихкоды.ДеревоУпаковок;
		ИначеЕсли ДанныеШтрихкода.Свойство("АдресДереваУпаковок")
			И Не ПустаяСтрока(ДанныеШтрихкода.АдресДереваУпаковок) Тогда
			ДеревоУпаковок = ПолучитьИзВременногоХранилища(ДанныеШтрихкода.АдресДереваУпаковок);
		КонецЕсли;
		
		Если НЕ ДеревоУпаковок = Неопределено Тогда
			ИнтеграцияИСУНФ.ОбработатьДанныеШтрихкодовДереваУпаковок(ДеревоУпаковок,
				ПараметрыШтрихкодаДляОбработки, Форма);
		КонецЕсли;
		
	Иначе
		
		// Подготовка данных штрихкода для обработки.
		ДанныеШтрихкодаДляОбработки = ИнтеграцияИСУНФ.ДанныеШтрихкодаДляОбработки();
		ЗаполнитьЗначенияСвойств(ДанныеШтрихкодаДляОбработки, ДанныеШтрихкода);
		
		ДанныеШтрихкодаДляОбработки.Количество = ИнтеграцияИСУНФ.КоличествоПродукцииПоДаннымШтрихкода(
			ДанныеШтрихкода, ПараметрыСканирования);
		
		Если ДанныеШтрихкодаДляОбработки.ТипУпаковки = Перечисления.ТипыУпаковок.МаркированныйТовар
			И ЗначениеЗаполнено(ДанныеШтрихкодаДляОбработки.ШтрихкодУпаковки) Тогда
			
			ДанныеШтрихкодаУпаковки = Справочники.ШтрихкодыУпаковокТоваров.СтруктураСозданияШтрихкодаУпаковки();
			ЗаполнитьЗначенияСвойств(ДанныеШтрихкодаУпаковки, ДанныеШтрихкода,,
				"ТипУпаковки,ТипШтрихкода,Штрихкод,ХешСуммаНормализации");
			ДанныеШтрихкодаУпаковки.ТипУпаковки = Перечисления.ТипыУпаковок.МонотоварнаяУпаковка;
			ДанныеШтрихкодаУпаковки.ТипШтрихкода = Перечисления.ТипыШтрихкодов.GS1_128;
			ДанныеШтрихкодаУпаковки.Штрихкод = СтрШаблон("(02)%1(37)1", ДанныеШтрихкода.GTIN);
			ДанныеШтрихкодаУпаковки.КоличествоПотребительскихУпаковок = ДанныеШтрихкодаУпаковки.Количество;
			ВложенныеШтрихкодыУпаковки = Новый Массив;
			ВложенныеШтрихкодыУпаковки.Добавить(ДанныеШтрихкодаДляОбработки.ШтрихкодУпаковки);
			МонотоварнаяУпаковка =
				Справочники.ШтрихкодыУпаковокТоваров.ПолучитьДанныеУпаковкиПоЗначениюШтрихкода(ДанныеШтрихкодаУпаковки.Штрихкод);
			Если МонотоварнаяУпаковка = Неопределено Тогда
				МонотоварнаяУпаковка = Справочники.ШтрихкодыУпаковокТоваров.СоздатьШтрихкодУпаковки(ДанныеШтрихкодаУпаковки,
					ВложенныеШтрихкодыУпаковки);
			Иначе
				МонотоварнаяУпаковка = МонотоварнаяУпаковка.Ссылка;
				СерияМонотоварнойУпаковки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(МонотоварнаяУпаковка, "Серия");
				Если ДанныеШтрихкодаУпаковки.Серия <> СерияМонотоварнойУпаковки Тогда
					ИзменяемыеРеквизиты = Новый Структура;
					ИзменяемыеРеквизиты.Вставить("Серия", ДанныеШтрихкодаУпаковки.Серия);
					Справочники.ШтрихкодыУпаковокТоваров.ИзменитьШтрихкодУпаковки(МонотоварнаяУпаковка, ИзменяемыеРеквизиты);
				КонецЕсли;
			КонецЕсли;
			ЗаполнитьЗначенияСвойств(ДанныеШтрихкодаДляОбработки, МонотоварнаяУпаковка);
			ДанныеШтрихкодаДляОбработки.ШтрихкодУпаковки = МонотоварнаяУпаковка;
			ДанныеШтрихкодаДляОбработки.Штрихкод = МонотоварнаяУпаковка.ЗначениеШтрихкода;
			
		КонецЕсли;
		
		ИнтеграцияИСУНФ.ОбработатьДанныеШтрихкодаПотребительскойУпаковки(ДанныеШтрихкодаДляОбработки,
			ПараметрыШтрихкодаДляОбработки, Форма);
		
	КонецЕсли;
	
	ЗаполнитьДанныеДобавленныхИзмененныхСтрок(Форма, РезультатОбработки);
	
	ПроверкаИПодборПродукцииИС.ЗаполнитьКешШтрихкодовУпаковок(Форма, НастройкиКэша);
	ПроверкаИПодборПродукцииИС.ПрименитьКешШтрихкодовУпаковок(Форма, НастройкиКэша);
	ШтрихкодированиеИС.ОбновитьКэшМаркируемойПродукции(Форма);
	
	Возврат РезультатОбработки;
	
КонецФункции

Процедура ЗаполнитьДанныеДобавленныхИзмененныхСтрок(Форма, Результат)
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Форма, "Объект") Тогда
		Объект = Форма.Объект;
	Иначе
		Объект = Форма;
	КонецЕсли;
	
	СтрокиДляОбработки = Новый Массив;
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокиДляОбработки, Результат.ДобавленныеСтроки, Истина);
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(СтрокиДляОбработки, Результат.ИзмененныеСтроки, Истина);
	
	СлужебныеРеквизиты = Новый Структура;
	СлужебныеРеквизиты.Вставить("МаркируемаяПродукция");
	СлужебныеРеквизиты.Вставить("ВидПродукцииИС");
	СлужебныеРеквизиты.Вставить("КоэффициентЕдиницыИзмеренияГосИС");
	СлужебныеРеквизиты.Вставить("КоличествоВБазовыхЕдиницахГосИС");
	СлужебныеРеквизиты.Вставить("РазрешенОборотНемаркированныхОстатков");
	СлужебныеРеквизиты.Вставить("ДействуетКонтрольОборотаМарок");
	Для Каждого СтрокаДляОбработки Из СтрокиДляОбработки Цикл
		НоменклатураВДокументахСервер.ЗаполнитьДанныеВСтрокеТабличнойЧасти(Объект,
			Форма.КэшДанныхГОСИС.ИмяТабличнойЧасти, СтрокаДляОбработки);
		ПараметрыСканирования = ШтрихкодированиеОбщегоНазначенияИС.ПараметрыСканирования(Форма);
		ИнтеграцияИСУНФКлиентСервер.ЗаполнитьСлужебныеРеквизитыСтроки(Форма, СтрокаДляОбработки,
			ПараметрыСканирования, СлужебныеРеквизиты);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
