
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения,, "Номер, Дата");
		ДокументОснование = ДанныеЗаполнения;
		
		//++ Tnext ivai 08.10.2025
		//Запасы.Загрузить(ДанныеЗаполнения.Запасы.Выгрузить());
		ТЗЗапасы = ДанныеЗаполнения.Запасы.Выгрузить();
		ТЗЗапасы.Свернуть("Номенклатура, Характеристика, ЕдиницаИзмерения", "Количество, КоличествоСобрано");
		Запасы.Загрузить(ТЗЗапасы);
		//-- Tnext ivai
		
		ДанныеЗаполненияЗапасов = Документы.спПриемкаТовара.ДанныеЗаполненияЗапасов(Запасы.Выгрузить(), ДокументОснование, Ячейка);
		Запасы.Загрузить(ДанныеЗаполненияЗапасов.Выгрузить());
		
		ВидЦены = Справочники.ВидыЦен.ПолучитьОсновнойВидЦенПродажи();
		ШаблонЦенникаЭтикетки = спУправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("спШаблонЦенникаПоУмолчанию");
		Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ДокументОснование = Документы.ЗаказНаПеремещение.ПустаяСсылка();
	СтатусДокумента = Перечисления.спСтатусыПриемкиТоваров.ВРаботе;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
