
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница1;
	Элементы.СтраницыВвода.ТекущаяСтраница = Элементы.СтраницаВводимоеЧисло;
	
	ТекущийЭлемент = Элементы.ПолеВводимоеЧисло;
	
	ОбщегоНазначенияИСПереопределяемый.НастроитьПодключаемоеОборудование(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	КодСтраны = "7";
	РежимПоискаКарты = 1;
	
	КомандаСтереть(Неопределено);
	УстановитьФокусВвода();
	
	maxma_ИнтеграцияССервисомКлиент.УстановитьМаскуНомераТелефона(ЭтаФорма);
	
	// ПодключаемоеОборудование
	ОповещенияПриПодключении = Новый ОписаниеОповещения("ПодключитьОборудованиеЗавершение", ЭтотОбъект);
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(ОповещенияПриПодключении, ЭтотОбъект, "СканерШтрихкода, СчитывательМагнитныхКарт");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если Источник = "ПодключаемоеОборудование"
		И ВводДоступен() Тогда
		Если ИмяСобытия = "TracksData" Тогда
			ВводимоеЧисло = Параметр[0];
		ИначеЕсли ИмяСобытия = "ScanData" Тогда
			Если Параметр[1] = Неопределено Тогда
				ВводимоеЧисло = Параметр[0];
			Иначе
				ВводимоеЧисло = Параметр[1][1];
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если ВводДоступен() Тогда
		
		ОписаниеСобытия = Новый Структура;
		ОписаниеСобытия.Вставить("Источник", Источник);
		ОписаниеСобытия.Вставить("Событие",  Событие);
		ОписаниеСобытия.Вставить("Данные",   Данные);
		
		ОписаниеОшибки  = "";
		
		Результат = МенеджерОборудованияКлиент.ПолучитьСобытиеОтУстройства(ОписаниеСобытия, ОписаниеОшибки);  
		
		Если Результат = Неопределено Тогда 
			ЗаголовокСообщения = НСтр("ru = 'При обработке внешнего события от устройства произошла ошибка:'");
			Сообщить(ЗаголовокСообщения);
		Иначе
			ОбработкаОповещения(Результат.ИмяСобытия, Результат.Параметр, Результат.Источник);
		КонецЕсли;
		
	Иначе
		ОписаниеОшибки  = "Ошибка. Ввод не доступен";
		ЗаголовокСообщения = НСтр("ru = 'При обработке внешнего события от устройства произошла ошибка:'");
		Сообщить(ЗаголовокСообщения);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура КодСтраныПриИзменении(Элемент)
	
	СтруктураМаски = maxma_ИнтеграцияССервисомВызовСервера.ПолучитьМаскуНомераТелефона(КодСтраны);
	
	Элементы.КодТелефона.Маска         = СтруктураМаски.КодТелефона;
	Элементы.НомерТелефонаЧасть1.Маска = СтруктураМаски.НомерТелефонаЧасть1;
	Элементы.НомерТелефонаЧасть2.Маска = СтруктураМаски.НомерТелефонаЧасть2;
	Элементы.НомерТелефонаЧасть3.Маска = СтруктураМаски.НомерТелефонаЧасть3;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Команда0(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда0ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("0")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("1")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда2ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("2")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда3ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("3")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда4ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("4")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда5ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("5")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда6ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("6")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда7ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("7")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда8ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("8")
	
КонецПроцедуры

&НаКлиенте
Процедура Команда9ПраваяКлавиатура(Команда)
	
	ДобавитьЦифру("9")
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтереть(Команда)
	ВводимоеЧисло = "";
	КодТелефона = "";
	НомерТелефонаЧасть1 = "";
	НомерТелефонаЧасть2 = "";
	НомерТелефонаЧасть3 = "";
	Если РежимПоискаКарты = 1 Тогда
		ПервыйВвод = Истина;
	Иначе
		ПервыйВвод = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаEnter(Команда)
	
	ЗакрытьСПередачейРезультата();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийПодключаемогоОборудования

&НаКлиенте
Процедура ПодключитьОборудованиеЗавершение(РезультатВыполнения, Параметры) Экспорт
	
	Если Не РезультатВыполнения.Результат Тогда
		ЗаголовокИнформации = НСтр("ru = 'При подключении оборудования произошла ошибка:'");
		ТекстИнформации     = РезультатВыполнения.ОписаниеОшибки;
		maxma_ИнтеграцияССервисомКлиент.ВывестиИнформациюРМКУправляемой(ЗаголовокИнформации, ТекстИнформации);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПоискаПоШтрихкоду(Штрихкод, ДополнительныеПараметры) Экспорт
	
	Если НЕ ПустаяСтрока(Штрихкод) Тогда
		ВводимоеЧисло = Штрихкод;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеПоискаПоМагнитномуКоду(ТекКод, ДополнительныеПараметры) Экспорт
	
	Если Не ПустаяСтрока(ТекКод) Тогда
		ВводимоеЧисло = ТекКод;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДобавитьЦифру(ВведеннаяЦифраСтрокой)
	
	Если ПервыйВвод Тогда
		ВводимоеЧисло = "";
		КодТелефона = "";
		НомерТелефонаЧасть1 = "";
		НомерТелефонаЧасть2 = "";
		НомерТелефонаЧасть3 = "";
		ПервыйВвод = Ложь;
	КонецЕсли;
	Если РежимПоискаКарты = 1 Тогда
		Если СтрДлина(КодТелефона) = СтрДлина(СтруктураМаски.КодТелефона) Тогда
			Если СтрДлина(НомерТелефонаЧасть1) = СтрДлина(СтруктураМаски.НомерТелефонаЧасть1) Тогда
				Если СтрДлина(НомерТелефонаЧасть2) = СтрДлина(СтруктураМаски.НомерТелефонаЧасть2) Тогда
					НомерТелефонаЧасть3 = НомерТелефонаЧасть3 + ВведеннаяЦифраСтрокой;
					Если СтрДлина(НомерТелефонаЧасть3) = СтрДлина(СтруктураМаски.НомерТелефонаЧасть3) Тогда
						ТекущийЭлемент = Элементы.КомандаEnter;
					КонецЕсли;
				Иначе
					НомерТелефонаЧасть2 = НомерТелефонаЧасть2 + ВведеннаяЦифраСтрокой;
				КонецЕсли;
			Иначе
				НомерТелефонаЧасть1 = НомерТелефонаЧасть1 + ВведеннаяЦифраСтрокой;
			КонецЕсли;
		Иначе
			КодТелефона = КодТелефона + ВведеннаяЦифраСтрокой;
		КонецЕсли;
		ВводимоеЧисло = КодСтраны + КодТелефона + НомерТелефонаЧасть1 + НомерТелефонаЧасть2 + НомерТелефонаЧасть3;
	Иначе
		ВводимоеЧисло = ВводимоеЧисло + ВведеннаяЦифраСтрокой;
		ТекущийЭлемент = Элементы.ПолеВводимоеЧисло;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСПередачейРезультата()
	
	СтруктураОтвета = Новый Структура;
	
	СтруктураОтвета.Вставить("ВведенноеЧисло", ВводимоеЧисло);
	
	Если РежимПоискаКарты = 1 Тогда
		СтруктураОтвета.Вставить("РежимПоискаКарты", "НомерТелефона");
	Иначе
		СтруктураОтвета.Вставить("РежимПоискаКарты", "КодКарты");
	КонецЕсли;
	
	СтруктураОтвета.Вставить("КодСтраны", КодСтраны);
	
	Закрыть(СтруктураОтвета);
	
КонецПроцедуры

&НаКлиенте
Процедура РежимПоискаКартыПриИзменении(Элемент)
	КомандаСтереть(Неопределено);
	УстановитьФокусВвода();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФокусВвода()
	
	Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраница1;
	Если РежимПоискаКарты =1 Тогда
		ТекущийЭлемент = Элементы.Команда9;
		Элементы.СтраницыВвода.ТекущаяСтраница = Элементы.СтраницаТелефон;
	Иначе
		Элементы.СтраницыВвода.ТекущаяСтраница = Элементы.СтраницаВводимоеЧисло;
		ТекущийЭлемент = Элементы.ПолеВводимоеЧисло;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаТипПоиска(Команда)
	
	КомандаСтереть(Неопределено);
	Если РежимПоискаКарты >= 3 Тогда
		РежимПоискаКарты = 0;
	Иначе
		РежимПоискаКарты = РежимПоискаКарты + 1;
	КонецЕсли;
	
	УстановитьФокусВвода();
	
КонецПроцедуры

#КонецОбласти