  
#Область ПрограммныйИнтерфейс

Функция ЗапросПоПараметрамДанных(ПараметрыЗапроса, ИмяТаблицы, ВыбираемыеПоля = "Ссылка") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СхемаЗапроса = Новый СхемаЗапроса;
	ПакетЗапросов = СхемаЗапроса.ПакетЗапросов[0];
	ОператорПакетаЗапросов = ПакетЗапросов.Операторы[0];
	
	СоставИмениТаблицы = СтрРазделить(ИмяТаблицы, ".");
	
	Таблица = "таб" + СоставИмениТаблицы[1];
	ИсточникЗапроса = ОператорПакетаЗапросов.Источники.Добавить(ИмяТаблицы, Таблица);
	
	ОператорПакетаЗапросов.ВыбираемыеПоля.Добавить(Таблица + "." + ВыбираемыеПоля);
	
	Запрос = Новый Запрос;
	
	Для каждого ПараметрЗапроса Из ПараметрыЗапроса Цикл
	
		ОператорПакетаЗапросов.Отбор.Добавить(Таблица + "." + ПараметрЗапроса.Ключ + " = &" + ПараметрЗапроса.Ключ);
		Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
	
	КонецЦикла; 
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса(); 
	Возврат Запрос.Выполнить().Выбрать();
	
КонецФункции

Процедура ДобавитьДополнительныйРеквизит(Объект, Данные) Экспорт
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("ИдентификаторДляФормул", Данные.ИдентификаторДляФормул);
	
	Выборка = ЗапросПоПараметрамДанных(ПараметрыЗапроса, "ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения");
	Если Выборка.Следующий() Тогда
		
		Свойство = Выборка.Ссылка;
		
		СтрокаРеквизита = Объект.ДополнительныеРеквизиты.Найти(Свойство, "Свойство");
		Если СтрокаРеквизита = Неопределено Тогда
			СтрокаРеквизита = Объект.ДополнительныеРеквизиты.Добавить();
			СтрокаРеквизита.Свойство = Свойство;
		КонецЕсли;
		
		СтрокаРеквизита.Значение = Данные.Значение;
		
	КонецЕсли;
	
КонецПроцедуры 

#КонецОбласти
