#Область ОбработчикиСобытийФормы

&НаСервере
Процедура спВистерияПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("НоменклатураПоставщика") И ТипЗнч(Параметры.НоменклатураПоставщика) = Тип("Структура") 
		И Параметры.НоменклатураПоставщика.Свойство("Номенклатура") И Параметры.НоменклатураПоставщика.Номенклатура.Количество() > 0 Тогда
		
		ДанныеЗаполнения = ПолучитьДанныеЗаполнения(Параметры.НоменклатураПоставщика.Номенклатура);
		  
		  Если ТипЗнч(ДанныеЗаполнения) = Тип("ТаблицаЗначений") Тогда  
			  ЗаполнитьНоменклатуруПоставщика(ДанныеЗаполнения, Параметры.НоменклатураПоставщика);	
			  
			  СтруктураПолей = Новый Структура;
			  СтруктураПолей.Вставить("Штрихкод");
			  СтруктураПолей.Вставить("Шаблоны");
			  ЗаполнитьПоляТаблицы(СтруктураПолей);
		  КонецЕсли;
	КонецЕсли;  
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьДанныеЗаполнения(Номенклатура)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураПереопределяемый.Ссылка КАК Ссылка,
		|	НоменклатураПереопределяемый.Ссылка КАК Номенклатура,
		|	НоменклатураПереопределяемый.ПометкаУдаления КАК ПометкаУдаления,
		|	ЛОЖЬ КАК ПрямойАналог,
		|	НоменклатураПереопределяемый.Код КАК Код,
		|	НоменклатураПереопределяемый.Наименование КАК Наименование,
		|	НоменклатураПереопределяемый.Артикул КАК Артикул,
		|	НоменклатураПереопределяемый.ДатаИзменения КАК ДатаИзменения,
		|	ЕСТЬNULL(НоменклатураПереопределяемый.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) КАК ЕдиницаИзмерения,
		|	1 КАК Коэффициент,
		|	НоменклатураПереопределяемый.МетодОценки КАК МетодОценки,
		|	ВЫРАЗИТЬ(НоменклатураПереопределяемый.НаименованиеПолное КАК СТРОКА(1000)) КАК НаименованиеПолное,
		|	НоменклатураПереопределяемый.НаправлениеДеятельности КАК НаправлениеДеятельности,
		|	НоменклатураПереопределяемый.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
		|	НоменклатураПереопределяемый.Поставщик КАК Поставщик,
		|	НоменклатураПереопределяемый.Склад КАК Склад,
		|	НоменклатураПереопределяемый.СпособПополнения КАК СпособПополнения,
		|	НоменклатураПереопределяемый.СрокПополнения КАК СрокПополнения,
		|	НоменклатураПереопределяемый.ВидСтавкиНДС КАК ВидСтавкиНДС,
		|	ЗНАЧЕНИЕ(Справочник.СтавкиНДС.ПустаяСсылка) КАК СтавкаНДСНоменклатуры,
		|	НоменклатураПереопределяемый.СчетУчетаЗапасов КАК СчетУчетаЗапасов,
		|	НоменклатураПереопределяемый.СчетУчетаЗатрат КАК СчетУчетаЗатрат,
		|	НоменклатураПереопределяемый.СчетУчетаНДСПоПриобретеннымЦенностям КАК СчетУчетаНДСПоПриобретеннымЦенностям,
		|	НоменклатураПереопределяемый.СчетУчетаНДСПоРеализации КАК СчетУчетаНДСПоРеализации,
		|	НоменклатураПереопределяемый.ТипНоменклатуры КАК ТипНоменклатуры,
		|	НоменклатураПереопределяемый.Ячейка КАК Ячейка,
		|	НоменклатураПереопределяемый.ЦеноваяГруппа КАК ЦеноваяГруппа,
		|	НоменклатураПереопределяемый.ИспользоватьХарактеристики КАК ИспользоватьХарактеристики,
		|	НоменклатураПереопределяемый.ИспользоватьПартии КАК ИспользуетсяРезервирование,
		|	НоменклатураПереопределяемый.ИспользоватьПартии КАК ИспользоватьПартии,
		|	НоменклатураПереопределяемый.Недействителен КАК Недействителен,
		|	НоменклатураПереопределяемый.СрокИсполненияЗаказа КАК СрокИсполненияЗаказа,
		|	НоменклатураПереопределяемый.НормаВремени КАК НормаВремени,
		|	НоменклатураПереопределяемый.ФиксированнаяСтоимость КАК ФиксированнаяСтоимость,
		|	НоменклатураПереопределяемый.СтранаПроисхождения КАК СтранаПроисхождения,
		|	НоменклатураПереопределяемый.ВидАлкогольнойПродукции КАК ВидАлкогольнойПродукции,
		|	НоменклатураПереопределяемый.ИмпортнаяАлкогольнаяПродукция КАК ИмпортнаяАлкогольнаяПродукция,
		|	НоменклатураПереопределяемый.ПроизводительИмпортерАлкогольнойПродукции КАК ПроизводительИмпортерАлкогольнойПродукции,
		|	НоменклатураПереопределяемый.Вес КАК Вес,
		|	НоменклатураПереопределяемый.Объем КАК Объем,
		|	НоменклатураПереопределяемый.ОбъемДАЛ КАК ОбъемДАЛ,
		|	ПОДСТРОКА(НоменклатураПереопределяемый.Комментарий, 1, 1000) КАК Комментарий,
		|	ВЫБОР
		|		КОГДА НоменклатураПереопределяемый.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Запас)
		|			ТОГДА 0
		|		ИНАЧЕ 2
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НоменклатураПереопределяемый.ИспользоватьХарактеристики
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НоменклатураПереопределяемый.ПометкаУдаления
		|			ТОГДА 4
		|		ИНАЧЕ 0
		|	КОНЕЦ + ВЫБОР
		|		КОГДА НоменклатураПереопределяемый.ЭтоНабор
		|			ТОГДА 8
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ВариантКартинки,
		|	0 КАК Цена,
		|	ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка) КАК ВалютаЦены,
		|	ВЫРАЗИТЬ("""""""" КАК СТРОКА(3)) КАК ВалютаЦеныПредставление,
		|	ЕСТЬNULL(Остатки.Количество, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(Остатки.Резерв, 0) КАК Резерв,
		|	НоменклатураПереопределяемый.ИспользоватьСерииНоменклатуры КАК ИспользоватьСерииНоменклатуры,
		|	НоменклатураПереопределяемый.ГарантийныйСрок КАК ГарантийныйСрок,
		|	НоменклатураПереопределяемый.ВыписыватьГарантийныйТалон КАК ВыписыватьГарантийныйТалон,
		|	НоменклатураПереопределяемый.ЭтоНабор КАК ЭтоНабор,
		|	0 КАК ЕстьФайлы,
		|	0 КАК КартинкаОстатки,
		|	0 КАК КартинкаКорзина,
		|	НоменклатураПереопределяемый.ПроверятьЗаполнениеПартий КАК ПроверятьЗаполнениеПартий,
		|	НоменклатураПереопределяемый.ПроверятьЗаполнениеХарактеристики КАК ПроверятьЗаполнениеХарактеристики,
		|	НоменклатураПереопределяемый.Родитель КАК Группа,
		|	НоменклатураПереопределяемый.Номинал КАК Номинал,
		|	НоменклатураПереопределяемый.Весовой КАК Весовой,
		|	НоменклатураПереопределяемый.ЗапретитьВводДробногоКоличества КАК ЗапретитьВводДробногоКоличества
		|ИЗ
		|	Справочник.Номенклатура КАК НоменклатураПереопределяемый
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ОстаткиТоваров.Номенклатура КАК Номенклатура,
		|			СУММА(ОстаткиТоваров.Количество) КАК Количество,
		|			СУММА(ОстаткиТоваров.Резерв) КАК Резерв
		|		ИЗ
		|			РегистрСведений.ОстаткиТоваров КАК ОстаткиТоваров
		|		
		|		СГРУППИРОВАТЬ ПО
		|			ОстаткиТоваров.Номенклатура) КАК Остатки
		|		ПО НоменклатураПереопределяемый.Ссылка = Остатки.Номенклатура
		|ГДЕ
		|	НоменклатураПереопределяемый.Ссылка В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Возврат РезультатЗапроса.Выгрузить();
	КонецЕсли;

	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура ЗаполнитьНоменклатуруПоставщика(ДанныеЗаполнения, НоменклатураПоставщика) 
	Если НоменклатураПоставщика.Свойство("СоответствиеНоменклатураХарактеристика") Тогда 
		СоответствиеНоменклатураХарактеристика = НоменклатураПоставщика.СоответствиеНоменклатураХарактеристика;
	КонецЕсли; 
	
	Для Каждого СтрокаЗагрузки Из ДанныеЗаполнения Цикл  
		Если ТипЗнч(СоответствиеНоменклатураХарактеристика) = Тип("Соответствие") Тогда 
			
			ПоискПоСоответствию = СоответствиеНоменклатураХарактеристика.Получить(СтрокаЗагрузки.Номенклатура);
			
			Если ТипЗнч(ПоискПоСоответствию) = Тип("Массив") И ПоискПоСоответствию.Количество() > 0 Тогда
				Для каждого ЗначениеПоиска  Из ПоискПоСоответствию Цикл
					ЗаполнитьНовуюСтроку(СтрокаЗагрузки, ЗначениеПоиска) 
				КонецЦикла;
			Иначе 
				ЗаполнитьНовуюСтроку(СтрокаЗагрузки); 
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры 

Процедура ЗаполнитьНовуюСтроку(СтрокаЗагрузки, ЗначениеПоиска = Неопределено)  
	НоваяСтрока = Объект.Товары.Добавить();
	ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗагрузки);
	НоваяСтрока.КоличествоЦенников = 1;
	НоваяСтрока.КоличествоЭтикеток = 1;
	НоваяСтрока.ОстатокНаСкладе = СтрокаЗагрузки.КоличествоОстаток; 
	Если ЗначениеПоиска <> Неопределено Тогда 
		НоваяСтрока.Характеристика = ЗначениеПоиска;   
	КонецЕсли;
КонецПроцедуры   

#КонецОбласти
 

