
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Информация") Тогда 
        Информация = Параметры.Информация;
	КонецЕсли;
	
	Если Параметры.Свойство("Документ") Тогда 
		Документ = Параметры.Документ;
	КонецЕсли;  
	
	Если Параметры.Свойство("Номенклатура") Тогда 
		Номенклатура = Параметры.Номенклатура;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере() 
	
	Если ЗначениеЗаполнено(Информация) И Номенклатура Тогда
		Данные.Очистить();
		ИнформацияСообщения = ДесериализоватьИзJSON(Информация);
		ТабличныйДокумент = ВывестиОшибкиНоменклатурыВТабличныйДокумент(ИнформацияСообщения); 
		Если ТабличныйДокумент <> Неопределено Тогда
			ВыводитьТабличныйДокумент = Истина;
			Данные.Вывести(ТабличныйДокумент);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Информация) И Документ Тогда  
		Данные.Очистить();
		ИнформацияСообщения = ДесериализоватьИзJSON(Информация);
		ТабличныйДокумент = ВывестиОшибкиДокументВТабличныйДокумент(ИнформацияСообщения);
		Если ТабличныйДокумент <> Неопределено Тогда
			ВыводитьТабличныйДокумент = Истина;
			Данные.Вывести(ТабличныйДокумент);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	Отказ = НЕ ВыводитьТабличныйДокумент; 
КонецПроцедуры

&НаСервере
Функция ДесериализоватьИзJSON(СтрокаJSON, ПоляДата = "")
    
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
    Значение = ПрочитатьJSON(ЧтениеJSON,, ПоляДата, ФорматДатыJSON.ISO);          
    ЧтениеJSON.Закрыть();
    Возврат Значение;
    
КонецФункции 

&НаСервере
Функция ВывестиОшибкиДокументВТабличныйДокумент(ИнформацияСообщения) Экспорт
	ОшибкаФайла = Ложь;
	
	ТабДок = Новый ТабличныйДокумент; 
	
	Макет = Обработки.спОтправкаСообщений.ПолучитьМакет("ОшибкиДокумент");
	Область = Макет.ПолучитьОбласть("Заголовок"); 
	ТабДок.Вывести(Область); 
	
	
	Если ИнформацияСообщения.Сервис.messageDate = Ложь 
		ИЛИ ИнформацияСообщения.Сервис.messageId = Ложь
		ИЛИ ИнформацияСообщения.Сервис.shop = Ложь
		ИЛИ ИнформацияСообщения.Сервис.token = Ложь Тогда 
		Область = Макет.ПолучитьОбласть("ОшибкиСервис");
		ТабДок.Вывести(Область);
		ОшибкаФайла = Истина;
		
	КонецЕсли; 
	
	Если ИнформацияСообщения.Сервис.messageDate = Ложь Тогда 
		Область = Макет.ПолучитьОбласть("ОшибкаmessageDate");
		Область.Параметры.messageDate = СтрШаблон("%1", "Не задано значение реквизита «Дата сообщения»");
		ТабДок.Вывести(Область); 
		ОшибкаФайла = Истина;
	КонецЕсли;
	
	Если ИнформацияСообщения.Сервис.messageId = Ложь Тогда 
		Область = Макет.ПолучитьОбласть("ОшибкаmessageId");
		Область.Параметры.messageId = СтрШаблон("%1", "Не задано значение реквизита «Id сообщения»");
		ТабДок.Вывести(Область); 
		ОшибкаФайла = Истина;
	КонецЕсли;
	
	Если ИнформацияСообщения.Сервис.shop= Ложь Тогда 
		Область = Макет.ПолучитьОбласть("Ошибкаshop");
		Область.Параметры.shop = СтрШаблон("%1", "Не задано значение реквизита «shop»");
		ТабДок.Вывести(Область);
		ОшибкаФайла = Истина;
	КонецЕсли;
	
	Если ИнформацияСообщения.Сервис.token = Ложь Тогда 
		Область = Макет.ПолучитьОбласть("Ошибкаtoken");
		Область.Параметры.token = СтрШаблон("%1", "Не задано значение реквизита «token»");
		ТабДок.Вывести(Область); 
		ОшибкаФайла = Истина;
	КонецЕсли;
	
	
	Товары = Новый Массив;
	Для каждого ЭлементТовара Из ИнформацияСообщения.Товары Цикл 
		Ошибка = Ложь;
		Товар = Новый Структура("Гуид, Ean, Количество, Размер, Цена");
		
		Если ЭлементТовара.Гуид = Ложь ИЛИ ЭлементТовара.Ean = Ложь ИЛИ ЭлементТовара.Количество = Ложь 
			ИЛИ ЭлементТовара.Размер = Ложь ИЛИ ЭлементТовара.Цена = Ложь Тогда 
			
			Товар.Вставить("Гуид", 			ЭлементТовара.Гуид);
			Товар.Вставить("Ean", 			ЭлементТовара.Ean); 
			Товар.Вставить("Количество", 	ЭлементТовара.Количество); 
			Товар.Вставить("Размер", 		ЭлементТовара.Размер);
			Товар.Вставить("Цена", 			ЭлементТовара.Цена);
			Ошибка = Истина;
		КонецЕсли;  
		
		Если Ошибка Тогда 
			Товары.Добавить(Товар);
			ОшибкаФайла = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Товары.Количество() > 0 Тогда
		ОшибкиТовара = Макет.ПолучитьОбласть("ОшибкиТовара"); 
		ТабДок.Вывести(ОшибкиТовара); 
		
		Для каждого ЭлементТовары Из Товары Цикл
			Если ЭлементТовары.Гуид = Ложь ИЛИ ЭлементТовары.Ean = Ложь ИЛИ ЭлементТовары.Количество = Ложь ИЛИ ЭлементТовары.Размер = Ложь ИЛИ ЭлементТовары.Цена = Ложь Тогда
				
				НоменклатураГуид = Неопределено;	
				Если ЭлементТовары.Гуид <> Ложь Тогда 
					ОшибкаТовараТовар = Макет.ПолучитьОбласть("ОшибкаТовараТовар");
					Попытка 
						НоменклатураГуид = Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(ЭлементТовары.Гуид));
						ОшибкаТовараТовар.Параметры.Номенклатура = НоменклатураГуид;
					Исключение
					КонецПопытки;
				КонецЕсли;
				
				Если ЭлементТовары.Размер <> Ложь И НоменклатураГуид <> Неопределено Тогда
					Попытка 
						ОшибкаТовараТовар.Параметры.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ЭлементТовары.Размер));
					Исключение
					КонецПопытки;
				КонецЕсли;
				ТабДок.Вывести(ОшибкаТовараТовар);
				
				
				Если ЭлементТовары.Гуид = Ложь Тогда 
					ОшибкаНоменклатура = Макет.ПолучитьОбласть("ОшибкаНоменклатура");
					ОшибкаНоменклатура.Параметры.Номенклатура = СтрШаблон("%1", "Не задано значение реквизита «Номенклатура»");
					ТабДок.Вывести(ОшибкаНоменклатура); 
				КонецЕсли;
				
				Если ЭлементТовары.Ean  = Ложь Тогда 
					ОшибкаEan = Макет.ПолучитьОбласть("ОшибкаEan");
					ОшибкаEan.Параметры.Ean = СтрШаблон("%1", "Не задано значение реквизита «Ean");
					ТабДок.Вывести(ОшибкаEan);
				КонецЕсли;
				
				Если ЭлементТовары.Количество = Ложь Тогда 
					ОшибкаКоличество = Макет.ПолучитьОбласть("ОшибкаКоличество");
					ОшибкаКоличество.Параметры.Количество = СтрШаблон("%1", "Не задано значение реквизита «Количество»");
					ТабДок.Вывести(ОшибкаКоличество);
				КонецЕсли;
				
				Если ЭлементТовары.Размер = Ложь Тогда 
					ОшибкаРазмер = Макет.ПолучитьОбласть("ОшибкаРазмер");
					ОшибкаРазмер.Параметры.Размер = СтрШаблон("%1", "Не задано значение реквизита «Размер»");
					ТабДок.Вывести(ОшибкаРазмер); 
					
				КонецЕсли;
				
				
				Если ЭлементТовары.Цена = Ложь Тогда 
					ОшибкаЦена = Макет.ПолучитьОбласть("ОшибкаЦена");
					ОшибкаЦена.Параметры.Цена = СтрШаблон("%1", "Не задано значение реквизита «Цена»");
					ТабДок.Вывести(ОшибкаЦена);
				КонецЕсли;
				
			КонецЕсли;
						
		КонецЦикла;	
	КонецЕсли;
	
	Если НЕ ОшибкаФайла Тогда 
		Возврат Неопределено;
	Иначе 
		Возврат ТабДок;
	КонецЕсли;
КонецФункции

&НаСервере
Функция ВывестиОшибкиНоменклатурыВТабличныйДокумент(ИнформацияСообщения) Экспорт
    ОшибкаФайла = Ложь;
 
	ТабДок = Новый ТабличныйДокумент; 
	
	Макет = Обработки.спОтправкаСообщений.ПолучитьМакет("ОшибкиНоменклатура");
	
	Область = Макет.ПолучитьОбласть("Заголовок"); 
	ТабДок.Вывести(Область); 
	
	Цены = Новый Массив;
	ВалютаЦены = Новый Массив; 
	
	Если ИнформацияСообщения.Цены.Количество() > 0 Тогда  
		
		Для каждого СтрокаЦены Из ИнформацияСообщения.Цены Цикл 
			Если СтрокаЦены.Гуид = Ложь ИЛИ СтрокаЦены.Наименование = Ложь Тогда 
				Цена = Новый Структура("Гуид, Наименование"); 
				Цена.Вставить("Гуид", 			СтрокаЦены.Гуид);
				Цена.Вставить("Наименование", 	СтрокаЦены.Наименование);
				Цены.Добавить(Цена);
			КонецЕсли; 
			
			Если СтрокаЦены.Валюта = Ложь И (СтрокаЦены.Гуид <> Ложь И СтрокаЦены.Наименование <> Ложь) Тогда 
				Валюта = Новый Структура("Валюта, Гуид, Наименование"); 
				Валюта.Вставить("Валюта", 			СтрокаЦены.Валюта);
				Валюта.Вставить("Гуид", 			СтрокаЦены.Гуид);
				Валюта.Вставить("Наименование", 	СтрокаЦены.Наименование);
				ВалютаЦены.Добавить(Валюта);
			КонецЕсли;
			
		КонецЦикла; 
	Иначе
		Цены.Добавить(Новый Структура("ТипыЦенНеЗаполнены", Истина));
		ОшибкаФайла = Истина
	КонецЕсли;
	
	ОбластьОшибкиЦеныНоменклатуры = Ложь;
	Если Цены.Количество() > 0 Тогда 
		ОбластьОшибкиЦеныНоменклатуры = Истина;

		Область = Макет.ПолучитьОбласть("ОшибкиЦеныНоменклатуры");
		ТабДок.Вывести(Область);
		
		Область = Макет.ПолучитьОбласть("ОшибкаЦены");
		Область.Параметры.Наименование = СтрШаблон("%1","Не найдено значение «Типы цен номенклатуры");
		ТабДок.Вывести(Область);
	КонецЕсли;
	
	Если ВалютаЦены.Количество() > 0 Тогда 
		Если Не ОбластьОшибкиЦеныНоменклатуры Тогда 
			Область = Макет.ПолучитьОбласть("ОшибкиЦеныНоменклатуры");
			ТабДок.Вывести(Область);
		КонецЕсли; 
		
		Для каждого ЭлементЦены Из Цены  Цикл 
			
			Область = Макет.ПолучитьОбласть("ЦенаНоменклатурыДляВалюты");
            Область.Параметры.Наименование  = СтрШаблон("%1", ЭлементЦены.Наименование);
			ТабДок.Вывести(Область);

			ОшибкаВалютыЦены = Макет.ПолучитьОбласть("ОшибкаВалютыЦены");
			ОшибкаВалютыЦены.Параметры.Валюта = СтрШаблон("%1", "Не найдено значение реквизита «Валюта типа цены номенклатуры");
			ТабДок.Вывести(ОшибкаВалютыЦены);			
		КонецЦикла; 
		ОшибкаФайла = Истина;
	КонецЕсли;

	
	Если ИнформацияСообщения.Товар.Артикл = Ложь
		ИЛИ ИнформацияСообщения.Товар.ГУИД = Ложь
		ИЛИ ИнформацияСообщения.Товар.Наименование = Ложь
		ИЛИ ИнформацияСообщения.Товар.НДС = Ложь
		ИЛИ ИнформацияСообщения.Товар.ПометкаУдаления = Ложь 
		ИЛИ (ИнформацияСообщения.Товар.Коды.Тнвэд = Ложь
		И ИнформацияСообщения.Товар.Коды.Окпд2 = Ложь) Тогда 
		
		Область = Макет.ПолучитьОбласть("ОшибкиТовара");
        ТабДок.Вывести(Область); 
		ОшибкаФайла = Истина;
	КонецЕсли;
	
	Если ИнформацияСообщения.Товар.Артикл = Ложь Тогда 
		Область = Макет.ПолучитьОбласть("ОшибкаАртикл");
		Область.Параметры.Артикл = СтрШаблон("%1", "Не найдено значение реквизита «Артикул»");
		ТабДок.Вывести(Область); 
		ОшибкаФайла = Истина;
	КонецЕсли;
	
	Если ИнформацияСообщения.Товар.ГУИД = Ложь Тогда 
		Область = Макет.ПолучитьОбласть("ОшибкаГУИД");
		Область.Параметры.Гуид 	= СтрШаблон("%1", "Не найдено значение реквизита «ГУИД номенклатуры»");  
		ТабДок.Вывести(Область);
		ОшибкаФайла = Истина;
	КонецЕсли;
	
	Если ИнформацияСообщения.Товар.Наименование = Ложь Тогда 
		Область = Макет.ПолучитьОбласть("ОшибкаНаименование");
		Область.Параметры.Наименование = СтрШаблон("%1", "Не найдено значение реквизита «Наименование номенклатуры»"); 
		ТабДок.Вывести(Область);  
		ОшибкаФайла = Истина;
	КонецЕсли;
	
	Если ИнформацияСообщения.Товар.НДС = Ложь Тогда 
		Область = Макет.ПолучитьОбласть("ОшибкаНДС");
		Область.Параметры.НДС = СтрШаблон("%1", "Не заполнена ставка НДС"); 
		ТабДок.Вывести(Область);
		ОшибкаФайла = Истина;
	КонецЕсли;
	
	Если ИнформацияСообщения.Товар.ПометкаУдаления = Ложь Тогда 
		Область = Макет.ПолучитьОбласть("ОшибкаПометкаУдаления");
		Область.Параметры.ПометкаУдаления = СтрШаблон("%1", "Объект помечен на удаление");  
		ТабДок.Вывести(Область); 
		ОшибкаФайла = Истина;
	КонецЕсли;
	
	Если ИнформацияСообщения.Товар.Коды.Тнвэд = Ложь
		И ИнформацияСообщения.Товар.Коды.Окпд2 = Ложь Тогда 
		Область = Макет.ПолучитьОбласть("ОшибкиКоды"); 
		Область.Параметры.Код = СтрШаблон("%1", "Не заполнен код ТН ВЭД/ОКПД2");
        ТабДок.Вывести(Область); 
		ОшибкаФайла = Истина;
	КонецЕсли;   
	
	РазмерыТовара = Новый Массив;
	Для каждого ЭлементРазмерыТовара Из ИнформацияСообщения.Товар.РазмерыТовара Цикл 
		Ошибка = Ложь;
		Размер = Новый Структура("Гуид, Размер, Штрихкод, ЦеныРазмера");
		
		Если ЭлементРазмерыТовара.Гуид = Ложь ИЛИ ЭлементРазмерыТовара.Размер = Ложь ИЛИ ЭлементРазмерыТовара.Штрихкод = Ложь Тогда 
			Размер.Вставить("Гуид", 		ЭлементРазмерыТовара.Гуид);
			Размер.Вставить("Размер", 		ЭлементРазмерыТовара.Размер); 
			Размер.Вставить("Штрихкод", 	ЭлементРазмерыТовара.Штрихкод);
			Ошибка = Истина;
		КонецЕсли;  
		
		Если Ошибка Тогда 
			РазмерыТовара.Добавить(Размер);
		КонецЕсли;
	КонецЦикла;
	
	
	ОбластьОшибкиРазмеровТовара = Ложь;
	Если РазмерыТовара.Количество() > 0 Тогда 
		Область = Макет.ПолучитьОбласть("ОшибкиРазмеровТовара"); 
		ТабДок.Вывести(Область);   
		ОбластьОшибкиРазмеровТовара = Истина;

		Для каждого ЭлементРазмеры Из РазмерыТовара Цикл 
			Если ЭлементРазмеры.Гуид = Ложь И ЭлементРазмеры.Размер = Ложь Тогда 
				Область = Макет.ПолучитьОбласть("ОшибкаРазмера"); 
				Область.Параметры.Размер = СтрШаблон("%1","Не найдено значение реквизита «Характеристика»");
				ТабДок.Вывести(Область);
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(ЭлементРазмеры.Размер) И ЭлементРазмеры.Штрихкод = Ложь Тогда 
				
				РазмерДляШтрихКода = Макет.ПолучитьОбласть("РазмерДляШтрихКода");
				РазмерДляШтрихКода.Параметры.Размер = ЭлементРазмеры.Размер;
				ТабДок.Вывести(РазмерДляШтрихКода);

				ОшибкаШрихкода = Макет.ПолучитьОбласть("ОшибкаШрихкода");
				ОшибкаШрихкода.Параметры.Штрихкод      = СтрШаблон("%1", "Не найден штрихкод номенклатуры");
				ТабДок.Вывести(ОшибкаШрихкода);   
			ИначеЕсли ЭлементРазмеры.Штрихкод = Ложь Тогда 
				
				ОшибкаШрихкода = Макет.ПолучитьОбласть("ОшибкаШрихкода");
				ОшибкаШрихкода.Параметры.Штрихкод      = СтрШаблон("%1", "Не найден штрихкод номенклатуры");
				ТабДок.Вывести(ОшибкаШрихкода);  
			КонецЕсли;			
		КонецЦикла;
	КонецЕсли;
	
	
	ЦенаРазмерыТовара = Новый Массив;
	Для каждого ЭлементРазмерыТовара Из ИнформацияСообщения.Товар.РазмерыТовара Цикл 
		Ошибка = Ложь;
		Размер = Новый Структура;
		Если ЭлементРазмерыТовара.ЦеныРазмера.Количество() > 0 Тогда 	
			Для каждого ЭлементЦеныРазмера Из ЭлементРазмерыТовара.ЦеныРазмера Цикл 
				Если ЭлементЦеныРазмера.Гуид = Ложь ИЛИ ЭлементЦеныРазмера.Цена = Ложь Тогда 
					Ошибка = Истина;
					ОшибкаФайла = Истина;
				КонецЕсли; 
			КонецЦикла; 
			Если Ошибка Тогда 
				Размер.Вставить("ОшибкаЦен",    Истина);
				Размер.Вставить("Гуид", 		ЭлементРазмерыТовара.Гуид);
				Размер.Вставить("Размер", 		ЭлементРазмерыТовара.Размер); 
				Размер.Вставить("Штрихкод", 	ЭлементРазмерыТовара.Штрихкод);
				
			КонецЕсли;
		Иначе 	
			Размер.Вставить("ОшибкаЦен",    Истина);
			Размер.Вставить("Гуид", 		ЭлементРазмерыТовара.Гуид);
			Размер.Вставить("Размер", 		ЭлементРазмерыТовара.Размер); 
			Размер.Вставить("Штрихкод", 	ЭлементРазмерыТовара.Штрихкод);
			
			Ошибка = Истина;
			ОшибкаФайла = Истина;
		КонецЕсли;
		
		Если Ошибка Тогда 
			ЦенаРазмерыТовара.Добавить(Размер);
		КонецЕсли;
	КонецЦикла;

	
	Если ЦенаРазмерыТовара.Количество() > 0 Тогда 
		Если НЕ ОбластьОшибкиРазмеровТовара Тогда 
			Область = Макет.ПолучитьОбласть("ОшибкиРазмеровТовара"); 
			ТабДок.Вывести(Область);   
		КонецЕсли;
	
		Для каждого ЦенаРазмера Из ЦенаРазмерыТовара Цикл
			Если ЦенаРазмера.ОшибкаЦен Тогда 	
				Если НЕ (ЦенаРазмера.Гуид = Ложь ИЛИ ЦенаРазмера.Размер = Ложь) Тогда 
					Если ЗначениеЗаполнено(ЦенаРазмера.Гуид) Тогда 
						РазмерПоГуид = Справочники.ХарактеристикиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(ЦенаРазмера.Гуид));
					КонецЕсли;
					
					Область = Макет.ПолучитьОбласть("РазмерДляЦены");
					Область.Параметры.Размер    	= ?(ЦенаРазмера.Размер <> Ложь, СтрШаблон("%1 %2","Размер: ", ЦенаРазмера.Размер), СтрШаблон("%1 %2","Размер: ", РазмерПоГуид)); 
					ТабДок.Вывести(Область);	
				КонецЕсли;
				
				Область = Макет.ПолучитьОбласть("ОшибкаЦеныРазмера"); 
				Область.Параметры.Цена = "Не задано значение реквизита «Цена»";
				ТабДок.Вывести(Область);
				
			КонецЕсли; 	
		КонецЦикла;
	КонецЕсли;	

	
	Если НЕ ОшибкаФайла Тогда 
		Возврат Неопределено;
	Иначе 
		Возврат ТабДок;
	КонецЕсли;

КонецФункции
