#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Загрузить(Команда)
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Книга Excel(*.xls; *.xlsx)|*.xls; *.xlsx";;
	Диалог.Заголовок = НСтр("ru = 'Выберите файл'");
	Диалог.МножественныйВыбор = Ложь;
	
	ОповещениеПродолжения = Новый ОписаниеОповещения("ЗагрузитьФайлПродолжение", ЭтотОбъект);
	ФайловаяСистемаКлиент.ПоказатьДиалогВыбора(ОповещениеПродолжения, Диалог);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Асинх Процедура ЗагрузитьФайлПродолжение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(,,, Результат[0], УникальныйИдентификатор);
	
	Если ОписаниеФайла = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОписаниеФайла.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНаСервере(ОписаниеФайла.Адрес);
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере(АдресНаСервере, Переписать = Ложь)
	
	ИмяФайла = ПолучитьИмяВременногоФайла("XLSX");
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресНаСервере);
	ДвоичныеДанные.Записать(ИмяФайла);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст);
	
	Область = Неопределено;
	Для каждого Область Из ТабличныйДокумент.Области Цикл
		Прервать;
	КонецЦикла;
	
	ФайловаяСистема.УдалитьВременныйФайл(ИмяФайла);
	
	Если Область = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПостроительЗапроса = Новый ПостроительЗапроса;
	ПостроительЗапроса.ИсточникДанных = Новый ОписаниеИсточникаДанных(Область);
	ПостроительЗапроса.Выполнить();
	
	ТаблицаФайла = ПостроительЗапроса.Результат.Выгрузить();
	
	ИмяКолонкиАртикул = "";
	ИмяКолонкиКартинки = "";
	
	Для Каждого Колонка Из ТаблицаФайла.Колонки Цикл
		
		ИмяКолонки = Колонка.Имя;
		
		Если СтрНачинаетсяС(ИмяКолонки, "Артикул") И ИмяКолонкиАртикул = "" Тогда
			ИмяКолонкиАртикул = Колонка.Имя;
		КонецЕсли;
		
		Если СтрНачинаетсяС(ИмяКолонки, "Картинки") И ИмяКолонкиКартинки = "" Тогда
			ИмяКолонкиКартинки = Колонка.Имя;
		КонецЕсли;
		
		Если Не ПустаяСтрока(ИмяКолонкиАртикул) И Не ПустаяСтрока(ИмяКолонкиКартинки) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Вернуть = Ложь;
	Если ПустаяСтрока(ИмяКолонкиАртикул) Тогда
		
		ТекстСообщения = НСтр("ru = 'В файле не найдена колонка ""Артикул поставщика""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Вернуть = Истина;
		
	КонецЕсли;
	
	Если ПустаяСтрока(ИмяКолонкиКартинки) Тогда
		
		ТекстСообщения = НСтр("ru = 'В файле не найдена колонка ""Картинки""'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		Вернуть = Истина;
		
	КонецЕсли;
	
	Если Вернуть Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрокаФайла Из ТаблицаФайла Цикл
		
		АртикулПоставщика = СтрокаФайла[ИмяКолонкиАртикул];
		ВнешниеСсылкиСтрокой = СтрокаФайла[ИмяКолонкиКартинки];
		
		Если Переписать Тогда
			
			НаборЗаписей = РегистрыСведений.спВнешниеКартинкиТовара.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.АртикулПоставщика.Установить(АртикулПоставщика);
			НаборЗаписей.Прочитать();
			НаборЗаписей.Очистить();
			
		КонецЕсли;
		
		ВнешниеСсылки = СтрРазделить(ВнешниеСсылкиСтрокой, ";", Ложь);
		
		Для каждого ВнешняяСсылка Из ВнешниеСсылки Цикл
			
			МенеджерЗаписи = РегистрыСведений.спВнешниеКартинкиТовара.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.АртикулПоставщика = АртикулПоставщика;
			МенеджерЗаписи.ВнешняяСсылка = ВнешняяСсылка;
			МенеджерЗаписи.Записать(Истина);
			Вернуть = Истина;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если Вернуть Тогда
		
		ТекстСообщения = НСтр("ru = 'Файл загружен'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти