//<<<--- Tnext Козык К.А. 16.06.2026 - адаптация под новый релиз 3.0.13.357
&НаКлиенте
&ИзменениеИКонтроль("Подключаемый_ВыполнитьКоманду")
Процедура спПодключаемый_ВыполнитьКоманду(Команда)
	#Удаление
	Если ТипЗнч(ВладелецФормы) = Тип("ФормаКлиентскогоПриложения") Тогда
		ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, ВладелецФормы.Объект);
	КонецЕсли;
	#КонецУдаления
	#Вставка
	Если СтрНачинаетсяС(Команда.Имя, "спЗнакиУхода") Тогда
		ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Ссылка);
	КонецЕсли;
	#КонецВставки
КонецПроцедуры //--->>> Tnext Козык К.А. 16.06.2026
