
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПечатьШтрихкодов(Команда) 
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	ПечатьШтрихкодовНаСервере(ТабличныйДокумент, ВыделенныеСтроки);
	
	ТабличныйДокумент.Показать();
	
КонецПроцедуры

&НаКлиенте
Процедура СгенерироватьШтрихкоды(Команда) 
	
	СгенерироватьШтрихкодыНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СгенерироватьШтрихкодыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ячейки.Наименование КАК Наименование,
		|	Ячейки.Ссылка КАК Ячейка,
		|	&Префикс + Ячейки.Наименование КАК Штрихкод
		|ИЗ
		|	Справочник.Ячейки КАК Ячейки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.спШтрихкодыЯчеек КАК спШтрихкодыЯчеек
		|		ПО Ячейки.Ссылка = спШтрихкодыЯчеек.Ячейка
		|			И (спШтрихкодыЯчеек.Штрихкод ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("Префикс", спРаботаСЯчейкамиВызовСервера.ПрефиксШтрихкодаЯчейки());
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаНовыйШтрихкодов = РезультатЗапроса.Выгрузить();
	
	НаборЗаписей = РегистрыСведений.спШтрихкодыЯчеек.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(ТаблицаНовыйШтрихкодов);
	НаборЗаписей.Записать(РежимЗамещения.Слияние);
	
КонецПроцедуры

&НаСервере
Процедура ПечатьШтрихкодовНаСервере(ТабличныйДокумент, Строки)
	
	Для каждого Строка Из Строки Цикл
		
		Макет = РегистрыСведений.спШтрихкодыЯчеек.ПолучитьМакет("ШтрихкодЯчейки");
		Эталон = РегистрыСведений.спШтрихкодыЯчеек.ПолучитьМакет("Шаблон128");
		
		Область = Макет.ПолучитьОбласть("Строка|Колонка");
		Рисунок = Область.Рисунки.ШтрихКод;
		
		КоличествоМиллиметровВПикселеВысота = Эталон.Рисунки.ШтрихкодПечать.Высота / 100;
		КоличествоМиллиметровВПикселеШирина = Эталон.Рисунки.ШтрихкодПечать.Ширина / 100;
		ШиринаШтрихкода = Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселеШирина);
		ВысотаШтрихкода = Окр(Рисунок.Высота / КоличествоМиллиметровВПикселеВысота);
		
		Ресурсы = РегистрыСведений.спШтрихкодыЯчеек.Получить(Новый Структура("Ячейка", Строка.Ячейка));
		Результат = ПолучитьШтрихкод(ШиринаШтрихкода, ВысотаШтрихкода, Ресурсы.Штрихкод, 2);  // 2 - EAN128
		
		Если Результат.Результат Тогда  
			
			Область.Параметры.Заполнить(Ресурсы);
			Рисунок.Картинка = Результат.Картинка;
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();  // Терлецкий АВ 25.03.25
			ТабличныйДокумент.Вывести(Область);
			
		Иначе
			
			Шаблон = НСтр("ru = 'Изображение штрихкода для ячейки %1 не сформировано'");
			ТекстСообщения = СтрШаблон(Шаблон, Строка.Ячейка);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
	
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция ПолучитьШтрихкод(ШиринаШтрихкода, ВысотаШтрихкода, ЗначШтрихкод, ЗначТипШтрихкода)
	
	ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	ПараметрыШтрихкода.Ширина = ШиринаШтрихкода;
	ПараметрыШтрихкода.Высота = ВысотаШтрихкода;
	ПараметрыШтрихкода.ТипКода = ЗначТипШтрихкода;
	ПараметрыШтрихкода.Штрихкод = ЗначШтрихкод;
	ПараметрыШтрихкода.ПрозрачныйФон = Истина;
	ПараметрыШтрихкода.УровеньКоррекцииQR = 2;
	ПараметрыШтрихкода.ОтображатьТекст = Ложь;
	ПараметрыШтрихкода.Масштабировать = Истина;
	ПараметрыШтрихкода.СохранятьПропорции = Истина;
	ПараметрыШтрихкода.ВертикальноеВыравнивание  = 0; 
	ПараметрыШтрихкода.GS1DatabarКоличествоСтрок = 1;
	ПараметрыШтрихкода.ТипВходныхДанных = 0;
	
	РезультатШтрихкод = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);

	Возврат РезультатШтрихкод;
	
КонецФункции

#КонецОбласти
