#Область СлужебныйПрограммныйИнтерфейс

Функция ПрефиксШтрихкодаЯчейки() Экспорт

	Возврат "CE-";

КонецФункции

Процедура ЗаполнитьЯчейкиВТЧПоОстаткам(Запасы, Организация, Склад, ТипДокумента = Неопределено) Экспорт
	
	// { Иванов С.С. (TNext) - 04.03.2025 - Задача №1000 
	РаспределяемыеЗапасы = Запасы.СкопироватьКолонки();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса(ТипДокумента);
	
	Запрос.УстановитьПараметр("ТаблицаЗапасы", Запасы);
	Запрос.УстановитьПараметр("ДатаПолученияОстатков", ТекущаяДатаСеанса()); // Возможно, надо переделать на дату документа?
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаСтроки = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаСтроки.Следующий() Цикл
		
		Индекс = ИндексСтроки(РаспределяемыеЗапасы, ВыборкаСтроки);
				
		КоличествоКРаспределению = ВыборкаСтроки.Количество;
			
		Выборка = ВыборкаСтроки.Выбрать();
		
		ДобавитьВТекущую = Истина;
		
		Пока Выборка.Следующий() И КоличествоКРаспределению > 0 Цикл
			
			Если Не ЗначениеЗаполнено(Выборка.Ячейка) Тогда
				Продолжить;
			КонецЕсли;
			
			КоличествоРаспределено = Мин(КоличествоКРаспределению, Выборка.ОстатокВЯчейке);
			
			Строка = ДобавитьСтроку(РаспределяемыеЗапасы, ВыборкаСтроки, Индекс, ТипДокумента);
			
			ПересчитатьСтроку(Строка, ВыборкаСтроки, Выборка.Ячейка, КоличествоРаспределено, ТипДокумента);
			
			КоличествоКРаспределению = КоличествоКРаспределению - КоличествоРаспределено;
			
		КонецЦикла;
		
		Если КоличествоКРаспределению > 0 Тогда
			
			Строка = ДобавитьСтроку(РаспределяемыеЗапасы, ВыборкаСтроки, Индекс, ТипДокумента);
				
			ПересчитатьСтроку(Строка, ВыборкаСтроки, Справочники.Ячейки.ПустаяСсылка(), КоличествоКРаспределению, ТипДокумента);
		
		КонецЕсли;
		             
	КонецЦикла;
	
	Запасы = РаспределяемыеЗапасы; 
	// }
	
КонецПроцедуры

Функция ЕстьЯчейки(СтруктурнаяЕдиница) Экспорт

	// { Иванов С.С. (TNext) - 04.03.2025 - Задача №1000 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Ячейки.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Ячейки КАК Ячейки
		|ГДЕ
		|	Ячейки.Владелец = &Склад";
	
	Запрос.УстановитьПараметр("Склад", СтруктурнаяЕдиница);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Ложь;
		
	Иначе
		
		Возврат Истина;
		
	КонецЕсли; 
	// }
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИндексСтроки(РаспределяемыеЗапасы, ВыборкаСтроки)

	// { Иванов С.С. (TNext) - 04.03.2025 - Задача №1000 
	Фильтр = Новый Структура("НомерСтроки", ВыборкаСтроки.НомерСтроки);
	НайденныеСтроки = РаспределяемыеЗапасы.НайтиСтроки(Фильтр);
	
	Если НайденныеСтроки.Количество() = 0 Тогда 
		Индекс = Неопределено;
	Иначе
		НайденнаяСтрока = НайденныеСтроки[0]; // Может быть найдена только одна строка
		Индекс = РаспределяемыеЗапасы.Индекс(НайденнаяСтрока);
	КонецЕсли;
	
	Возврат Индекс;
	// }
	
КонецФункции

Функция ДобавитьСтроку(РаспределяемыеЗапасы, ВыборкаСтроки, Индекс, ТипДокумента)
	
	// { Иванов С.С. (TNext) - 04.03.2025 - Задача №1000 
	Если Индекс = Неопределено Тогда
		Строка = РаспределяемыеЗапасы.Добавить();
	Иначе
		Строка = РаспределяемыеЗапасы.Вставить(Индекс); 
	КонецЕсли;
	
	Если ТипДокумента = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		ИсключаемыеКолонки = "НомерСтроки, Количество, Сумма, СуммаНДС, Всего, СуммаСкидкиНаценки, Ячейка, Вес, Объем";
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПеремещениеПоЯчейкам") Тогда
		ИсключаемыеКолонки = "НомерСтроки, Количество, Ячейка,";
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(Строка, ВыборкаСтроки,, ИсключаемыеКолонки); 
	
    Возврат Строка;
	// }
	
КонецФункции

Процедура ПересчитатьСтроку(Строка, ВыборкаСтроки, Ячейка, Количество, ТипДокумента)
	
	// { Иванов С.С. (TNext) - 04.03.2025 - Задача №1000 
	Строка.Количество = Количество;
	Строка.Ячейка = Ячейка; 
	
	Если ТипДокумента = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		
		Строка.Сумма = Строка.Цена * Строка.Количество;
		Строка.СуммаНДС = Строка.Сумма * ВыборкаСтроки.Ставка / (100 + ВыборкаСтроки.Ставка); // Сумма включает НДС
		Строка.Всего = Строка.Сумма; // Сумма включает НДС
		Строка.СуммаСкидкиНаценки = Строка.Сумма * ВыборкаСтроки.ПроцентСкидкиНаценки / 100;
		Строка.Вес = Строка.Количество * ВыборкаСтроки.Вес / ВыборкаСтроки.Количество; 
		Строка.Объем = Строка.Количество * ВыборкаСтроки.Объем / ВыборкаСтроки.Количество;  
		
	КонецЕсли;
	// }

КонецПроцедуры

Функция ТекстЗапроса(ТипДокумента)
	
	ТекстЗапроса = "";
	
	Если ТипДокумента = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда
		
		ТекстЗапроса = ТекстЗапросаДляПеремещенияЗапасов();
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ПеремещениеПоЯчейкам") Тогда
		
		ТекстЗапроса = ТекстЗапросаДляПеремещенияПоЯчейкам();
		
	Иначе
		
		ВызватьИсключение НСтр("ru = 'Функционал не адаптирован под данный тип документа.'");
		
	КонецЕсли;
	
	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаДляПеремещенияЗапасов()
	
	ТекстЗапроса = 
	
	#Область ТекстЗапроса
	"ВЫБРАТЬ
	|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	ПеремещениеЗапасовЗапасы.Характеристика КАК Характеристика,
	|	ПеремещениеЗапасовЗапасы.Партия КАК Партия,
	|	ПеремещениеЗапасовЗапасы.СерииНоменклатуры КАК СерииНоменклатуры,
	|	ПеремещениеЗапасовЗапасы.Количество КАК Количество,
	|	ПеремещениеЗапасовЗапасы.Резерв КАК Резерв,
	|	ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПеремещениеЗапасовЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ПеремещениеЗапасовЗапасы.Себестоимость КАК Себестоимость,
	|	ПеремещениеЗапасовЗапасы.Сумма КАК Сумма,
	|	ПеремещениеЗапасовЗапасы.КлючСвязи КАК КлючСвязи,
	|	ПеремещениеЗапасовЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ПеремещениеЗапасовЗапасы.НомерГТД КАК НомерГТД,
	|	ПеремещениеЗапасовЗапасы.Проект КАК Проект,
	|	ПеремещениеЗапасовЗапасы.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ПеремещениеЗапасовЗапасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ПеремещениеЗапасовЗапасы.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	ПеремещениеЗапасовЗапасы.УчитыватьВНУ КАК УчитыватьВНУ,
	|	ПеремещениеЗапасовЗапасы.Ячейка КАК Ячейка,
	|	ПеремещениеЗапасовЗапасы.ЯчейкаПолучатель КАК ЯчейкаПолучатель,
	|	ПеремещениеЗапасовЗапасы.Вес КАК Вес,
	|	ПеремещениеЗапасовЗапасы.Объем КАК Объем,
	|	ПеремещениеЗапасовЗапасы.Цена КАК Цена,
	|	ВЫРАЗИТЬ(ПеремещениеЗапасовЗапасы.СтавкаНДС КАК Справочник.СтавкиНДС) КАК СтавкаНДС,
	|	ПеремещениеЗапасовЗапасы.СуммаНДС КАК СуммаНДС,
	|	ПеремещениеЗапасовЗапасы.Всего КАК Всего,
	|	ПеремещениеЗапасовЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ПеремещениеЗапасовЗапасы.СуммаСкидкиНаценки КАК СуммаСкидкиНаценки,
	|	ПеремещениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_Запасы
	|ИЗ
	|	&ТаблицаЗапасы КАК ПеремещениеЗапасовЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Запасы.Номенклатура КАК Номенклатура,
	|	ВТ_Запасы.Характеристика КАК Характеристика,
	|	ВТ_Запасы.Партия КАК Партия,
	|	ВТ_Запасы.СерииНоменклатуры КАК СерииНоменклатуры,
	|	СУММА(ВТ_Запасы.Количество) КАК Количество,
	|	СУММА(ВТ_Запасы.Резерв) КАК Резерв,
	|	ВТ_Запасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Запасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(ВТ_Запасы.Себестоимость) КАК Себестоимость,
	|	СУММА(ВТ_Запасы.Сумма) КАК Сумма,
	|	ВТ_Запасы.КлючСвязи КАК КлючСвязи,
	|	ВТ_Запасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВТ_Запасы.НомерГТД КАК НомерГТД,
	|	ВТ_Запасы.Проект КАК Проект,
	|	ВТ_Запасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ВТ_Запасы.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	ВТ_Запасы.УчитыватьВНУ КАК УчитыватьВНУ,
	|	МАКСИМУМ(ВТ_Запасы.Ячейка) КАК Ячейка,
	|	ВТ_Запасы.ЯчейкаПолучатель КАК ЯчейкаПолучатель,
	|	СУММА(ВТ_Запасы.Вес) КАК Вес,
	|	СУММА(ВТ_Запасы.Объем) КАК Объем,
	|	ВТ_Запасы.Цена КАК Цена,
	|	ВТ_Запасы.СтавкаНДС КАК СтавкаНДС,
	|	СУММА(ВТ_Запасы.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ВТ_Запасы.Всего) КАК Всего,
	|	ВТ_Запасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	СУММА(ВТ_Запасы.СуммаСкидкиНаценки) КАК СуммаСкидкиНаценки,
	|	МИНИМУМ(ВТ_Запасы.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_СгруппированныеЗапасы
	|ИЗ
	|	ВТ_Запасы КАК ВТ_Запасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Запасы.Номенклатура,
	|	ВТ_Запасы.Характеристика,
	|	ВТ_Запасы.Партия,
	|	ВТ_Запасы.СерииНоменклатуры,
	|	ВТ_Запасы.ЕдиницаИзмерения,
	|	ВТ_Запасы.ЗаказПокупателя,
	|	ВТ_Запасы.КлючСвязи,
	|	ВТ_Запасы.СтранаПроисхождения,
	|	ВТ_Запасы.НомерГТД,
	|	ВТ_Запасы.Проект,
	|	ВТ_Запасы.ПрослеживаемыйТовар,
	|	ВТ_Запасы.ПрослеживаемыйКомплект,
	|	ВТ_Запасы.УчитыватьВНУ,
	|	ВТ_Запасы.Цена,
	|	ВТ_Запасы.ЯчейкаПолучатель,
	|	ВТ_Запасы.СтавкаНДС,
	|	ВТ_Запасы.ПроцентСкидкиНаценки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ЗапасыНаСкладахОстатки.Партия КАК Партия,
	|	ЗапасыНаСкладахОстатки.Ячейка КАК Ячейка,
	|	ЗапасыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиНаЯчейках
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|			&ДатаПолученияОстатков,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И (Номенклатура, Характеристика, Партия) В
	|					(ВЫБРАТЬ
	|						ВТ_Запасы.Номенклатура КАК Номенклатура,
	|						ВТ_Запасы.Характеристика КАК Характеристика,
	|						ВТ_Запасы.Партия КАК Партия
	|					ИЗ
	|						ВТ_Запасы КАК ВТ_Запасы)) КАК ЗапасыНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СгруппированныеЗапасы.Номенклатура КАК Номенклатура,
	|	ВТ_СгруппированныеЗапасы.Характеристика КАК Характеристика,
	|	ВТ_СгруппированныеЗапасы.Партия КАК Партия,
	|	ВТ_СгруппированныеЗапасы.СерииНоменклатуры КАК СерииНоменклатуры,
	|	ВТ_СгруппированныеЗапасы.Количество КАК Количество,
	|	ВТ_СгруппированныеЗапасы.Резерв КАК Резерв,
	|	ВТ_СгруппированныеЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_СгруппированныеЗапасы.ЗаказПокупателя КАК ЗаказПокупателя,
	|	ВТ_СгруппированныеЗапасы.Себестоимость КАК Себестоимость,
	|	ВТ_СгруппированныеЗапасы.Сумма КАК Сумма,
	|	ВТ_СгруппированныеЗапасы.КлючСвязи КАК КлючСвязи,
	|	ВТ_СгруппированныеЗапасы.СтранаПроисхождения КАК СтранаПроисхождения,
	|	ВТ_СгруппированныеЗапасы.НомерГТД КАК НомерГТД,
	|	ВТ_СгруппированныеЗапасы.Проект КАК Проект,
	|	ВТ_СгруппированныеЗапасы.ПрослеживаемыйТовар КАК ПрослеживаемыйТовар,
	|	ВТ_СгруппированныеЗапасы.ПрослеживаемыйКомплект КАК ПрослеживаемыйКомплект,
	|	ВТ_СгруппированныеЗапасы.УчитыватьВНУ КАК УчитыватьВНУ,
	|	ВТ_СгруппированныеЗапасы.Ячейка КАК ЯчейкаДокумента,
	|	ВТ_СгруппированныеЗапасы.ЯчейкаПолучатель КАК ЯчейкаПолучатель,
	|	ВТ_СгруппированныеЗапасы.Вес КАК Вес,
	|	ВТ_СгруппированныеЗапасы.Объем КАК Объем,
	|	ВТ_СгруппированныеЗапасы.Цена КАК Цена,
	|	ВТ_СгруппированныеЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_СгруппированныеЗапасы.СуммаНДС КАК СуммаНДС,
	|	ВТ_СгруппированныеЗапасы.Всего КАК Всего,
	|	ВТ_СгруппированныеЗапасы.ПроцентСкидкиНаценки КАК ПроцентСкидкиНаценки,
	|	ВТ_СгруппированныеЗапасы.СуммаСкидкиНаценки КАК СуммаСкидкиНаценки,
	|	ЕСТЬNULL(ВТ_ОстаткиНаЯчейках.Ячейка, ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)) КАК Ячейка,
	|	ЕСТЬNULL(ВТ_ОстаткиНаЯчейках.КоличествоОстаток, 0) КАК ОстатокВЯчейке,
	|	ВТ_СгруппированныеЗапасы.НомерСтроки КАК НомерСтроки,
	|	ЕСТЬNULL(ВТ_СгруппированныеЗапасы.СтавкаНДС.Ставка, 0) КАК Ставка
	|ИЗ
	|	ВТ_СгруппированныеЗапасы КАК ВТ_СгруппированныеЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНаЯчейках КАК ВТ_ОстаткиНаЯчейках
	|		ПО ВТ_СгруппированныеЗапасы.Номенклатура = ВТ_ОстаткиНаЯчейках.Номенклатура
	|			И ВТ_СгруппированныеЗапасы.Характеристика = ВТ_ОстаткиНаЯчейках.Характеристика
	|			И ВТ_СгруппированныеЗапасы.Партия = ВТ_ОстаткиНаЯчейках.Партия
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	Ячейка УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(Номенклатура),
	|	МАКСИМУМ(Характеристика),
	|	МАКСИМУМ(Партия),
	|	МАКСИМУМ(СерииНоменклатуры),
	|	МАКСИМУМ(Количество),
	|	МАКСИМУМ(Резерв),
	|	МАКСИМУМ(ЕдиницаИзмерения),
	|	МАКСИМУМ(ЗаказПокупателя),
	|	МАКСИМУМ(Себестоимость),
	|	МАКСИМУМ(Сумма),
	|	МАКСИМУМ(КлючСвязи),
	|	МАКСИМУМ(СтранаПроисхождения),
	|	МАКСИМУМ(НомерГТД),
	|	МАКСИМУМ(Проект),
	|	МАКСИМУМ(ПрослеживаемыйТовар),
	|	МАКСИМУМ(ПрослеживаемыйКомплект),
	|	МАКСИМУМ(УчитыватьВНУ),
	|	МАКСИМУМ(ЯчейкаДокумента),
	|	МАКСИМУМ(ЯчейкаПолучатель),
	|	МАКСИМУМ(Вес),
	|	МАКСИМУМ(Объем),
	|	МАКСИМУМ(Цена),
	|	МАКСИМУМ(СтавкаНДС),
	|	МАКСИМУМ(СуммаНДС),
	|	МАКСИМУМ(Всего),
	|	МАКСИМУМ(ПроцентСкидкиНаценки),
	|	МАКСИМУМ(СуммаСкидкиНаценки),
	|	МАКСИМУМ(Ставка)
	|ПО
	|	НомерСтроки";
	#КонецОбласти	

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаДляПеремещенияПоЯчейкам()
	
	ТекстЗапроса = 
	
	#Область ТекстЗапроса
	"ВЫБРАТЬ
	|	ПеремещениеЗапасовЗапасы.НомерСтроки КАК НомерСтроки,
	|	ПеремещениеЗапасовЗапасы.Номенклатура КАК Номенклатура,
	|	ПеремещениеЗапасовЗапасы.Характеристика КАК Характеристика,
	|	ПеремещениеЗапасовЗапасы.Партия КАК Партия,
	|	ПеремещениеЗапасовЗапасы.СерииНоменклатуры КАК СерииНоменклатуры,
	|	ПеремещениеЗапасовЗапасы.Количество КАК Количество,
	|	ПеремещениеЗапасовЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПеремещениеЗапасовЗапасы.КлючСвязи КАК КлючСвязи,
	|	ПеремещениеЗапасовЗапасы.Ячейка КАК Ячейка
	|ПОМЕСТИТЬ ВТ_Запасы
	|ИЗ
	|	&ТаблицаЗапасы КАК ПеремещениеЗапасовЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Запасы.Номенклатура КАК Номенклатура,
	|	ВТ_Запасы.Характеристика КАК Характеристика,
	|	ВТ_Запасы.Партия КАК Партия,
	|	ВТ_Запасы.СерииНоменклатуры КАК СерииНоменклатуры,
	|	СУММА(ВТ_Запасы.Количество) КАК Количество,
	|	ВТ_Запасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Запасы.КлючСвязи КАК КлючСвязи,
	|	МАКСИМУМ(ВТ_Запасы.Ячейка) КАК Ячейка,
	|	МИНИМУМ(ВТ_Запасы.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_СгруппированныеЗапасы
	|ИЗ
	|	ВТ_Запасы КАК ВТ_Запасы
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_Запасы.Номенклатура,
	|	ВТ_Запасы.Характеристика,
	|	ВТ_Запасы.Партия,
	|	ВТ_Запасы.СерииНоменклатуры,
	|	ВТ_Запасы.ЕдиницаИзмерения,
	|	ВТ_Запасы.КлючСвязи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапасыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ЗапасыНаСкладахОстатки.Характеристика КАК Характеристика,
	|	ЗапасыНаСкладахОстатки.Партия КАК Партия,
	|	ЗапасыНаСкладахОстатки.Ячейка КАК Ячейка,
	|	ЗапасыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток
	|ПОМЕСТИТЬ ВТ_ОстаткиНаЯчейках
	|ИЗ
	|	РегистрНакопления.ЗапасыНаСкладах.Остатки(
	|			&ДатаПолученияОстатков,
	|			Организация = &Организация
	|				И СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|				И (Номенклатура, Характеристика, Партия) В
	|					(ВЫБРАТЬ
	|						ВТ_Запасы.Номенклатура КАК Номенклатура,
	|						ВТ_Запасы.Характеристика КАК Характеристика,
	|						ВТ_Запасы.Партия КАК Партия
	|					ИЗ
	|						ВТ_Запасы КАК ВТ_Запасы)) КАК ЗапасыНаСкладахОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СгруппированныеЗапасы.Номенклатура КАК Номенклатура,
	|	ВТ_СгруппированныеЗапасы.Характеристика КАК Характеристика,
	|	ВТ_СгруппированныеЗапасы.Партия КАК Партия,
	|	ВТ_СгруппированныеЗапасы.СерииНоменклатуры КАК СерииНоменклатуры,
	|	ВТ_СгруппированныеЗапасы.Количество КАК Количество,
	|	ВТ_СгруппированныеЗапасы.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_СгруппированныеЗапасы.КлючСвязи КАК КлючСвязи,
	|	ВТ_СгруппированныеЗапасы.Ячейка КАК ЯчейкаДокумента,
	|	ЕСТЬNULL(ВТ_ОстаткиНаЯчейках.Ячейка, ЗНАЧЕНИЕ(Справочник.Ячейки.ПустаяСсылка)) КАК Ячейка,
	|	ЕСТЬNULL(ВТ_ОстаткиНаЯчейках.КоличествоОстаток, 0) КАК ОстатокВЯчейке,
	|	ВТ_СгруппированныеЗапасы.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	ВТ_СгруппированныеЗапасы КАК ВТ_СгруппированныеЗапасы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОстаткиНаЯчейках КАК ВТ_ОстаткиНаЯчейках
	|		ПО ВТ_СгруппированныеЗапасы.Номенклатура = ВТ_ОстаткиНаЯчейках.Номенклатура
	|			И ВТ_СгруппированныеЗапасы.Характеристика = ВТ_ОстаткиНаЯчейках.Характеристика
	|			И ВТ_СгруппированныеЗапасы.Партия = ВТ_ОстаткиНаЯчейках.Партия
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки,
	|	Ячейка УБЫВ
	|ИТОГИ
	|	МАКСИМУМ(Номенклатура),
	|	МАКСИМУМ(Характеристика),
	|	МАКСИМУМ(Партия),
	|	МАКСИМУМ(СерииНоменклатуры),
	|	МАКСИМУМ(Количество),
	|	МАКСИМУМ(ЕдиницаИзмерения),
	|	МАКСИМУМ(КлючСвязи),
	|	МАКСИМУМ(ЯчейкаДокумента)
	|ПО
	|	НомерСтроки";
	#КонецОбласти	

	Возврат ТекстЗапроса;

КонецФункции

#КонецОбласти

