#Область ПрограммныйИнтерфейс

Процедура ПриСозданииНаСервере(Форма) Экспорт

	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		Справочник_Номенклатура_Форма_ФормаЭлемента_ПриСозданииНаСервере(Форма);
	ИначеЕсли Форма.ИмяФормы = "Справочник.ХранилищеШаблонов.Форма.ФормаРедактированияШаблона" Тогда   
		Справочник_ХранилищеШаблонов_Форма_ФормаРедактированияШаблона_ПриСозданииНаСервере(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаДокумента" Тогда   
		Документ_ЗаказПоставщику_Форма_ФормаДокумента_ПриСозданииНаСервере(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказПоставщику.Форма.ФормаСписка" Тогда   
		Документ_ЗаказПоставщику_Форма_ФормаСписка_ПриСозданииНаСервере(Форма); 
		
	// ++ Терлецкий АВ 25.01.15
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаДокумента" Тогда   
		Документ_ЗаказНаПеремещение_Форма_ФормаДокумента_ПриСозданииНаСервере(Форма); 
	
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказНаПеремещение.Форма.ФормаСписка" Тогда   
		Документ_ЗаказНаПеремещение_Форма_ФормаСписка_ПриСозданииНаСервере(Форма);
	// -- Терлецкий АВ 25.01.15 
	    Документ_ЗаказНаПеремещение_ФормаСписка_УстановкаИнтервалаОбновленияСписка(Форма);
		 
	// ++ Терлецкий АВ 25.01.19
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда   
		Документ_ЗаказПокупателя_Форма_ФормаДокумента_ПриСозданииНаСервере(Форма);
	// -- Терлецкий АВ 25.01.19

	
	// { Иванов С.С. (TNext) - 23.01.2025 
	ИначеЕсли Форма.ИмяФормы = "Документ.ПеремещениеЗапасов.Форма.ФормаДокумента" Тогда   
		Документ_ПеремещениеЗапасов_Форма_ФормаДокумента_ПриСозданииНаСервере(Форма); 
	// }
	
	// dimedrol 23.02.2025
	ИначеЕсли Форма.ИмяФормы = "Справочник.Контрагенты.Форма.ФормаЭлемента" Тогда
		Справочник_Контрагенты_Форма_ФормаЭлемента_ПриСозданииНаСервере(Форма);
	// end of dimedrol 23.02.2025
	
	ИначеЕсли Форма.ИмяФормы = "Документ.ЧекККМ.Форма.ФормаДокумента"  Тогда
	   	Справочник_ШтрихкодыУпаковокТоваров_Форма_ПеренестиКнопку(Форма);
	ИначеЕсли Форма.ИмяФормы = "Справочник.ШтрихкодыУпаковокТоваров.Форма.ФормаСписка"  Тогда
	   	Справочник_ШтрихкодыУпаковокТоваров_Форма_ПеренестиКнопку(Форма);
	ИначеЕсли Форма.ИмяФормы = "Справочник.ШтрихкодыУпаковокТоваров.Форма.ФормаЭлемента"  Тогда
	   	Справочник_ШтрихкодыУпаковокТоваров_Форма_ПеренестиКнопку(Форма);
	ИначеЕсли Форма.ИмяФормы = "Справочник.Сотрудники.Форма.ФормаЭлемента"  Тогда
	   	Справочник_Сотрудники_ФормаЭлемента_ПриСоздании(Форма);
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Форма.ФормаДокумента"  Тогда
	   	Документ_ЗаказНаЭмиссиюКодовМаркировкиСУЗ_Форма_ПриСоздании(Форма);
	Иначе
		Возврат;
	КонецЕсли;

КонецПроцедуры

Процедура АРМРаботникаЗалаНоменклатураПриСоздании(Форма) Экспорт
	
	Если Форма.ИмяФормы <> "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Элементы	= Форма.Элементы;
	Параметры	= Форма.Параметры;
	
	// {  Иванов С.С. (TNext) - 20.02.2025
	ПереопределитьВыводКартинокНаВнешние(Форма);
	// }  
	
	// {  Иванов С.С. (TNext) - 13.02.2025
	// используется ограничение отображения реквизитов формы при работе в "АРМ Работника зала"
	Если Параметры.Свойство("НомерВерсииПереходаНаВерсиюИсторииДанных") И ЗначениеЗаполнено(Параметры.НомерВерсииПереходаНаВерсиюИсторииДанных) Тогда
		
		РеквизитыКОтображению = Параметры.НомерВерсииПереходаНаВерсиюИсторииДанных;
		
		Если ТипЗнч(РеквизитыКОтображению) = Тип("СписокЗначений") Тогда
			
			Форма.ТолькоПросмотр = Истина;
			
			СкрытьЭлементыФормыРекурсивно(РеквизитыКОтображению.ВыгрузитьЗначения(), Элементы);
			
		КонецЕсли;
	
	Иначе
		
		Возврат;
		
	КонецЕсли; 
	// }
	
КонецПроцедуры

Процедура Номенклатура_ВыводКартинок(Форма) Экспорт
	
	Если Форма.ИмяФормы <> "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		Возврат;
	КонецЕсли;
	
	// {  Иванов С.С. (TNext) - 20.02.2025
	ПереопределитьВыводКартинокНаВнешние(Форма);
	// }  
	
КонецПроцедуры

#КонецОбласти  

#Область СлужебныеПроцедурыИФункции 

Процедура Справочник_Номенклатура_Форма_ФормаЭлемента_ПриСозданииНаСервере(Форма)
	
	Элементы = Форма.Элементы;
	
	// элемент формы спАртикулПоставщика
	Родитель = Элементы.Найти("ГруппаСгруппированныеРеквизиты");
	ИмяЭлемента = "спАртикулПоставщика";
	Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
	 	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Родитель);		
		НовыйЭлемент.ПутьКДанным = "Объект.спАртикулПоставщика";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Артикул поставщика";
	КонецЕсли;
	
	// dimedrol 24.01.2025
	// элементы формы Размер и Цвет
	Родитель = Элементы.Найти("ГруппаСгруппированныеРеквизиты");
	ИмяЭлемента = "спГруппаДобавленныеРеквизиты";
	Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		НовыйЭлементГруппа = Элементы.Добавить(ИмяЭлемента, Тип("ГруппаФормы"), Родитель);
		НовыйЭлементГруппа.Вид                    = ВидГруппыФормы.ОбычнаяГруппа;
		НовыйЭлементГруппа.Отображение            = ОтображениеОбычнойГруппы.Нет;
		НовыйЭлементГруппа.ОтображатьЗаголовок    = Ложь;
		НовыйЭлементГруппа.Группировка            = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
		НовыйЭлементГруппа.Заголовок              = "(Вистерия) Добавленные реквизиты";
	КонецЕсли;
	
	Родитель = Элементы.Найти("спГруппаДобавленныеРеквизиты");
	ИмяЭлемента = "спРазмер";
	Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Родитель);
		НовыйЭлемент.ПутьКДанным              = "Объект.спРазмер";
		НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
		НовыйЭлемент.Заголовок                = "Размер";
	КонецЕсли;
	
	Родитель = Элементы.Найти("спГруппаДобавленныеРеквизиты");
	ИмяЭлемента = "спЦвет";
	Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Родитель);
		НовыйЭлемент.ПутьКДанным              = "Объект.спЦвет";
		НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок                = "Цвет";
	КонецЕсли;
	// end of dimedrol 24.01.2025
	
	// dimedrol 23.02.2025
	Родитель = Элементы.Найти("спГруппаДобавленныеРеквизиты");
	ИмяЭлемента = "спБренд";
	Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Родитель);
		НовыйЭлемент.ПутьКДанным              = "Объект.спБренд";
		НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок                = "Бренд";
	КонецЕсли;
	// end of dimedrol 23.02.2025
	
	// { Иванов С.С. (TNext) - 06.08.2025 - Задача №3342 
	Родитель = Элементы.Найти("ГруппаПрайсЛист");
	ЭлементПеред = Элементы.Найти("ГруппаНовинка");
	
	ИмяЭлемента = "спАтрибутРаздела";
	Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		НовыйЭлемент = Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Родитель, ЭлементПеред);
		НовыйЭлемент.ПутьКДанным              = "Объект.спАтрибутРаздела";
		НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
	ИмяЭлемента = "спМаркетинговаяКатегория";
	Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		НовыйЭлемент = Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Родитель, ЭлементПеред);
		НовыйЭлемент.ПутьКДанным              = "Объект.спМаркетинговаяКатегория";
		НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Форма.Объект.Ссылка) И Не ЗначениеЗаполнено(Форма.Объект.спМаркетинговаяКатегория) Тогда
		Форма.Объект.спМаркетинговаяКатегория = Перечисления.спМаркетинговыеКатегории.RARE;
	КонецЕсли;
	
	ИмяЭлемента = "спПодборка";
	Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		НовыйЭлемент = Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Родитель, ЭлементПеред);
		НовыйЭлемент.ПутьКДанным              = "Объект.спПодборка";
		НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеВвода;
	КонецЕсли;
	
	ИмяЭлемента = "спЯндексБизнес";
	Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
		НовыйЭлемент = Элементы.Вставить(ИмяЭлемента, Тип("ПолеФормы"), Родитель, ЭлементПеред);
		НовыйЭлемент.ПутьКДанным              = "Объект.спЯндексБизнес";
		НовыйЭлемент.Вид                      = ВидПоляФормы.ПолеФлажка;
		НовыйЭлемент.ПоложениеЗаголовка		  = ПоложениеЗаголовкаЭлементаФормы.Право;
	КонецЕсли;
	// } 
	
КонецПроцедуры

Процедура Справочник_ХранилищеШаблонов_Форма_ФормаРедактированияШаблона_ПриСозданииНаСервере(Форма)
	
	Элементы = Форма.Элементы;
	Команды = Форма.Команды;
	Подключаемый_ДействиеКоманды = "Подключаемый_ВыполнитьКоманду";
	
	//Добавляем новую команду
	НоваяКоманда = Команды.Добавить("спЗнакиУхода");
	НоваяКоманда.Действие = Подключаемый_ДействиеКоманды;
	НоваяКоманда.Заголовок = "Добавить ЗУ";
	  
	//Обращение к командной панели в форме
	КоманднаяПанельПоле = Элементы.Шапка.ПодчиненныеЭлементы.ДеревоНастроек.ПодчиненныеЭлементы.ДоступныеПоля.КоманднаяПанель;
	//Добавляем новую кнопку
	Элемент2 = Элементы.Добавить("спЗнакиУхода", Тип("КнопкаФормы"),КоманднаяПанельПоле);
	Элемент2.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	Элемент2.ИмяКоманды = "спЗнакиУхода";	 
	
	//Добавляем новую команду
	НоваяКоманда = Команды.Добавить("спЗнакиУходаКартинка");
	НоваяКоманда.Действие = Подключаемый_ДействиеКоманды;
	НоваяКоманда.Заголовок = "Добавить ЗУК";
	  
	//Добавляем новую кнопку
	Элемент2 = Элементы.Добавить("спЗнакиУходаКартинка", Тип("КнопкаФормы"),КоманднаяПанельПоле);
	Элемент2.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	Элемент2.ИмяКоманды = "спЗнакиУходаКартинка";	
	
КонецПроцедуры

Процедура Документ_ЗаказПоставщику_Форма_ФормаДокумента_ПриСозданииНаСервере(Форма)

	Элементы = Форма.Элементы;
	Команды = Форма.Команды;
	Подключаемый_ДействиеКоманды = "Подключаемый_ВыполнитьКоманду";
	
	//Добавляем новую команду
	НоваяКоманда = Команды.Добавить("спПечатьЭтикетокИЦенников");
	НоваяКоманда.Действие = Подключаемый_ДействиеКоманды;
	НоваяКоманда.Заголовок = "Печать этикеток и ценников";
	  
	//Обращение к командной панели в форме
	КоманднаяПанельПоле = Элементы.ГруппаВажныеКоманды;
	//Добавляем новую кнопку
	Элемент = Элементы.Добавить("спПечатьЭтикетокИЦенников", Тип("КнопкаФормы"), КоманднаяПанельПоле);
	Элемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	Элемент.ИмяКоманды = "спПечатьЭтикетокИЦенников";	 
	
	//Добавляем новую команду
	НоваяКоманда = Команды.Добавить("спНоменклатураИзФайла");
	НоваяКоманда.Действие = Подключаемый_ДействиеКоманды;
	НоваяКоманда.Заголовок = "Номенклатура из файла";
	  
	//Обращение к командной панели в форме
	КоманднаяПанельПоле = Элементы.ГруппаВажныеКоманды;
	//Добавляем новую кнопку
	Элемент = Элементы.Добавить("спНоменклатураИзФайла", Тип("КнопкаФормы"), КоманднаяПанельПоле);
	Элемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	Элемент.ИмяКоманды = "спНоменклатураИзФайла";	
	
	// dimedrol 23.02.2025
	//Добавляем новую команду
	НоваяКоманда = Команды.Добавить("спСоздатьУстановкуЦенПоАлгоритму");
	НоваяКоманда.Действие = Подключаемый_ДействиеКоманды;
	НоваяКоманда.Заголовок = "Создать установку цен по алгоритму";
	
	//Обращение к командной панели в форме
	КоманднаяПанельПоле = Элементы.ГруппаВажныеКоманды;
	//Добавляем новую кнопку
	Элемент = Элементы.Добавить("спСоздатьУстановкуЦенПоАлгоритму", Тип("КнопкаФормы"), КоманднаяПанельПоле);
	Элемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	Элемент.ИмяКоманды = "спСоздатьУстановкуЦенПоАлгоритму";
	// end of dimedrol 23.02.2025
	
КонецПроцедуры

Процедура Документ_ЗаказПоставщику_Форма_ФормаСписка_ПриСозданииНаСервере(Форма)

	Элементы = Форма.Элементы;
	Команды = Форма.Команды;
	Подключаемый_ДействиеКоманды = "Подключаемый_ВыполнитьКоманду";

	//Добавляем новую команду
	НоваяКоманда = Команды.Добавить("спПечатьЭтикетокИЦенников");
	НоваяКоманда.Действие = Подключаемый_ДействиеКоманды;
	НоваяКоманда.Заголовок = "Печать этикеток и ценников";
	  
	//Обращение к командной панели в форме
	КоманднаяПанельПоле = Элементы.ГруппаВажныеКоманды;
	//Добавляем новую кнопку
	Элемент = Элементы.Добавить("спПечатьЭтикетокИЦенников", Тип("КнопкаФормы"), КоманднаяПанельПоле);
	Элемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	Элемент.ИмяКоманды = "спПечатьЭтикетокИЦенников";	

КонецПроцедуры

// ++ Терлецкий АВ 25.01.15
Процедура Документ_ЗаказНаПеремещение_Форма_ФормаДокумента_ПриСозданииНаСервере(Форма)  
	РезультатОтправкиСообщения = Неопределено;  
	
	// ++ Терлецкий АВ 25.02.18
	ИмяКоманды  = "спОтправитьСообщение";
	ИмяЭлемента = "спОтправитьСообщение";
	
	Подключаемый_ДействиеКоманды = "Подключаемый_ВыполнитьКоманду";

	НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
	НоваяКоманда.Действие  = Подключаемый_ДействиеКоманды;
	НоваяКоманда.Заголовок = НСтр("ru = 'Отправить сообщение'");
	
	НовыйЭлемент = Форма.Элементы.Добавить(ИмяЭлемента, Тип("КнопкаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = ИмяКоманды;
    // -- Терлецкий АВ 25.02.18
	
	// { Иванов С.С. (TNext) - 26.03.2025 - Задача №1096 
	ИмяКоманды  = "спОтгрузкаТоваров";
	Подключаемый_ДействиеКоманды = "Подключаемый_ВыполнитьКоманду";

	НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
	НоваяКоманда.Действие  = Подключаемый_ДействиеКоманды;
	НоваяКоманда.Заголовок = НСтр("ru = 'Отгрузка товаров'");
	
	НовыйЭлемент = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Форма.Элементы.ФормаКоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = ИмяКоманды;
	// } 
	// { Иванов С.С. (TNext) - 26.03.2025 - Задача №1412 
	ИмяКоманды  = "спПодсортСЦС";
	Подключаемый_ДействиеКоманды = "Подключаемый_ВыполнитьКоманду";

	НоваяКоманда = Форма.Команды.Добавить(ИмяКоманды);
	НоваяКоманда.Действие  = Подключаемый_ДействиеКоманды;
	НоваяКоманда.Заголовок = НСтр("ru = 'Подсорт с ЦС'");
	
	НовыйЭлемент = Форма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Форма.Элементы.Запасы.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = ИмяКоманды;
	// } 
	
	СтруктурнаяЕдиницаРезерв = спОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("спОтправлятьСообщениеДляПодсортировкиМагазина");
	Если ЗначениеЗаполнено(СтруктурнаяЕдиницаРезерв) И Форма.Объект.СтруктурнаяЕдиницаРезерв = СтруктурнаяЕдиницаРезерв Тогда 
		Если Форма.Объект.Ссылка <> Документы.ЗаказНаПеремещение.ПустаяСсылка() Тогда  
			РезультатОтправкиСообщения = спПодключаемыеКомандыСервер.ПроверкаИсходящегоСообщенияНаВебСервер(Форма.Объект.Ссылка);
		КонецЕсли;
		
		//Обращение к командной панели в форме
		ПолеПраваяКолонка = Форма.Элементы.ПраваяКолонка;
		
		Если РезультатОтправкиСообщения = Истина Тогда 
			НовыйЭлемент = Форма.Элементы.Добавить("ОтправкаСообщения", Тип("ДекорацияФормы"), ПолеПраваяКолонка);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок = "Сообщение отправлено";
			НовыйЭлемент.ЦветТекста = WebЦвета.Зеленый;
			
		ИначеЕсли РезультатОтправкиСообщения = Ложь Тогда
			НовыйЭлемент = Форма.Элементы.Добавить("ОтправкаСообщения", Тип("ДекорацияФормы"), ПолеПраваяКолонка);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок = "Ошибка отправки";
			НовыйЭлемент.ЦветТекста = WebЦвета.Красный;
			
		Иначе
			НовыйЭлемент = Форма.Элементы.Добавить("ОтправкаСообщения", Тип("ДекорацияФормы"), ПолеПраваяКолонка);
			НовыйЭлемент.Вид = ВидДекорацииФормы.Надпись;
			НовыйЭлемент.Заголовок = "Сообщение не отправлялось";
			НовыйЭлемент.ЦветТекста = WebЦвета.Синий;
			
		КонецЕсли; 
		
	Иначе
		ДекорацияФормыОтправкаСообщения = Форма.Элементы.Найти("ОтправкаСообщения");
		
		Если Не ТипЗнч(ДекорацияФормыОтправкаСообщения) = Тип("ДекорацияФормы") Тогда 
			ПолеПраваяКолонка = Форма.Элементы.ПраваяКолонка;
			ДекорацияФормыОтправкаСообщения = Форма.Элементы.Добавить("ОтправкаСообщения", Тип("ДекорацияФормы"), ПолеПраваяКолонка);
			ДекорацияФормыОтправкаСообщения.Вид = ВидДекорацииФормы.Надпись;
		КонецЕсли;
		ДекорацияФормыОтправкаСообщения.Заголовок = "";
		
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура Документ_ЗаказНаПеремещение_Форма_ФормаСписка_ПриСозданииНаСервере(Форма)
       СуществующийДС = Форма["Список"]; 
	   
	   СуществующийДС.ТекстЗапроса = "ВЫБРАТЬ
	                                 |	спОтправленныеСообщения.СсылкаНаОбъект КАК СсылкаНаОбъект,
	                                 |	ВЫРАЗИТЬ(""Отправлено"" КАК СТРОКА(30)) КАК СотояниеСообщения,
	                                 |	0 КАК Приоритет
	                                 |ПОМЕСТИТЬ ВТОтправленныеСообщения
	                                 |ИЗ
	                                 |	РегистрСведений.спОтправленныеСообщения КАК спОтправленныеСообщения
	                                 |ГДЕ
	                                 |	спОтправленныеСообщения.СпособПередачи = &СпособПередачи
	                                 |
	                                 |ОБЪЕДИНИТЬ
	                                 |
	                                 |ВЫБРАТЬ
	                                 |	тбОчередь.СсылкаНаОбъект,
	                                 |	ВЫРАЗИТЬ(""Отправлено"" КАК СТРОКА(30)),
	                                 |	0
	                                 |ИЗ
	                                 |	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
	                                 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
	                                 |		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
	                                 |			И (тбСостояние.СтатусСообщения В (&СписокСтатусовИсходящихСообщений))
	                                 |			И (тбОчередь.СпособПередачи = &СпособПередачи)
	                                 |;
	                                 |
	                                 |////////////////////////////////////////////////////////////////////////////////
	                                 |ВЫБРАТЬ
	                                 |	тбОчередь.СсылкаНаОбъект КАК СсылкаНаОбъект,
	                                 |	ВЫРАЗИТЬ(""Ошибка отправки"" КАК СТРОКА(30)) КАК СотояниеСообщения,
	                                 |	1 КАК Приоритет
	                                 |ПОМЕСТИТЬ ВТОшибкаОтправки
	                                 |ИЗ
	                                 |	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
	                                 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
	                                 |		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСобытия
	                                 |			И (тбСостояние.СтатусСообщения В (&СписокСтатусовОшибкаОтправки))
	                                 |			И (тбОчередь.СпособПередачи = &СпособПередачи)
	                                 |;
	                                 |
	                                 |////////////////////////////////////////////////////////////////////////////////
	                                 |ВЫБРАТЬ
	                                 |	ВТОтправленныеСообщения.СсылкаНаОбъект КАК СсылкаНаОбъект,
	                                 |	ВТОтправленныеСообщения.СотояниеСообщения КАК СотояниеСообщения,
	                                 |	ВТОтправленныеСообщения.Приоритет КАК Приоритет
	                                 |ПОМЕСТИТЬ ВТСотояниеСообщения
	                                 |ИЗ
	                                 |	ВТОтправленныеСообщения КАК ВТОтправленныеСообщения
	                                 |
	                                 |ОБЪЕДИНИТЬ ВСЕ
	                                 |
	                                 |ВЫБРАТЬ
	                                 |	ВТОшибкаОтправки.СсылкаНаОбъект,
	                                 |	ВТОшибкаОтправки.СотояниеСообщения,
	                                 |	ВТОшибкаОтправки.Приоритет
	                                 |ИЗ
	                                 |	ВТОшибкаОтправки КАК ВТОшибкаОтправки
	                                 |;
	                                 |
	                                 |////////////////////////////////////////////////////////////////////////////////
	                                 |ВЫБРАТЬ
	                                 |	ВТСотояниеСообщения.СсылкаНаОбъект КАК СсылкаНаОбъект,
	                                 |	ВТСотояниеСообщения.СотояниеСообщения КАК СотояниеСообщения,
	                                 |	МАКСИМУМ(ВТСотояниеСообщения.Приоритет) КАК Приоритет
	                                 |ПОМЕСТИТЬ ВТСотояниеСообщенияПриоритет
	                                 |ИЗ
	                                 |	ВТСотояниеСообщения КАК ВТСотояниеСообщения
	                                 |
	                                 |СГРУППИРОВАТЬ ПО
	                                 |	ВТСотояниеСообщения.СсылкаНаОбъект,
	                                 |	ВТСотояниеСообщения.СотояниеСообщения
	                                 |;
	                                 |
	                                 |////////////////////////////////////////////////////////////////////////////////
	                                 |ВЫБРАТЬ
	                                 |	ВЫБОР
	                                 |		КОГДА НЕ ДокументЗаказНаПеремещение.Проведен
	                                 |				ИЛИ ДокументЗаказНаПеремещение.ВариантЗавершения = ЗНАЧЕНИЕ(Перечисление.ВариантыЗавершенияЗаказа.Отменен)
	                                 |			ТОГДА -1
	                                 |		КОГДА ЕСТЬNULL(ЗаказыНаПеремещениеОстаткиИОбороты.КоличествоРасход, 0) = 0
	                                 |			ТОГДА ВЫБОР
	                                 |					КОГДА ДокументЗаказНаПеремещение.СостояниеЗаказа = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовНаПеремещение.Завершен)
	                                 |						ТОГДА 2
	                                 |					КОГДА КОНЕЦПЕРИОДА(ДокументЗаказНаПеремещение.ДатаПеремещения, ДЕНЬ) < &АктуальнаяДатаСеанса
	                                 |						ТОГДА 6
	                                 |					КОГДА НАЧАЛОПЕРИОДА(ДокументЗаказНаПеремещение.ДатаПеремещения, ДЕНЬ) = НАЧАЛОПЕРИОДА(&АктуальнаяДатаСеанса, ДЕНЬ)
	                                 |						ТОГДА 4
	                                 |					ИНАЧЕ 2
	                                 |				КОНЕЦ
	                                 |		КОГДА ЕСТЬNULL(ЗаказыНаПеремещениеОстаткиИОбороты.КоличествоКонечныйОстаток, 0) = 0
	                                 |			ТОГДА 0
	                                 |		ИНАЧЕ ВЫБОР
	                                 |				КОГДА ДокументЗаказНаПеремещение.СостояниеЗаказа = ЗНАЧЕНИЕ(Справочник.СостоянияЗаказовНаПеремещение.Завершен)
	                                 |					ТОГДА 1
	                                 |				КОГДА КОНЕЦПЕРИОДА(ДокументЗаказНаПеремещение.ДатаПеремещения, ДЕНЬ) < &АктуальнаяДатаСеанса
	                                 |					ТОГДА 5
	                                 |				КОГДА НАЧАЛОПЕРИОДА(ДокументЗаказНаПеремещение.ДатаПеремещения, ДЕНЬ) = НАЧАЛОПЕРИОДА(&АктуальнаяДатаСеанса, ДЕНЬ)
	                                 |					ТОГДА 3
	                                 |				ИНАЧЕ 1
	                                 |			КОНЕЦ
	                                 |	КОНЕЦ КАК НомерКартинки,
	                                 |	ВЫБОР
	                                 |		КОГДА ДокументЗаказНаПеремещение.СтатусСборки = 0
	                                 |			ТОГДА 2
	                                 |		КОГДА ДокументЗаказНаПеремещение.СтатусСборки = 1
	                                 |			ТОГДА 1
	                                 |		КОГДА ДокументЗаказНаПеремещение.СтатусСборки = 2
	                                 |			ТОГДА 0
	                                 |	КОНЕЦ КАК НомерКартинкиСборки,
	                                 |	ВЫБОР
	                                 |		КОГДА КОНЕЦПЕРИОДА(ДокументЗаказНаПеремещение.ДатаПеремещения, ДЕНЬ) < &АктуальнаяДатаСеанса
	                                 |				И ЕСТЬNULL(ЗаказыНаПеремещениеОстаткиИОбороты.КоличествоКонечныйОстаток, 0) > 0
	                                 |			ТОГДА ИСТИНА
	                                 |		ИНАЧЕ ЛОЖЬ
	                                 |	КОНЕЦ КАК ПросроченоВыполнение,
	                                 |	ВЫБОР
	                                 |		КОГДА НАЧАЛОПЕРИОДА(ДокументЗаказНаПеремещение.ДатаПеремещения, ДЕНЬ) = НАЧАЛОПЕРИОДА(&АктуальнаяДатаСеанса, ДЕНЬ)
	                                 |				И ЕСТЬNULL(ЗаказыНаПеремещениеОстаткиИОбороты.КоличествоКонечныйОстаток, 0) > 0
	                                 |			ТОГДА ИСТИНА
	                                 |		ИНАЧЕ ЛОЖЬ
	                                 |	КОНЕЦ КАК НаСегодня,
	                                 |	&АктуальнаяДатаСеанса КАК АктуальнаяДатаСеанса,
	                                 |	ДокументЗаказНаПеремещение.Ссылка КАК Ссылка,
	                                 |	ДокументЗаказНаПеремещение.ПометкаУдаления КАК ПометкаУдаления,
	                                 |	ДокументЗаказНаПеремещение.Номер КАК Номер,
	                                 |	ДокументЗаказНаПеремещение.Дата КАК Дата,
	                                 |	ДокументЗаказНаПеремещение.Проведен КАК Проведен,
	                                 |	ДокументЗаказНаПеремещение.Автор КАК Автор,
	                                 |	ДокументЗаказНаПеремещение.ДокументОснование КАК ДокументОснование,
	                                 |	ДокументЗаказНаПеремещение.ЗаказПокупателя КАК ЗаказПокупателя,
	                                 |	ДокументЗаказНаПеремещение.Комментарий КАК Комментарий,
	                                 |	ДокументЗаказНаПеремещение.Организация КАК Организация,
	                                 |	ДокументЗаказНаПеремещение.ПоложениеЗаказаПокупателя КАК ПоложениеЗаказаПокупателя,
	                                 |	ДокументЗаказНаПеремещение.ДатаПеремещения КАК ДатаПеремещения,
	                                 |	ДокументЗаказНаПеремещение.СтруктурнаяЕдиницаРезерв КАК СтруктурнаяЕдиницаРезерв,
	                                 |	ДокументЗаказНаПеремещение.СтруктурнаяЕдиницаПолучатель КАК СтруктурнаяЕдиницаПолучатель,
	                                 |	ДокументЗаказНаПеремещение.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	                                 |	ДокументЗаказНаПеремещение.Запасы.(
	                                 |		Ссылка КАК Ссылка,
	                                 |		НомерСтроки КАК НомерСтроки,
	                                 |		Номенклатура КАК Номенклатура,
	                                 |		Характеристика КАК Характеристика,
	                                 |		Партия КАК Партия,
	                                 |		Количество КАК Количество,
	                                 |		Резерв КАК Резерв,
	                                 |		ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	                                 |		ЗаказПокупателя КАК ЗаказПокупателя,
	                                 |		КлючСвязи КАК КлючСвязи
	                                 |	) КАК Запасы,
	                                 |	ДокументЗаказНаПеремещение.ДополнительныеРеквизиты.(
	                                 |		Ссылка КАК Ссылка,
	                                 |		НомерСтроки КАК НомерСтроки,
	                                 |		Свойство КАК Свойство,
	                                 |		Значение КАК Значение,
	                                 |		ТекстоваяСтрока КАК ТекстоваяСтрока
	                                 |	) КАК ДополнительныеРеквизиты,
	                                 |	ДокументЗаказНаПеремещение.МоментВремени КАК МоментВремени,
	                                 |	ВЫБОР
	                                 |		КОГДА НаличиеФайлов.ЕстьФайлы ЕСТЬ NULL
	                                 |			ТОГДА 0
	                                 |		КОГДА НаличиеФайлов.ЕстьФайлы
	                                 |			ТОГДА 1
	                                 |		ИНАЧЕ 0
	                                 |	КОНЕЦ КАК ЕстьФайлы,
	                                 |	ДокументЗаказНаПеремещение.СостояниеЗаказа КАК СостояниеЗаказа,
	                                 |	ДокументЗаказНаПеремещение.СтатусСборки КАК СтатусСборки,
	                                 |	ВЫБОР
	                                 |		КОГДА ДокументЗаказНаПеремещение.СтруктурнаяЕдиницаРезерв = &СтруктурнаяЕдиницаРезерв
	                                 |			ТОГДА ВЫБОР
	                                 |					КОГДА ВТСотояниеСообщенияПриоритет.СотояниеСообщения ЕСТЬ NULL
	                                 |						ТОГДА ВЫРАЗИТЬ(""Сообщение не отправлялось"" КАК СТРОКА(30))
	                                 |					ИНАЧЕ ВТСотояниеСообщенияПриоритет.СотояниеСообщения
	                                 |				КОНЕЦ
	                                 |		ИНАЧЕ ВЫРАЗИТЬ("""" КАК СТРОКА(30))
	                                 |	КОНЕЦ КАК СотояниеСообщения
	                                 |ИЗ
	                                 |	Документ.ЗаказНаПеремещение КАК ДокументЗаказНаПеремещение
	                                 |		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеФайлов КАК НаличиеФайлов
	                                 |		ПО ДокументЗаказНаПеремещение.Ссылка = НаличиеФайлов.ОбъектСФайлами}
	                                 |		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыНаПеремещение.ОстаткиИОбороты КАК ЗаказыНаПеремещениеОстаткиИОбороты
	                                 |		ПО ДокументЗаказНаПеремещение.Ссылка = ЗаказыНаПеремещениеОстаткиИОбороты.ЗаказНаПеремещение}
	                                 |		ЛЕВОЕ СОЕДИНЕНИЕ ВТСотояниеСообщенияПриоритет КАК ВТСотояниеСообщенияПриоритет
	                                 |		ПО ДокументЗаказНаПеремещение.Ссылка = ВТСотояниеСообщенияПриоритет.СсылкаНаОбъект";
									
	   
	Форма.Список.Параметры.УстановитьЗначениеПараметра("СпособПередачи", Перечисления.спСпособПередачи.SOAP); 
	Форма.Список.Параметры.УстановитьЗначениеПараметра("СписокСтатусовИсходящихСообщений", спКэшируемыеФункцииВызовСервера.ПоучитьСписокСтатусовОчередиИсходящихСообщений()); 
    Форма.Список.Параметры.УстановитьЗначениеПараметра("СписокСтатусовОшибкаОтправки", спКэшируемыеФункцииВызовСервера.ПоучитьСписокСтатусовОшибкаОтправки());
	
	Форма.Список.Параметры.УстановитьЗначениеПараметра("АктуальнаяДатаСеанса", ТекущаяДатаСеанса()); 
	
	СтруктурнаяЕдиницаРезерв = спОбщегоНазначенияВызовСервера.ПолучитьЗначениеКонстанты("спОтправлятьСообщениеДляПодсортировкиМагазина"); 
	Форма.Список.Параметры.УстановитьЗначениеПараметра("СтруктурнаяЕдиницаРезерв", СтруктурнаяЕдиницаРезерв);

	   
	// Получим элемент динамического списка
	СуществующийЭлементДС = Форма.Элементы["Список"];
	
	// Добавим колонку
	НоваяКолонкаТаблицы = Форма.Элементы.Добавить("СотояниеСообщения", Тип("ПолеФормы"), СуществующийЭлементДС);
	НоваяКолонкаТаблицы.ПутьКДанным = "Список.СотояниеСообщения";
КонецПроцедуры
// -- Терлецкий АВ 25.01.15

Процедура Документ_ЗаказНаПеремещение_ФормаСписка_УстановкаИнтервалаОбновленияСписка(Форма)

	// Добавить интервал обновления списка
	Элементы 						= Форма.Элементы;
	Родитель 						= Элементы.Найти("ФильтрыНастройкиИДопИнфо");
	ИмяРеквизита 					= "спИнтервал";
	Подключаемый_ДействиеКоманды 	= "Подключаемый_ВыполнитьКоманду";
	
	Реквизит = Новый РеквизитФормы(ИмяРеквизита, ОбщегоНазначения.ОписаниеТипаЧисло(10),, НСтр("ru = 'Обновлять каждые (минут)'"));
	ДобавляемыеРеквизиты = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Реквизит);
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ЭлементФормы 						= Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Родитель);
	ЭлементФормы.Вид 					= ВидПоляФормы.ПолеВвода;
	ЭлементФормы.ПутьКДанным 			= ИмяРеквизита;
	ЭлементФормы.РежимВыбораИзСписка 	= Истина;  
	
	ЭлементФормы.СписокВыбора.Добавить(0, НСтр("ru = 'откл.'"));
	ЭлементФормы.СписокВыбора.Добавить(60, НСтр("ru = '1'"));
	ЭлементФормы.СписокВыбора.Добавить(120, НСтр("ru = '2'"));
	ЭлементФормы.СписокВыбора.Добавить(180, НСтр("ru = '3'"));
	ЭлементФормы.СписокВыбора.Добавить(240, НСтр("ru = '4'"));
	ЭлементФормы.СписокВыбора.Добавить(300, НСтр("ru = '5'"));
	ЭлементФормы.СписокВыбора.Добавить(360, НСтр("ru = '6'"));
	ЭлементФормы.СписокВыбора.Добавить(420, НСтр("ru = '7'"));
	ЭлементФормы.СписокВыбора.Добавить(480, НСтр("ru = '8'"));
	ЭлементФормы.СписокВыбора.Добавить(540, НСтр("ru = '9'"));
	ЭлементФормы.СписокВыбора.Добавить(600, НСтр("ru = '10'"));
	ЭлементФормы.СписокВыбора.Добавить(660, НСтр("ru = '11'"));
	ЭлементФормы.СписокВыбора.Добавить(720, НСтр("ru = '12'"));
	ЭлементФормы.СписокВыбора.Добавить(780, НСтр("ru = '13'"));
	ЭлементФормы.СписокВыбора.Добавить(840, НСтр("ru = '14'"));
	ЭлементФормы.СписокВыбора.Добавить(900, НСтр("ru = '15'"));
	ЭлементФормы.УстановитьДействие("ПриИзменении", Подключаемый_ДействиеКоманды); 
	
	Интервал = ОбщегоНазначения.ХранилищеНастроекДанныхФормЗагрузить(Форма.ИмяФормы, Форма.ИмяФормы, 600,, ИмяПользователя());
	Форма[ИмяРеквизита] = Интервал;
	
	Элементы.Список.Автообновление = Интервал <> 0;
	Элементы.Список.ПериодАвтообновления = Интервал;
	Элементы.Список.Обновить();
	
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(Форма.ИмяФормы, Форма.ИмяФормы, Интервал,, ИмяПользователя());

КонецПроцедуры
// -- Терлецкий АВ 25.01.15

Процедура Документ_ПеремещениеЗапасов_Форма_ФормаДокумента_ПриСозданииНаСервере(Форма)

	// {  Иванов С.С. (TNext) - 23.01.2025
	Элементы = Форма.Элементы;
	Команды = Форма.Команды;
	Подключаемый_ДействиеКоманды = "Подключаемый_ВыполнитьКоманду";
	
	ГруппаЗапасыКоманднаяПанель = Элементы.Найти("ГруппаЗапасыКоманднаяПанель");
	
	Команда = Команды.Добавить("спПриемТоваров");
	Команда.Действие = Подключаемый_ДействиеКоманды;
	Команда.Заголовок = НСтр("ru = 'Прием товаров'");
	  
	Элемент = Элементы.Добавить("спПриемТоваров", Тип("КнопкаФормы"), ГруппаЗапасыКоманднаяПанель);
	Элемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	Элемент.ИмяКоманды = "спПриемТоваров";
	Элемент.Видимость = Документ_ПеремещениеЗапасов_ПроверкаСоответствия(Форма.Объект.СтруктурнаяЕдиница, Форма.Объект.СтруктурнаяЕдиницаПолучатель);
	// }

КонецПроцедуры 

Функция Документ_ПеремещениеЗапасов_ПроверкаСоответствия(Отправитель, Получатель) Экспорт
	
	// ++ Терлецкий АВ 25.01.24
	СкладОтправитель = спУправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("спСкладОтправитель");
	СкладПолучатель = спУправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("спСкладПолучатель");
	// -- Терлецкий АВ 25.01.24
	
	Результат = (Отправитель = СкладОтправитель И Получатель = СкладПолучатель);
		
	Возврат Результат; 
	
КонецФункции
// -- Терлецкий АВ 25.01.15 

// ++ Терлецкий АВ 25.01.19
Процедура Документ_ЗаказПокупателя_Форма_ФормаДокумента_ПриСозданииНаСервере(Форма)
	Элементы = Форма.Элементы;
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Бренд", Новый ОписаниеТипов("Строка"), "Объект.Запасы", "Бренд", Ложь)); 
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Размер", Новый ОписаниеТипов("СправочникСсылка.спРазмеры"), "Объект.Запасы", "Возраст", Ложь));
	МассивРеквизитов.Добавить(Новый РеквизитФормы("Цвет", Новый ОписаниеТипов("СправочникСсылка.спЦвета"), "Объект.Запасы", "Цвет", Ложь));
	Форма.ИзменитьРеквизиты( МассивРеквизитов );
	
	НовыйЭлмент = Элементы.Вставить("Бренд", Тип("ПолеФормы"), Элементы.Запасы,	Элементы.Запасы.ПодчиненныеЭлементы["ЗапасыПартия"]);
	НовыйЭлмент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлмент.ПутьКДанным = "Объект.Запасы.Бренд";
	НовыйЭлмент.Заголовок = "Бренд";  
	
	НовыйЭлмент = Элементы.Вставить("Возраст", Тип("ПолеФормы"), Элементы.Запасы,	Элементы.Запасы.ПодчиненныеЭлементы["ЗапасыПартия"]);
	НовыйЭлмент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлмент.ПутьКДанным = "Объект.Запасы.Размер";
	НовыйЭлмент.Заголовок = "Размер";
	
	
	НовыйЭлмент = Элементы.Вставить("Цвет", Тип("ПолеФормы"), Элементы.Запасы,	Элементы.Запасы.ПодчиненныеЭлементы["ЗапасыПартия"]);
	НовыйЭлмент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлмент.ПутьКДанным = "Объект.Запасы.Цвет";
	НовыйЭлмент.Заголовок = "Цвет";
	
	// { Иванов С.С. (TNext) - 06.05.2025 - Задача №1448 
	Родитель 		= Элементы.Найти("ГруппаОтменаНеотгруженных");  
	КнопкаФормы 	= Элементы.Найти("ФормаКоманднаяПанель__спОтменаНеотгруженныхСтрок");     
	Если КнопкаФормы <> Неопределено Тогда
		Элементы.Переместить(КнопкаФормы, Родитель); 
		КнопкаФормы = Элементы.Найти("ОтменитьНеотгруженныеСтроки");
		Если КнопкаФормы <> Неопределено Тогда
			КнопкаФормы.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	// }
	
КонецПроцедуры
// -- Терлецкий АВ 25.01.19

// dimedrol 23.02.2025
Процедура Справочник_Контрагенты_Форма_ФормаЭлемента_ПриСозданииНаСервере(Форма)
	
	Элементы = Форма.Элементы;
	
	// элемент формы Алгоритм установки цен
	Родитель = Элементы.Найти("ГруппаПрочие");
	ИмяЭлемента = "спАлгоритмРасчетаУстановкиЦен";
	Если Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
	 	НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), Родитель);
		НовыйЭлемент.ПутьКДанным = "Объект.спАлгоритмРасчетаУстановкиЦен";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Алгоритм расчета установки цен";
	КонецЕсли;
	
КонецПроцедуры
// end of dimedrol 23.02.2025

Процедура СкрытьЭлементыФормыРекурсивно(РеквизитыКОтображению, Элементы)
	
	Для каждого ЭлементФормы Из Элементы Цикл
		
		Если ТипЗнч(ЭлементФормы) = Тип("ПолеФормы") Тогда
			
			Если РеквизитыКОтображению.Найти(ЭлементФормы.Имя) = Неопределено Тогда
				
				ЭлементФормы.Видимость = Ложь;
				
			КонецЕсли;
			
		ИначеЕсли ТипЗнч(ЭлементФормы) = Тип("ГруппаФормы") Тогда
			
			ПодчиненныеЭлементы = ЭлементФормы.ПодчиненныеЭлементы;
			
			Если ПодчиненныеЭлементы.Количество() > 0 Тогда
				
				СкрытьЭлементыФормыРекурсивно(РеквизитыКОтображению, ПодчиненныеЭлементы);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

#Область ВнешниеКартинки

Процедура ПереопределитьВыводКартинокНаВнешние(Форма)

	// {  Иванов С.С. (TNext) - 20.02.2025  
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	Изображения = Форма.Изображения;
	УникальныйИдентификатор = Форма.УникальныйИдентификатор;
	ТекущееИзображение = Форма.ТекущееИзображение;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спВнешниеКартинкиТовара.ВнешняяСсылка КАК ВнешняяСсылка
		|ИЗ
		|	РегистрСведений.спВнешниеКартинкиТовара КАК спВнешниеКартинкиТовара
		|ГДЕ
		|	спВнешниеКартинкиТовара.АртикулПоставщика = &АртикулПоставщика";
	
	Запрос.УстановитьПараметр("АртикулПоставщика", Форма.Объект.спАртикулПоставщика);
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = Запрос.Выполнить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	ВнешниеСсылки = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ВнешняяСсылка");
	Изображения.Очистить();
	
	Для каждого ВнешняяСсылка Из ВнешниеСсылки Цикл
		
		ДвоичныеДанныеКартинки = СсылкаНаДвоичныеДанныеКартинки(ВнешняяСсылка,, УникальныйИдентификатор);
		Если ДвоичныеДанныеКартинки <> Неопределено Тогда
			НоваяСтрока = Изображения.Вставить(0);
			НоваяСтрока.Адрес = ДвоичныеДанныеКартинки;
		КонецЕсли;
		
	КонецЦикла;
	
	КоличествоИзображений = Элементы.Изображение.ПодчиненныеЭлементы.Количество();
	ОтображаемоеИзображение = Элементы.Изображение.ПодчиненныеЭлементы[КоличествоИзображений - 1];
	ОтображаемоеИзображение.ТекстНевыбраннойКартинки = Элементы.АдресКартинки.ТекстНевыбраннойКартинки;
	Если Изображения.Количество() = 0 Тогда
		ТекущееИзображение = 0;
		ОтображаемоеИзображение.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.Одинарная);
	Иначе
		ТекущееИзображение = 0;
		ОтображаемоеИзображение.Рамка = Новый Рамка(ТипРамкиЭлементаУправления.БезРамки);
	КонецЕсли;
	
	УстановитьПрокруткуИзображения(Форма);
	ИзображениеВидимостьКоманднойПанели(Форма);
	
	// Убираем неиспользуемый функционал
	Форма.РазрешеноРедактированиеНоменклатуры = Ложь;
	
	КомандыИзображения = Элементы.Найти("КомандыИзображения");
	КомандыИзображения.Доступность = Ложь;
	
КонецПроцедуры

Функция СсылкаНаДвоичныеДанныеКартинки(ВнешняяСсылка, Размер = 0, УникальныйИдентификатор = Неопределено, Напрямую = Ложь) Экспорт
	
	Если УникальныйИдентификатор = Неопределено Тогда
		УникальныйИдентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	СтруктураУРЛ = ОбщегоНазначенияКлиентСервер.СтруктураURI(ВнешняяСсылка);
	
	Если СтруктураУРЛ.Схема = "https" Тогда
		ТипСоединения = Новый ЗащищенноеСоединениеOpenSSL() 
	Иначе
		ТипСоединения = Неопределено;
	КонецЕсли;
	
	АдресСервера 	= СтруктураУРЛ.ИмяСервера; 
	СсылкаКартинки 	= СтруктураУРЛ.ПутьНаСервере; 
	ЭтоЯндекс 		= СтрНайти(АдресСервера, "disk.360.yandex.ru") > 0;
	ИспользоватьАПИ = Не Напрямую И ЭтоЯндекс;
	
	Если ИспользоватьАПИ Тогда 
		// используется API
		АдресСервера 	= "cloud-api.yandex.net"; 
		Разделитель 	= "/";
		РазделительРесурса = "&path=";
		Части 			= СтрРазделить(ВнешняяСсылка, Разделитель, Ложь);
		Части[0] 		= Части[0] + Разделитель;
		Части[3] 		= ?(СтрЗаканчиваетсяНа(Части[3], РазделительРесурса), Части[3], Части[3] + РазделительРесурса);
		ПубличныйКлюч 	= СтрСоединить(Части, Разделитель); 
		СсылкаКартинки 	= СтрШаблон("/v1/disk/public/resources/download?public_key=%1", ПубличныйКлюч);
	КонецЕсли;              
	    
	Попытка
		
		УстановитьПривилегированныйРежим(Истина);
		Соединение = Новый HTTPСоединение(АдресСервера,,,,,, ТипСоединения);
		Запрос = Новый HTTPЗапрос(СсылкаКартинки);
		Ответ = Соединение.Получить(Запрос);
		УстановитьПривилегированныйРежим(Ложь);
		
		Если Ответ.КодСостояния = 200 Тогда
			
			Если ИспользоватьАПИ Тогда 
				
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
				СсылкаНаСкачиваниеФайла = ПрочитатьJSON(ЧтениеJSON);
				Если ЗначениеЗаполнено(СсылкаНаСкачиваниеФайла.href) тогда 
					АдресКартинки =  СсылкаНаДвоичныеДанныеКартинки(СсылкаНаСкачиваниеФайла.href, Размер, УникальныйИдентификатор, Истина);
				Иначе
					Возврат Неопределено;
				КонецЕсли;
				
			Иначе
				
				ДвоичныеДанныеКартинки = Ответ.ПолучитьТелоКакДвоичныеДанные();
				
				Если Размер <> 0 Тогда
					Картинка = Новый Картинка(ДвоичныеДанныеКартинки);
					ОбрабатываемаяКартинка = Новый ОбрабатываемаяКартинка(Картинка);
					ОбрабатываемаяКартинка.УстановитьРазмер(Размер, );
					ОбрабатываемаяКартинка.ПреобразоватьВОттенкиСерого();
					Картинка = ОбрабатываемаяКартинка.ПолучитьКартинку();
					ДвоичныеДанныеКартинки = Картинка.ПолучитьДвоичныеДанные();
				КонецЕсли;
				
				АдресКартинки = ПоместитьВоВременноеХранилище(ДвоичныеДанныеКартинки, УникальныйИдентификатор);
				
			КонецЕсли;
			
		ИначеЕсли СтрНачинаетсяС(Ответ.КодСостояния, "3") Тогда
			
			Ссылка = Ответ.Заголовки.Получить("Location");
			АдресКартинки =  СсылкаНаДвоичныеДанныеКартинки(Ссылка, Размер, УникальныйИдентификатор, Истина);
			
		Иначе
			
			ТекстИсключения = СтрШаблон(НСтр("ru = 'Не удалось получить картинку. Код ответа: %1'"), Ответ.КодСостояния);
			ВызватьИсключение ТекстИсключения;

		КонецЕсли;
		
		Возврат АдресКартинки;
	
	Исключение
		
		Ошибка = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		спЛогированиеСобытийИБ.ЛогироватьСобытиеИБ("Tnext.ПолучениеВнешнейКартинки", "Ошибка",,,Ошибка);
		Возврат Неопределено;
		
	КонецПопытки;

КонецФункции

// Устанавливает видимость и доступность кнопок перелистывания изображения.
//
Процедура УстановитьПрокруткуИзображения(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	Изображения = Форма.Изображения;
	ТекущееИзображение = Форма.ТекущееИзображение;
	
	Если Изображения.Количество() <= 1 Тогда
		Элементы.ДекорацияПрокруткаИзображенийВлево.Видимость = Ложь;
		Элементы.ДекорацияПрокруткаИзображенийВправо.Видимость = Ложь;
		Элементы.ДекорацияПрокруткаИзображенийВлевоОтступ.Видимость = Истина;
		Элементы.ДекорацияПрокруткаИзображенийВправоОтступ.Видимость = Истина;
		Возврат;
	КонецЕсли;
	
	Если ТекущееИзображение = 0 Тогда
		Элементы.ДекорацияПрокруткаИзображенийВлево.Видимость = Ложь;
		Элементы.ДекорацияПрокруткаИзображенийВправо.Видимость = Истина;
	ИначеЕсли ТекущееИзображение = Изображения.Количество() - 1 Тогда
		Элементы.ДекорацияПрокруткаИзображенийВлево.Видимость = Истина;
		Элементы.ДекорацияПрокруткаИзображенийВправо.Видимость = Ложь;
	Иначе
		Элементы.ДекорацияПрокруткаИзображенийВлево.Видимость = Истина;
		Элементы.ДекорацияПрокруткаИзображенийВправо.Видимость = Истина
	КонецЕсли;
	
	Элементы.ДекорацияПрокруткаИзображенийВлево.Видимость = Ложь;
	Элементы.ДекорацияПрокруткаИзображенийВправо.Видимость = Истина;
	
	Элементы.ДекорацияПрокруткаИзображенийВлевоОтступ.Видимость = Не Элементы.ДекорацияПрокруткаИзображенийВлево.Видимость;
	Элементы.ДекорацияПрокруткаИзображенийВправоОтступ.Видимость = Не Элементы.ДекорацияПрокруткаИзображенийВправо.Видимость;
	
	ЭлементАдресКартинки = Элементы.Найти("АдресКартинки1");
	Если ЭлементАдресКартинки <> Неопределено Тогда
		ТекущийЭлемент = ЭлементАдресКартинки;
	КонецЕсли;
	
КонецПроцедуры

// Устанавливает видимость кнопок контекстного меню изображения.
//
Процедура ИзображениеВидимостьКоманднойПанели(Форма)
	
	Объект = Форма.Объект;
	Элементы = Форма.Элементы;
	Изображения = Форма.Изображения;
	ТекущееИзображение = Форма.ТекущееИзображение;
	ОтображатьКнопкуСортировкиНаФорме = Форма.ОтображатьКнопкуСортировкиНаФорме;
	
	ЕстьИзображения = Изображения.Количество();
	
	ЭтоОсновноеИзображение = Ложь;
	Если ЕстьИзображения Тогда
		ЭтоОсновноеИзображение = (ТекущееИзображение = 0);
	КонецЕсли;
	
	Элементы.ДекорацияИндикацияОсновнойКартинки.Видимость = ЭтоОсновноеИзображение;
	Элементы.ДекорацияИндикацияНеОсновнойКартинки.Видимость = Не ЭтоОсновноеИзображение;
	
	
	Элементы.ГруппаИндикацияОсновнойКартинки.Видимость = ЕстьИзображения;
	Элементы.АдресКартинкиКонтекстноеМенюУстановитьИзображениеОсновнымДоп.Видимость = Ложь;
	Элементы.АдресКартинкиКонтекстноеМенюПросмотретьИзображениеДоп.Видимость = Ложь;
	Элементы.АдресКартинкиКонтекстноеМенюУдалитьИзображениеДоп.Видимость = Ложь;
	Элементы.АдресКартинкиКонтекстноеМенюУстановитьИзображениеОсновным.Видимость = Ложь;
	Элементы.АдресКартинкиКонтекстноеМенюУдалитьИзображение.Видимость = Ложь;
	Элементы.АдресКартинкиКонтекстноеМенюПросмотретьИзображение.Видимость = Ложь;
	Элементы.АдресКартинкиКонтекстноеМенюКнопкаСортировкаФайловНаСайте.Видимость = Ложь;
	
	Элементы.АдресКартинкиКонтекстноеМенюУстановитьИзображениеОсновнымДоп.Доступность = Ложь;
	Элементы.АдресКартинкиКонтекстноеМенюПросмотретьИзображениеДоп.Доступность = Ложь;
	Элементы.АдресКартинкиКонтекстноеМенюУдалитьИзображениеДоп.Доступность = Ложь;
	Элементы.АдресКартинкиКонтекстноеМенюУстановитьИзображениеОсновным.Доступность = Ложь;
	Элементы.АдресКартинкиКонтекстноеМенюУдалитьИзображение.Доступность = Ложь;
	Элементы.АдресКартинкиКонтекстноеМенюПросмотретьИзображение.Доступность = Ложь;
	Элементы.АдресКартинкиКонтекстноеМенюКнопкаСортировкаФайловНаСайте.Доступность = Ложь;

КонецПроцедуры

#КонецОбласти

Процедура ПереопределитьЭлементФормы(Элементы, КопируемыйЭлемент, Родитель, Префикс = "сп")

	// Скрываем типовые картинки
	Если КопируемыйЭлемент = Неопределено Тогда
		 Возврат;
	КонецЕсли;
	
	// Создаем новую группу с картинками копированием
	СкопироватьЭлементРекурсивно(Элементы, КопируемыйЭлемент, Родитель, Префикс);
	
	КопируемыйЭлемент.Видимость = Ложь;

КонецПроцедуры

Процедура СкопироватьЭлементРекурсивно(Элементы, КопируемыйЭлемент, Родитель, Префикс, Вставить = Истина)
	
	Если Вставить Тогда
		ЭлементПеред = КопируемыйЭлемент;
	Иначе
		ЭлементПеред = Неопределено;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(КопируемыйЭлемент);
	ЭтоГруппаФормы = ТипЗначения = Тип("ГруппаФормы");
	ЕстьПутьКДаннымЗаголовка = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(КопируемыйЭлемент, "ПутьКДаннымЗаголовка");
	ИмяНовогоЭлементы = Префикс + КопируемыйЭлемент.Имя;
	
	НовыйЭлемент = Элементы.Найти(ИмяНовогоЭлементы);
	Если НовыйЭлемент <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовыйЭлемент = Элементы.Вставить(ИмяНовогоЭлементы, ТипЗначения, Родитель, ЭлементПеред); 
	
	ИсключаемыеПоля = ?(ЕстьПутьКДаннымЗаголовка, "Имя, ПутьКДаннымЗаголовка", "Имя");
	
	ЗаполнитьЗначенияСвойств(НовыйЭлемент, КопируемыйЭлемент,, ИсключаемыеПоля); 
	
	Если ЭтоГруппаФормы Тогда
		
		Для каждого Элемент Из КопируемыйЭлемент.ПодчиненныеЭлементы Цикл 
			СкопироватьЭлементРекурсивно(Элементы, Элемент, НовыйЭлемент, Префикс, Ложь);
		КонецЦикла;
		
	ИначеЕсли ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(КопируемыйЭлемент, "КонтекстноеМеню") Тогда
		
		Для каждого Элемент Из КопируемыйЭлемент.КонтекстноеМеню.ПодчиненныеЭлементы Цикл
			СкопироватьЭлементРекурсивно(Элементы, Элемент, НовыйЭлемент.КонтекстноеМеню, Префикс, Ложь);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ТипЗначения = Тип("КнопкаФормы") Тогда
		Возврат;
	КонецЕсли;
	
	// копируем основные действия
	ДействияСтрокой = "ПриИзменении, Нажатие";
	Действия = СтрРазделить(ДействияСтрокой, ", ", Ложь);
	
	Для каждого Действие Из Действия Цикл
		
		МетодДействия = КопируемыйЭлемент.ПолучитьДействие(Действие);
		Если ЗначениеЗаполнено(МетодДействия) Тогда
			НовыйЭлемент.УстановитьДействие(Действие, МетодДействия);
		КонецЕсли;
	
	КонецЦикла;
	
КонецПроцедуры

#Область Справочник_ШтрихкодыУпаковокТоваров

Процедура Справочник_ШтрихкодыУпаковокТоваров_Форма_ПеренестиКнопку(Форма)
	
	Элементы 		= Форма.Элементы;
	Родитель 		= Элементы.Найти("ПодменюПечать");  
	КнопкаФормы 	= Элементы.Найти("ФормаОбработкаспПовторнаяПечатьЭтикетокСДатаМатриксКодомПовторнаяПечатьЭтикеток");     
	
	Элементы.Переместить(КнопкаФормы, Родитель);

КонецПроцедуры

#КонецОбласти

Процедура Справочник_Сотрудники_ФормаЭлемента_ПриСоздании(Форма)

	Элементы = Форма.Элементы;
	
	ИмяРеквизита = "спТорговыйОбъект";
	ЭлементПеред = Элементы.Найти("Наименование"); 
	
	//НовыйЭлемент = Элементы.Вставить(ИмяРеквизита, Тип("ПолеФормы"), Форма, ЭлементПеред);
	Родитель = ЭлементПеред.Родитель;
	НовыйЭлемент = Элементы.Добавить(ИмяРеквизита, Тип("ПолеФормы"), Родитель);
	//к
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = СтрШаблон("Объект.%1", ИмяРеквизита); 

КонецПроцедуры

#Область Документ_ЗаказНаЭмиссиюКодовМаркировкиСУЗ

Процедура Документ_ЗаказНаЭмиссиюКодовМаркировкиСУЗ_Форма_ПриСоздании(Форма)

	// { Иванов С.С. (TNext) - 06.05.2025 - Задача №1448  
	Элементы 		= Форма.Элементы;
	
	Родитель 		= Элементы.Найти("ТоварыГруппаПодменюЗаполнить");  
	КнопкаФормы 	= Элементы.Найти("ФормаКоманднаяПанель__спВидУпаковкиGTIN");     
	Если КнопкаФормы <> Неопределено Тогда
		Элементы.Переместить(КнопкаФормы, Родитель); 
	КонецЕсли;
	// }

КонецПроцедуры

#КонецОбласти   

#КонецОбласти