
&После("ПривестиАдресИМестоРасчетов")
Процедура спПривестиАдресИМестоРасчетов(ДанныеЧека, ПараметрыРегистрации)
	
	// Добавим сведения о кассе ККМ в чек:  
	Если ДанныеЧека.Свойство("КассаККМ") И ЗначениеЗаполнено(ДанныеЧека.КассаККМ) Тогда   
		
		ПредставлениеКассы = ДанныеЧека.КассаККМ.Наименование;
		АдресСкладаКассыККМ = ПечатьДокументовУНФ.КонтактнаяИнформация(ДанныеЧека.КассаККМ.СтруктурнаяЕдиница, Справочники.ВидыКонтактнойИнформации.ФактАдресСтруктурнойЕдиницы);

		ДанныеЧека.Вставить("МестоРасчетов", ПредставлениеКассы);
		ДанныеЧека.Вставить("АдресРасчетов", АдресСкладаКассыККМ);
		
	КонецЕсли;
	
КонецПроцедуры
