#Область ПрограммныйИнтерфейс

// Процедура - Загрузить метрики посетителей
//
// Параметры:
//  ДатаОбработки	 - ДатаВремя - дата на которую загружаются данные в систему
//
Процедура ЗагрузитьМетрикиПосетителей(ДатаОбработки) Экспорт
	
	ДатаНачала = НачалоДня(ДатаОбработки);
	ДатаОкончания = КонецДня(ДатаОбработки);
	
	ДанныеНастройки = спУправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("спНастройкаЗагрузкиПодсчетаПосетителей");
	
	ЗаголовокСообщения = НСтр("ru = 'Загрузка данных в систему подсчета посетителей'") 
		+ Символы.ПС + НСтр("ru = 'Наименование - ""%1"" Код - %2'");
	
	ЗаголовокСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
	ЗаголовокСообщения,
	ДанныеНастройки.Наименование,
	ДанныеНастройки.Код);         
	
	URLСервиса = ДанныеНастройки.АдресСервиса;
	
	УстановитьПривилегированныйРежим(Истина);
	ТокенДоступа = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(ДанныеНастройки, "ТокенДоступа"); 
	УстановитьПривилегированныйРежим(Ложь);
	
	Если ТокенДоступа = Неопределено Тогда
		СтрСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1
		|Ошибка получения токена доступа.'"),
		ЗаголовокСообщения,);
		ЗаписатьВЖурналИВыдатьСообщение(СтрСообщения, Истина);
		Возврат;
	КонецЕсли;
    
	Попытка
		Метрики = МетрикиПосетителей(
		URLСервиса, 
		ТокенДоступа, 
		ДатаНачала, 
		ДатаОкончания, 
		"portal", 
		"external");
	Исключение                         
		ОписаниеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		СтрСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1
		|%2'"),
		ЗаголовокСообщения,
		ОписаниеОшибки);
		ЗаписатьВЖурналИВыдатьСообщение(СтрСообщения, Истина);
		Возврат;
	КонецПопытки;
	
	ОбработатьМетрики(Метрики, ДанныеНастройки, ЗаголовокСообщения);
	
КонецПроцедуры

// Функция - Получить метрики посетителей
//
// Параметры:
//  URLСервиса			 - Строка	 - Ссылка на сервис "1С-Рарус:Система подсчета посетителей"
//  ТокенДоступа		 - Строка	 - токен доступа в формате JWT 
//  ДатаНачала			 - ДатаВремя - Дата начала отбора метрик. Обязателен к заполнению
//  ДатаОкончания		 - ДатаВремя - Дата окончания отбора метрик. Обязателен к заполнению
//  ТипОбъекта			 - Строка	 - Тип объекта получаемых метрик, доступные значения:
//										- "object"- объекты
//										- "zone" - зоны
//										- "portal" - переходы 
//										Значение по умолчанию: "portal"
//  ТипИдентификатора	 - Строка	 - Тип возвращаемого идентификатора объекта, доступные значения:
//										- “internal” - Внутренний идентификатора объекта (идентификатор объекта в 1С)
//										- “external” - Внешний идентификатор объекта.
//										Значение по умолчанию: “internal” 
//   ЗаголовокСообщения	- Строка	- тест заголовка сообщения об ошибке
//
// Возвращаемое значение:
//   - Массив - массив с метриками
//
// Пример возвращаемого файла:
//	{
// 		"error_flag": 0,
// 		"messages": [
// 		"Без ошибок"
// 		],
// 		"payload": {
// 			"metrics": [
// 				{
// 					"object_id": "120353489",
// 					"date": "2022-02-01T13:00:00",
// 					"in": 32,
// 					"out": 35,
// 					"name": "Вход 2",
// 					"owner_id": "12674563",
// 					"zone_id": "56666444"
// 				},
// 				{
// 					"object_id": "102571185",
// 					"date": "2022-02-01T15:30:00",
// 					"in": 32,
// 					"out": 38,
// 					"name": "Вход",
// 					"owner_id": "2655555",
// 					"owner_name": "ТЦ Ромашка",
// 					"zone_id": "149061785"
// 				}
// 			]
// 		}
//	}
//
// Пример вызова функции:
//	Процедура ПримерИспользования()
//    
//    	URLСервиса = "https://lk.rarus-spp.ru/metrics/hs/common/metrics";
//    	ТокенДоступа = "ваш_токен_jwt";
//    
//    	ДатаНачала = Дата(2022, 6, 10);
//    	ДатаОкончания = Дата(2022, 6, 23);
//    
//    	Попытка
//        	Метрики = ПолучитьМетрикиПосетителей(
//            	URLСервиса, 
//            	ТокенДоступа, 
//            	ДатаНачала, 
//            	ДатаОкончания, 
//            	"portal", 
//            	"external");
//			
//			ОбработкаМетрик(Метрики);	
//		
//    	Исключение
//        	Сообщить("Ошибка: " + ОписаниеОшибки());
//    	КонецПопытки;
//    
//	КонецПроцедуры
//
Функция МетрикиПосетителей(Знач URLСервиса, Знач ТокенДоступа, 
                                    Знач ДатаНачала, Знач ДатаОкончания, 
                                    Знач ТипОбъекта = "portal", 
                                    Знач ТипИдентификатора = "internal") Экспорт
    
    // Проверка периода (не более 14 дней)
    Если ДатаОкончания - ДатаНачала > 14 * 86400 Тогда
        ВызватьИсключение НСтр("ru = 'Период получения данных не может быть больше 14 дней'");
    КонецЕсли;
    
    // Формирование URL запроса
    ПараметрыЗапроса = Новый Массив;
    ПараметрыЗапроса.Добавить(СтрШаблон("start_date=%1", Формат(ДатаНачала, "ДФ='yyyy-MM-ddTHH:mm:ss'")));
    ПараметрыЗапроса.Добавить(СтрШаблон("end_date=%1", Формат(ДатаОкончания, "ДФ='yyyy-MM-ddTHH:mm:ss'")));
    ПараметрыЗапроса.Добавить(СтрШаблон("object_type=%1", ТипОбъекта));
    ПараметрыЗапроса.Добавить(СтрШаблон("identifier_type=%1", ТипИдентификатора));
    
    
	// Установка заголовков
    Заголовки = Новый Соответствие;
	Заголовки.Вставить("x-authorization", ТокенДоступа);
	Заголовки.Вставить("Accept", "application/json");
	
	// Создание HTTP-соединения
    СтруктураУРЛ = ОбщегоНазначенияКлиентСервер.СтруктураURI(URLСервиса);
	Если СтруктураУРЛ.Схема = "https" Тогда
		ТипСоединения = Новый ЗащищенноеСоединениеOpenSSL() 
	Иначе
		ТипСоединения = Неопределено;
	КонецЕсли;
	АдресСервера 	= СтруктураУРЛ.ИмяСервера; 
	
	URLЗапроса = СтрШаблон("%1?%2", СтруктураУРЛ.ПутьНаСервере, СтрСоединить(ПараметрыЗапроса, "&"));
	
    Соединение = Новый HTTPСоединение(АдресСервера, СтруктураУРЛ.Порт, СтруктураУРЛ.Логин, СтруктураУРЛ.Пароль, Новый ИнтернетПрокси(Истина), 50, ТипСоединения);  
    Запрос = Новый HTTPЗапрос(URLЗапроса, Заголовки);
    
    // Отправка запроса 
	Попытка
		Ответ = Соединение.Получить(Запрос);
	Исключение
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
        ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка при отправке запроса: %1'"), ОписаниеОшибки);
	КонецПопытки;
	
	// Проверка статуса ответа
    Если Ответ.КодСостояния <> 200 Тогда
        ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка при обращении к сервису: %1'"),  Ответ.КодСостояния);
        ВызватьИсключение ТекстОшибки;
    КонецЕсли;
    
    // Чтение и разбор JSON ответа
    ЧтениеJSON = Новый ЧтениеJSON;
    ЧтениеJSON.ОткрытьПоток(Ответ.ПолучитьТелоКакПоток());
    
    Попытка
        Результат = ПрочитатьJSON(ЧтениеJSON);
	Исключение                          
		ОписаниеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
        ВызватьИсключение СтрШаблон(НСтр("ru = 'Ошибка при разборе JSON ответа: %1'"), ОписаниеОшибки);
    КонецПопытки;
    
    ЧтениеJSON.Закрыть();
    
    // Проверка флага ошибки в ответе
    Если Результат.error_flag <> 0 Тогда
        СообщенияОшибок = "";
        Для Каждого Сообщение Из Результат.messages Цикл
            СообщенияОшибок = СообщенияОшибок + Сообщение + Символы.ПС;
        КонецЦикла;
        ВызватьИсключение СообщенияОшибок;
    КонецЕсли;
    
    Возврат Результат.payload.metrics;
    
КонецФункции
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьМетрики(Метрики, ДанныеНастройки, ЗаголовокСообщения)
	
	СчетчикПодсчетаПосетителей = ДанныеНастройки.СчетчикПодсчетаПосетителей;
	
	ДокументРегистрацииДляЗаписи = Неопределено;
	ЗаменилиДанныеСтатистики     = Ложь; 
	БылиНеКритическиеОшибки = Ложь;
	БылиКритическиеОшибки   = Ложь;
	НайденыФайлыКОбработке  = Ложь;
	КоличествоОбработанныхВТранзакцииДокументов = 0;
		
	Для Каждого Метрика Из Метрики Цикл
		// Поиск документа 
		ДатаМетрики = ПрочитатьДатуJSON(Метрика.date, ФорматДатыJSON.ISO);
		ВремяРегистрации = Дата("01.01.0001 " + Формат(ДатаМетрики, "ДЛФ=T"));
		ДатаВремяРегистрации = Дата(Формат(ДатаМетрики, "ДЛФ=DT"));
		КоличествоВходящих   = Метрика.in;
		КоличествоВыходящих  = Метрика.out;
		
		Если Не ДокументРегистрацииДляЗаписи = Неопределено 
			И  НачалоДня(ДокументРегистрацииДляЗаписи.Дата) = НачалоДня(ДатаВремяРегистрации)
			И  ДокументРегистрацииДляЗаписи.СчетчикПодсчетаПосетителей = СчетчикПодсчетаПосетителей Тогда
			
			ДокументРегистрации = ДокументРегистрацииДляЗаписи;
			СтрокаДокумента = ДокументРегистрации.ДанныеПодсчета.Найти(ВремяРегистрации, "ВремяРегистрации");
			Если Не СтрокаДокумента = Неопределено Тогда
				НомерСтроки = СтрокаДокумента.НомерСтроки;
			Иначе
				НомерСтроки = 0;
			КонецЕсли;
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	РегистрацияПодсчетаПосетителейДанныеПодсчета.Ссылка КАК Ссылка,
			|	ЕСТЬNULL(РегистрацияПодсчетаПосетителейДанныеПодсчета.НомерСтроки, 0) КАК НомерСтроки,
			|	ВЫБОР
			|		КОГДА РегистрацияПодсчетаПосетителейДанныеПодсчета.Ссылка ЕСТЬ NULL
			|			ТОГДА ИСТИНА
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ КАК ЕстьНомерСтроки
			|ПОМЕСТИТЬ ДанныеПодсчетаПосетителей
			|ИЗ
			|	Документ.РегистрацияПодсчетаПосетителей.ДанныеПодсчета КАК РегистрацияПодсчетаПосетителейДанныеПодсчета
			|ГДЕ
			|	НЕ РегистрацияПодсчетаПосетителейДанныеПодсчета.Ссылка.ПометкаУдаления
			|	И РегистрацияПодсчетаПосетителейДанныеПодсчета.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И РегистрацияПодсчетаПосетителейДанныеПодсчета.Ссылка.СчетчикПодсчетаПосетителей = &СчетчикПодсчетаПосетителей
			|	И РегистрацияПодсчетаПосетителейДанныеПодсчета.ВремяРегистрации = &ВремяРегистрации
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	РегистрацияПодсчетаПосетителей.Ссылка КАК Ссылка,
			|	МИНИМУМ(ДанныеПодсчетаПосетителей.НомерСтроки) КАК НомерСтроки,
			|	ДанныеПодсчетаПосетителей.ЕстьНомерСтроки КАК ЕстьНомерСтроки
			|ИЗ
			|	Документ.РегистрацияПодсчетаПосетителей КАК РегистрацияПодсчетаПосетителей
			|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеПодсчетаПосетителей КАК ДанныеПодсчетаПосетителей
			|		ПО РегистрацияПодсчетаПосетителей.Ссылка = ДанныеПодсчетаПосетителей.Ссылка
			|ГДЕ
			|	НЕ РегистрацияПодсчетаПосетителей.ПометкаУдаления
			|	И РегистрацияПодсчетаПосетителей.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И РегистрацияПодсчетаПосетителей.СчетчикПодсчетаПосетителей = &СчетчикПодсчетаПосетителей
			|
			|СГРУППИРОВАТЬ ПО
			|	РегистрацияПодсчетаПосетителей.Ссылка,
			|	ДанныеПодсчетаПосетителей.ЕстьНомерСтроки
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДанныеПодсчетаПосетителей.ЕстьНомерСтроки,
			|	РегистрацияПодсчетаПосетителей.Проведен УБЫВ";
			
			Запрос.УстановитьПараметр("ДатаНачала"                , НачалоДня(ДатаВремяРегистрации));
			Запрос.УстановитьПараметр("ДатаОкончания"             , КонецДня(ДатаВремяРегистрации));
			Запрос.УстановитьПараметр("СчетчикПодсчетаПосетителей", СчетчикПодсчетаПосетителей);
			Запрос.УстановитьПараметр("ВремяРегистрации"          , ВремяРегистрации );
			
			Результат = Запрос.Выполнить();
			Выборка = Результат.Выбрать();
			
			Если Выборка.Следующий() Тогда
				ДокументРегистрации = Выборка.Ссылка.ПолучитьОбъект();
				НомерСтроки = Выборка.НомерСтроки;
			Иначе 
				ДокументРегистрации = Документы.РегистрацияПодсчетаПосетителей.СоздатьДокумент();
				ДокументРегистрации.Дата                       = ДатаВремяРегистрации;
				ДокументРегистрации.СчетчикПодсчетаПосетителей = СчетчикПодсчетаПосетителей;
				ДокументРегистрации.Магазин                    = СчетчикПодсчетаПосетителей.Магазин;
				ДокументРегистрации.Ответственный = Пользователи.ТекущийПользователь();
				НомерСтроки = 0;
				ЗаменилиДанныеСтатистики = Истина;
				ДокументРегистрации.СтатистикаПодсчетаСотрудников.Загрузить(СчетчикПодсчетаПосетителей.СтатистикаПодсчетаСотрудников.Выгрузить());
			КонецЕсли;
		КонецЕсли;
		
		Если ДокументРегистрацииДляЗаписи <> Неопределено
			И ДокументРегистрацииДляЗаписи <> ДокументРегистрации Тогда
			
			ЗаменилиДанныеСтатистики = Ложь;
			НачатьТранзакцию();
			Попытка
				Если ДокументРегистрацииДляЗаписи.ДанныеПодсчета.Количество()>0 Тогда
					ДокументРегистрацииДляЗаписи.Записать(РежимЗаписиДокумента.Проведение);
				КонецЕсли; 
				НайденыФайлыКОбработке = Истина;
				ДокументРегистрацииДляЗаписи = Неопределено;
				КоличествоОбработанныхВТранзакцииДокументов = КоличествоОбработанныхВТранзакцииДокументов + 1;
			Исключение
				
				ОтменитьТранзакцию();
				СтрСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1
				|Ошибка проведения документа за дату %2'"),
				ЗаголовокСообщения,
				Формат(ДокументРегистрацииДляЗаписи.Дата, "ДЛФ=D"));
				
				ЗаписатьВЖурналИВыдатьСообщение(СтрСообщения, Истина);
				БылиКритическиеОшибки = Истина;
				ФайлНеСодержитОшибок  = Ложь;
			КонецПопытки;
			Если Не ДанныеНастройки.КоличествоЭлементовВТранзакции = 0
				И КоличествоОбработанныхВТранзакцииДокументов = ДанныеНастройки.КоличествоЭлементовВТранзакции Тогда
				
				КоличествоОбработанныхВТранзакцииДокументов = 0;
				
				ЗафиксироватьТранзакцию();
				
			КонецЕсли;
		КонецЕсли;
		
		Если НомерСтроки = 0 Тогда
			СтрокаДокумента = ДокументРегистрации.ДанныеПодсчета.Добавить();
		ИначеЕсли ДанныеНастройки.ЗаменятьДанныеПриПовторнойЗагрузке Тогда
			СтрокаДокумента = ДокументРегистрации.ДанныеПодсчета[НомерСтроки - 1];
		КонецЕсли;
		
		Если НомерСтроки = 0 ИЛИ ДанныеНастройки.ЗаменятьДанныеПриПовторнойЗагрузке Тогда
			СтрокаДокумента.ВремяРегистрации    = ВремяРегистрации;
			СтрокаДокумента.КоличествоВходящих  = КоличествоВходящих;
			СтрокаДокумента.КоличествоВыходящих = КоличествоВыходящих;
			ДокументРегистрацииДляЗаписи        = ДокументРегистрации;
		КонецЕсли;
		
		Если НЕ ЗаменилиДанныеСтатистики И ДанныеНастройки.ЗаменятьДанныеПриПовторнойЗагрузке Тогда
			ДокументРегистрации.СтатистикаПодсчетаСотрудников.Загрузить(СчетчикПодсчетаПосетителей.СтатистикаПодсчетаСотрудников.Выгрузить());
			ЗаменилиДанныеСтатистики = Истина;
		КонецЕсли;

	КонецЦикла;
	
	Если Не ДокументРегистрацииДляЗаписи = Неопределено Тогда
		НачатьТранзакцию();
		Попытка
			Если ДокументРегистрацииДляЗаписи.ДанныеПодсчета.Количество()>0 Тогда
				ДокументРегистрацииДляЗаписи.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			НайденыФайлыКОбработке = Истина;
			ДокументРегистрацииДляЗаписи = Неопределено;
			КоличествоОбработанныхВТранзакцииДокументов = КоличествоОбработанныхВТранзакцииДокументов + 1;
		Исключение
			
			СтрСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = '%1
			|Ошибка проведения документа за дату %2'"),
			ЗаголовокСообщения,
			Формат(ДокументРегистрацииДляЗаписи.Дата, "ДЛФ=D"));
			
			ЗаписатьВЖурналИВыдатьСообщение(СтрСообщения, Истина);
			БылиКритическиеОшибки = Истина;
			ФайлНеСодержитОшибок  = Ложь;
			ОтменитьТранзакцию();
		КонецПопытки;
		
		Если Не ДанныеНастройки.КоличествоЭлементовВТранзакции = 0
			И КоличествоОбработанныхВТранзакцииДокументов = ДанныеНастройки.КоличествоЭлементовВТранзакции Тогда
			КоличествоОбработанныхВТранзакцииДокументов = 0;
			ЗафиксироватьТранзакцию();
		КонецЕсли;
	КонецЕсли;
					
	Если БылиКритическиеОшибки Тогда
		СтрСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1
		|Были критические ошибки при загрузке'"),
		ЗаголовокСообщения);
		ЗаписатьВЖурналИВыдатьСообщение(СтрСообщения, Истина);
	ИначеЕсли БылиНеКритическиеОшибки Тогда
		СтрСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1
		|Были не критические ошибки при загрузке'"),
		ЗаголовокСообщения);
		ЗаписатьВЖурналИВыдатьСообщение(СтрСообщения, Истина);
	ИначеЕсли НЕ НайденыФайлыКОбработке Тогда
		
		СтрСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1
		|Не найдены файлы к обработке'"),
		ЗаголовокСообщения);
		ЗаписатьВЖурналИВыдатьСообщение(СтрСообщения, Истина);
		
	Иначе
		СтрСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = '%1
		|Загрузка прошла успешно'"),
		ЗаголовокСообщения);
		ЗаписатьВЖурналИВыдатьСообщение(СтрСообщения, Ложь);
	КонецЕсли;

КонецПроцедуры

Процедура ЗаписатьВЖурналИВыдатьСообщение(СтрСообщения, ЭтоОшибка)
	
	ИмяСобытия = НСтр("ru = 'Регистрация подсчета посетителей'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	спЛогированиеСобытийИБ.ЛогироватьСобытиеИБ(ИмяСобытия, ?(ЭтоОшибка, "Ошибка", "Информация"),,, СтрСообщения);
	
	ОбщегоНазначения.СообщитьПользователю(СтрСообщения);
	
КонецПроцедуры 

#КонецОбласти