#Область ОписаниеПеременных

&НаКлиенте
Перем МассивВыбранных; // используется для хранения выбранных строк 

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Отправитель", Отправитель);
	Параметры.Свойство("Организация", Организация);
	
	Получатель = Неопределено; 
	Параметры.Свойство("Получатель", Получатель);
	
	Если ЗначениеЗаполнено(Получатель) Тогда
		ГруппаПолучателя = Получатель.Родитель;
	КонецЕсли;
	
	УстановитьПараметрыСпискаЗапасыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	МассивВыбранных = Новый Массив;
	УстановитьПараметрыСпискаЗапасыНаКлиенте(МассивВыбранных);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименьшееКоличествоНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ИзменениеНаименьшегоКоличества();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ИзменениеНаименьшегоКоличества()

	НаименьшееКоличество = Ждать ВвестиЧислоАсинх(НаименьшееКоличество, НСтр("ru = 'Наименьшее количество'"), 15, 3);
	УстановитьПараметрыСпискаЗапасыНаКлиенте(МассивВыбранных);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапасы

&НаКлиенте
Процедура ЗапасыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Поле.Имя = "ЗапасыПометка" Тогда
		
		ДанныеСтроки = Элемент.ДанныеСтроки(ВыбраннаяСтрока);
		
		Если ДанныеСтроки.Пометка Тогда
			
			СнятьПометку(ВыбраннаяСтрока);
			
		Иначе
			
			УстановитьПометку(ВыбраннаяСтрока);
			
		КонецЕсли;
		
	Иначе
		
		ПоказатьЗначение(, ВыбраннаяСтрока);
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПеренестиВЗаказ(Команда)
	
	ДанныеЗапасовВЗаказ = ДанныеЗапасовВЗаказ();
	Закрыть(ДанныеЗапасовВЗаказ);
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ЗаполнитьКоличествоКЗаказу(Команда)

	КоличествоКЗаказу = Ждать ВвестиЧислоАсинх(КоличествоКЗаказу, НСтр("ru = 'Количество к заказу'"), 15, 3);
	УстановитьПараметрыСпискаЗапасыНаКлиенте(МассивВыбранных);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьВсе(Команда)
	
	УстановитьПометки();
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	ОтменитьПометки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьПараметрыСпискаЗапасыНаСервере()
	
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Запасы, "ВыделенныеСтроки", Новый Массив , Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Запасы, "КоличествоКЗаказу", КоличествоКЗаказу, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Запасы, "НаименьшееКоличество", НаименьшееКоличество, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Запасы, "Отправитель", Отправитель, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Запасы, "Организация", Организация, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Запасы, "ГруппаСкладов", ГруппаПолучателя, Истина);

КонецПроцедуры

&НаСервере
Процедура УстановитьПараметрыСпискаЗапасыНаКлиенте(МассивВыбранных)
		
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Запасы, "ВыделенныеСтроки", МассивВыбранных, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Запасы, "КоличествоКЗаказу", КоличествоКЗаказу, Истина);
	ОбщегоНазначенияКлиентСервер.УстановитьПараметрДинамическогоСписка(Запасы, "НаименьшееКоличество", НаименьшееКоличество, Истина);
		
КонецПроцедуры

#Область ВыделенныеСтрокиСписка

&НаКлиенте
Процедура СнятьПометку(Строка)
	
	ИндексСтроки = МассивВыбранных.Найти(Строка);
	
	Если ИндексСтроки <> Неопределено Тогда
		МассивВыбранных.Удалить(ИндексСтроки);
		УстановитьПараметрыСпискаЗапасыНаКлиенте(МассивВыбранных);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометку(Строка)
	
	ИндексСтроки = МассивВыбранных.Найти(Строка);
	
	Если ИндексСтроки = Неопределено Тогда
		МассивВыбранных.Добавить(Строка);
		УстановитьПараметрыСпискаЗапасыНаКлиенте(МассивВыбранных);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьПометки()
	
	МассивВыбранных = Новый Массив;
	УстановитьПараметрыСпискаЗапасыНаКлиенте(МассивВыбранных);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки()
	
	МассивВыбранных = ВсеСтроки();
	УстановитьПараметрыСпискаЗапасыНаКлиенте(МассивВыбранных);
	
КонецПроцедуры

&НаСервере
Функция ВсеСтроки()
	
	Элемент = Элементы.Запасы;
	
	Схема = Элемент.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	
	Настройки = Элемент.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаЗначений = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ТаблицаЗначений.ВыгрузитьКолонку("Номенклатура");
	
КонецФункции

&НаСервере
Функция ДанныеЗапасовВЗаказ()
	
	Элемент = Элементы.Запасы;
	
	Схема = Элемент.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	
	Настройки = Элемент.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Пометка");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
	ЭлементОтбора = Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Количество");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Больше;
	ЭлементОтбора.ПравоеЗначение = 0;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,, Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТаблицаЗначений = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗначений);
	
КонецФункции

#КонецОбласти

#КонецОбласти
