
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура спПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ДобавитьЭлементыРеквизитыФормы();
	
	// СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	ЗагрузкаДанныхИзВнешнегоИсточника.ПриСозданииНаСервере(Метаданные.Обработки.ПечатьЭтикетокИЦенниковБПО.ТабличныеЧасти.Товары, ЭтотОбъект.НастройкиЗагрузкиДанных, ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ЗагрузкаДанныхИзВнешнегоИсточника
	
КонецПроцедуры

//<<<--- Tnext Козык К.А. 16.06.2026 - адаптация под новый релиз 3.0.13.357
&НаКлиенте
&ИзменениеИКонтроль("ОбработкаОповещения")
Процедура спОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ВводДоступен() Тогда
		Если ИмяСобытия = "ЗаполнитьДанныеЭтикетокИЦенников" Тогда
			
			Для Каждого Товар Из Параметр Цикл
				
				#Вставка
				Фильтр = Новый Структура("НоменклатураБПО, ХарактеристикаБПО");
				ЗаполнитьЗначенияСвойств(Фильтр, Товар);
				
				НайденныеСтроки = Объект.Товары.НайтиСтроки(Фильтр);
				Если НайденныеСтроки.Количество() > 0 Тогда
					НайденнаяСтрока = НайденныеСтроки[0];
					НайденнаяСтрока.Количество = НайденнаяСтрока.Количество + 1;
					Продолжить;
				КонецЕсли;
				#КонецВставки
				
				НоваяСтрока = Объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар);
				
			КонецЦикла;
			
		ИначеЕсли ИмяСобытия = "ScanData" Тогда
			
			ДанныеОповещения = Параметр[0];
			ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПоискаПоШтрихкодуЭтикетокИЦенниковБПО", ЭтотОбъект);
			ВыполнитьОбработкуОповещения(ОписаниеОповещения, ДанныеОповещения);
			
		КонецЕсли;
	КонецЕсли;
	
	ПечатьЭтикетокИЦенниковБПОКлиентПереопределяемый.ОбработкаОповещения(ИмяСобытия, Параметр, Источник, ЭтотОбъект);
	
КонецПроцедуры //--->>> Tnext Козык К.А. 16.06.2026

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура спЗаполнитьИзФайла(Команда)
	
	ЭтотОбъект.НастройкиЗагрузкиДанных.ПолноеИмяОбъектаЗаполнения = "Обработка.ПечатьЭтикетокИЦенниковБПО.ТабличнаяЧасть.Товары";
	
	ЭтотОбъект.НастройкиЗагрузкиДанных.Вставить("ПолноеИмяТабличнойЧасти", "ПечатьЭтикетокИЦенниковБПО.Товары");
	ЭтотОбъект.НастройкиЗагрузкиДанных.Вставить("ИмяМакетаСШаблоном","ЗагрузкаИзФайлаЗапасы");
	ЭтотОбъект.НастройкиЗагрузкиДанных.Вставить("Заголовок", НСтр("ru = 'Загрузка запасов из файла'"));
	ЭтотОбъект.НастройкиЗагрузкиДанных.Вставить("СодержаниеВидимо", Истина);
	ЭтотОбъект.НастройкиЗагрузкиДанных.Вставить("ПоложениеСклада", ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ПустаяСсылка"));
	ЭтотОбъект.НастройкиЗагрузкиДанных.Вставить("КонтрагентПоставщик", ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ПустаяСсылка"));
	ЭтотОбъект.НастройкиЗагрузкиДанных.Вставить("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийПриходнаяНакладная.ПустаяСсылка"));
	ЭтотОбъект.НастройкиЗагрузкиДанных.Вставить("ЗагрузкаТабличнойЧастиУслуги", Ложь);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, ЭтотОбъект.НастройкиЗагрузкиДанных);
	
	ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(ЭтотОбъект.НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьЭлементыРеквизитыФормы()
	
	// Добавим необходимые реквизиты формы
	ДобавляемыеРеквизиты = Новый Массив;
	
	РеквизитНастройкиЗагрузкиДанных = Новый РеквизитФормы("НастройкиЗагрузкиДанных", Новый ОписаниеТипов("Неопределено"));
	ДобавляемыеРеквизиты.Добавить(РеквизитНастройкиЗагрузкиДанных);
	
	ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	// Добавление команды и кнопки "Заполнить из файла"
	ИмяКоманды = "спЗаполнитьИзФайла";
	ЗаголовокКоманды = НСтр("ru = 'Заполнить из файла'");
	
	КомандаПодобратьЯчейки = Команды.Добавить(ИмяКоманды);
	КомандаПодобратьЯчейки.Действие = ИмяКоманды;
	КомандаПодобратьЯчейки.Заголовок = ЗаголовокКоманды;
	КомандаПодобратьЯчейки.ИзменяетСохраняемыеДанные = Истина;
	КомандаПодобратьЯчейки.Подсказка = НСтр("ru = 'Загрузка запасов (товаров) из внешнего источника'");
	
	ЭлементПеред = Элементы.Найти("ЗаполнитьПоОтбору");
	Родитель = Элементы.Найти("ГруппаКоманднаяПанельТовары");
	
	КнопкаПодобратьЯчейки = Элементы.Вставить(ИмяКоманды, Тип("КнопкаФормы"), Родитель, ЭлементПеред);
	КнопкаПодобратьЯчейки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КнопкаПодобратьЯчейки.ИмяКоманды = ИмяКоманды;
	КнопкаПодобратьЯчейки.Картинка = БиблиотекаКартинок.ЗагрузкаИзФайла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата(РезультатЗагрузки, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗагрузки) = Тип("Структура") Тогда
		
		Если РезультатЗагрузки.ОписаниеДействия = "ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника" Тогда
		
			ЗагрузкаДанныхИзВнешнегоИсточника.ИзменитьСпособЗагрузкиДанныхИзВнешнегоИсточника(ЭтотОбъект.НастройкиЗагрузкиДанных.ИмяФормыЗагрузкиДанныхИзВнешнихИсточников);
			
			ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузкаДанныхИзВнешнегоИсточникаОбработкаРезультата", ЭтотОбъект, ЭтотОбъект.НастройкиЗагрузкиДанных);
			ЗагрузкаДанныхИзВнешнегоИсточникаКлиент.ПоказатьФормуЗагрузкиДанныхИзВнешнегоИсточника(ЭтотОбъект.НастройкиЗагрузкиДанных, ОписаниеОповещения, ЭтотОбъект);
			
		ИначеЕсли РезультатЗагрузки.ОписаниеДействия = "ОбработатьПодготовленныеДанные" Тогда
			
			ДлительнаяОперация = ОбработатьПодготовленныеДанныеНоменклатуры(РезультатЗагрузки);
			
			СтруктураПараметров = Новый Структура;
			ПроверитьНеобходимостьПодключенияОбработчикаОжидания(ДлительнаяОперация, СтруктураПараметров);
			
		КонецЕсли;
		
	Иначе
		
		ЗагрузитьИзФайлаЗавершение(РезультатЗагрузки, Неопределено);
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных, ТипЗагрузки)
	
	ЗагруженныеДанные = ПолучитьИзВременногоХранилища(АдресЗагруженныхДанных);
	
	ТоварыДобавлены = Ложь;
	Для каждого СтрокаТаблицы Из ЗагруженныеДанные Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТаблицы.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаТаблицы.Номенклатура.ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.Запас Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Объект.Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы,, "Цена");
		НоваяСтрока.НоменклатураБПО = СтрокаТаблицы.Номенклатура;
		ТоварыДобавлены = Истина;
		
	КонецЦикла;
	
	Если ТоварыДобавлены Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьИзФайлаЗавершение(АдресЗагруженныхДанных, ДополнительныйПараметр) Экспорт
	
	Если АдресЗагруженныхДанных = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	ЗагрузитьИзФайлаНаСервере(АдресЗагруженныхДанных, ДополнительныйПараметр);
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыполненияФоновогоЗадания(Прогресс, ДополнительныеПараметры) Экспорт
	
	Если НЕ Прогресс = Неопределено Тогда
		ОбработатьПодготовленныеДанные(Прогресс.АдресРезультата);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьПодготовленныеДанные(АдресРезультатаЗагрузки)
	
	РезультатЗагрузки = ПолучитьИзВременногоХранилища(АдресРезультатаЗагрузки);	
	Если РезультатЗагрузки <> Неопределено Тогда
		ТаблицаСопоставленияДанных = РезультатЗагрузки.ТаблицаСопоставленияДанных;
		ЗагрузитьДанныеВТабличноеПолеЗапасы(ТаблицаСопоставленияДанных);
	КонецЕсли;	
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИменаСвойств()
	
	ИменаСвойств = "Количество, Цена, Штрихкод";
	Если ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		
		ИменаСвойств = ИменаСвойств + ", ХарактеристикаБПО";
		
	КонецЕсли;
	
	Возврат ИменаСвойств;
	
КонецФункции

&НаСервере
Процедура ЗагрузитьДанныеВТабличноеПолеЗапасы(ТаблицаСопоставленияДанных)
	
	ИменаСвойств = ИменаСвойств();
	
	НачатьТранзакцию();
	
	Попытка
		
		Для Каждого СтрокаТаблицы Из ТаблицаСопоставленияДанных Цикл
			
			ЗагрузкаВПриложениеВозможна = СтрокаТаблицы[ЗагрузкаДанныхИзВнешнегоИсточника.ИмяСлужебногоПоляЗагрузкаВПриложениеВозможна()];
			Если ЗагрузкаВПриложениеВозможна Тогда
				
				НоваяСтрока = Объект.Товары.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицы,, "Цена");
				
				НоваяСтрока.НоменклатураБПО = СтрокаТаблицы.Номенклатура;
				
			КонецЕсли;
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		спЛогированиеСобытийИБ.ЛогироватьСобытиеИБ(НСтр("ru='Загрузка данных'", ОбщегоНазначения.КодОсновногоЯзыка()), 
			"Ошибка", "Справочник.Номенклатура", , ПодробноеПредставлениеОшибки);
		
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьНеобходимостьПодключенияОбработчикаОжидания(ДлительнаяОперация, СтруктураПараметров = Неопределено)
	
	Если ДлительнаяОперация.Статус = "Выполнено" Тогда
		
		ПослеВыполненияФоновогоЗадания(ДлительнаяОперация, СтруктураПараметров);
		
	Иначе
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПослеВыполненияФоновогоЗадания", ЭтотОбъект);
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Идет загрузка данных.'");
		ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ВыводитьСообщения = Истина;
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОбработатьПодготовленныеДанныеНоменклатуры(РезультатЗагрузки)
	
	ПараметрыВызоваСервера = Новый Структура;
	ПараметрыВызоваСервера.Вставить("НастройкиЗагрузкиДанных", РезультатЗагрузки.НастройкиЗагрузкиДанных);
	ПараметрыВызоваСервера.Вставить("ТаблицаСопоставленияДанных", ДанныеФормыВЗначение(РезультатЗагрузки.ТаблицаСопоставленияДанных, Тип("ТаблицаЗначений")));
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Подсистема ЗагрузкаДанныхИзВнешнегоИсточника: Выполнение серверного метода загрузки результата'");
	ПараметрыВыполнения.ЗапуститьНеВФоне    = Ложь;
	ПараметрыВыполнения.ЗапуститьВФоне      = Истина;	
	
	ИмяМетода = "Справочники.Номенклатура.ОбработатьПодготовленныеДанные";
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ИмяМетода, ПараметрыВызоваСервера, ПараметрыВыполнения);
	
КонецФункции

#КонецОбласти