
&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	Для Каждого СтрокаТЗ Из ВладелецФормы.maxma_ПодарочныеКарты Цикл
		ЗаполнитьЗначенияСвойств(ТаблицаПодарочныхКарт.Добавить(), СтрокаТЗ);	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивироватьКарту(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаПодарочныхКарт.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено
		ИЛИ ЗначениеЗаполнено(ТекущиеДанные.СекретныйКод) Тогда
		Возврат;
	КонецЕсли;
	
	maxma_СтруктураПолей = ВладелецФормы.Объект.maxma_СтруктураПолей;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Номенклатура", 		ТекущиеДанные.Номенклатура);
	ПараметрыОткрытияФормы.Вставить("ИдентификаторПродажи", maxma_СтруктураПолей.ПараметрыПродажи.ИдентификаторПродажи);
	ПараметрыОткрытияФормы.Вставить("НастройкиМодуля", 		maxma_СтруктураПолей.НастройкиМодуля);
	
	ОписаниеОповещенияОЗакрытии = Новый ОписаниеОповещения("АктивацияПодарочногоСертификатаЗавершение", ЭтотОбъект, Новый Структура("ДанныеСтроки", ТекущиеДанные));
	
	ОткрытьФорму("Обработка.maxma_ИнтеграцияССервисом.Форма.ФормаУказанияКодаПодарочнойКарты", 
	ПараметрыОткрытияФормы, ЭтотОбъект, УникальныйИдентификатор,,,
	ОписаниеОповещенияОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры
	
&НаКлиенте
Процедура ДеактивироватьКарту(Команда)
	
	ТекущиеДанные = Элементы.ТаблицаПодарочныхКарт.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено
		ИЛИ НЕ ЗначениеЗаполнено(ТекущиеДанные.СекретныйКод) Тогда
		Возврат;
	КонецЕсли;
	
	maxma_СтруктураПолей = ВладелецФормы.maxma_СтруктураПолей;
	
	ВходящиеПараметры = Новый Структура();
	ВходящиеПараметры.Вставить("Номенклатура", 		   ТекущиеДанные.Номенклатура);
	ВходящиеПараметры.Вставить("КодКарты", 	   		   ТекущиеДанные.СекретныйКод);
	ВходящиеПараметры.Вставить("ИдентификаторПродажи", maxma_СтруктураПолей.ПараметрыПродажи.ИдентификаторПродажи);
										
	Результат = ДеактивироватьПодарочнуюКартуНаСервере(ВходящиеПараметры, maxma_СтруктураПолей.НастройкиМодуля); 
	
	Если Не Результат.ЕстьОшибки Тогда
		ТекущиеДанные.СекретныйКод = "";
	Иначе
		
		ТекстСообщения = НСтр("ru = 'При деактивации подарочной карты с кодом ""%1"" произошла ошибка: %2.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ТекущиеДанные.СекретныйКод, Результат.ОписаниеОшибки),,"КодКарты");
		
	КонецЕсли;
		
	УстановитьДоступностьКоманд();	
	
КонецПроцедуры

Функция ДеактивироватьПодарочнуюКартуНаСервере(ВходящиеПараметры, НастройкиМодуля)

	Возврат maxma_ИнтеграцияССервисомВызовСервера.ДеактивироватьПодарочнуюКартуНаСервере(ВходящиеПараметры, НастройкиМодуля);
	
КонецФункции

&НаКлиенте
Процедура ТаблицаПодарочныхКартПриАктивизацииСтроки(Элемент)
	
	УстановитьДоступностьКоманд(); 
	
КонецПроцедуры

&НаКлиенте
Процедура АктивацияПодарочногоСертификатаЗавершение(РезультатАктивации, ДополнительныеПараметры) Экспорт
	
	Если РезультатАктивации <> Неопределено Тогда
		
		ДанныеСтроки = ДополнительныеПараметры.ДанныеСтроки;
		ЗаполнитьЗначенияСвойств(ДанныеСтроки, РезультатАктивации);
		
	КонецЕсли;
	
	УстановитьДоступностьКоманд();

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьКоманд()

	ТекущиеДанные = Элементы.ТаблицаПодарочныхКарт.ТекущиеДанные;
	
	Элементы.АктивироватьКарту.Доступность = ТекущиеДанные <> Неопределено И Не ЗначениеЗаполнено(ТекущиеДанные.СекретныйКод);
	Элементы.ДеактивироватьКарту.Доступность = ТекущиеДанные <> Неопределено И ЗначениеЗаполнено(ТекущиеДанные.СекретныйКод);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ВладелецФормы.maxma_ПодарочныеКарты.Очистить();
	
	Для Каждого СтрокаТаблицы Из ТаблицаПодарочныхКарт Цикл
		ЗаполнитьЗначенияСвойств(ВладелецФормы.maxma_ПодарочныеКарты.Добавить(), СтрокаТаблицы); 	
	КонецЦикла;		
	
КонецПроцедуры
