#Область ПрограммныйИнтерфейс


// Функция - Получить значение константы
// 
// Параметры:
//  ИмяКонстанты - Строка
// 
// Возвращаемое значение:
//  Произвольный - Значение константы, определённой по имени.
// Значение константы, определённой по имени.
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт
	
	// ++ Терлецкий АВ 25.01.24
	Возврат спУправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты(ИмяКонстанты);
    // -- Терлецкий АВ 25.01.24
	
КонецФункции

// Функция - Получить длительность хранения по умолчанию
// 
// Возвращаемое значение:
//  Произвольный - Значение константы "РасшОСШ_ДлительностьХраненияСообщений".
// Значение константы "ДлительностьХраненияСообщений".
Функция ПолучитьДлительностьХраненияПоУмолчанию() Экспорт

	Возврат Константы.спДлительностьХраненияСообщений.Получить();
	
КонецФункции

// Функция - Получить длительность хранения
// 
// Возвращаемое значение:
//  ТаблицаЗначений, Произвольный - Значение константы "РасшОСШ_ДлительностьХраненияСообщенийПоОчередямИСостояниям".:
// * ТипОчереди - ПеречислениеСсылка.спТипыОчередей - 
// * СтатусСообщения - ПеречислениеСсылка.спСтатусыСообщений - 
// * ДлительностьХранения - Число - 
// Значение константы "спДлительностьХраненияСообщенийПоОчередямИСостояниям".
Функция ПолучитьДлительностьХранения() Экспорт
	
	ЗначениеКонстанты = Константы.спДлительностьХраненияСообщенийПоОчередямИСостояниям.Получить().Получить();
	
	Если ЗначениеКонстанты = Неопределено Тогда
		 
		Возврат СформироватьЗначениеКонстантыДлительностьХранения();
		
	Иначе
		
		Возврат ЗначениеКонстанты;
		
	КонецЕсли;

КонецФункции

// Функция - Сформировать значение константы Длительность хранения
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Пустая таблица значений для описания константы Длительность хранения.:
// * ТипОчереди - ПеречислениеСсылка.спТипыОчередей - 
// * СтатусСообщения - ПеречислениеСсылка.спСтатусыСообщений - 
// * ДлительностьХранения - Число - 
// Пустая таблица значений для описания константы Длительность хранения.
Функция СформироватьЗначениеКонстантыДлительностьХранения() Экспорт
	 
	ТаблицаДлительностиОжидания = Новый ТаблицаЗначений;
	ТаблицаДлительностиОжидания.Колонки.Добавить("ТипОчереди", Новый ОписаниеТипов("ПеречислениеСсылка.спТипыОчередей"), "Тип очереди");
	ТаблицаДлительностиОжидания.Колонки.Добавить("СтатусСообщения", Новый ОписаниеТипов("ПеречислениеСсылка.спСтатусыСообщений"), "Статус сообщения");
	ТаблицаДлительностиОжидания.Колонки.Добавить("ДлительностьХранения", Новый ОписаниеТипов("Число"), "Длительность хранения, дн.");
	
	Возврат ТаблицаДлительностиОжидания;
	
КонецФункции

#КонецОбласти
