#Область ОбработчикиСобытийФормы

&НаСервере
Процедура спПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	
	// { Иванов С.С. (TNext) - 04.03.2025 - Задача №1000    
	Если спРаботаСЯчейкамиВызовСервера.ЕстьЯчейки(Объект.СтруктурнаяЕдиница) Тогда
		
		Объект.ПоложениеЯчейкиОтправителя = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
		УстановитьВидимостьЯчейки();
		
	КонецЕсли;
		
	Если спРаботаСЯчейкамиВызовСервера.ЕстьЯчейки(Объект.СтруктурнаяЕдиницаПолучатель) Тогда
		
		Объект.ПоложениеЯчейкиПолучателя = Перечисления.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти;
		УстановитьВидимостьЯчейкиПолучатель();
		
	КонецЕсли;
	// }
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовШапкиФормы

&НаКлиенте
Процедура спСтруктурнаяЕдиницаПриИзмененииПосле(Элемент)
	
	спВидимостьКнопкиПриемки();
	// { Иванов С.С. (TNext) - 04.03.2025 - Задача №1000
	
	//<<<--- Tnext Козык К.А. 01.07.2026
	Если НЕ спРаботаСЯчейкамиВызовСервера.ЕстьЯчейки(Объект.СтруктурнаяЕдиница) Тогда
		спОчиститьЯчейкиОтправителя();
		Возврат;
	КонецЕсли;
	//--->>> Tnext Козык К.А. 01.07.2026
	
	спЗаполнитьЯчейкиПриИзмененииЭлемента();
	Если спРаботаСЯчейкамиВызовСервера.ЕстьЯчейки(Объект.СтруктурнаяЕдиница) Тогда
		
		Объект.ПоложениеЯчейкиОтправителя = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти");
		УстановитьВидимостьЯчейки();
		
	КонецЕсли;;
	// }
	
КонецПроцедуры

&НаКлиенте
Процедура спСтруктурнаяЕдиницаПолучательПриИзмененииПосле(Элемент)
	
	спВидимостьКнопкиПриемки();
	
	// { Иванов С.С. (TNext) - 04.03.2025 - Задача №1000 
	Если спРаботаСЯчейкамиВызовСервера.ЕстьЯчейки(Объект.СтруктурнаяЕдиницаПолучатель) Тогда
		
		Объект.ПоложениеЯчейкиПолучателя = ПредопределенноеЗначение("Перечисление.ПоложениеРеквизитаНаФорме.ВТабличнойЧасти");
		УстановитьВидимостьЯчейкиПолучатель();
		
	КонецЕсли;
	// }
	
КонецПроцедуры

&НаКлиенте
Процедура спЗапасыНоменклатураПриИзмененииПосле(Элемент)

	// { Иванов С.С. (TNext) - 04.03.2025 - Задача №1000 
	спНачатьЗаполнениеЯчеек();
	// }

КонецПроцедуры

&НаКлиенте
Процедура спЗапасыКоличествоПриИзмененииПосле(Элемент)
	
	// { Иванов С.С. (TNext) - 04.03.2025 - Задача №1000 
	спНачатьЗаполнениеЯчеек();
	// }

КонецПроцедуры 

//<<<--- Tnext Козык К.А. 01.07.2026
&НаСервере
Процедура спОчиститьЯчейкиОтправителя()
	
	Объект.Ячейка = Справочники.Ячейки.ПустаяСсылка();
	
	Для каждого СтрокаЗапасов Из Объект.Запасы Цикл
		СтрокаЗапасов.Ячейка = Справочники.Ячейки.ПустаяСсылка();
	КонецЦикла;
	
КонецПроцедуры //--->>> Tnext Козык К.А. 01.07.2026

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СохранитьНастройкиФормы()
	
	Настройки = Новый Структура("ПоложениеЯчейкиОтправителя, ПоложениеЯчейкиПолучателя");
	ЗаполнитьЗначенияСвойств(Настройки, Объект);
	
	ОбщегоНазначения.ХранилищеНастроекДанныхФормСохранить(ИмяФормы, ИмяФормы, Настройки,, ИмяПользователя());
	
КонецПроцедуры

&НаКлиенте
Процедура спВидимостьКнопкиПриемки()
	
	КнопкаПриемки = Элементы.Найти("спПриемТоваров");
	
	Если КнопкаПриемки <> Неопределено Тогда
	
		ВидимостьКнопки = спПодключаемыеКомандыВызовСервера.Документ_ПеремещениеЗапасов_ПроверкаСоответствия(Объект.СтруктурнаяЕдиница, Объект.СтруктурнаяЕдиницаПолучатель);
	    КнопкаПриемки.Видимость = ВидимостьКнопки;
		
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура спНачатьЗаполнениеЯчеек()
	
	// { Иванов С.С. (TNext) - 04.03.2025 - Задача №1000 
	ТекущаяСтрока = Элементы.Запасы.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		НомерСтроки = 1;
	Иначе
		НомерСтроки = ТекущаяСтрока.НомерСтроки;
	КонецЕсли;
	
	спЗаполнитьЯчейкиПриИзмененииЭлемента(); 
	
	НайденныеСтроки = Объект.Запасы.НайтиСтроки(Новый Структура("НомерСтроки", НомерСтроки));
	Если НайденныеСтроки.Количество() > 0 Тогда
		Элементы.Запасы.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	// }
	
КонецПроцедуры

&НаСервере
Процедура спЗаполнитьЯчейкиПриИзмененииЭлемента()
	
	// { Иванов С.С. (TNext) - 04.03.2025 - Задача №1000
	
	//<<<--- Tnext Козык К.А. 01.07.2026
	Если НЕ спРаботаСЯчейкамиВызовСервера.ЕстьЯчейки(Объект.СтруктурнаяЕдиница) Тогда
		спОчиститьЯчейкиОтправителя();
		Возврат;
	КонецЕсли;
	//--->>> Tnext Козык К.А. 01.07.2026
	
	ТаблицаЗапасы = Объект.Запасы.Выгрузить(); 
	спРаботаСЯчейкамиВызовСервера.ЗаполнитьЯчейкиВТЧПоОстаткам(ТаблицаЗапасы, Объект.Организация, Объект.СтруктурнаяЕдиница, ТипЗнч(Объект.Ссылка));
	Объект.Запасы.Загрузить(ТаблицаЗапасы);
	// }
	
КонецПроцедуры

#Область СканированиеШтрихкодов

&НаКлиенте
&Вместо("ПолученыШтрихкоды")
Процедура спПолученыШтрихкоды(ДанныеШтрихкодов)
	
	Модифицированность = Истина;
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли;
	
	Результат = спОбработатьШтрихкодыЯчеек(МассивШтрихкодов);
	
	Если Не Результат Тогда
		ПродолжитьВызов(ДанныеШтрихкодов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция спОбработатьШтрихкодыЯчеек(Штрихкоды) 
	
	ЭтоШтрихкодЯчейки = Ложь;
	ПрефиксЯчейки = спРаботаСЯчейкамиВызовСервера.ПрефиксШтрихкодаЯчейки();
	
	Для каждого СтрокаШтрихкода Из Штрихкоды Цикл
		
		Если СтрНачинаетсяС(СтрокаШтрихкода.Штрихкод, ПрефиксЯчейки) Тогда
			
			ЭтоШтрихкодЯчейки = Истина;
			
			АдресныйПолучатель = спРаботаСЯчейкамиВызовСервера.ЕстьЯчейки(Объект.СтруктурнаяЕдиницаПолучатель);
			АдресныйОтправитель = спРаботаСЯчейкамиВызовСервера.ЕстьЯчейки(Объект.СтруктурнаяЕдиница);
			
			Если АдресныйПолучатель И АдресныйОтправитель Тогда
				
				Кнопки = Новый СписокЗначений;
				Кнопки.Добавить("Ячейка", НСтр("ru = 'Ячейка склада отправителя'"));
				Кнопки.Добавить("ЯчейкаПолучатель", НСтр("ru = 'Ячейка склада получателя'"));
				
				ОжиданиеОтвета = Новый ОписаниеОповещения("спПослеОтветаНаВопрос", ЭтотОбъект, СтрокаШтрихкода.Штрихкод);
				
				ПоказатьВопрос(ОжиданиеОтвета ,НСтр("ru = 'Укажите какая ячейка отсканирована.'"), Кнопки);
				
			ИначеЕсли АдресныйПолучатель Тогда
				
				Склад = Объект.СтруктурнаяЕдиницаПолучатель;
				ИмяКолонки = "ЯчейкаПолучатель";
				
				спВыполнитьДействие(ИмяКолонки, Склад, СтрокаШтрихкода.Штрихкод);
			
			ИначеЕсли АдресныйОтправитель Тогда
				
				Склад = Объект.СтруктурнаяЕдиница;
				ИмяКолонки = "Ячейка";
				
				спВыполнитьДействие(ИмяКолонки, Склад, СтрокаШтрихкода.Штрихкод);
			
			Иначе
				
				ТекстСообщения = НСтр("ru = 'Отсканирован штрихкод ячейки, но ни один из складов не является адресным.'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЭтоШтрихкодЯчейки;
	
КонецФункции

&НаКлиенте
Процедура спВыполнитьДействие(ИмяКолонки, Склад, Штрихкод)
	
	ДанныеСтроки = Элементы.Запасы.ТекущиеДанные;
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки[ИмяКолонки] = спЯчейкаПоШтрихкоду(Штрихкод, Склад);
	
КонецПроцедуры

&НаКлиенте
Процедура спПослеОтветаНаВопрос(Ответ, Штрихкод) Экспорт
	
	Если Ответ = "Ячейка" Тогда
		Склад = Объект.СтруктурнаяЕдиница;
	ИначеЕсли Ответ = "ЯчейкаПолучатель" Тогда
		Склад = Объект.СтруктурнаяЕдиницаПолучатель;
	Иначе
		Возврат;
	КонецЕсли;
	
	ИмяКолонки = Ответ;
	
	спВыполнитьДействие(ИмяКолонки, Склад, Штрихкод);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция спЯчейкаПоШтрихкоду(Штрихкод, Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	спШтрихкодыЯчеек.Ячейка КАК Ячейка
		|ИЗ
		|	РегистрСведений.спШтрихкодыЯчеек КАК спШтрихкодыЯчеек
		|ГДЕ
		|	спШтрихкодыЯчеек.Штрихкод = &Штрихкод
		|	И спШтрихкодыЯчеек.Ячейка.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("Владелец", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Ячейка;
		
	Иначе
		
		Возврат Справочники.Ячейки.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти