
&После("ПриСозданииНаСервере")
Процедура спПриСозданииНаСервере(Форма, Знач ПараметрыРазмещения)
	
	// так как в большинстве форм есть вызов этого метода при создании формы,
	// используем его для переопределения обработчика формы ПриСозданииНаСервере
	спМодификацияКонфигурацииПереопределяемый.ПриСозданииНаСервере(Форма);
	
КонецПроцедуры

&Перед("ВывестиКоманды")
Процедура спВывестиКоманды(Форма, Команды, ПараметрыРазмещения)
	
	// { Иванов С.С. (TNext) - 05.05.2025 - Задача №1448 
	Если Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда  
		
		НоваяКоманда = Команды.Добавить();
		
		НоваяКоманда.Вид = "КоманднаяПанель";
		НоваяКоманда.Идентификатор = "спОтменаНеотгруженныхСтрок";  
		НоваяКоманда.Представление = "Отменить неотгруженные строки";
		НоваяКоманда.ВидимостьВФормах = "ФормаДокумента";
		НоваяКоманда.ИзменяетВыбранныеОбъекты = Истина;    
		НоваяКоманда.МножественныйВыбор = Ложь;
		НоваяКоманда.Обработчик = "спПодключаемыеКомандыКлиент.Документ_ЗаказПокупателя_спОтменаНеотгруженныхСтрок";    
		
	ИначеЕсли Форма.ИмяФормы = "Документ.ЗаказНаЭмиссиюКодовМаркировкиСУЗ.Форма.ФормаДокумента" Тогда
		
		НоваяКоманда = Команды.Добавить();
		
		НоваяКоманда.Вид = "КоманднаяПанель";
		НоваяКоманда.Идентификатор = "спВидУпаковкиGTIN";  
		НоваяКоманда.Представление = "Вид упаковки и GTIN";
		НоваяКоманда.ВидимостьВФормах = "ФормаДокумента";
		НоваяКоманда.ИзменяетВыбранныеОбъекты = Истина;    
		НоваяКоманда.МножественныйВыбор = Ложь;
		НоваяКоманда.Обработчик = "спПодключаемыеКомандыКлиент.Документ_ЗаказНаЭмиссиюКодовМаркировкиСУЗ_спВидУпаковкиGTIN";    
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	// }
	
КонецПроцедуры
