#Область ПрограммныйИнтерфейс 

 // Функция - Сериализовать объект
 // 
 // Параметры:
 //  Источник Источник
 // 
 // Возвращаемое значение:
 //  Строка - Результат сериализации объекта.
 // Результат сериализации объекта.
Функция СериализоватьОбъект(Источник, ИнициаторОтправки) Экспорт 
	 ЗаписьXML = Неопределено;
	 
	 Если ТипЗнч(Источник) = Тип("СправочникСсылка.Номенклатура") Тогда   		 
		 ЗаписьXML = СериализоватьFE714(Источник, ИнициаторОтправки); 
	 ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ПеремещениеЗапасов") Тогда 
		 ЗаписьXML = СериализоватьFE720(Источник);
	 ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда 
		 ЗаписьXML = СериализоватьFE720(Источник);
	 ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда 
		 ЗаписьXML = СериализоватьWS_CreateOrder_b2b(Источник);

	 КонецЕсли;
	 
	 Возврат ЗаписьXML;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СериализоватьWS_CreateOrder_b2b(Источник) 
	Сериализация = Новый Структура("Строка, ОписаниеДанных, ОшибкаДанных, СтатусСообщения");
	Сериализация.Вставить("ОшибкаДанных", Ложь);
	ДанныеСериализации = Новый Структура;
    ОшибкаДанных = Ложь;
	
	Если ТипЗнч(Источник) <> Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда  
		Сериализация.Вставить("ОшибкаДанных", Истина);
		Возврат Сериализация;
	КонецЕсли;
	
	WSПрокси = спВзаимодействиеСПодключением.ПолучитьКоннектор(Перечисления.спТипыКоннекторов.SOAP);  
	
	ДанныеСериализации.Вставить("WSПрокси", WSПрокси); 
	Если WSПрокси = Неопределено Тогда 
		ДанныеСериализации.Вставить("WSПрокси", Ложь); 
		
		Сериализация.Вставить("ОшибкаДанных", Истина);
		Сериализация.Вставить("СтатусСообщения", Перечисления.спСтатусыСообщений.ОшибкаОбработки);	
		Сериализация.Вставить("ОписаниеДанных",  ДанныеСериализации); 
		Сериализация.Вставить("Строка",  Неопределено); 
		Возврат Сериализация;
    КонецЕсли;
	
	Попытка 
		ИнформацияОрганизации = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Источник.Организация, , ТекущаяДатаСеанса(), Ложь);
		
		ДанныеСериализации.Вставить("WSПрокси", Истина);
		
		СвояФабрикаXDTO = WSПрокси.ФабрикаXDTO;  
		
		КорневойОбъект = СвояФабрикаXDTO.Создать(СвояФабрикаXDTO.Тип(ПространствоИмен(), "createOrder"));
		
		Service = Новый Структура;
		
		ТипЭлементаService = КорневойОбъект.Свойства().Получить("service").Тип; 	
		ServiceОбъект = СвояФабрикаXDTO.Создать(ТипЭлементаService);
		
		shopОбъект = СвояФабрикаXDTO.Создать(ServiceОбъект.Свойства().Получить("shop").Тип);
		shop = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спshop");		
		shopОбъект = shop; 
		
		Если ЗначениеЗаполнено(XMLСтрока(shop)) Тогда 
			Service.Вставить("Shop", XMLСтрока(shop)); 
		Иначе 
			Service.Вставить("Shop", Ложь);
			ОшибкаДанных = Истина;
		КонецЕсли;
		
		tokenОбъект = СвояФабрикаXDTO.Создать(ServiceОбъект.Свойства().Получить("token").Тип);
		token = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спtoken");
		tokenОбъект = token; 
		
		Если ЗначениеЗаполнено(XMLСтрока(token)) Тогда 
			Service.Вставить("Token", XMLСтрока(token)); 
		Иначе 
			Service.Вставить("Token", Ложь);
			ОшибкаДанных = Истина;
		КонецЕсли;

		
		ТДата = ТекущаяДатаСеанса();
		ТГод = Формат(ТДата, "ДФ=гггг");
		ТМесяц = Месяц(ТДата);
		ТДень =  День(ТДата);
		ТЧас =  Час(ТДата);
		ТМинута = Минута(ТДата);
		ТСекунда =  Секунда(ТДата); 
		
		МДата = СтрШаблон("P%1Y%2M%3DT%4H%5M%6S", ТГод, ТМесяц, ТДень, ТЧас, ТМинута, ТСекунда);
		
		messageDateОбъект = СвояФабрикаXDTO.Создать(ServiceОбъект.Свойства().Получить("messageDate").Тип);
		messageDateОбъект = МДата; 
		
		Если ЗначениеЗаполнено(XMLСтрока(МДата)) Тогда 
			Service.Вставить("MessageDate", XMLСтрока(МДата)); 
		Иначе 
			Service.Вставить("MessageDate", Ложь);
			ОшибкаДанных = Истина;
		КонецЕсли;

		
		УИД = Строка(Новый УникальныйИдентификатор());
		messageIDОбъект = СвояФабрикаXDTO.Создать(ServiceОбъект.Свойства().Получить("messageID").Тип);
		messageIDОбъект = УИД;
		
		Если ЗначениеЗаполнено(XMLСтрока(УИД)) Тогда 
			Service.Вставить("MessageID", XMLСтрока(УИД)); 
		Иначе 
			Service.Вставить("MessageID", Ложь);
			ОшибкаДанных = Истина;
		КонецЕсли;
		
		ServiceОбъект.shop = shopОбъект; 
		ServiceОбъект.token = tokenОбъект;
		ServiceОбъект.messageDate = messageDateОбъект;
		ServiceОбъект.messageID = messageIDОбъект;
		КорневойОбъект.service = ServiceОбъект;
		
		ДанныеСериализации.Вставить("Service", Service);
		
		Param = Новый Структура; 
		
		ТипЭлементаParam = КорневойОбъект.Свойства().Получить("param").Тип; 	
		ParamОбъект = СвояФабрикаXDTO.Создать(ТипЭлементаParam);
		
		orderTypeОбъект = СвояФабрикаXDTO.Создать(ParamОбъект.Свойства().Получить("orderType").Тип);
		orderType = ParamОбъект.Свойства().Получить("orderType").Тип.Фасеты.Получить(6); 
        ParamОбъект.Установить("orderType", orderType.Значение);  
		КорневойОбъект.param = ParamОбъект; 
		
		Если ЗначениеЗаполнено(XMLСтрока(orderType.Значение)) Тогда 
			Param.Вставить("OrderType", XMLСтрока(orderType.Значение)); 
		Иначе 
			Param.Вставить("OrderType", Ложь);	
			ОшибкаДанных = Истина;
		КонецЕсли;
		ДанныеСериализации.Вставить("Param", Param);
		
		ТипЭлементаVersion = КорневойОбъект.Свойства().Получить("version").Тип; 
		VersionType = ТипЭлементаVersion.Фасеты.Получить(0);
		VersionОбъект = СвояФабрикаXDTO.Создать(ТипЭлементаVersion);
		VersionОбъект = VersionType;
		КорневойОбъект.version = VersionОбъект.Значение; 
		

		Если ЗначениеЗаполнено(XMLСтрока(VersionType.Значение)) Тогда 
			ДанныеСериализации.Вставить("Version", XMLСтрока(VersionType.Значение)); 
		Иначе 
			ДанныеСериализации.Вставить("Version", Ложь);
			ОшибкаДанных = Истина;
		КонецЕсли;

		
		ТипЭлементаOrder = КорневойОбъект.Свойства().Получить("order").Тип; 	
		OrderОбъект = СвояФабрикаXDTO.Создать(ТипЭлементаOrder);
		
		paymentModeОбъект = СвояФабрикаXDTO.Создать(OrderОбъект.Свойства().Получить("paymentMode").Тип);
		paymentModeType = OrderОбъект.Свойства().Получить("paymentMode").Тип.Фасеты.Получить(0);
		paymentModeОбъект = paymentModeType;  
		OrderОбъект.Установить("paymentMode", paymentModeОбъект.Значение); 
		
		Order = Новый Структура;
		
		Если ЗначениеЗаполнено(XMLСтрока(paymentModeType.Значение)) Тогда 
			Order.Вставить("PaymentMode", XMLСтрока(paymentModeType.Значение)); 
		Иначе 
			Order.Вставить("PaymentMode", Ложь);
			ОшибкаДанных = Истина;
		КонецЕсли;
		
		// для тестовой среды:2501 
		carrierId = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спSOAPУИДДоставщика");
		OrderОбъект.Установить("carrierId", carrierId);
		
		Если ЗначениеЗаполнено(XMLСтрока(carrierId)) Тогда 
			Order.Вставить("CarrierId", XMLСтрока(carrierId)); 
		Иначе 
			Order.Вставить("CarrierId", Ложь);
			ОшибкаДанных = Истина;
		КонецЕсли;
		

		
		Client = Новый Структура;
		
		EmailОрганизации = "";
		ТелефонОрганизации = ""; 
		Если ТипЗнч(ИнформацияОрганизации) = тиП("ТаблицаЗначений") Тогда 
			Для каждого Строка  Из ИнформацияОрганизации Цикл
				Если Строка.Вид = Справочники.ВидыКонтактнойИнформации.ТелефонОрганизации Тогда
					ТелефонОрганизации = СтрШаблон("%1", Строка.Представление);
				ИначеЕсли Строка.Вид = Справочники.ВидыКонтактнойИнформации.EmailОрганизации Тогда  
					EmailОрганизации = СтрШаблон("%1", Строка.Представление);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		clientОбъект = СвояФабрикаXDTO.Создать(OrderОбъект.Свойства().Получить("client").Тип);  
		customerFingerprintОбъект = СвояФабрикаXDTO.Создать(clientОбъект.Свойства().Получить("customerFingerprint").Тип);
		customerFingerprintОбъект.email 	= EmailОрганизации;
		customerFingerprintОбъект.id     	= "1"; 
		clientОбъект.customerFingerprint  	= customerFingerprintОбъект;  
		
		СustomerFingerprint = Новый Структура;
		Если ЗначениеЗаполнено(XMLСтрока(EmailОрганизации)) Тогда 
			СustomerFingerprint.Вставить("Email", XMLСтрока(EmailОрганизации)); 
		Иначе 
			СustomerFingerprint.Вставить("Email", Ложь);
			ОшибкаДанных = Истина;
		КонецЕсли;
        Client.Вставить("СustomerFingerprint", СustomerFingerprint);
		
		clientОбъект.phone              			= ТелефонОрганизации;
		clientОбъект.firstName          			= "администратор магазина";
		clientОбъект.secondName        				= "администратор магазина";
		clientОбъект.lastName           			= "администратор магазина";  
		OrderОбъект.Установить("client", clientОбъект);
		
		Если ЗначениеЗаполнено(XMLСтрока(ТелефонОрганизации)) Тогда 
			Client.Вставить("Phone", XMLСтрока(ТелефонОрганизации)); 
		Иначе 
			Client.Вставить("Phone", Ложь);
			ОшибкаДанных = Истина;
		КонецЕсли;
		Order.Вставить("Client", Client);
		
		ИнформацияСклад = Неопределено;
		ИнформацияОрганизацииСклад = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Источник.СтруктурнаяЕдиницаПолучатель, , ТекущаяДатаСеанса(), Ложь);
		Если ТипЗнч(ИнформацияОрганизацииСклад) = Тип("ТаблицаЗначений") И ИнформацияОрганизацииСклад.Количество() > 0 Тогда  
			ИнформацияСклад = _ПрочитатьJSON(ИнформацияОрганизацииСклад[0].Значение);
		КонецЕсли;
		ВидАдреса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Справочники.ВидыКонтактнойИнформации["ЮрАдресОрганизации"], "Ссылка");
		
		streetType = Неопределено;
		street = Неопределено;   
		
		Если ТипЗнч(ИнформацияСклад) = Тип("Структура") Тогда 
			
			deliveryAddressОбъект = СвояФабрикаXDTO.Создать(OrderОбъект.Свойства().Получить("deliveryAddress").Тип); 
			deliveryAddressОбъект.country = "RU";
			deliveryAddressОбъект.zip = ?(ИнформацияСклад.Свойство("ZIPcode"), ИнформацияСклад.ZIPcode, ""); 
			deliveryAddressОбъект.region = ?(ИнформацияСклад.Свойство("areaValue"), СокрЛП(СтрЗаменить(ИнформацияСклад.areaValue, "Город", "")), "");
			deliveryAddressОбъект.area   = "";
			deliveryAddressОбъект.city   = ?(ИнформацияСклад.Свойство("area"), ИнформацияСклад.area, ""); 
			
			streetType = ?(ИнформацияСклад.Свойство("streetType"),ИнформацияСклад.streetType, "");
			street = ?(ИнформацияСклад.Свойство("street"), ИнформацияСклад.street, "");
			
			deliveryAddressОбъект.street = СтрШаблон("%1 %2", streetType, street); 
			deliveryAddressОбъект.building = ?(ИнформацияСклад.Свойство("houseNumber"), ИнформацияСклад.houseNumber, "");
			deliveryAddressОбъект.frame = "";
			deliveryAddressОбъект.construction = "";
			deliveryAddressОбъект.flat = ""; 
			
			OrderОбъект.Установить("deliveryAddress", deliveryAddressОбъект); 
		КонецЕсли;
	 
		
		Если ТипЗнч(ИнформацияСклад) = Тип("Структура") Тогда
			DeliveryAddress = Новый Структура;
			DeliveryAddress.Вставить("country", "RU");  
			
			AddressZip = ?(ИнформацияСклад.Свойство("ZIPcode") И ЗначениеЗаполнено(ИнформацияСклад.ZIPcode), ИнформацияСклад.ZIPcode, Ложь);
			DeliveryAddress.Вставить("zip", AddressZip);  
			
			AddressAreaValue = ?(ИнформацияСклад.Свойство("areaValue") И ЗначениеЗаполнено(ИнформацияСклад.areaValue), ИнформацияСклад.areaValue, Ложь);
			DeliveryAddress.Вставить("region", AddressAreaValue); 
			
			DeliveryAddress.Вставить("area", "");  
			
			AddressCity = ?(ИнформацияСклад.Свойство("area") И ЗначениеЗаполнено(ИнформацияСклад.area), ИнформацияСклад.area, Ложь);
			DeliveryAddress.Вставить("city", AddressCity);
			
			AddressStreet = СтрШаблон("%1 %2", streetType, street); 
			AddressStreet = ?(ЗначениеЗаполнено(AddressStreet), AddressStreet, Ложь);
			DeliveryAddress.Вставить("street", AddressStreet);
			
			AddressBuilding = ?(ИнформацияСклад.Свойство("houseNumber") И ЗначениеЗаполнено(ИнформацияСклад.houseNumber), ИнформацияСклад.houseNumber, Ложь);
			DeliveryAddress.Вставить("building", AddressBuilding); 
			
			DeliveryAddress.Вставить("frame", "");
			DeliveryAddress.Вставить("construction", "");
			DeliveryAddress.Вставить("flat", "");

			
			Order.Вставить("DeliveryAddress", DeliveryAddress); 
			
			Если AddressZip = Ложь ИЛИ AddressAreaValue = Ложь ИЛИ AddressCity = Ложь ИЛИ AddressStreet = Ложь 
				ИЛИ AddressBuilding = Ложь Тогда
				ОшибкаДанных = Истина;
			КонецЕсли;
		Иначе 
			Order.Вставить("DeliveryAddress", Ложь);
			ОшибкаДанных = Истина;
		КонецЕсли; 
		
		Items = Новый Массив;
		
		
		itemsОбъект = СвояФабрикаXDTO.Создать(OrderОбъект.Свойства().Получить("items").Тип);
		ТипЭлементаСписка = itemsОбъект.Свойства().Получить("item").Тип; 
		
		РезультатЗапросаЦеныШтрихкодНоменклатуры = ПолучитьЦеныШтрихкодаНоменклатурыХарактеристики(Источник.Запасы.Выгрузить(,"Номенклатура")); // ++ Терлецкий АВ 25.01.21 
		
		РезультатЗапросаРазмер = ЗаполнитьCписокТоваровРазмерРазмерИД(Источник.Запасы.Выгрузить(,"Номенклатура")); // Терлецкий АВ 25.02.04
				
		Для Каждого ЭлементЗапас Из Источник.Запасы Цикл
			Item = Новый Структура("Uuid, Size, Quantity, Price, Ean");  // ++ Терлецкий АВ 25.01.30
			
			itemОбъект =  itemsОбъект.item.Добавить(СвояФабрикаXDTO.Создать(ТипЭлементаСписка));
			
			ГУИДНоменклатура = ЭлементЗапас.Номенклатура.УникальныйИдентификатор(); 
			itemОбъект.uuid  = Строка(ГУИДНоменклатура);
			
			itemОбъект.quantity = ЭлементЗапас.Количество;   
			itemОбъект.customerCompany = shop; 
			
			// ++ Терлецкий АВ 25.01.30
			ГУИДХарактеристика = Неопределено;
			ПараметрыПоиска = Новый Структура("Номенклатура", ЭлементЗапас.Номенклатура);
			МассивСтрок = РезультатЗапросаРазмер.НайтиСтроки(ПараметрыПоиска);
			Если МассивСтрок.Количество() > 0 Тогда
				ГУИДХарактеристика = XMLСтрока(МассивСтрок[0].SizeId);   
				Если ЗначениеЗаполнено(ГУИДХарактеристика) Тогда
					itemОбъект.size = XMLСтрока(ГУИДХарактеристика);
				Иначе 
					ГУИДХарактеристика = XMLСтрока(ГУИДНоменклатура); 
					itemОбъект.size = ГУИДХарактеристика; 
				КонецЕсли;		
			КонецЕсли;
            // -- Терлецкий АВ 25.01.30
			
			Если ЗначениеЗаполнено(XMLСтрока(ГУИДНоменклатура)) Тогда 
				Item.Вставить("Uuid", XMLСтрока(ГУИДНоменклатура)); // ++ Терлецкий АВ 25.01.21 
			Иначе 
				Item.Вставить("Uuid", Ложь);
				ОшибкаДанных = Истина;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(XMLСтрока(ГУИДХарактеристика)) Тогда 
				Item.Вставить("Size", XMLСтрока(ГУИДХарактеристика)); 
			Иначе 
				Item.Вставить("Size", Ложь);
				ОшибкаДанных = Истина;
			КонецЕсли;
			
			Если ЭлементЗапас.Количество > 0 Тогда 
				Item.Вставить("Quantity", ЭлементЗапас.Количество); 
			Иначе 
				Item.Вставить("Quantity", Ложь);
				ОшибкаДанных = Истина;
			КонецЕсли;
			
			
			// ++ Терлецкий АВ 25.01.21
			PriceItem = 0;
			Если РезультатЗапросаЦеныШтрихкодНоменклатуры.Свойство("Цены") Тогда 
				Отбор = Новый Структура();
				Отбор.Вставить("Номенклатура", ЭлементЗапас.Номенклатура);
				Строки = РезультатЗапросаЦеныШтрихкодНоменклатуры.Цены.НайтиСтроки(Отбор);
				
				Если Строки.Количество() > 0 Тогда
					itemОбъект.price = Строки[0].Цена;
					PriceItem = Строки[0].Цена;
				Иначе
					itemОбъект.price = 0;
				КонецЕсли;
			Иначе 
				itemОбъект.price = 0; 
			КонецЕсли; 
			
			Если PriceItem > 0 Тогда 
				Item.Вставить("Price", XMLСтрока(PriceItem)); 
			Иначе 
				Item.Вставить("Price", Ложь);
				ОшибкаДанных = Истина;
			КонецЕсли;

			EanItem = "";
			Если РезультатЗапросаЦеныШтрихкодНоменклатуры.Свойство("Штрихкода") Тогда 
				Отбор = Новый Структура();
				Отбор.Вставить("Номенклатура", ЭлементЗапас.Номенклатура);
				Строки = РезультатЗапросаЦеныШтрихкодНоменклатуры.Штрихкода.НайтиСтроки(Отбор);
				
				Если Строки.Количество() > 0 Тогда
					itemОбъект.ean = Строка(Строки[0].Штрихкод);
					EanItem = Строка(Строки[0].Штрихкод);
				Иначе
					itemОбъект.ean = "";	
				КонецЕсли;
			Иначе 
				itemОбъект.ean = "";
			КонецЕсли; 
			
			Если ЗначениеЗаполнено(EanItem) Тогда 
				Item.Вставить("Ean", XMLСтрока(EanItem)); 
			Иначе 
				Item.Вставить("Ean", Ложь);
				ОшибкаДанных = Истина;
			КонецЕсли;
			
			Items.Добавить(Item); 
			// -- Терлецкий АВ 25.01.21
		КонецЦикла;
		
		Order.Вставить("Items", Items);
        ДанныеСериализации.Вставить("Order", Order);
		
		OrderОбъект.Установить("items", itemsОбъект); 
				
		orderFingerprintОбъект = СвояФабрикаXDTO.Создать(OrderОбъект.Свойства().Получить("orderFingerprint").Тип);
		orderFingerprintОбъект.orderId = Строка(Источник.УникальныйИдентификатор());
		orderFingerprintОбъект.orderNumber = Источник.Номер;
		
		OrderОбъект.Установить("orderFingerprint", orderFingerprintОбъект);  
		
		commentОбъект = СвояФабрикаXDTO.Создать(OrderОбъект.Свойства().Получить("comment").Тип);
		commentОбъект = "";
		
		OrderОбъект.Установить("comment", commentОбъект);  
		
		AddFields = Новый Структура("legalReciever, legalRecieverAddress, legalRecieverINN, legalRecieverKPP");
		
		addFieldsОбъект = СвояФабрикаXDTO.Создать(OrderОбъект.Свойства().Получить("addFields").Тип);
		ТипЭлементаСписка = addFieldsОбъект.Свойства().Получить("field").Тип; 
		 
		ФактическаяИнформация = "";
		ЮридическийАдрес      = "";

		Для каждого Строка  Из ИнформацияОрганизации Цикл
			Если Строка.Вид = Справочники.ВидыКонтактнойИнформации.ЮрАдресОрганизации Тогда
				ЮридическийАдрес = Строка.Представление;
			ИначеЕсли Строка.Вид = Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации Тогда  
				ФактическаяИнформация = СтрШаблон("%1 / %2", Источник.Организация.Наименование, Строка.Представление);
			КонецЕсли;
		КонецЦикла; 
		
		addFieldОбъект =  addFieldsОбъект.field.Добавить(СвояФабрикаXDTO.Создать(ТипЭлементаСписка)); 
		addFieldОбъект.name  = "legalReciever";
		addFieldОбъект.value = Источник.Организация.НаименованиеСокращенное; 
		
		Если ЗначениеЗаполнено(Источник.Организация.НаименованиеСокращенное) Тогда 
			AddFields.Вставить("LegalReciever", Источник.Организация.НаименованиеСокращенное); 
		Иначе 
			AddFields.Вставить("LegalReciever", Ложь);
			ОшибкаДанных = Истина;
		КонецЕсли;

		addFieldОбъект =  addFieldsОбъект.field.Добавить(СвояФабрикаXDTO.Создать(ТипЭлементаСписка)); 
		addFieldОбъект.name  = "legalRecieverAddress";
        addFieldОбъект.value = ЮридическийАдрес; 
		
		Если ЗначениеЗаполнено(ЮридическийАдрес) Тогда 
			AddFields.Вставить("legalRecieverAddress", ЮридическийАдрес); 
		Иначе 
			AddFields.Вставить("legalRecieverAddress", Ложь);
			ОшибкаДанных = Истина;
		КонецЕсли;

		
		addFieldОбъект =  addFieldsОбъект.field.Добавить(СвояФабрикаXDTO.Создать(ТипЭлементаСписка)); 
		addFieldОбъект.name  = "legalRecieverINN";
        addFieldОбъект.value = Строка(Источник.Организация.ИНН); 
		
		Если ЗначениеЗаполнено(XMLСтрока(Источник.Организация.ИНН)) Тогда 
			AddFields.Вставить("legalRecieverINN", XMLСтрока(Источник.Организация.ИНН)); 
		Иначе 
			AddFields.Вставить("legalRecieverINN", Ложь);
			ОшибкаДанных = Истина;
		КонецЕсли;

		addFieldОбъект =  addFieldsОбъект.field.Добавить(СвояФабрикаXDTO.Создать(ТипЭлементаСписка)); 
		addFieldОбъект.name  = "legalRecieverKPP";
        addFieldОбъект.value = Строка(Источник.Организация.КПП); 
		
		Если ЗначениеЗаполнено(XMLСтрока(Источник.Организация.КПП)) Тогда 
			AddFields.Вставить("legalRecieverKPP", XMLСтрока(Источник.Организация.КПП)); 
		Иначе 
			AddFields.Вставить("legalRecieverKPP", Ложь);
			ОшибкаДанных = Истина;
		КонецЕсли;
		
		ДанныеСериализации.Вставить("AddFields", AddFields);
		
		OrderОбъект.Установить("addFields", addFieldsОбъект);
		
		КорневойОбъект.order = OrderОбъект; 
		
		Сериализация.Вставить("ОписаниеДанных",  ДанныеСериализации); 
		Сериализация.Вставить("СтатусСообщения", ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.Новое")); 
		Сериализация.Вставить("ОшибкаДанных", ОшибкаДанных);

	Исключение
		Сериализация.Вставить("ОшибкаДанных", ОшибкаДанных);
		Сериализация.Вставить("СтатусСообщения", Перечисления.спСтатусыСообщений.НеВалидно);	

		Возврат Сериализация;
	КонецПопытки;

	Запись = Новый ЗаписьXML;
	Запись.УстановитьСтроку(); 
	
	СвояФабрикаXDTO.ЗаписатьXML(Запись, КорневойОбъект);
	СтрокаXML = Запись.Закрыть(); 
	
	Сериализация.Вставить("Строка", СтрокаXML);

	Возврат Сериализация;
КонецФункции

Функция ПолучитьЦеныШтрихкодаНоменклатурыХарактеристики(СтписокНоменклатуры) 
	// ++ Терлецкий АВ 25.01.21
	ВидЦеныПоступления = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спВидЦеныПоступления");
	
	ЦеныНоменклатуры = Новый ТаблицаЗначений;
	ЦеныНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	КвалификаторыЧисла = Новый КвалификаторыЧисла(15, 2, ДопустимыйЗнак.Неотрицательный);
	ЦеныНоменклатуры.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число", КвалификаторыЧисла));  
	
	ШтрихКодНоменклатуры = Новый ТаблицаЗначений;
	ШтрихКодНоменклатуры.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	КвалификаторыСтроки = Новый КвалификаторыСтроки(200);
	ШтрихКодНоменклатуры.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка", КвалификаторыСтроки));
	
	РезультатЗапроса = Новый Структура("Цены, Штрихкода");
	
	Запрос = Новый Запрос; 
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураХарактеристика.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_НоменклатураХарактеристика
		|ИЗ
		|	&НоменклатураХарактеристика КАК НоменклатураХарактеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ПОМЕСТИТЬ ВТ_ЦеныНоменклатурыСрезПоследних
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ТекущаяДата,
		|			Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура КАК Номенклатура
		|					ИЗ
		|						ВТ_НоменклатураХарактеристика КАК ВТ)
		|				И %1) КАК ЦеныНоменклатурыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоменклатураХарактеристика.Номенклатура КАК Номенклатура,
		|	ВТ_ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	ВТ_НоменклатураХарактеристика КАК ВТ_НоменклатураХарактеристика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЦеныНоменклатурыСрезПоследних КАК ВТ_ЦеныНоменклатурыСрезПоследних
		|		ПО ВТ_НоменклатураХарактеристика.Номенклатура = ВТ_ЦеныНоменклатурыСрезПоследних.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоменклатураХарактеристика.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод
		|ИЗ
		|	ВТ_НоменклатураХарактеристика КАК ВТ_НоменклатураХарактеристика
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ВТ_НоменклатураХарактеристика.Номенклатура = ШтрихкодыНоменклатуры.Номенклатура";
	
	Запрос.УстановитьПараметр("НоменклатураХарактеристика", СтписокНоменклатуры);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Если ЗначениеЗаполнено(ВидЦеныПоступления) Тогда
		Запрос.Текст = СтрШаблон(Запрос.Текст, "ВидЦен = &ВидЦен");
		Запрос.УстановитьПараметр("ВидЦен", ВидЦеныПоступления);
	Иначе 
		Запрос.Текст = СтрШаблон(Запрос.Текст, "ИСТИНА = ИСТИНА");
	КонецЕсли;


	
	Пакет = Запрос.ВыполнитьПакет();
	
	ВыборкаПакетЦены = Пакет[2].Выбрать();
	Если ЗначениеЗаполнено(ВидЦеныПоступления) Тогда
		Пока ВыборкаПакетЦены.Следующий() Цикл
			НоваяСтрока = ЦеныНоменклатуры.Добавить();
			НоваяСтрока.Номенклатура 	= ВыборкаПакетЦены.Номенклатура;
			НоваяСтрока.Цена            = ВыборкаПакетЦены.Цена;
			
		КонецЦикла;
	КонецЕсли;

	ВыборкаПакетШтрихкод = Пакет[3].Выбрать();
	Пока ВыборкаПакетШтрихкод.Следующий() Цикл
		НоваяСтрока = ШтрихКодНоменклатуры.Добавить();
		НоваяСтрока.Номенклатура 	= ВыборкаПакетШтрихкод.Номенклатура;
		НоваяСтрока.Штрихкод        = ВыборкаПакетШтрихкод.Штрихкод;
	КонецЦикла;
	
	РезультатЗапроса.Вставить("Цены", ЦеныНоменклатуры);
	РезультатЗапроса.Вставить("Штрихкода", ШтрихКодНоменклатуры);
	
	Возврат РезультатЗапроса;  
	// -- Терлецкий АВ 25.01.21
КонецФункции

Функция _ПрочитатьJSON(ТекстJSON) Экспорт
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	Структура = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);	
	Чтение.Закрыть();
	Возврат Структура;
КонецФункции 

Функция ЗаполнитьСтруктуруИзОтветаJSON(Знач Чтение) Экспорт
	Результат = Новый Структура;

	ПоследнееИмяРеквизита = Неопределено;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта И ПоследнееИмяРеквизита<>Неопределено Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьСтруктуруИзОтветаJSON(Чтение);
		ИначеЕсли Тип = ТипЗначенияJSON.КонецОбъекта Тогда 
			Возврат Результат;
			ПоследнееИмяРеквизита = Неопределено;
		ИначеЕсли Тип = ТипЗначенияJSON.ИмяСвойства Тогда 
			Результат.Вставить(Чтение.ТекущееЗначение, Неопределено);
			ПоследнееИмяРеквизита = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.Булево или Тип = ТипЗначенияJSON.Строка
			или Тип = ТипЗначенияJSON.Число или Тип = ТипЗначенияJSON.Null Тогда 
			Результат[ПоследнееИмяРеквизита] = Чтение.ТекущееЗначение;
		ИначеЕсли Тип = ТипЗначенияJSON.НачалоМассива Тогда 
			Результат[ПоследнееИмяРеквизита] = ЗаполнитьМассивИзОтветаJSON(Чтение);
		КонецЕсли;
	КонецЦикла;  
		
	Возврат Результат;
КонецФункции 

Функция ЗаполнитьМассивИзОтветаJSON(Знач Чтение)
	Результат = Новый Массив;
	
	Пока Чтение.Прочитать() Цикл
		Тип = Чтение.ТипТекущегоЗначения;
		Если Тип = ТипЗначенияJSON.НачалоОбъекта Тогда 
			Результат.Добавить(ЗаполнитьСтруктуруИзОтветаJSON(Чтение));
		ИначеЕсли Тип = ТипЗначенияJSON.КонецМассива Тогда 
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;  
	
	Возврат Результат;
КонецФункции

Функция ПространствоИмен()
    Возврат спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спSOAPПространстваИменСервиса")
КонецФункции

Функция СериализоватьFE714(Источник, ИнициаторОтправки)  

	Если ТипЗнч(Источник) <> Тип("СправочникСсылка.Номенклатура") Тогда  
		Возврат "";
	КонецЕсли;
	
	ОшибкаДанных = Ложь;
	
	Сериализация = Новый Структура("Строка, ОписаниеДанных, ОшибкаДанных, СтатусСообщения");
	
	ДанныеСериализации = Новый Структура;
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8"); 
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("productMasterDataRequest");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xs", "http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("", "http://service.profashionsolutions.ru/fe714_r002");
	ЗаписьXML.ЗаписатьНачалоЭлемента("main");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("parents");
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("typesItems");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Цены = Новый Массив;
	
	ВидЦеныПоступления = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спВидЦеныПоступления"); 
		
	ТипЦены = Новый Структура("ГУИД, Наименование, Валюта, ВалютаКод, ВалютаНаименование");
	ТипЦены.Вставить("ГУИД", ВидЦеныПоступления.УникальныйИдентификатор());
	ТипЦены.Вставить("Наименование", ВидЦеныПоступления.Наименование);
	ТипЦены.Вставить("Валюта", ВидЦеныПоступления.ВалютаЦены);
	ТипЦены.Вставить("КодВалюты", ВидЦеныПоступления.ВалютаЦены.Код);
	ТипЦены.Вставить("НаименованиеВалюты", ВидЦеныПоступления.ВалютаЦены.Наименование);

	ЗаписьXML.ЗаписатьНачалоЭлемента("prices"); 

	Если ЗначениеЗаполнено(ВидЦеныПоступления) И ТипЗнч(ВидЦеныПоступления) = Тип("СправочникСсылка.ВидыЦен") Тогда 
			ЗаписьXML.ЗаписатьНачалоЭлемента("price"); 
			
			Цена = Новый Структура;
			Если ЗначениеЗаполнено(ТипЦены.ГУИД) Тогда 
				ЗаписьXML.ЗаписатьАтрибут("id", XMLСтрока(ТипЦены.ГУИД));
				Цена.Вставить("Гуид", XMLСтрока(ТипЦены.ГУИД))
			Иначе 
				Цена.Вставить("Гуид", Ложь);
				ОшибкаДанных = Истина;
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("name"); 
			Если ЗначениеЗаполнено(ТипЦены.Наименование) Тогда 
				ЗаписьXML.ЗаписатьТекст(XMLСтрока(ТипЦены.Наименование)); 
				Цена.Вставить("Наименование", XMLСтрока(ТипЦены.Наименование));
			Иначе 
				Цена.Вставить("Наименование", Ложь);
				ОшибкаДанных = Истина;
			КонецЕсли;
			ЗаписьXML.ЗаписатьКонецЭлемента();  
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("currency"); 
			Если ТипЦены.КодВалюты = "643" Тогда
				ЗаписьXML.ЗаписатьТекст(XMLСтрока("RUB")); 
				currency = XMLСтрока("RUB");
			Иначе 
				ЗаписьXML.ЗаписатьТекст(XMLСтрока(ТипЦены.НаименованиеВалюты));
				currency = XMLСтрока(ТипЦены.НаименованиеВалюты);
			КонецЕсли;	 
			
			Если ЗначениеЗаполнено(currency) Тогда
				Цена.Вставить("Валюта", currency);
			Иначе 
				Цена.Вставить("Валюта", Ложь);
				ОшибкаДанных = Истина;
			КонецЕсли;  
				
			ЗаписьXML.ЗаписатьКонецЭлемента();
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			
			Цены.Добавить(Цена);  
	Иначе 
		ЗаписьXML.ЗаписатьНачалоЭлемента("price");
		ЗаписьXML.ЗаписатьАтрибут("id", XMLСтрока(""));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("name"); 
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
		ЗаписьXML.ЗаписатьКонецЭлемента();  
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("currency"); 
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ОшибкаДанных = Истина;
	КонецЕсли;  
	
	ДанныеСериализации.Вставить("Цены", Цены);  
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("commonAddFieldsItem");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("commonAddFieldsSize");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); 	
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("items"); 
	ЗаписьXML.ЗаписатьНачалоЭлемента("item"); 
	
	Товар = Новый Структура;  
	
	ЗаписьXML.ЗаписатьАтрибут("uuid", XMLСтрока(Источник.УникальныйИдентификатор())); 
	
	Если ЗначениеЗаполнено(XMLСтрока(Источник.УникальныйИдентификатор())) Тогда
		Товар.Вставить("Гуид", XMLСтрока(Источник.УникальныйИдентификатор()));
	Иначе 
		Товар.Вставить("Гуид", Ложь);
		ОшибкаДанных = Истина;
	КонецЕсли;

	
	ЗаписьXML.ЗаписатьНачалоЭлемента("active"); 
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(НЕ Источник.ПометкаУдаления));
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Если НЕ Источник.ПометкаУдаления Тогда 
		ПометкаУдаления = XMLСтрока(НЕ Источник.ПометкаУдаления);
	Иначе
		ПометкаУдаления = Ложь;
		ОшибкаДанных = Истина;
	КонецЕсли;
	Товар.Вставить("ПометкаУдаления", ПометкаУдаления);

	ЗаписьXML.ЗаписатьНачалоЭлемента("parentId");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
	ЗаписьXML.ЗаписатьКонецЭлемента(); 

	ЗаписьXML.ЗаписатьНачалоЭлемента("typeItemId");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("article");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Источник.спАртикулПоставщика));
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Если ЗначениеЗаполнено(XMLСтрока(Источник.спАртикулПоставщика)) Тогда
		Товар.Вставить("Артикл", XMLСтрока(Источник.спАртикулПоставщика));
	Иначе 
		Товар.Вставить("Артикл", Ложь);
		ОшибкаДанных = Истина;
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("name");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Источник.Наименование));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(XMLСтрока(Источник.Наименование)) Тогда
		Товар.Вставить("Наименование", XMLСтрока(Источник.Наименование));
	Иначе 
		Товар.Вставить("Наименование", Ложь);
		ОшибкаДанных = Истина;
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("images");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("fullDescr");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Источник.Комментарий));
	ЗаписьXML.ЗаписатьКонецЭлемента();  

	ЗаписьXML.ЗаписатьНачалоЭлемента("shortDescr");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("materialDescr");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	СтавкаНДС = "vc_WithoutVAT";
	Если ТипЗнч(Источник.ВидСтавкиНДС) = Тип("ПеречислениеСсылка.ВидыСтавокНДС") Тогда 
		ТекущаяСтавкаНДС = Справочники.СтавкиНДС.СтавкаНДС(Источник.ВидСтавкиНДС, ТекущаяДатаСеанса()); 
		Если ТипЗнч(ТекущаяСтавкаНДС) = Тип("СправочникСсылка.СтавкиНДС") И ЗначениеЗаполнено(ТекущаяСтавкаНДС) Тогда
			НаименованиеСтавкаНДС = ТекущаяСтавкаНДС.Наименование;
			СтавкаНДСТолькоЦифры = УправлениеКонтактнойИнформациейКлиентСервер.ОставитьТолькоЦифрыВСтроке(НаименованиеСтавкаНДС); 
			Если ЗначениеЗаполнено(СтавкаНДСТолькоЦифры) Тогда 
				СтавкаНДС = СтрШаблон("%1%2", "vc_", СтавкаНДСТолькоЦифры); 
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	ЗаписьXML.ЗаписатьНачалоЭлемента("vatCode");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(СтавкаНДС));
	ЗаписьXML.ЗаписатьКонецЭлемента();  	
	
    Если ЗначениеЗаполнено(XMLСтрока(СтавкаНДС)) Тогда
		Товар.Вставить("НДС", XMLСтрока(СтавкаНДС));
	ИначеЕсли НЕ ЗначениеЗаполнено(XMLСтрока(СтавкаНДС))Тогда   
		Товар.Вставить("НДС", Ложь); 
		ОшибкаДанных = Истина;
	КонецЕсли;

	
	ЗначениеЦвет = Неопределено;
	ДополнительныеСвойствоЦвет = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Цвет поставщика"); // Терлецкий АВ 25.02.04
	ДополнительныйРеквизитЦвет = Источник.ДополнительныеРеквизиты.Найти(ДополнительныеСвойствоЦвет);
	Если ДополнительныйРеквизитЦвет <> Неопределено Тогда
		ЗначениеЦвет = Строка(ДополнительныйРеквизитЦвет.Значение);	
	КонецЕсли;

	ЗаписьXML.ЗаписатьНачалоЭлемента("color");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(ЗначениеЦвет));
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("packingUnit"); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("length");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Источник.Длина));
	ЗаписьXML.ЗаписатьКонецЭлемента();	
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("width");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Источник.Ширина));
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("height");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Источник.Высота));
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("volume");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Источник.Объем));
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	ЗаписьXML.ЗаписатьНачалоЭлемента("weight");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Источник.Вес));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();  
	
	РазмерыТовара = Новый Массив;
	
	СписокЦен = ПолучитьЦеныПоИнициаторОтправки(ИнициаторОтправки); // ++ Терлецкий АВ 25.01.20
	СписокНоменклатурыШтрихкод = ЗаполнитьСписокНоменклатурыШтрихкод(Источник); // ++ Терлецкий АВ 25.01.20
	
	// ++ Терлецкий АВ 25.01.20
	Если ТипЗнч(СписокНоменклатурыШтрихкод) = Тип("ТаблицаЗначений") Тогда 
				
		ЗаполнитьХарактеристики = Ложь; 
		Если СписокНоменклатурыШтрихкод.Количество() > 0 И ЗначениеЗаполнено(СписокНоменклатурыШтрихкод[0].Размер) Тогда // Терлецкий АВ 25.02.04
			ЗаполнитьХарактеристики = Истина;
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("sizesInfo");  

		Если ЗаполнитьХарактеристики Тогда  
			Для каждого СтрокаНоменклатурыШтрихкод Из СписокНоменклатурыШтрихкод Цикл  
				Если ЗначениеЗаполнено(СтрокаНоменклатурыШтрихкод.Размер) Тогда
					РазмерТовара = Новый Структура;
					
					SizeId = "";
					Если ЗначениеЗаполнено(СтрокаНоменклатурыШтрихкод.SizeId) Тогда 
						SizeId = СтрокаНоменклатурыШтрихкод.SizeId;
					Иначе
						SizeId = Источник.УникальныйИдентификатор();
					КонецЕсли; 
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("sizeInfo");
					ЗаписьXML.ЗаписатьАтрибут("size", XMLСтрока(SizeId)); 
					
					Если ЗначениеЗаполнено(XMLСтрока(SizeId)) Тогда
						РазмерТовара.Вставить("Гуид", XMLСтрока(SizeId));
					Иначе 
						РазмерТовара.Вставить("Гуид", Ложь);
						ОшибкаДанных = Истина;
					КонецЕсли;

					
					ЗаписьXML.ЗаписатьНачалоЭлемента("sizeText");
					ЗаписьXML.ЗаписатьТекст(XMLСтрока(СтрокаНоменклатурыШтрихкод.Размер));
					ЗаписьXML.ЗаписатьКонецЭлемента();  
					
					Если ЗначениеЗаполнено(XMLСтрока(СтрокаНоменклатурыШтрихкод.Размер)) Тогда
						РазмерТовара.Вставить("Размер", XMLСтрока(СтрокаНоменклатурыШтрихкод.Размер));
					Иначе 
						РазмерТовара.Вставить("Размер", Ложь);
						ОшибкаДанных = Истина;
					КонецЕсли;
					
					// ++ Терлецкий АВ 25.01.30
					ШтрихкодНоменклатуры = "";
					Если ЗначениеЗаполнено(Источник.Штрихкод) Тогда     
						ШтрихкодНоменклатуры = Источник.Штрихкод;		
					Иначе 	
						ШтрихкодНоменклатуры = СтрокаНоменклатурыШтрихкод.Штрихкод; 
					КонецЕсли;

					ЗаписьXML.ЗаписатьНачалоЭлемента("ean"); 
					ЗаписьXML.ЗаписатьТекст(XMLСтрока(ШтрихкодНоменклатуры));  
					ЗаписьXML.ЗаписатьКонецЭлемента(); 
					
					Если ЗначениеЗаполнено(XMLСтрока(ШтрихкодНоменклатуры)) Тогда
						РазмерТовара.Вставить("Штрихкод", XMLСтрока(ШтрихкодНоменклатуры));
					Иначе 
						РазмерТовара.Вставить("Штрихкод", Ложь);
						ОшибкаДанных = Истина;
					КонецЕсли;
                    // -- Терлецкий АВ 25.01.30
				
					ЗаписьXML.ЗаписатьНачалоЭлемента("prices"); 
					
					СтруктураПоиска = Новый Структура("Номенклатура", Источник); 
					МассивНайденныхЦен = СписокЦен.НайтиСтроки(СтруктураПоиска); 
					
					ЦеныРазмера = Новый Массив;
					Если МассивНайденныхЦен.Количество() > 0 Тогда
						Для каждого НайденнаяСтрока Из МассивНайденныхЦен Цикл 

							ЦенаРазмера = Новый Структура;
							ЗаписьXML.ЗаписатьНачалоЭлемента("price"); 
							Если ЗначениеЗаполнено(ВидЦеныПоступления) И ТипЗнч(ВидЦеныПоступления) = Тип("СправочникСсылка.ВидыЦен") Тогда
								ЗаписьXML.ЗаписатьАтрибут("id", XMLСтрока(ВидЦеныПоступления.УникальныйИдентификатор())); 
							КонецЕсли;
							ЗаписьXML.ЗаписатьТекст(XMLСтрока(НайденнаяСтрока.Цена));
							ЗаписьXML.ЗаписатьКонецЭлемента(); 
							
							Если ЗначениеЗаполнено(ВидЦеныПоступления) И ТипЗнч(ВидЦеныПоступления) = Тип("СправочникСсылка.ВидыЦен") Тогда
								ЦенаРазмера.Вставить("Гуид",  XMLСтрока(ВидЦеныПоступления.УникальныйИдентификатор()));
							Иначе 
								ЦенаРазмера.Вставить("Гуид", Ложь);
								ОшибкаДанных = Истина;
							КонецЕсли;
							
							Если ЗначениеЗаполнено( XMLСтрока(НайденнаяСтрока.Цена)) Тогда
								ЦенаРазмера.Вставить("Цена",  XMLСтрока(НайденнаяСтрока.Цена));
							Иначе 
								ЦенаРазмера.Вставить("Цена", Ложь);
								ОшибкаДанных = Истина;
							КонецЕсли;
							
							ЦеныРазмера.Добавить(ЦенаРазмера);
							
						КонецЦикла;
					Иначе
						ЗаписьXML.ЗаписатьНачалоЭлемента("price");
						ЗаписьXML.ЗаписатьАтрибут("id", XMLСтрока("")); 	
						ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));  
						ЗаписьXML.ЗаписатьКонецЭлемента();
						ОшибкаДанных = Истина;
						
					КонецЕсли;
			
					ЗаписьXML.ЗаписатьКонецЭлемента();  
					
					ЗаписьXML.ЗаписатьНачалоЭлемента("addFieldValues");
					ЗаписьXML.ЗаписатьКонецЭлемента();

					ЗаписьXML.ЗаписатьКонецЭлемента();
					
					РазмерТовара.Вставить("ЦеныРазмера", ЦеныРазмера);
					РазмерыТовара.Добавить(РазмерТовара);
				КонецЕсли; 
								
			КонецЦикла;
			
		Иначе
			ЗаписьXML.ЗаписатьНачалоЭлемента("sizeInfo");
			ЗаписьXML.ЗаписатьАтрибут("size", XMLСтрока(""));
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("sizeText");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ean");
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("prices"); 
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("price");
			ЗаписьXML.ЗаписатьАтрибут("id", XMLСтрока("")); 	
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
		КонецЕсли;
		
	Иначе
		ЗаписьXML.ЗаписатьНачалоЭлемента("sizesInfo"); 
		ЗаписьXML.ЗаписатьНачалоЭлемента("sizeInfo");
		ЗаписьXML.ЗаписатьАтрибут("size", XMLСтрока(""));
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("sizeText");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("ean");
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
		ЗаписьXML.ЗаписатьКонецЭлемента(); 
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("prices");
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("price");
		ЗаписьXML.ЗаписатьАтрибут("id", XMLСтрока("")); 	
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("addFieldValues");
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
		ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();
		
	КонецЕсли;
	// -- Терлецкий АВ 25.01.20
	
	Товар.Вставить("РазмерыТовара", РазмерыТовара);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("addFieldValues");
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("buyWithThisItem"); 
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Коды = Новый Структура;
	ЗаписьXML.ЗаписатьНачалоЭлемента("stateCodes");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("tnved");
	Если ЗначениеЗаполнено(Источник.ТоварнаяНоменклатураВЭД) Тогда 
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(Источник.ТоварнаяНоменклатураВЭД.Код));
	Иначе 
		ЗаписьXML.ЗаписатьТекст(XMLСтрока(""));
	КонецЕсли;
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("okpd2");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(Источник.КодОКПД2));
	ЗаписьXML.ЗаписатьКонецЭлемента();
		
	ЗаполнениеТНВЭД = ?(ЗначениеЗаполнено(Источник.ТоварнаяНоменклатураВЭД) И ЗначениеЗаполнено(Источник.ТоварнаяНоменклатураВЭД.Код), Истина, Ложь);
	ЗаполнениеОКПД2 = ?(ЗначениеЗаполнено(Источник.КодОКПД2), Истина, Ложь); 

	Если НЕ (ЗаполнениеТНВЭД ИЛИ ЗаполнениеОКПД2) Тогда 
		ОшибкаДанных = Истина;
		Коды.Вставить("Тнвэд", Ложь);
		Коды.Вставить("Окпд2", Ложь); 
	Иначе
		Коды.Вставить("Тнвэд", XMLСтрока(Источник.ТоварнаяНоменклатураВЭД.Код));
		Коды.Вставить("Окпд2", XMLСтрока(Источник.КодОКПД2)); 
	КонецЕсли;
	
	Товар.Вставить("Коды", Коды);
	ДанныеСериализации.Вставить("Товар", Товар); 
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
	ЗаписьXML.ЗаписатьКонецЭлемента();

	СтрокаЗаписиXML = ЗаписьXML.Закрыть();

	Сериализация.Вставить("Строка", СтрокаЗаписиXML);
	Сериализация.Вставить("ОписаниеДанных", ДанныеСериализации); 
	Сериализация.Вставить("ОшибкаДанных", ОшибкаДанных); 
	
	Если ОшибкаДанных Тогда
		Сериализация.Вставить("СтатусСообщения", Перечисления.спСтатусыСообщений.НеВалидно);	
	КонецЕсли;
	
	Возврат Сериализация;
	
КонецФункции 

Функция ПолучитьЦеныПоИнициаторОтправки(ИнициаторОтправки)  
	Ссылка = Неопределено;
	Если ТипЗнч(ИнициаторОтправки) = Тип("ДокументСсылка.ПеремещениеЗапасов") 
		И ТипЗнч(ИнициаторОтправки.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда 
		   Ссылка = ИнициаторОтправки.ДокументОснование;   
	   Иначе 
		   Ссылка = ИнициаторОтправки;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
		//|	ПриходнаяНакладнаяЗапасы.Характеристика КАК Характеристика, // ++ Терлецкий АВ 25.01.20
		|	ПриходнаяНакладнаяЗапасы.Цена КАК Цена
		|ИЗ
		|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
		|ГДЕ
		|	ПриходнаяНакладнаяЗапасы.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат; 
КонецФункции

Функция СериализоватьFE720(Источник)
	ОшибкаДанных = Ложь;
	
	Сериализация = Новый Структура("Строка, ОписаниеДанных, ОшибкаДанных, СтатусСообщения");
	ДанныеСериализации = Новый Структура;
	
	CписокТоваров = ЗаполнитьCписокТоваров(Источник); // ++ Терлецкий АВ 25.01.20 
	
	Если ТипЗнч(Источник) = Тип("ДокументСсылка.ПеремещениеЗапасов") 
		И ТипЗнч(Источник.ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") И Источник.ДокументОснование <> Документы.ПриходнаяНакладная.ПустаяСсылка() Тогда 
		ШтрихкодУпаковки =  ПолучитьШтрихкодУпаковки(Источник.ДокументОснование);
	Иначе 
		ШтрихкодУпаковки = ПолучитьШтрихкодУпаковки(Источник);
	КонецЕсли; 
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8"); 
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("shipmentAnnouncementRequest");
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xsi", "http://www.w3.org/2001/XMLSchema-instance");		
	ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("xs", "http://www.w3.org/2001/XMLSchema");
    ЗаписьXML.ЗаписатьСоответствиеПространстваИмен("", "http://service.profashionsolutions.ru/fe720_r002");
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("service");
	
	Сервис = Новый Структура;
	
	shop = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спshop");
	ЗаписьXML.ЗаписатьНачалоЭлемента("shop"); 
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(shop));
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Если ЗначениеЗаполнено(XMLСтрока(shop)) Тогда
		Сервис.Вставить("shop", XMLСтрока(shop));
	Иначе 
		Сервис.Вставить("shop", Ложь);
		ОшибкаДанных = Истина;
	КонецЕсли;
	
	token = спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спtoken");
	ЗаписьXML.ЗаписатьНачалоЭлемента("token");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(token));
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Если ЗначениеЗаполнено(XMLСтрока(token)) Тогда
		Сервис.Вставить("token", XMLСтрока(token));
	Иначе 
		Сервис.Вставить("token", Ложь);
		ОшибкаДанных = Истина;
	КонецЕсли;
	
	ТДата = ТекущаяДатаСеанса();
	ТГод = Формат(ТДата, "ДФ=гггг");
	ТМесяц = Месяц(ТДата);
    ТДень =  День(ТДата);
    ТЧас =  Час(ТДата);
	ТМинута = Минута(ТДата);
	ТСекунда =  Секунда(ТДата); 
	
	МДата = СтрШаблон("P%1Y%2M%3DT%4H%5M%6S", ТГод, ТМесяц, ТДень, ТЧас, ТМинута, ТСекунда);
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("messageDate"); 
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(МДата));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(XMLСтрока(МДата)) Тогда
		Сервис.Вставить("messageDate", XMLСтрока(МДата));
	Иначе 
		Сервис.Вставить("messageDate", Ложь);
		ОшибкаДанных = Истина;
	КонецЕсли;
	
	УИД = Новый УникальныйИдентификатор();
	ЗаписьXML.ЗаписатьНачалоЭлемента("messageId");
	ЗаписьXML.ЗаписатьТекст(XMLСтрока(УИД));
	ЗаписьXML.ЗаписатьКонецЭлемента();
	
	Если ЗначениеЗаполнено(XMLСтрока(УИД)) Тогда
		Сервис.Вставить("messageId", XMLСтрока(УИД));
	Иначе 
		Сервис.Вставить("messageId", Ложь);
		ОшибкаДанных = Истина;
	КонецЕсли;
	ДанныеСериализации.Вставить("Сервис", Сервис);
	
	ЗаписьXML.ЗаписатьКонецЭлемента(); 
	
	Товары = Новый Массив;

	ЗаписьXML.ЗаписатьНачалоЭлемента("items");
	Если ТипЗнч(CписокТоваров) = Тип("ТаблицаЗначений") И CписокТоваров.Количество() > 0 Тогда 
		Для каждого СтрТовары Из CписокТоваров Цикл
			Товар = Новый Структура; 
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("item");  
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("uuid"); 
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(СтрТовары.uuid));
			ЗаписьXML.ЗаписатьКонецЭлемента();
						
			Если ЗначениеЗаполнено(XMLСтрока(СтрТовары.uuid)) Тогда
				Товар.Вставить("Гуид", XMLСтрока(СтрТовары.uuid));
			Иначе 
				Товар.Вставить("Гуид", Ложь);
				ОшибкаДанных = Истина;
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("size"); 
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(СтрТовары.size));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(XMLСтрока(СтрТовары.size)) Тогда
				Товар.Вставить("Размер", XMLСтрока(СтрТовары.size));
			Иначе 
				Товар.Вставить("Размер", Ложь);
				ОшибкаДанных = Истина;
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ean"); 
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(СтрТовары.ean));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			Если ЗначениеЗаполнено(XMLСтрока(СтрТовары.ean)) Тогда
				Товар.Вставить("Ean", XMLСтрока(СтрТовары.ean));
			Иначе 
				Товар.Вставить("Ean", Ложь);
				ОшибкаДанных = Истина;
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("quantity"); 
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(СтрТовары.quantity));
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			
			Если СтрТовары.quantity <> 0 Тогда
				Товар.Вставить("Количество", XMLСтрока(СтрТовары.quantity));
			Иначе 
				Товар.Вставить("Количество", Ложь);
				ОшибкаДанных = Истина;
			КонецЕсли;
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("price"); 
			ЗаписьXML.ЗаписатьТекст(XMLСтрока(СтрТовары.price));
			ЗаписьXML.ЗаписатьКонецЭлемента(); 
			
			Если СтрТовары.price <> 0 Тогда
				Товар.Вставить("Цена", XMLСтрока(СтрТовары.price));
			Иначе 
				Товар.Вставить("Цена", Ложь);
				ОшибкаДанных = Истина;
			КонецЕсли;

			labelCodes = Новый Структура;;
			labelCodes.Вставить("Номенклатура", 	XMLСтрока(СтрТовары.Номенклатура));
			//labelCodes.Вставить("Характеристика", 	XMLСтрока(СтрТовары.Характеристика)); // ++ Терлецкий АВ 25.01.20
            labelCode = Новый Массив; 
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("labelCodes");  
			Если ТипЗнч(ШтрихкодУпаковки) = Тип("ТаблицаЗначений") И ШтрихкодУпаковки.Количество() > 0 Тогда 
				//НайденныеСтроки = ШтрихкодУпаковки.НайтиСтроки(Новый Структура("Номенклатура, Характеристика", СтрТовары.Номенклатура, СтрТовары.Характеристика)); // ++ Терлецкий АВ 25.01.20 
				НайденныеСтроки = ШтрихкодУпаковки.НайтиСтроки(Новый Структура("Номенклатура", СтрТовары.Номенклатура)); // ++ Терлецкий АВ 25.01.20
				Если НайденныеСтроки.Количество() > 0 Тогда
					Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл 
						Если ЗначениеЗаполнено(XMLСтрока(НайденнаяСтрока.ШтрихкодУпаковок)) Тогда 
							ЗаписьXML.ЗаписатьНачалоЭлемента("labelCode");
							// {{ - TNext - Иванов С.С. - 20.12.2024 г. - Доб.  
							ВидПродукции = ИнтеграцияИСПовтИсп.ВидПродукцииПоНоменклатуре(СтрТовары.Номенклатура);
							
							ВидыПродукции = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ВидПродукции);
							
							ЗначениеКМ = XMLСтрока(НайденнаяСтрока.ШтрихкодУпаковок);
							
							ДанныеРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(ЗначениеКМ, ВидыПродукции);
							
							ПараметрыНормализацииКМ = РазборКодаМаркировкиИССлужебныйКлиентСервер.НастройкиРазбораКодаМаркировкиДляХэшаНормализации();
							
							НормализованныйКМ = РазборКодаМаркировкиИССлужебныйКлиентСервер.НормализоватьКодМаркировки(ДанныеРазбора, ВидыПродукции[0], ПараметрыНормализацииКМ);
							
							ЗаписьXML.ЗаписатьТекст(НормализованныйКМ); 
							// }} - TNext - Иванов С.С. - 20.12.2024 г. - Доб.
							ЗаписьXML.ЗаписатьКонецЭлемента();
						КонецЕсли;
					КонецЦикла;
				КонецЕсли; 
			КонецЕсли; 
			
            labelCodes.Вставить("labelCode", labelCode);
			Товар.Вставить("labelCodes", labelCodes);

			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьКонецЭлемента();	
			
			Товары.Добавить(Товар);
		КонецЦикла;
	КонецЕсли;
	
	ДанныеСериализации.Вставить("Товары", Товары);
	
	ЗаписьXML.ЗаписатьКонецЭлемента();
    ЗаписьXML.ЗаписатьКонецЭлемента();
	
	СтрокаЗаписиXML = ЗаписьXML.Закрыть();
	
	Сериализация.Вставить("Строка", СтрокаЗаписиXML);
	Сериализация.Вставить("ОписаниеДанных", ДанныеСериализации); 
	Сериализация.Вставить("ОшибкаДанных", ОшибкаДанных);  
	
	Если ОшибкаДанных Тогда
		Сериализация.Вставить("СтатусСообщения", Перечисления.спСтатусыСообщений.НеВалидно);	
	КонецЕсли;

	Возврат Сериализация;
	
КонецФункции

Функция ЗаполнитьCписокТоваров(Знач Источник) 
	// ++ Терлецкий АВ 25.02.04
	
	Запасы = Источник.Запасы.Выгрузить(,"Номенклатура, Количество, Цена");
	Запасы.Свернуть("Номенклатура, Цена", "Количество");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Запасы.Номенклатура КАК НоменклатураСсылка
	|ПОМЕСТИТЬ ВТТовары
	|ИЗ
	|	&Запасы КАК Запасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка,
	|	НоменклатураДополнительныеРеквизиты.Значение КАК Размер
	|ПОМЕСТИТЬ ВТРазмер
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТТовары.НоменклатураСсылка КАК Номенклатура
	|			ИЗ
	|				ВТТовары КАК ВТТовары)
	|	И НоменклатураДополнительныеРеквизиты.Свойство.Наименование ПОДОБНО ""Размер поставщика""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка,
	|	НоменклатураДополнительныеРеквизиты.Значение КАК SizeId
	|ПОМЕСТИТЬ ВТSizeId
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТТовары.НоменклатураСсылка КАК Номенклатура
	|			ИЗ
	|				ВТТовары КАК ВТТовары)
	|	И НоменклатураДополнительныеРеквизиты.Свойство.Наименование ПОДОБНО ""SizeId""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Товары.НоменклатураСсылка КАК Номенклатура,
	|	ВТРазмер.Размер КАК Размер,
	|	ВТSizeId.SizeId КАК SizeId,
	|	Номенклатура.Штрихкод КАК Штрихкод
	|ИЗ
	|	ВТТовары КАК Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмер КАК ВТРазмер
	|		ПО Товары.НоменклатураСсылка = ВТРазмер.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТSizeId КАК ВТSizeId
	|		ПО Товары.НоменклатураСсылка = ВТSizeId.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	|		ПО Товары.НоменклатураСсылка = Номенклатура.Ссылка";
	
	Запрос.УстановитьПараметр("Запасы", Запасы);	
	ШтрихкодыНоменклатуры = Запрос.Выполнить().Выгрузить();

	Товары = Новый ТаблицаЗначений;
	Товары.Колонки.Добавить("Номенклатура",  Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Товары.Колонки.Добавить("uuid",  Новый ОписаниеТипов("УникальныйИдентификатор")); 
	Товары.Колонки.Добавить("size",  Новый ОписаниеТипов("Строка")); 
	Товары.Колонки.Добавить("ean",  Новый ОписаниеТипов("Строка"));
    Товары.Колонки.Добавить("quantity",  Новый ОписаниеТипов("Число")); 
	Товары.Колонки.Добавить("price",  Новый ОписаниеТипов("Число"));
	
	Для каждого СтрЗапасы Из Запасы Цикл 
		СтрокаТовары = Товары.Добавить();  
		СтрокаТовары.Номенклатура = СтрЗапасы.Номенклатура;
	    СтрокаТовары.uuid = СтрЗапасы.Номенклатура.УникальныйИдентификатор();
		
		Отбор = Новый Структура();
		Отбор.Вставить("Номенклатура", СтрЗапасы.Номенклатура);  

		Строки = ШтрихкодыНоменклатуры.НайтиСтроки(Отбор);
		Если Строки.Количество() > 0 Тогда
			СтрокаТовары.ean  	= Строки[0].Штрихкод;
			СтрокаТовары.size  	= Строки[0].Размер;
		КонецЕсли;
		
		СтрокаТовары.quantity = СтрЗапасы.Количество;
		Если ТипЗнч(Источник) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда 
			СтрокаТовары.price = СтрЗапасы.Цена; 
		Иначе
			СписокЦен = ПолучитьЦеныПоИнициаторОтправки(Источник);
			
			Отбор = Новый Структура();
			Отбор.Вставить("Номенклатура", СтрЗапасы.Номенклатура);  
			
			Строки = СписокЦен.НайтиСтроки(Отбор);
			Если Строки.Количество() > 0 Тогда
				СтрокаТовары.price  = Строки[0].Цена;
			КонецЕсли;
			
        КонецЕсли;
	КонецЦикла;
	Возврат Товары; 
	// ++ Терлецкий АВ 25.02.04
КонецФункции

Функция ЗаполнитьCписокТоваровРазмерРазмерИД(Запасы) 
	// ++ Терлецкий АВ 25.02.04
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
			"ВЫБРАТЬ
			|	Запасы.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ВТТовары
			|ИЗ
			|	&Запасы КАК Запасы
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка,
			|	НоменклатураДополнительныеРеквизиты.Значение КАК Размер
			|ПОМЕСТИТЬ ВТРазмер
			|ИЗ
			|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
			|ГДЕ
			|	НоменклатураДополнительныеРеквизиты.Ссылка В
			|			(ВЫБРАТЬ
			|				ВТТовары.Номенклатура КАК Номенклатура
			|			ИЗ
			|				ВТТовары КАК ВТТовары)
			|	И НоменклатураДополнительныеРеквизиты.Свойство.Наименование ПОДОБНО ""Размер поставщика""
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Ссылка,
			|	НоменклатураДополнительныеРеквизиты.Значение КАК SizeId
			|ПОМЕСТИТЬ ВТSizeId
			|ИЗ
			|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
			|ГДЕ
			|	НоменклатураДополнительныеРеквизиты.Ссылка В
			|			(ВЫБРАТЬ
			|				ВТТовары.Номенклатура КАК Номенклатура
			|			ИЗ
			|				ВТТовары КАК ВТТовары)
			|	И НоменклатураДополнительныеРеквизиты.Свойство.Наименование ПОДОБНО ""SizeId""
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Товары.Номенклатура КАК Номенклатура,
			|	ВТРазмер.Размер КАК Размер,
			|	ВТSizeId.SizeId КАК SizeId
			|ИЗ
			|	ВТТовары КАК Товары
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмер КАК ВТРазмер
			|		ПО Товары.Номенклатура = ВТРазмер.Ссылка
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТSizeId КАК ВТSizeId
			|		ПО Товары.Номенклатура = ВТSizeId.Ссылка";
	
	Запрос.УстановитьПараметр("Запасы", Запасы);	
	Возврат Запрос.Выполнить().Выгрузить();  
	// -- Терлецкий АВ 25.02.04
КонецФункции

Функция ПолучитьШтрихкодУпаковки(Ссылка) 
		
	ШтрихкодыУпаковок = Новый ТаблицаЗначений;
	ШтрихкодыУпаковок.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	//ШтрихкодыУпаковок.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ШтрихкодыУпаковок.Колонки.Добавить("ШтрихкодУпаковок", Новый ОписаниеТипов("Строка"));

	
	// { Разумов А.А. (TNEXT) 31.08.2025 Задача № 3950 Передача документов на склад Простор
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	//	//|	ПриходнаяНакладнаяЗапасы.Характеристика КАК Характеристика,
	//	|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ШтрихкодУпаковок
	//	|ИЗ
	//	|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	//	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	//	|		ПО ПриходнаяНакладнаяЗапасы.Номенклатура = ШтрихкодыУпаковокТоваров.Номенклатура
	//	//|			И ПриходнаяНакладнаяЗапасы.Характеристика = ШтрихкодыУпаковокТоваров.Характеристика
	//	|ГДЕ
	//	|	ПриходнаяНакладнаяЗапасы.Ссылка = &Ссылка";
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ПриходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	ПриходнаяНакладнаяШтрихкодыУпаковок.ЗначениеШтрихкода КАК ШтрихкодУпаковок
	|ИЗ
	|	Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.ШтрихкодыУпаковок КАК ПриходнаяНакладнаяШтрихкодыУпаковок
	|		ПО ПриходнаяНакладнаяЗапасы.Ссылка = ПриходнаяНакладнаяШтрихкодыУпаковок.Ссылка
	|			И ПриходнаяНакладнаяЗапасы.Номенклатура = ПриходнаяНакладнаяШтрихкодыУпаковок.ШтрихкодУпаковки.Номенклатура
	|ГДЕ
	|	ПриходнаяНакладнаяЗапасы.Ссылка = &Ссылка";	
	
	// } Разумов А.А. (TNEXT) 31.08.2025 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);  
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда 
		Возврат ШтрихкодыУпаковок; 
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ШтрихкодыУпаковок.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);	
	КонецЦикла;
	
    Возврат ШтрихкодыУпаковок;
КонецФункции

Функция ЗаполнитьСписокНоменклатурыШтрихкод(Источник)  
	// ++ Терлецкий АВ 25.02.04
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
	|	НоменклатураДополнительныеРеквизиты.Значение КАК Размер
	|ПОМЕСТИТЬ ВТРазмер
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
	|	И НоменклатураДополнительныеРеквизиты.Свойство.Наименование ПОДОБНО ""Размер поставщика""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
	|	НоменклатураДополнительныеРеквизиты.Значение КАК SizeId
	|ПОМЕСТИТЬ ВТSizeId
	|ИЗ
	|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
	|ГДЕ
	|	НоменклатураДополнительныеРеквизиты.Ссылка = &Номенклатура
	|	И НоменклатураДополнительныеРеквизиты.Свойство.Наименование ПОДОБНО ""SizeId""
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРазмер.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТНоменклатура
	|ИЗ
	|	ВТРазмер КАК ВТРазмер
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ВТSizeId.Номенклатура
	|ИЗ
	|	ВТSizeId КАК ВТSizeId
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТНоменклатура.Номенклатура КАК Номенклатура,
	|	ВТSizeId.SizeId КАК SizeId,
	|	ВТРазмер.Размер КАК Размер,
	|	ВТНоменклатура.Номенклатура.Штрихкод КАК Штрихкод
	|ИЗ
	|	ВТНоменклатура КАК ВТНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТРазмер КАК ВТРазмер
	|		ПО ВТНоменклатура.Номенклатура = ВТРазмер.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТSizeId КАК ВТSizeId
	|		ПО ВТНоменклатура.Номенклатура = ВТSizeId.Номенклатура";
	
	Запрос.УстановитьПараметр("Номенклатура", Источник);
	Результат = Запрос.Выполнить().Выгрузить();  
	
	Возврат Результат;
	// ++ Терлецкий АВ 25.02.04
	
КонецФункции

Функция ПолучитьЗначенияКонстант() Экспорт 
	СтруктураКонстантПодключения = Новый Структура;
	СтруктураКонстантПодключения.Вставить("sFTPСервер", спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спsFTPСервер")); 
	СтруктураКонстантПодключения.Вставить("sFTPЛогин", спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спsFTPЛогин"));
	СтруктураКонстантПодключения.Вставить("sFTPПароль", спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спsFTPПароль"));
	СтруктураКонстантПодключения.Вставить("sFTPПорт", спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спsFTPПорт"));
	СтруктураКонстантПодключения.Вставить("спsFTPSHHКлюч", спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спsFTPSHHКлюч")); 
	СтруктураКонстантПодключения.Вставить("sFTPПутьНаFTPPending", спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спsFTPПутьНаFTPPending"));
	СтруктураКонстантПодключения.Вставить("sFTPПутьНаFTPProcessed", спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спsFTPПутьНаFTPProcessed"));
	СтруктураКонстантПодключения.Вставить("sFTPПутьНаFTPErrors", спРаботаСКонстантами.ПолучитьЗначениеКонстанты("спsFTPПутьНаFTPErrors"));
	Возврат СтруктураКонстантПодключения;
КонецФункции 

Функция ПолучитьСообщение(Ссылка) Экспорт 
	Возврат спОбслуживаниеОчередей.ОбработкаОчередиИсходящегоСообщения(Ссылка);
КонецФункции  

Функция ПолучитьСообщениеПоСсылкеИСтатусу(Ссылка, Статус) Экспорт 
	Возврат спОбслуживаниеОчередей.ОбработкаОчередиИсходящегоСообщенияПоСсылкеИСтатусу(Ссылка, Статус);
КонецФункции

Функция ПолучитьСообщениеПоСсылке(Ссылка) Экспорт 
	Возврат спОбслуживаниеОчередей.ОбработкаОчередиИсходящегоСообщенияПоСсылке(Ссылка);
КонецФункции 

Функция ПолучитьСообщениеПоСсылкам(СообщенияДляОтправки) Экспорт 
	Возврат спОбслуживаниеОчередей.ОбработкаИсходящихСообщения(СообщенияДляОтправки);
КонецФункции  

Функция ПолучитьДанныеСообщенийПоСсылкеИСтатусу(Ссылки, Статус) Экспорт
	Возврат спОбслуживаниеОчередей.ПолучитьДанныеИсходящихСообщенийПоСсылкеИСтатусу(Ссылки, Статус);
КонецФункции  

#КонецОбласти

