//<<<--- Tnext Козык К.А. 16.06.2026 - адаптация под новый релиз 3.0.13.357
&ИзменениеИКонтроль("ДобавитьЭлементНоменклатурыВXDTO")
Процедура спДобавитьЭлементНоменклатурыВXDTO(ТоварыXDTO, ПакетCML, ДополнительныеДанные, Параметры)

	ТоварТип = ПакетCML.Получить("Товар");
	ТоварXDTO = ФабрикаXDTO.Создать(ТоварТип);
	
	Номенклатура = Параметры.ВыборкаНоменклатуры;
	
	Если Номенклатура.ПометкаУдаления Или Номенклатура.Недействителен Тогда
		ТоварXDTO.Статус = "Удален";
	КонецЕсли;
	
	Если Номенклатура.Наименование = "" Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.МассивВыгруженныхНоменклатур.Найти(Номенклатура.Номенклатура) = Неопределено Тогда
		Параметры.МассивВыгруженныхНоменклатур.Добавить(Номенклатура.Номенклатура);
	Иначе
		Возврат;
	КонецЕсли;
	
	ЗаполнитьИДСайтаДляОбъектаXDTO(ТоварXDTO, Номенклатура.Номенклатура,, Параметры);
	
	Попытка
		НоменклатураАртикул = Номенклатура.НоменклатураАртикул;
	Исключение
		НоменклатураАртикул = Номенклатура.Артикул;
	КонецПопытки;
	
	ТоварXDTO.Артикул = СоответствиеПоляНоменклатуры(Параметры, "Артикул", НоменклатураАртикул);

	ТоварXDTO.Код = СоответствиеПоляНоменклатуры(Параметры, "Код", Номенклатура.Код);
	Штрихкод = ПолучитьШтрихкодДляXDTO(СоответствиеПоляНоменклатуры(Параметры, "ШтрихКод", Номенклатура.Штрихкод));
	Если ЗначениеЗаполнено(Штрихкод) Тогда
		ТоварXDTO.Штрихкод = Штрихкод;
	КонецЕсли;
	ТоварXDTO.Наименование = ФорматНаименованияДляXDTO(СоответствиеПоляНоменклатуры(Параметры, "Наименование", Номенклатура.Наименование));
	ТоварXDTO.Описание = СоответствиеПоляНоменклатуры(Параметры, "Описание", Номенклатура.Комментарий);
	
	СтранаПроисхождения = СоответствиеПоляНоменклатуры(Параметры, "СтранаПроисхождения", Номенклатура.СтранаПроисхождения);
	Если ЗначениеЗаполнено(СтранаПроисхождения) Тогда
		ТоварXDTO.Страна = Строка(СтранаПроисхождения);
	КонецЕсли;
	
	Вес = СоответствиеПоляНоменклатуры(Параметры, "Вес", Номенклатура.Вес);
	Если ЗначениеЗаполнено(Вес) Тогда
		ТоварXDTO.Вес = Вес;
	КонецЕсли;
	
	ТоварXDTO.БазоваяЕдиница = ПолучитьБазовуюЕдиницуXDTO(ПакетCML, Параметры.ВыборкаНоменклатуры);
	
	ИдГруппы = "";
	Если Параметры.РучнаяНастройкаКаталога = 1 Тогда //с детализацией по товарам
		
		ГруппыТип = ПолучитьТипСвойстваОтТипаОбъектаXDTO(ТоварТип, "Группы");
		ГруппыXDTO = ФабрикаXDTO.Создать(ГруппыТип);
		
		// может быть несколько групп
		МассивИдГруппы = ИдентификаторНоменклатурыРучнаяНастройкаКаталога(Параметры.НастройкаИнтеграции, 
		Параметры.СтрокаТаблицыКаталогов.ИдентификаторКаталога, 
		Номенклатура.Номенклатура);
		
		Если массивИдГруппы.Количество() > 0 Тогда
			Для Каждого элементИд Из массивИдГруппы Цикл
				ГруппыXDTO.Ид.Добавить(элементИд);
			КонецЦикла;
			ТоварXDTO.Группы = ГруппыXDTO;
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Номенклатура.Родитель) Тогда
		
		ГруппыТип = ПолучитьТипСвойстваОтТипаОбъектаXDTO(ТоварТип, "Группы");
		ГруппыXDTO = ФабрикаXDTO.Создать(ГруппыТип);
		
		ИдГруппы = ЗаполнитьИДСайтаДляОбъектаXDTO(ГруппыXDTO, Номенклатура.Родитель,, Параметры);
		
		Если НЕ ПустаяСтрока(ИдГруппы) Тогда
			ТоварXDTO.Группы = ГруппыXDTO;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ (Параметры.Свойство("ОбменЧерезВебСервис") И Параметры.ОбменЧерезВебСервис = Истина) Тогда
		// Категории
		Если ЗначениеЗаполнено(Номенклатура.КатегорияНоменклатуры) Тогда
			ИдКатегории = СформироватьИдентификаторСайтаОбъекта(Номенклатура.КатегорияНоменклатуры,, Параметры.НастройкаИнтеграции, Ложь);
			Если ИдКатегории.Свойство("ИдСайта") И ЗначениеЗаполнено(ИдКатегории.ИдСайта) Тогда
				ТоварXDTO.Категория = ИдКатегории.ИдСайта;
				Параметры.СоответствияОбъектовИнтернетМагазина.Вставить(Номенклатура.КатегорияНоменклатуры);
			Иначе
				ТоварXDTO.Категория = СформироватьУникальныйИдентификаторОбъекта(Номенклатура.КатегорияНоменклатуры);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОписанияФайлов = Новый Соответствие;
	ОписанияКартинок = Новый Массив;
	ДобавитьАдресаИзображенийНоменклатурыXDTO(ТоварXDTO, ДополнительныеДанные.ТаблицаФайлов, Параметры, ОписанияФайлов, ОписанияКартинок);
	
	ДобавитьЗначенияСвойствНоменклатурыXDTO(ТоварXDTO, ДополнительныеДанные.ТаблицаСвойств, Параметры, ПакетCML);
	
	СтавкаНДС = Номенклатура.СтавкаНДС;
	#Вставка
	// { Иванов С.С. (TNext) - 20.03.2025 - Задача №1114 
	спВыгружатьНаСайтБезНДС = спУправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("спВыгружатьНаСайтБезНДС");
	Если спВыгружатьНаСайтБезНДС Тогда
		СтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();	
	КонецЕсли;	
	// }
	#КонецВставки
	Если ЗначениеЗаполнено(СтавкаНДС) Тогда
		
		СтавкиНалоговТип = ПолучитьТипСвойстваОтТипаОбъектаXDTO(ТоварТип, "СтавкиНалогов");
		
		СтавкиНалоговXDTO = ФабрикаXDTO.Создать(СтавкиНалоговТип);
		СтавкаНалогаXDTO = ФабрикаXDTO.Создать(ПакетCML.Получить("СтавкаНалога"));
		
		СтавкаНалогаXDTO.Наименование = Параметры.НаименованиеНалога;
		СтавкаНалогаXDTO.Ставка = ИнтеграцияСИнтернетМагазиномПовтИсп.ПолучитьПоСтавкеНДСЗначениеДляВыгрузки(СтавкаНДС);
		
		СтавкиНалоговXDTO.СтавкаНалога.Добавить(СтавкаНалогаXDTO);
		
		ТоварXDTO.СтавкиНалогов = СтавкиНалоговXDTO;
		
	КонецЕсли;
	
	Если Параметры.ОбменЧерезВебСервис Тогда
		ДобавитьХарактеристикиТовараXDTO(ТоварXDTO, ПакетCML, Номенклатура.Номенклатура, Параметры.ДеревоСвойствХарактеристик, Параметры);
	КонецЕсли;
	
	ЗначенияРеквизитовТип = ПолучитьТипСвойстваОтТипаОбъектаXDTO(ТоварТип, "ЗначенияРеквизитов");
	ЗначенияРеквизитовXDTO = ФабрикаXDTO.Создать(ЗначенияРеквизитовТип);
	
	Для Каждого ОписаниеФайла Из ОписанияФайлов Цикл
		
		Файл = ОписаниеФайла.Ключ;
		Описание = ОписаниеФайла.Значение;
		
		ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Файл", Файл);
		
		ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "ОписаниеФайла", Файл + "#" + Описание);
		
	КонецЦикла;
	
	Для Каждого ОписаниеФайла Из ОписанияКартинок Цикл
		
		Файл = ОписаниеФайла.Ключ;
		Описание = ОписаниеФайла.Значение;
		
		ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "ОписаниеФайла", Файл + "#" + Описание);
		
	КонецЦикла;
	
	// выгрузка доп.реквизитов Номенклатуры в раздел ЗначенияРеквизитов
	ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "ВидНоменклатуры", Номенклатура.ВидНоменклатуры);
	ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "ТипНоменклатуры", Номенклатура.ТипНоменклатуры);
	ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Полное наименование", Номенклатура.НаименованиеПолное);
	
	Если Номенклатура.ПометкаУдаления Или Номенклатура.Недействителен Тогда
		ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "ПометкаУдаления", Истина);
	КонецЕсли;
	
	Если Параметры.Свойство("НастройкиВыгрузкиРеквизитов") И ЗначениеЗаполнено(Параметры.НастройкиВыгрузкиРеквизитов) Тогда
		
		СтруктураПолейДопРеквизитов = ЧтениеJSONВСтруктуру(Параметры.НастройкиВыгрузкиРеквизитов);
		
		МассивДобавленныхСвойств = Новый Массив;
		
		Если СтруктураПолейДопРеквизитов.Количество() > 0 Тогда
			ВыборкаДопРеквизиты = Параметры.ДопРеквизитыНоменклатуры;
			ВыборкаДопРеквизиты.Сбросить();
			СтруктураПоискаНоменклатуры = Новый Структура("Номенклатура", Номенклатура.Номенклатура);
			Пока ВыборкаДопРеквизиты.НайтиСледующий(СтруктураПоискаНоменклатуры) Цикл
				Для Каждого Реквизит Из СтруктураПолейДопРеквизитов Цикл
					
					Если МассивДобавленныхСвойств.Найти(Реквизит.Ключ) <> Неопределено Тогда
						Продолжить;
					КонецЕсли;
					МассивДобавленныхСвойств.Добавить(Реквизит.Ключ);
					
					ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, Реквизит.Значение, ВыборкаДопРеквизиты[Реквизит.Ключ]);
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	ТоварXDTO.ЗначенияРеквизитов = ЗначенияРеквизитовXDTO;
	ТоварыXDTO.Товар.Добавить(ТоварXDTO);
	
	Параметры.СтрокаТаблицыКаталогов.СтруктураРезультата.ВыгруженоТоваров =
	Параметры.СтрокаТаблицыКаталогов.СтруктураРезультата.ВыгруженоТоваров + 1;
	
	Если Параметры.ОбменЧерезВебСервис <> Истина И Параметры.ВыгружатьЦены = Ложь Тогда
		// Выгруженные товары
		ТоварДействиеУдаление = Перечисления.ОбменСВнешнимиСистемамиЛогированиеДействия.ТоварУдалить;
		
		ВыгруженныеТоварыИнтернетМагазинаСтрока = Параметры.ВыгруженныеТоварыИнтернетМагазина.Добавить();
		
		ВыгруженныеТоварыИнтернетМагазинаСтрока.ИдентификаторКаталога = Параметры.СтрокаТаблицыКаталогов.ИдентификаторКаталога;
		ВыгруженныеТоварыИнтернетМагазинаСтрока.Номенклатура = Номенклатура.Номенклатура;
		ВыгруженныеТоварыИнтернетМагазинаСтрока.Характеристика = Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
		ВыгруженныеТоварыИнтернетМагазинаСтрока.Действие = ?(ТоварXDTO.Статус = "Удален", ТоварДействиеУдаление, Неопределено );
		ВыгруженныеТоварыИнтернетМагазинаСтрока.ДатаВыгрузки = Параметры.ДатаФормирования;
		
	КонецЕсли;

КонецПроцедуры //--->>> Tnext Козык К.А. 16.06.2026

&ИзменениеИКонтроль("ДобавитьТоварыЗаказаXDTO")
Процедура спДобавитьТоварыЗаказаXDTO(ДокументXDTO, ПакетCML, ВыборкаДокументов, ДеревоСвойствХарактеристик, Параметры)

	ВыборкаТоваров = ВыборкаДокументов.Товары.Выбрать();
	Если ВыборкаТоваров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	ТоварыТип = ПолучитьТипСвойстваОтТипаОбъектаXDTO(ДокументXDTO.Тип(), "Товары");
	ТоварТип = ПолучитьТипСвойстваОтТипаОбъектаXDTO(ТоварыТип, "Товар");

	НалогиВДокументеXDTO = ФабрикаXDTO.Создать(ПолучитьТипСвойстваОтТипаОбъектаXDTO(ДокументXDTO.Тип(), "Налоги"));
	ТоварыXDTO = ФабрикаXDTO.Создать(ТоварыТип);

	СчитатьНДС = ВыборкаДокументов.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ОблагаетсяНДС;
	СуммаНДС = 0;
	ДоставкаЗаполнена = Ложь;

	// выгрузим доставку заказа, если она заполнена на отдельной странице
	Если ВыборкаДокументов.СтоимостьДоставки <> 0 И ЗначениеЗаполнено(ВыборкаДокументов.НоменклатураДоставки) Тогда

		ТоварXDTO = ФабрикаXDTO.Создать(ТоварТип);

		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Код КАК Код,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Номенклатура.Артикул КАК Артикул,
		|	Номенклатура.ЕдиницаИзмерения.Код КАК ЕдиницаИзмеренияКод,
		|	Номенклатура.ЕдиницаИзмерения.Наименование КАК ЕдиницаИзмеренияНаименование,
		|	Номенклатура.ЕдиницаИзмерения.НаименованиеПолное КАК ЕдиницаИзмеренияНаименованиеПолное,
		|	Номенклатура.ЕдиницаИзмерения.МеждународноеСокращение КАК ЕдиницаИзмеренияМеждународноеСокращение,
		|	Номенклатура.КатегорияНоменклатуры КАК Категория,
		|	Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	НЕОПРЕДЕЛЕНО КАК Характеристика
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка = &НоменклатураДоставки";

		Запрос.УстановитьПараметр("НоменклатураДоставки", ВыборкаДокументов.НоменклатураДоставки);

		Результат = Запрос.Выполнить();
		ДанныеНоменклатураДоставки = Результат.Выбрать();

		Пока ДанныеНоменклатураДоставки.Следующий() Цикл

			ТоварXDTO.БазоваяЕдиница = ПолучитьБазовуюЕдиницуXDTO(ПакетCML, ДанныеНоменклатураДоставки);
			ТоварXDTO.Артикул = ДанныеНоменклатураДоставки.Артикул;
			ТоварXDTO.Наименование = ФорматНаименованияДляXDTO(ДанныеНоменклатураДоставки.Наименование);
			ТоварXDTO.Ид = "ORDER_DELIVERY";
			ТоварXDTO.Количество = 1;
			ТоварXDTO.ЦенаЗаЕдиницу = ВыборкаДокументов.СтоимостьДоставки;
			ТоварXDTO.Сумма = ВыборкаДокументов.СтоимостьДоставки;

			ЗначенияРеквизитовXDTOТовара = ФабрикаXDTO.Создать(ПолучитьТипСвойстваОтТипаОбъектаXDTO(ТоварТип, "ЗначенияРеквизитов"));
			//@skip-check query-in-loop
			ДобавитьСвойстваТовараВЗаказе(ЗначенияРеквизитовXDTOТовара, ПакетCML, ДанныеНоменклатураДоставки, Параметры, ТоварXDTO.Ид);

			ТоварXDTO.ЗначенияРеквизитов = ЗначенияРеквизитовXDTOТовара;

			ТоварыXDTO.Товар.Добавить(ТоварXDTO);
			ДоставкаЗаполнена = Истина;

			Прервать;

		КонецЦикла;

	КонецЕсли;

	Пока ВыборкаТоваров.Следующий() Цикл

		ТоварXDTO = ФабрикаXDTO.Создать(ТоварТип);

		Характеристика = Неопределено;
		Если Параметры.ИспользоватьХарактеристики Тогда
			Характеристика = ВыборкаТоваров.Характеристика;
		КонецЕсли;

		Если НЕ ДоставкаЗаполнена 
			И Параметры.ПротоколОбменаCMS = Перечисления.ПротоколыОбменаCMS.Битрикс
			И ВыборкаТоваров.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
			И Параметры.ТаблицаСоответствияСлужбДоставки.Количество() = 0
			Тогда //для CMS Битрикс выгружаем первую услугу - как доставку, с Ид = "ORDER_DELIVERY"

			ТоварXDTO.Ид = "ORDER_DELIVERY";
			ДоставкаЗаполнена = Истина;
		Иначе	
			//@skip-check query-in-loop
			ЗаполнитьИДСайтаДляОбъектаXDTO(ТоварXDTO, ВыборкаТоваров.Номенклатура, Характеристика, Параметры);	
		КонецЕсли;

		ТоварXDTO.Артикул = ВыборкаТоваров.Артикул;
		ТоварXDTO.Наименование = ФорматНаименованияДляXDTO(ВыборкаТоваров.Номенклатура);
		ТоварXDTO.БазоваяЕдиница = ПолучитьБазовуюЕдиницуXDTO(ПакетCML, ВыборкаТоваров);
		ТоварXDTO.ЦенаЗаЕдиницу = ВыборкаТоваров.Цена;
		ТоварXDTO.Количество = ВыборкаТоваров.Количество;
		ТоварXDTO.Сумма = ВыборкаТоваров.Сумма;

		Если Параметры.ПротоколОбменаCMS = Перечисления.ПротоколыОбменаCMS.Битрикс Тогда
			ТоварXDTO.Единица = ПроверитьЕдиницуИзмерения(ВыборкаТоваров.ЕдиницаИзмеренияКод, Ложь);
		Иначе
			ТоварXDTO.Единица = ПроверитьЕдиницуИзмерения(ВыборкаТоваров.ЕдиницаИзмерения, Истина);
		КонецЕсли;
		ТоварXDTO.Коэффициент = 1;

		Если ВыборкаТоваров.СуммаНДС > 0 И ЗначениеЗаполнено(ВыборкаТоваров.СтавкаНДС) И НЕ ВыборкаТоваров.СтавкаНДС.НеОблагается Тогда

			НалогиТовараXDTO = ФабрикаXDTO.Создать(ПолучитьТипСвойстваОтТипаОбъектаXDTO(ТоварТип, "Налоги"));
			НалогТовараXDTO = ФабрикаXDTO.Создать(ПакетCML.Получить("НалогВДокументе"));

			НалогТовараXDTO.Наименование = Параметры.НаименованиеНалога;
			НалогТовараXDTO.УчтеноВСумме = ВыборкаДокументов.СуммаВключаетНДС;
			НалогТовараXDTO.Сумма = ВыборкаТоваров.СуммаНДС;
			НалогТовараXDTO.Ставка = ИнтеграцияСИнтернетМагазиномПовтИсп.ПолучитьПоСтавкеНДСЗначениеДляВыгрузкиЧисло(ВыборкаТоваров.СтавкаНДС);

			НалогиТовараXDTO.Налог.Добавить(НалогТовараXDTO);
			ТоварXDTO.Налоги = НалогиТовараXDTO;

			Если СчитатьНДС Тогда

				СуммаНДС = СуммаНДС + ВыборкаТоваров.СуммаНДС;

			КонецЕсли;

		КонецЕсли;

		ПроцентСкидкиНаценки = ВыборкаТоваров.ПроцентСкидкиНаценки;

		Если ПроцентСкидкиНаценки <> 0 Тогда

			СуммаСкидки = ВыборкаТоваров.Количество * ВыборкаТоваров.Цена - ВыборкаТоваров.Сумма;

			СкидкиТовараXDTO = ФабрикаXDTO.Создать(ПолучитьТипСвойстваОтТипаОбъектаXDTO(ТоварТип, "Скидки"));
			СкидкаТовараXDTO = ФабрикаXDTO.Создать(ПакетCML.Получить("Скидка"));

			Попытка
				Если ПолучитьФункциональнуюОпцию("ИспользоватьРучныеСкидкиНаценкиПродажи") Тогда
					Если ЗначениеЗаполнено(ВыборкаДокументов.ВидСкидкиНаценки) Тогда
						СкидкаТовараXDTO.Наименование = Строка(ВыборкаДокументов.ВидСкидкиНаценки);
					Иначе
						СкидкаТовараXDTO.Наименование = "Ручная скидка";
					КонецЕсли;
				Иначе
					СкидкаТовараXDTO.Наименование = "Ручная скидка";
				КонецЕсли;

			Исключение
				СкидкаТовараXDTO.Наименование = "Ручная скидка";
			КонецПопытки;

			СкидкаТовараXDTO.Процент = ПолучитьЧислоИзСтроки(Формат(ПроцентСкидкиНаценки, "ЧЦ=5; ЧДЦ=2"));
			СкидкаТовараXDTO.Сумма = ПолучитьЧислоИзСтроки(Формат(СуммаСкидки, "ЧЦ=15; ЧДЦ=2"));
			СкидкаТовараXDTO.УчтеноВСумме = "true";

			СкидкиТовараXDTO.Скидка.Добавить(СкидкаТовараXDTO);
			ТоварXDTO.Скидки = СкидкиТовараXDTO;

		КонецЕсли;

		Если ЗначениеЗаполнено(ВыборкаТоваров.СтавкаНДС) И НЕ ВыборкаТоваров.СтавкаНДС.НеОблагается Тогда

#Удаление
			СтавкиНалоговXDTO = ФабрикаXDTO.Создать(ПолучитьТипСвойстваОтТипаОбъектаXDTO(ТоварТип, "СтавкиНалогов"));
			СтавкаНалогаXDTO = фабрикаXDTO.Создать(ПакетCML.Получить("СтавкаНалога"));

			СтавкаНалогаXDTO.Наименование = Параметры.НаименованиеНалога;
			СтавкаНалогаXDTO.Ставка = ИнтеграцияСИнтернетМагазиномПовтИсп.ПолучитьПоСтавкеНДСЗначениеДляВыгрузки(ВыборкаТоваров.СтавкаНДС, ДокументXDTO.Дата);

			СтавкиНалоговXDTO.СтавкаНалога.Добавить(СтавкаНалогаXDTO);

			ТоварXDTO.СтавкиНалогов = СтавкиНалоговXDTO;
#КонецУдаления
#Вставка
			// { Иванов С.С. (TNext) - 20.03.2025 - Задача №1114 
			спВыгружатьНаСайтБезНДС = спУправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("спВыгружатьНаСайтБезНДС");
			Если Не спВыгружатьНаСайтБезНДС Тогда
				
				СтавкиНалоговXDTO = ФабрикаXDTO.Создать(ПолучитьТипСвойстваОтТипаОбъектаXDTO(ТоварТип, "СтавкиНалогов"));
				СтавкаНалогаXDTO = фабрикаXDTO.Создать(ПакетCML.Получить("СтавкаНалога"));
				
				СтавкаНалогаXDTO.Наименование = Параметры.НаименованиеНалога;
				СтавкаНалогаXDTO.Ставка = ИнтеграцияСИнтернетМагазиномПовтИсп.ПолучитьПоСтавкеНДСЗначениеДляВыгрузки(ВыборкаТоваров.СтавкаНДС, ДокументXDTO.Дата);
				
				СтавкиНалоговXDTO.СтавкаНалога.Добавить(СтавкаНалогаXDTO);
				
				ТоварXDTO.СтавкиНалогов = СтавкиНалоговXDTO;
	
			КонецЕсли;	
			// }
#КонецВставки

		КонецЕсли;

		ЗначенияРеквизитовXDTO = ФабрикаXDTO.Создать(ПолучитьТипСвойстваОтТипаОбъектаXDTO(ТоварТип, "ЗначенияРеквизитов"));
		//@skip-check query-in-loop
		ДобавитьСвойстваТовараВЗаказе(ЗначенияРеквизитовXDTO, ПакетCML, ВыборкаТоваров, Параметры, ТоварXDTO.Ид);

		Если Параметры.ИспользоватьХарактеристики Тогда
			ВыгрузитьСвойстваХарактеристикиДляТовараXDTO(ПакетCML, ТоварXDTO, ТоварТип, ВыборкаТоваров.Характеристика, ДеревоСвойствХарактеристик, Параметры);
		КонецЕсли;

		ТоварXDTO.ЗначенияРеквизитов = ЗначенияРеквизитовXDTO;
		ТоварыXDTO.Товар.Добавить(ТоварXDTO);

	КонецЦикла;

	НалогДокументаXDTO = ФабрикаXDTO.Создать(ПакетCML.Получить("НалогВДокументе"));

	НалогДокументаXDTO.Наименование = Параметры.НаименованиеНалога;
	НалогДокументаXDTO.УчтеноВСумме = ВыборкаДокументов.СуммаВключаетНДС;
	НалогДокументаXDTO.Сумма = СуммаНДС;

	НалогиВДокументеXDTO.Налог.Добавить(НалогДокументаXDTO);

	ДокументXDTO.Налоги = НалогиВДокументеXDTO;
	ДокументXDTO.Товары = ТоварыXDTO;

КонецПроцедуры

//<<<--- Tnext Козык К.А. 15.08.2026 - адаптация под УНФ 3.0.14.115
&ИзменениеИКонтроль("ПодготовитьДанныеДляВыгрузкиТоваровЧерезСКД")
Процедура спПодготовитьДанныеДляВыгрузкиТоваровЧерезСКД(Параметры)
	
	// Компоновщик настроек.
	
	КомпоновщикНастроек = ПолучитьКомпоновщикНастроекВыгрузкиТоваровСКД(Параметры.СтрокаТаблицыКаталогов.ХранилищеНастроекКомпоновки);
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ИспользоватьХарактеристики");
	ПараметрСКД.Значение = Параметры.ИспользоватьХарактеристики;
	ПараметрСКД.Использование = Истина;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ИспользоватьНаборы");
	ПараметрСКД.Значение = Параметры.ИспользоватьНаборы;
	ПараметрСКД.Использование = Истина;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ОрганизацияВладелецКаталога");
	ПараметрСКД.Значение = Параметры.ОрганизацияВладелецКаталога;
	ПараметрСКД.Использование = Истина;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ВидыЦен");
	ПараметрСКД.Значение = Параметры.МассивВидовЦен;
	ПараметрСКД.Использование = Истина;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("УчетВалютныхОпераций");
	ПараметрСКД.Значение = Параметры.УчетВалютныхОпераций;
	ПараметрСКД.Использование = Истина;
	
	Если Параметры.ВыгружатьКартинки Тогда 
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("РазрешенныеТипыКартинок");
		ПараметрСКД.Значение = Параметры.РазрешенныеТипыКартинок;
		ПараметрСКД.Использование = Истина;
		
		ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("РазрешенныеТипыФайлов");
		ПараметрСКД.Значение = Параметры.РазрешенныеТипыФайлов;
		ПараметрСКД.Использование = Истина;		
	КонецЕсли;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("РазрешенныеТипыНоменклатуры");
	ПараметрСКД.Значение = Параметры.РазрешенныеТипыНоменклатуры;
	ПараметрСКД.Использование = Истина;
	
	ПараметрСКД = КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("ВыгружатьКатегории");
	ПараметрСКД.Значение = ?(Параметры.ОтборГруппыКатегорииНоменклатуры = Перечисления.ВидыОтборовНоменклатуры.КатегорииНоменклатуры,
	Истина, Ложь);
	ПараметрСКД.Использование = Истина;
	
	// Отборы.
	
	НастройкиСтруктураКаталога = Новый Структура;
	НастройкиСтруктураКаталога.Вставить("Группы", Параметры.СтрокаТаблицыКаталогов.Группы);
	НастройкиСтруктураКаталога.Вставить("РучнаяНастройкаКаталога", Параметры.РучнаяНастройкаКаталога);
	НастройкиСтруктураКаталога.Вставить("ОтборНоменклатураРучнаяНастройкаКаталога", Параметры.ОтборНоменклатураРучнаяНастройкаКаталога);
	
	Если Параметры.ВыгружатьТолькоИзменения
		И НЕ Параметры.ВыполнятьПолнуюВыгрузкуПринудительно Тогда
		
		ИзменитьОтборКомпоновщика( КомпоновщикНастроек, НастройкиСтруктураКаталога );
		
	Иначе
		
		Если Параметры.Свойство("КодГруппы") И ЗначениеЗаполнено(Параметры.КодГруппы) Тогда
			// отборы по параметрам для веб-сервиса
			
			ГруппаНоменклатуры = Справочники.Номенклатура.НайтиПоКоду(Параметры.КодГруппы);
			Если ЗначениеЗаполнено(ГруппаНоменклатуры) Тогда
				НастройкиСтруктураКаталога.Вставить("Группы", ГруппаНоменклатуры);
				ИзменитьОтборКомпоновщика(КомпоновщикНастроек, ГруппаНоменклатуры);
			КонецЕсли;
			
		ИначеЕсли Параметры.ОбменЗаписьНаУслуги И Параметры.РежимВыгрузкиУслуг Тогда
			// отборы запись на услуги
			ИзменитьОтборКомпоновщика(КомпоновщикНастроек, НастройкиСтруктураКаталога, Параметры.Услуги);
		Иначе
			ИзменитьОтборКомпоновщика(КомпоновщикНастроек, НастройкиСтруктураКаталога);
		КонецЕсли;
		
		Если Параметры.Свойство("ДатаИзменения") И ТипЗнч(Параметры.ДатаИзменения) = Тип("Дата") И ЗначениеЗаполнено(Параметры.ДатаИзменения) Тогда
			
			НовыйЭлемент = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлемент.ИдентификаторПользовательскойНастройки = "ПрограммныйОтборПоДатеИзменения";
			НовыйЭлемент.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Номенклатура.ДатаИзменения");
			НовыйЭлемент.ВидСравнения 	= ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
			НовыйЭлемент.ПравоеЗначение = Параметры.ДатаИзменения;
			НовыйЭлемент.Использование 	= Истина;
			
		КонецЕсли;
		
		Если Параметры.Свойство("КодСклада") И ЗначениеЗаполнено(Параметры.КодСклада) Тогда
			
			Склад = Справочники.СтруктурныеЕдиницы.НайтиПоКоду(Параметры.КодСклада);
			Если Склад = Неопределено Тогда
				Склад = Справочники.СтруктурныеЕдиницы.ПустаяСсылка();
			КонецЕсли;
			
			НовыйЭлемент = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлемент.ИдентификаторПользовательскойНастройки = "ПрограммныйОтборПоСкладу";
			НовыйЭлемент.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("СкладДляОстатков");
			НовыйЭлемент.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
			НовыйЭлемент.ПравоеЗначение = Склад;
			НовыйЭлемент.Использование 	= Истина;
			
			НовыйЭлемент = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлемент.ИдентификаторПользовательскойНастройки = "ПрограммныйОтборПоОстатку";
			НовыйЭлемент.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Остаток");
			НовыйЭлемент.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Больше;
			НовыйЭлемент.ПравоеЗначение = 0;
			НовыйЭлемент.Использование 	= Истина;
			
		КонецЕсли;
		
		Если Параметры.Свойство("КодОрганизации") И ЗначениеЗаполнено(Параметры.КодОрганизации) Тогда
			
			Организация = Справочники.Организации.НайтиПоКоду(Параметры.КодОрганизации);
			Если Организация = Неопределено Тогда
				Организация = Справочники.Организации.ПустаяСсылка();
			КонецЕсли;
			
			НовыйЭлемент = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			НовыйЭлемент.ИдентификаторПользовательскойНастройки = "ПрограммныйОтборПоОрганизации";
			НовыйЭлемент.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Организация");
			НовыйЭлемент.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Равно;
			НовыйЭлемент.ПравоеЗначение = Организация;
			НовыйЭлемент.Использование 	= Истина;
			
			Если Не ЗначениеЗаполнено(Параметры.КодСклада) Тогда
				НовыйЭлемент = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
				НовыйЭлемент.ИдентификаторПользовательскойНастройки = "ПрограммныйОтборПоОстатку";
				НовыйЭлемент.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Остаток");
				НовыйЭлемент.ВидСравнения 	= ВидСравненияКомпоновкиДанных.Больше;
				НовыйЭлемент.ПравоеЗначение = 0;
				НовыйЭлемент.Использование 	= Истина;
			КонецЕсли;
			
		КонецЕсли;
		
КонецЕсли;

ИсключитьУслугиИзТоварногоКаталога(Параметры, КомпоновщикНастроек);

// Запрос
	
	СхемаВыгрузкиТоваров = Справочники.НастройкиИнтеграцииСИнтернетМагазином.ПолучитьМакет( "СхемаВыгрузкиТоваров" );
	
	
	// +Отчет по данным для выгрузки
	ФормироватьОтчетПоДаннымДляВыгрузки = ИнтеграцияСМаркетплейсамиСервер.СтруктураСвойствоЗначениеПолучить( Параметры, "ОтчетПоДаннымДляВыгрузки", Ложь );
	
	УчетнаяЗапись = ИнтеграцияСМаркетплейсамиСервер.СтруктураСвойствоЗначениеПолучить( Параметры, "НастройкаИнтеграции", Неопределено );
	Если ОбменСВнешнимиСистемамиЛогированиеПовтИсп.ЛогированиеВключено( УчетнаяЗапись )
	Или ФормироватьОтчетПоДаннымДляВыгрузки Тогда
		
		Попытка
			КомпоновщикНастроекОтборЭлементы = КомпоновщикНастроек.Настройки.Отбор.Элементы;
			КомпоновщикНастроекОтборыПредставление = ОбменСВнешнимиСистемамиЛогирование.ОбъектПредставление( КомпоновщикНастроекОтборЭлементы );
		Исключение
			КомпоновщикНастроекОтборыПредставление = НСтр( "ru = '<ПодготовитьДанныеДляВыгрузкиТоваровЧерезСКД: Ошибка при получении элементов отбора>:'" )
			 + " " + ОбработкаОшибок.ПодробноеПредставлениеОшибки( ИнформацияОбОшибке() );
		КонецПопытки;
		
		КаталогПредставление = "" + СокрЛП( Параметры.СтрокаТаблицыКаталогов.Каталог ) + ": " + СокрЛП( Параметры.СтрокаТаблицыКаталогов.ИдентификаторКаталога );

		ЛогКомментарий = НСтр( "ru = 'Отбор по каталогу:'" ) + " " + КаталогПредставление
		+ ": " + ОбменСВнешнимиСистемамиЛогирование.КомментарийРазделительБлоков() 
		+ КомпоновщикНастроекОтборыПредставление;
		
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ЛогКомментарий, УчетнаяЗапись );
		
	КонецЕсли;
	
	Если ФормироватьОтчетПоДаннымДляВыгрузки = Истина Тогда

		ДиагностикаТовараОтборНоменклатура = ИнтеграцияСМаркетплейсамиСервер.СтруктураСвойствоЗначениеПолучить( Параметры, "ДиагностикаТовараОтборНоменклатура", Неопределено );
		Если ЗначениеЗаполнено( ДиагностикаТовараОтборНоменклатура ) Тогда
		
			КомпоновщикНастроекНовыйЭлемент = КомпоновщикНастроек.Настройки.Отбор.Элементы.Добавить( Тип( "ЭлементОтбораКомпоновкиДанных" ) );
			КомпоновщикНастроекНовыйЭлемент.ИдентификаторПользовательскойНастройки = "ДиагностикаТовараОтборНоменклатура";
			КомпоновщикНастроекНовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных( "Номенклатура" );
			КомпоновщикНастроекНовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
			КомпоновщикНастроекНовыйЭлемент.ПравоеЗначение = ДиагностикаТовараОтборНоменклатура;
			КомпоновщикНастроекНовыйЭлемент.Использование = Истина;
		
		КонецЕсли;
		
		КаталогОтборПредставление = Новый ТаблицаЗначений;
		КаталогОтборПредставление.Колонки.Добавить( "КаталогОтборПредставление" );
		
		КаталогОтборПредставлениеСтрока = КаталогОтборПредставление.Добавить();
		КаталогОтборПредставлениеСтрока.КаталогОтборПредставление = КомпоновщикНастроекОтборыПредставление;
		
		Параметры.Вставить( "КаталогОтборПредставление", КаталогОтборПредставление );
	КонецЕсли;
	// -Отчет по данным для выгрузки
	
	Запрос = ПолучитьЗапросИзМакетаКомпоновки(КомпоновщикНастроек, СхемаВыгрузкиТоваров);
	
	Запрос.УстановитьПараметр("КлючИнтеграции", ПолучитьКлючПоНастройке(Параметры.НастройкаИнтеграции));
	Запрос.УстановитьПараметр("НастройкаИнтеграции", Параметры.НастройкаИнтеграции);
	Запрос.УстановитьПараметр("ТекущаяДата", МестноеВремя(ТекущаяУниверсальнаяДата(), ЧасовойПоясСеанса()));
	Запрос.УстановитьПараметр("ВыгружатьДнейГрафика", Параметры.ВыгружатьДнейГрафика);
	Запрос.УстановитьПараметр("МассивИзмененийНоменклатуры", Параметры.МассивИзмененийНоменклатуры);
	Запрос.УстановитьПараметр("ЕстьИзменения", ЗначениеЗаполнено(Параметры.МассивИзмененийНоменклатуры));
	
	Если Параметры.ВыгружатьТолькоИзменения = Истина Тогда
		Запрос.УстановитьПараметр( "ТоварыДляЗаполненияImportXML", Параметры.СтруктураИзменений.ТоварыДляЗаполненияImportXML);
		Запрос.УстановитьПараметр( "ТоварыДляЗаполненияOffersXML", Параметры.СтруктураИзменений.ТоварыДляЗаполненияOffersXML);
	Иначе
		Запрос.УстановитьПараметр( "ТоварыДляЗаполненияImportXML", Новый Массив );
		Запрос.УстановитьПараметр( "ТоварыДляЗаполненияOffersXML", ТоварыНовый() );
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ИдентификаторКаталога", Параметры.СтрокаТаблицыКаталогов.ИдентификаторКаталога);
	Запрос.УстановитьПараметр("ВыгружатьТолькоИзменения", Параметры.ВыгружатьТолькоИзменения
		И НЕ Параметры.ВыполнятьПолнуюВыгрузкуПринудительно);
	
	Запрос.УстановитьПараметр("МинимальныйИнтервалУслуги", 30); // 30 минут
	Если Параметры.РучнаяНастройкаКаталога > 0 Тогда
		Запрос.УстановитьПараметр("РучнаяНастройкаКаталога", Параметры.РучнаяНастройкаКаталога);
		Запрос.УстановитьПараметр("ИдентификаторКаталога", Параметры.СтрокаТаблицыКаталогов.ИдентификаторКаталога);
	КонецЕсли;
	Запрос.УстановитьПараметр("УчетНоменклатурыПоставщиков", Параметры.УчетНоменклатурыПоставщиков);
	Запрос.УстановитьПараметр("ОбязательноеНаличиеФотографий", Параметры.ОбязательноеНаличиеФотографий);
	Запрос.УстановитьПараметр("ВыгружатьЦены", Параметры.ВыгружатьЦены);
	Запрос.УстановитьПараметр("ВыгружатьТоварыТолькоСНеНулевойЦеной", Параметры.ВыгружатьТоварыТолькоСНеНулевойЦеной);
	Запрос.УстановитьПараметр("НастройкиВыгрузкиОстатковПоставщиковНаСайт", Параметры.НастройкиВыгрузкиОстатковПоставщиковНаСайт);
	
	НаборСвойств_Справочник_Номенклатура = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура");
	НаборСвойств_Справочник_Номенклатура_Общие = УправлениеСвойствами.НаборСвойствПоИмени(
		"Справочник_Номенклатура_Общие");
	
	Запрос.УстановитьПараметр("НаборСвойств_Справочник_Номенклатура", НаборСвойств_Справочник_Номенклатура);
	Запрос.УстановитьПараметр("НаборСвойств_Справочник_Номенклатура_Общие", НаборСвойств_Справочник_Номенклатура_Общие);
	
	Если Параметры.ОбменЗаписьНаУслуги Тогда
		Запрос.УстановитьПараметр("ПроизводственныйКалендарь", Параметры.ПроизводственныйКалендарь); // из организации
	КонецЕсли;
	
	
	ДобавитьЗапросыВПакет(Запрос.Текст, Параметры);
	#Вставка
	//<<<--- Tnext Козык К.А. 15.08.2026
	спДополнитьДанныеДляВыгрузки(Запрос, Параметры);
	//--->>> Tnext Козык К.А. 15.08.2026
	#КонецВставки
	
	
	ЗапросыРезультаты = Запрос.ВыполнитьПакетСПромежуточнымиДанными();
	
	ЗапросыРезультатыПоИдентификаторам =
	РезультатыПакетаЗапросовРазложитьПоИдентификаторам( ЗапросыРезультаты, , Истина );
	
	Параметры.Вставить("ВыборкаЦен", ЗапросыРезультатыПоИдентификаторам[ "ЦеныДляВыгрузки" ].Выбрать());
	
	Параметры.Вставить("ВыборкаСкладов", ЗапросыРезультатыПоИдентификаторам[ "СкладыДляВыгрузки" ].Выбрать());
	
	ТаблицаОстатковПоСкладам = ЗапросыРезультатыПоИдентификаторам[ "СвободныеОстаткиПоСкладам" ].Выгрузить();
	
	ТаблицаОстатковПоСкладам.Индексы.Добавить("Номенклатура, Характеристика");
	Параметры.Вставить("ТаблицаОстатковПоСкладам", ТаблицаОстатковПоСкладам);
	
	Параметры.Вставить("ВыборкаВидовЦен", ЗапросыРезультатыПоИдентификаторам[ "ВыборкаВидовЦен" ].Выбрать());
	
	Параметры.Вставить("ДеревоСвойствХарактеристик", 
	ЗапросыРезультатыПоИдентификаторам["ДеревоСвойствХарактеристик"].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам));
	
	Параметры.Вставить("ВыборкаСвойствНоменклатурыДляКлассификатора", 
	ЗапросыРезультатыПоИдентификаторам[ "27: ТаблицаСвойстваНоменклатурыЗначения" ].Выбрать( ОбходРезультатаЗапроса.ПоГруппировкам ) );
	
	Параметры.Вставить("ВыборкаСвойствХарактеристикДляКлассификатора", 
	ЗапросыРезультатыПоИдентификаторам[ "37: ВТСвойстваХарактеристик" ].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	
	РезультатЗапросаСвойствНоменклатуры = ЗапросыРезультатыПоИдентификаторам[ "28: ВыборкаСвойствНоменклатуры" ];
	Если РезультатЗапросаСвойствНоменклатуры.Пустой() Тогда
		ВыборкаСвойствНоменклатуры = Неопределено;
	Иначе
		ВыборкаСвойствНоменклатуры = РезультатЗапросаСвойствНоменклатуры.Выбрать();
		ВыборкаСвойствНоменклатуры.Следующий();
	КонецЕсли;
	
	Параметры.Вставить("ВыборкаСвойствНоменклатуры", ВыборкаСвойствНоменклатуры);
	
	РезультатЗапросаДанныхОрганизацииВладельцаКаталога = ЗапросыРезультатыПоИдентификаторам[ "31: ДанныеОрганизацииВладельцаКаталога" ];
	Если РезультатЗапросаДанныхОрганизацииВладельцаКаталога.Пустой() Тогда
		ВыборкаДанныхОрганизацииВладельцаКаталога = Неопределено;
	Иначе
		ВыборкаДанныхОрганизацииВладельцаКаталога = РезультатЗапросаДанныхОрганизацииВладельцаКаталога.Выбрать();
		ВыборкаДанныхОрганизацииВладельцаКаталога.Следующий();
	КонецЕсли;
	
	Параметры.Вставить("ДанныеОрганизацииВладельцаКаталога", ВыборкаДанныхОрганизацииВладельцаКаталога);
	
	Параметры.Вставить("ВыборкаНоменклатуры", ЗапросыРезультатыПоИдентификаторам[ "32: НоменклатураДляВыгрузки" ].Выбрать());
	
	Параметры.Вставить( "ДеревоГрупп", ЗапросыРезультатыПоИдентификаторам[ "34: СтруктураКаталогаИнтернетМагазина" ].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией));
	
	ВыборкаФайловНоменклатуры = Неопределено;
	ВыборкаКартинкиХарактеристик = Неопределено;
	Если Параметры.ВыгружатьКартинки Тогда
		
		РезультатЗапросаФайлов = ЗапросыРезультатыПоИдентификаторам[ "35: НоменклатураПрисоединенныеФайлы" ];
		Если РезультатЗапросаФайлов.Пустой() Тогда
			ВыборкаФайловНоменклатуры = Неопределено;
		Иначе
			ВыборкаФайловНоменклатуры = РезультатЗапросаФайлов.Выбрать();
			ВыборкаФайловНоменклатуры.Следующий();
		КонецЕсли;
		
		РезультатЗапросаКартинкиХарактеристик = ЗапросыРезультатыПоИдентификаторам[ "40: ХарактеристикиНоменклатурыПрисоединенныеФайлы: СортировкаФайловДляСайта" ];
		Если РезультатЗапросаКартинкиХарактеристик.Пустой() Тогда
			ВыборкаКартинкиХарактеристик = Неопределено;
		Иначе
			ВыборкаКартинкиХарактеристик = РезультатЗапросаКартинкиХарактеристик.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ВыборкаКартинкиХарактеристик.Следующий();
		КонецЕсли;
		
	КонецЕсли;
	
	Параметры.Вставить("ВыборкаФайлов", ВыборкаФайловНоменклатуры);
	Параметры.Вставить("ВыборкаКартинкиХарактеристик", ВыборкаКартинкиХарактеристик);
	
	Параметры.Вставить("КатегорииНоменклатуры", ЗапросыРезультатыПоИдентификаторам[ "36: КатегорииНоменклатуры: СоответствияОбъектовИнтернетМагазина" ].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	
	Параметры.Вставить("ВыборкаЕдиницИзмеренияДляКлассификатора", 
	ЗапросыРезультатыПоИдентификаторам[ "42: ЕдиницыИзмерения" ].Выбрать());
	
	Параметры.Вставить("ДопРеквизитыНоменклатуры", 
	ЗапросыРезультатыПоИдентификаторам[ "38: ДопРеквизитыНоменклатурыДляВыгрузки" ].Выбрать());
	
	Если Параметры.ИспользоватьНаборы Тогда
		
		ТаблицаОстаткиНаборов = ЗапросыРезультатыПоИдентификаторам[ "47: Наборы: Товары и Остатки" ].Выгрузить();
		ТаблицаОстаткиНаборов.Индексы.Добавить("Номенклатура, Характеристика");
		Параметры.Вставить("ТаблицаОстаткиНаборов", ТаблицаОстаткиНаборов);
		
		ТаблицаЦеныНаборов = ЗапросыРезультатыПоИдентификаторам[ "48: Наборы: Товары и Цены" ].Выгрузить();
		ТаблицаЦеныНаборов.Индексы.Добавить("Номенклатура, Характеристика, ВидЦен");
		Параметры.Вставить("ТаблицаЦеныНаборов", ТаблицаЦеныНаборов);
		
	КонецЕсли; 
	
	Если Параметры.ОбменЗаписьНаУслуги И Параметры.РежимВыгрузкиУслуг Тогда
		Параметры.Вставить("ТаблицаГрафикЗанятостиРесурсов", ЗапросыРезультатыПоИдентификаторам[ "56: ЗаписьНаУслуги: Ресурсы" ]);
		Параметры.Вставить("ТаблицаРесурсыУслуги", ЗапросыРезультатыПоИдентификаторам[ "57: ЗаписьНаУслуги: Ресурсы и Услуги" ]);
	КонецЕсли;
	
	Параметры.Вставить("СоответствияОбъектовИнтернетМагазина", Новый Соответствие);
	
КонецПроцедуры
//--->>> Tnext Козык К.А. 15.08.2026 - адаптация под УНФ 3.0.14.115
 
#Область ЗапускОбмена

Процедура спДополнитьДанныеДляВыгрузки(Запрос, Параметры)
	
	СтрокаПоиска = "ВЫБРАТЬ
	|	""27"" КАК НомерЗапроса,
	|	ТаблицаСвойстваНоменклатуры.Свойство КАК Свойство,
	|	ТаблицаСвойстваНоменклатуры.Свойство.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
	|	ТаблицаСвойстваНоменклатуры.Свойство.Заголовок КАК Наименование,
	|	ТаблицаСвойстваНоменклатуры.Свойство.НаборСвойств КАК НаборСвойств,
	|	ТаблицаСвойстваНоменклатуры.Свойство.ТипЗначения КАК ТипЗначения,
	|	ТаблицаСвойстваНоменклатуры.Значение КАК Значение
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВременнаяТаблицаСвойстваНоменклатуры.Свойство КАК Свойство,
	|		ВременнаяТаблицаСвойстваНоменклатуры.Значение КАК Значение
	|	ИЗ
	|		ВременнаяТаблицаСвойстваНоменклатуры КАК ВременнаяТаблицаСвойстваНоменклатуры) КАК ТаблицаСвойстваНоменклатуры
	|ИТОГИ
	|	МАКСИМУМ(ИдентификаторДляФормул)
	|ПО
	|	Свойство";
	
	СтрокаЗамены = "ВЫБРАТЬ
	|	""27"" КАК НомерЗапроса,
	|	ТаблицаСвойстваНоменклатуры.Свойство КАК Свойство,
	|	ТаблицаСвойстваНоменклатуры.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
	|	ТаблицаСвойстваНоменклатуры.Наименование КАК Наименование,
	|	ТаблицаСвойстваНоменклатуры.НаборСвойств КАК НаборСвойств,
	|	ТаблицаСвойстваНоменклатуры.Свойство.ТипЗначения  КАК ТипЗначения,
	|	ТаблицаСвойстваНоменклатуры.Значение КАК Значение
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ВременнаяТаблицаСвойстваНоменклатуры.Свойство КАК Свойство,
	|		ВременнаяТаблицаСвойстваНоменклатуры.Свойство.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
	|		ВременнаяТаблицаСвойстваНоменклатуры.Свойство.Заголовок КАК Наименование,
	|		ВременнаяТаблицаСвойстваНоменклатуры.Свойство.НаборСвойств КАК НаборСвойств,
	|		ТИПЗНАЧЕНИЯ(ВременнаяТаблицаСвойстваНоменклатуры.Значение) КАК ТипЗначения,
	|		ВременнаяТаблицаСвойстваНоменклатуры.Значение КАК Значение
	|	ИЗ
	|		ВременнаяТаблицаСвойстваНоменклатуры КАК ВременнаяТаблицаСвойстваНоменклатуры
	|	ГДЕ 
	|		НЕ ВременнаяТаблицаСвойстваНоменклатуры.ИдентификаторДляФормул = ""СтранаПроисхождения""
	|
	|   ОБЪЕДИНИТЬ
	|
	|   ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		&спСвойство,
	|		ВременнаяТаблицаСвойстваНоменклатуры.ИдентификаторДляФормул,
	|		ВременнаяТаблицаСвойстваНоменклатуры.ИдентификаторДляФормул,
	|		""Общие"",
	|		ТИПЗНАЧЕНИЯ(ВременнаяТаблицаСвойстваНоменклатуры.Номенклатура.СтранаПроисхождения),
	|		ВременнаяТаблицаСвойстваНоменклатуры.Номенклатура.СтранаПроисхождения
	|	ИЗ
	|		ВременнаяТаблицаСвойстваНоменклатуры КАК ВременнаяТаблицаСвойстваНоменклатуры
	|	ГДЕ 
	|		ВременнаяТаблицаСвойстваНоменклатуры.ИдентификаторДляФормул = ""СтранаПроисхождения"") КАК ТаблицаСвойстваНоменклатуры
	|ИТОГИ
	|	МАКСИМУМ(ИдентификаторДляФормул),
	|	МАКСИМУМ(Наименование),
	|	МАКСИМУМ(НомерЗапроса),
	|	МАКСИМУМ(НаборСвойств),
	|	МАКСИМУМ(Наименование),
	|	МАКСИМУМ(Значение)
	|ПО
	|	Свойство";
	
	Если СтрНайти(Запрос.Текст, СтрокаПоиска) = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, СтрокаПоиска, СтрокаЗамены); 
	
	СтрокаПоиска = "ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""26"",
	|	ДополнительныеСведения.Номенклатура,
	|	ДополнительныеСведения.ИдентификаторДляФормул,
	|	ДополнительныеСведения.Свойство,
	|	ЗначенияДополнительныхСведений.Значение,
	|	0
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВременнаяТаблицаНоменклатура.Номенклатура КАК Номенклатура,
	|		НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство.ИдентификаторДляФормул КАК ИдентификаторДляФормул,
	|		НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Свойство КАК Свойство
	|	ИЗ
	|		ВременнаяТаблицаНоменклатура КАК ВременнаяТаблицаНоменклатура
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыДополнительныхРеквизитовИСведений.ДополнительныеСведения КАК НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения
	|			ПО (НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка В ИЕРАРХИИ (&НаборСвойств_Справочник_Номенклатура)
	|						И НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = ВременнаяТаблицаНоменклатура.НаборСвойств
	|					ИЛИ НаборыДополнительныхРеквизитовИСведенийДополнительныеСведения.Ссылка = &НаборСвойств_Справочник_Номенклатура_Общие)) КАК ДополнительныеСведения
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ЗначенияДополнительныхСведений
	|		ПО ДополнительныеСведения.Номенклатура = ЗначенияДополнительныхСведений.Объект
	|			И ДополнительныеСведения.Свойство = ЗначенияДополнительныхСведений.Свойство";
	
	СтрокаЗамены = "
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	""26"",
	|	ВременнаяТаблицаНоменклатура.Номенклатура,
	|	""СтранаПроисхождения"",
	|	&спСвойство,
	|	ВременнаяТаблицаНоменклатура.Номенклатура.СтранаПроисхождения,
	|	0
	|ИЗ
	|	ВременнаяТаблицаНоменклатура КАК ВременнаяТаблицаНоменклатура
	|";
	
	Если СтрНайти(Запрос.Текст, СтрокаПоиска) = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Параметры.НастройкиВыгрузкиДопРеквизитовНоменклатуры = СтрЗаменить(
	Параметры.НастройкиВыгрузкиДопРеквизитовНоменклатуры, "}", """СтранаПроисхождения"": ""Страна происхождения"" }");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, СтрокаПоиска, СтрокаПоиска + СтрокаЗамены); 
	спСвойство = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьСсылку(Новый УникальныйИдентификатор("cfc8d218-471f-449b-8a45-dbea513067b3"));
	Запрос.УстановитьПараметр("спСвойство", спСвойство);

КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьСвойстваНоменклатурыВКлассификаторXDTO")
Процедура спДобавитьСвойстваНоменклатурыВКлассификаторXDTO(КлассификаторXDTO, ПакетCML, ВыборкаСвойствНоменклатуры, Параметры)

	Если ВыборкаСвойствНоменклатуры.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;

	СвойстваТип = КлассификаторXDTO.Свойства().Получить("Свойства").Тип;
	СвойстваXDTO = ФабрикаXDTO.Создать(СвойстваТип);

	// Выгрузка выбранных в узле обмена доп. реквизитов номенклатуры
	ЕстьРеквизитыДляЗаполнения = Ложь;
	СоответствиеПолейДопРеквизитов = Неопределено;
	Если Параметры.Свойство("НастройкиВыгрузкиДопРеквизитовНоменклатурыИспользовать")
		И Параметры.НастройкиВыгрузкиДопРеквизитовНоменклатурыИспользовать Тогда

		СоответствиеПолейДопРеквизитов = Новый Соответствие;

		Если Параметры.Свойство("НастройкиВыгрузкиДопРеквизитовНоменклатуры")
			И НЕ ПустаяСтрока(Параметры.НастройкиВыгрузкиДопРеквизитовНоменклатуры) Тогда
			СоответствиеПолейДопРеквизитов = ЧтениеJSONВСтруктуру(Параметры.НастройкиВыгрузкиДопРеквизитовНоменклатуры, Истина);
		КонецЕсли; 
	КонецЕсли; 

	Пока ВыборкаСвойствНоменклатуры.Следующий() Цикл

		Попытка
			КлючРеквизита = ВыборкаСвойствНоменклатуры.ИдентификаторДляФормул;
		Исключение
			КлючРеквизита = Неопределено;
		КонецПопытки;

		Если СоответствиеПолейДопРеквизитов = Неопределено Или КлючРеквизита = Неопределено Тогда
			Если ЗначениеЗаполнено(ВыборкаСвойствНоменклатуры.Наименование) Тогда
				ИмяВыгрузкиРеквизита = ФорматНаименованияДляXDTO(ВыборкаСвойствНоменклатуры.Наименование);
			Иначе
				ИмяВыгрузкиРеквизита = ФорматНаименованияДляXDTO(ВыборкаСвойствНоменклатуры.Свойство);
			КонецЕсли;
		Иначе

			ИмяВыгрузкиРеквизита = СоответствиеПолейДопРеквизитов.Получить(КлючРеквизита);
			Если ИмяВыгрузкиРеквизита = Неопределено Тогда
				Продолжить;
			КонецЕсли;

		КонецЕсли;

		ЕстьРеквизитыДляЗаполнения = Истина;

		СвойствоXDTO = ФабрикаXDTO.Создать(ПакетCML.Получить("Свойство"));
		//@skip-check query-in-loop
		ЗаполнитьИДСайтаДляОбъектаXDTO(СвойствоXDTO, ВыборкаСвойствНоменклатуры.Свойство,, Параметры);

		СвойствоXDTO.Наименование = ИмяВыгрузкиРеквизита;

		НаборСвойств_Справочник_ХарактеристикиНоменклатуры = УправлениеСвойствами.НаборСвойствПоИмени(
		"Справочник_ХарактеристикиНоменклатуры");

		НаборСвойств = ВыборкаСвойствНоменклатуры.Свойство.НаборСвойств.Родитель;

		Если НаборСвойств = НаборСвойств_Справочник_ХарактеристикиНоменклатуры Тогда
			СвойствоXDTO.ДляПредложений = Истина;
		ИначеЕсли НаборСвойств = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура")
			ИЛИ НаборСвойств = УправлениеСвойствами.НаборСвойствПоИмени("Справочник_Номенклатура_Общие") Тогда
			СвойствоXDTO.ДляТоваров = Истина;
		КонецЕсли;

		#Удаление
		Типы = ВыборкаСвойствНоменклатуры.ТипЗначения.Типы();
		#КонецУдаления
		#Вставка
		Если Не ЗначениеЗаполнено(ВыборкаСвойствНоменклатуры.ТипЗначения) Тогда
			Типы = Новый Массив;
			Типы.Добавить(Тип("СправочникСсылка.СтраныМира"));
		Иначе
			Типы = ВыборкаСвойствНоменклатуры.ТипЗначения.Типы();
		КонецЕсли;
		#КонецВставки
		
		ТипXML = "Строка";

		Если Типы.Количество() <> 1 Тогда

			// По стандарту CML 2.08 можно выгрузить только один тип значений.
			// Выгружаем тип "Строка", как универсальный тип.

			СвойствоXDTO.ТипЗначений = ТипXML;

		Иначе

			Тип = Типы[0];
			ТипXML = ПолучитьТипXML(Тип);

			СвойствоXDTO.ТипЗначений = ТипXML;

			Если ТипXML = "Справочник" Тогда

				ОбработатьСвойствоXDTOДляТипаСправочник(СвойствоXDTO, ПакетCML, ВыборкаСвойствНоменклатуры, Параметры, Тип);

			КонецЕсли;

		КонецЕсли;

		СвойстваXDTO.Свойство.Добавить(СвойствоXDTO);

	КонецЦикла;

	Если НЕ ЕстьРеквизитыДляЗаполнения Тогда
		Возврат;
	КонецЕсли;

	КлассификаторXDTO.Свойства = СвойстваXDTO;

КонецПроцедуры

&ИзменениеИКонтроль("ИдентифицироватьНоменклатуру")
Функция спИдентифицироватьНоменклатуру(ДокументОбъект, ДокументXDTO, СвойстваЗаказа, Параметры, ОписаниеОшибки)

	Успешно = Истина;

	Если НЕ ОбъектXDTOСодержитСвойство(ДокументXDTO, "Товары")
		ИЛИ ДокументXDTO.Товары = Неопределено
		ИЛИ НЕ ОбъектXDTOСодержитСвойство(ДокументXDTO.Товары, "Товар") Тогда

		Возврат Успешно;

	КонецЕсли;

	ДокументОбъект.ВидСкидкиНаценки = Неопределено;

	СтавкаНДСПоУмолчанию = Неопределено;

	Если ОбъектXDTOСодержитСвойство(ДокументXDTO, "Налоги")
		И ДокументXDTO.Налоги <> Неопределено
		И ОбъектXDTOСодержитСвойство(ДокументXDTO.Налоги, "Налог") Тогда

		НалогиXDTO = ДокументXDTO.Налоги.Налог;
		МассивНалоговXDTO = ПолучитьМассивОбъектовСпискаXDTO(НалогиXDTO);

		Для Каждого НалогXDTO Из МассивНалоговXDTO Цикл

			Если ОбъектXDTOСодержитСвойство(НалогXDTO, "Наименование") И НРег(НалогXDTO.Наименование) = "ндс" Тогда

				Если ОбъектXDTOСодержитСвойство(НалогXDTO, "Ставка") Тогда
					СтавкаНДСПоУмолчанию = ИнтеграцияСИнтернетМагазиномПовтИсп.ПолучитьПоЗначениюДляВыгрузкиСтавкуНДС(НалогXDTO.Ставка);
				Иначе
					СтавкаНДСПоУмолчанию = ИнтеграцияСИнтернетМагазиномПовтИсп.ПолучитьПоЗначениюДляВыгрузкиСтавкуНДС("20");
				КонецЕсли;

				Если ОбъектXDTOСодержитСвойство(НалогXDTO, "УчтеноВСумме") Тогда
					ДокументОбъект.СуммаВключаетНДС = НалогXDTO.УчтеноВСумме = Истина ИЛИ НРег(НалогXDTO.УчтеноВСумме) = "true";
				КонецЕсли;

				Прервать;

			КонецЕсли;

		КонецЦикла;

	Иначе
		
		#Удаление
		// Если нет секции "Налоги" считаем, что документ не облагается НДС.
		ДокументОбъект.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
		//@skip-check bsl-legacy-check-expression-type
		ДокументОбъект.СтавкаНДСДоставки = Перечисления.ТипыНалогообложенияНДС.НеОблагаетсяНДС;
		#КонецУдаления
		#Вставка
		//++ Tnext ivai 22.09.2025 Задача №3388
	    //Убрал сброс реквизита НалогообложениеНДС.
		//-- Tnext ivai
		#КонецВставки

	КонецЕсли;

	ДокументОбъект.Запасы.Очистить();
	ДокументОбъект.ДобавленныеНаборы.Очистить();
	ПерваяДоставка = Истина;	

	ТоварыXDTO = ДокументXDTO.Товары.Товар;
	МассивТоваровXDTO = ПолучитьМассивОбъектовСпискаXDTO(ТоварыXDTO);

	РезервироватьТовары = Ложь;
	Если ПолучитьФункциональнуюОпцию("РезервированиеЗапасов") Тогда

		Если Параметры.ОбменЧерезВебСервис Тогда
			РезервироватьТовары = Истина;
		Иначе
			Если Параметры.Свойство("ТаблицаСоответствияСтатусовЗаказов") Тогда

				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("СостояниеЗаказаПокупателя", ДокументОбъект.СостояниеЗаказа);

				НайденныеСтроки = Параметры.ТаблицаСоответствияСтатусовЗаказов.НайтиСтроки(СтруктураОтбора);
				Для Каждого СтрокаСоответствия Из НайденныеСтроки Цикл
					Если СтрокаСоответствия.РезервироватьТовар Тогда
						РезервироватьТовары = Истина;
						Если ЗначениеЗаполнено(СтрокаСоответствия.СкладРезерв) Тогда
							ДокументОбъект.СтруктурнаяЕдиницаРезерв = СтрокаСоответствия.СкладРезерв;
						КонецЕсли;
						Если СтрокаСоответствия.ИДСтатусаЗаказаНаСайте = СвойстваЗаказа["Статуса заказа ИД"]
							ИЛИ СтрокаСоответствия.СтатусЗаказаНаСайте = СвойстваЗаказа["Статус заказа"] Тогда
							Прервать;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	#Вставка
	//++ Tnext ivai 25.09.2025 Задача №3388
	ДатаДок = ?(ЗначениеЗаполнено(ДокументОбъект.Дата), ДокументОбъект.Дата, ТекущаяДатаСеанса());
	
	НастройкиЗаполненияНДС = НалогиУНФ.НастройкиНДСОрганизации(ДокументОбъект.Организация, , ДатаДок);
	
	Если ДокументОбъект.НалогообложениеНДС <> НастройкиЗаполненияНДС.ТипНалогообложения Тогда
		ДокументОбъект.НалогообложениеНДС = НастройкиЗаполненияНДС.ТипНалогообложения;
	КонецЕсли;
	
	ПараметрыНДС = Новый Структура;
	ПараметрыНДС.Вставить("Организация", ДокументОбъект.Организация);
	ПараметрыНДС.Вставить("ДатаОбработки", ДатаДок);
	ПараметрыНДС.Вставить("НалогообложениеНДС", ДокументОбъект.НалогообложениеНДС);
	ПараметрыНДС.Вставить("ЕстьПартииСНДС", Ложь);
	ПараметрыНДС.Вставить("Номенклатура", Неопределено);
	ПараметрыНДС.Вставить("НоменклатураВидСтавкиНДС", Неопределено);
	ПараметрыНДС.Вставить("Партия", Неопределено);
	ПараметрыНДС.Вставить("ВидСтавкиНДСПоУмолчанию", НастройкиЗаполненияНДС.ВидСтавкиНДС);
	//-- Tnext ivai
	#КонецВставки
	Для Каждого ТоварXDTO Из МассивТоваровXDTO Цикл

		ТипНоменклатурыXDTO = "";

		Если ОбъектXDTOСодержитСвойство(ТоварXDTO, "ЗначенияРеквизитов")
			И ТоварXDTO.ЗначенияРеквизитов <> Неопределено
			И ОбъектXDTOСодержитСвойство(ТоварXDTO.ЗначенияРеквизитов, "ЗначениеРеквизита") Тогда

			ЗначенияРеквизитовXDTO = ТоварXDTO.ЗначенияРеквизитов.ЗначениеРеквизита;
			МассивЗначенийРеквизитовXDTO = ПолучитьМассивОбъектовСпискаXDTO(ЗначенияРеквизитовXDTO);

			Для Каждого ЗначениеРеквизитаXDTO Из МассивЗначенийРеквизитовXDTO Цикл

				Если ЗначениеРеквизитаXDTO.Наименование = "ТипНоменклатуры" 
					И ТипЗнч(ЗначениеРеквизитаXDTO.Значение) = Тип("Строка") Тогда

					ТипНоменклатурыXDTO = ЗначениеРеквизитаXDTO.Значение;
					Прервать;

				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

		СтавкаНДСНоменклатуры = Неопределено;
		Если ОбъектXDTOСодержитСвойство(ТоварXDTO, "СтавкиНалогов")
			И ТоварXDTO.СтавкиНалогов <> Неопределено Тогда

			СтавкиНалогов = Неопределено;
			Если ОбъектXDTOСодержитСвойство(ТоварXDTO.СтавкиНалогов, "СтавкаНалога") Тогда
				СтавкиНалогов = ТоварXDTO.СтавкиНалогов.СтавкаНалога;
			ИначеЕсли ОбъектXDTOСодержитСвойство(ТоварXDTO.СтавкиНалогов, "Ставка") Тогда
				СтавкиНалогов = ТоварXDTO.СтавкиНалогов.Ставка;
			КонецЕсли;

			Если СтавкиНалогов <> Неопределено Тогда
				МассивСтавокXDTO = ПолучитьМассивОбъектовСпискаXDTO(СтавкиНалогов);

				Для Каждого СтавкаНалога Из МассивСтавокXDTO Цикл

					Если НРег(СтавкаНалога.Наименование) = "ндс" Тогда

						СтавкаНДСНоменклатуры = ИнтеграцияСИнтернетМагазиномПовтИсп.ПолучитьПоЗначениюДляВыгрузкиСтавкуНДС(СтавкаНалога.Ставка);
						Прервать;

					КонецЕсли;

				КонецЦикла;
			КонецЕсли;


		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(СтавкаНДСНоменклатуры) И ОбъектXDTOСодержитСвойство(ТоварXDTO, "Налоги")
			И ТоварXDTO.Налоги <> Неопределено
			И ОбъектXDTOСодержитСвойство(ТоварXDTO.Налоги, "Налог") Тогда

			НалогиXDTO = ТоварXDTO.Налоги.Налог;
			МассивНалоговXDTO = ПолучитьМассивОбъектовСпискаXDTO(НалогиXDTO);

			Для Каждого НалогXDTO Из МассивНалоговXDTO Цикл

				Если ОбъектXDTOСодержитСвойство(НалогXDTO, "Наименование") И НРег(НалогXDTO.Наименование) = "ндс" Тогда

					Если ОбъектXDTOСодержитСвойство(НалогXDTO, "Ставка") Тогда

						СтавкаНДСНоменклатуры = ИнтеграцияСИнтернетМагазиномПовтИсп.ПолучитьПоЗначениюДляВыгрузкиСтавкуНДС(НалогXDTO.Ставка);
						Прервать;

					КонецЕсли;

				КонецЕсли;

			КонецЦикла;

		КонецЕсли;

		СтавкаНДСНоменклатуры = ?(ЗначениеЗаполнено(СтавкаНДСНоменклатуры), СтавкаНДСНоменклатуры, СтавкаНДСПоУмолчанию);
		Если СтавкаНДСНоменклатуры = Неопределено Тогда

			ЗначениеНалога = "Без НДС";
			СтавкаНДСНоменклатуры = ИнтеграцияСИнтернетМагазиномПовтИсп.ПолучитьПоЗначениюДляВыгрузкиСтавкуНДС(ЗначениеНалога);

		КонецЕсли;

		ЭтоУслуга = НРег(ТипНоменклатурыXDTO) = "услуга";

		//@skip-check query-in-loop
		Номенклатура = НайтиСоздатьНоменклатуру(ТоварXDTO, ЭтоУслуга, Параметры, СтавкаНДСНоменклатуры, ОписаниеОшибки);

		//@skip-check query-in-loop
		ХарактеристикаНоменклатуры = НайтиСоздатьХарактеристикуНоменклатуры(
		ТоварXDTO, 
		ЭтоУслуга, 
		Номенклатура, 
		Параметры, 
		ОписаниеОшибки
		);

		Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
			Продолжить;
		КонецЕсли;

		Если НЕ ОбъектXDTOСодержитСвойство(ТоварXDTO, "Количество") Тогда 
			Продолжить;
		КонецЕсли;

		Количество = ПолучитьЧислоИзСтроки(ТоварXDTO.Количество);
		Если Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		#Вставка
		//++ Tnext ivai 25.09.2025 Задача №3388
		Если спУстанавливатьСтавкуНДСНоменклатураПоДанным1С() Тогда
			ПараметрыНДС.Номенклатура = Номенклатура;
			ПараметрыНДС.НоменклатураВидСтавкиНДС = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ВидСтавкиНДС");
			ДанныеНДС = НоменклатураВДокументахСервер.ДанныеНДССтрокиНоменклатуры(ПараметрыНДС);
			СтавкаНДСНоменклатуры = ДанныеНДС.СтавкаНДС;
		КонецЕсли;
		//-- Tnext ivai
		#КонецВставки

		Резерв = 0;
		Если РезервироватьТовары Тогда
			Если Параметры.ОбменЧерезВебСервис Тогда
				Если ОбъектXDTOСодержитСвойство(ТоварXDTO, "Резерв") Тогда
					Резерв = ПолучитьЧислоИзСтроки(ТоварXDTO.Резерв);
				КонецЕсли;

				Если Резерв > Количество Тогда
					Резерв = Количество;
				КонецЕсли;
			Иначе
				Резерв = Количество;
			КонецЕсли;

		КонецЕсли;

		ЦенаЗаЕдиницу = 0;
		Сумма = 0;
		СуммаСкидок = 0;

		Если ОбъектXDTOСодержитСвойство(ТоварXDTO, "ЦенаЗаЕдиницу") Тогда
			ЦенаЗаЕдиницу = ПолучитьЧислоИзСтроки(ТоварXDTO.ЦенаЗаЕдиницу);
		КонецЕсли;

		Если ОбъектXDTOСодержитСвойство(ТоварXDTO, "Сумма") Тогда
			Сумма = ПолучитьЧислоИзСтроки(ТоварXDTO.Сумма);
		КонецЕсли;

		Если НЕ УстанавливатьСкидкиИзДоговора(Параметры) Тогда
			Если ОбъектXDTOСодержитСвойство(ТоварXDTO, "Скидки")
				И ТоварXDTO.Скидки <> Неопределено
				И ОбъектXDTOСодержитСвойство(ТоварXDTO.Скидки, "Скидка") Тогда

				МассивСкидокXDTO = ПолучитьМассивОбъектовСпискаXDTO(ТоварXDTO.Скидки.Скидка);
				Для Каждого СкидкаXDTO Из МассивСкидокXDTO Цикл

					//@skip-check bsl-legacy-check-expression-type
					Если НЕ ОбъектXDTOСодержитСвойство(СкидкаXDTO, "УчтеноВСумме") 
						ИЛИ НРег(СкидкаXDTO.УчтеноВСумме = "true") Тогда

						Продолжить;

					КонецЕсли;

					СуммаСкидки = ПолучитьЧислоИзСтроки(СкидкаXDTO.Сумма);
					СуммаСкидок = СуммаСкидок + СуммаСкидки;

				КонецЦикла;
			КонецЕсли;
		КонецЕсли;

		// Спецификация
		Спецификация = Справочники.Спецификации.СпецификацияПоУмолчанию(Номенклатура, ХарактеристикаНоменклатуры);
		// Некоторые сайты некорректно возвращают признак услуги, нужно перепроверить по данным 1С
		ЭтоУслуга = НЕ (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ТипНоменклатуры") = Перечисления.ТипыНоменклатуры.Запас);

		// Если заполнена таблица соответствия служб доставки - загружаем доставку на отдельную закладку. Если не заполнена -
		// в ТЧ Запасы
		Если ОбъектXDTOСодержитСвойство(ТоварXDTO, "Ид")
			И ТоварXDTO.Ид = "ORDER_DELIVERY" 
			И Параметры.ТаблицаСоответствияСлужбДоставки.Количество()>0 
			И ПерваяДоставка = Истина 
			Тогда

			ДокументОбъект.НоменклатураДоставки = Номенклатура;
			ДокументОбъект.СтоимостьДоставки = ЦенаЗаЕдиницу;

			ДокументОбъект.СтавкаНДСДоставки = СтавкаНДСНоменклатуры;
			СтавкаНДС = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеСтавкиНДС(ДокументОбъект.СтавкаНДСДоставки);
			Если ДокументОбъект.СуммаВключаетНДС Тогда
				ДокументОбъект.СуммаНДСДоставки = ДокументОбъект.СтоимостьДоставки - (ДокументОбъект.СтоимостьДоставки) / ((СтавкаНДС + 100) / 100);
			Иначе
				ДокументОбъект.СуммаНДСДоставки = ДокументОбъект.СтоимостьДоставки * СтавкаНДС / 100;
			КонецЕсли;

			ПерваяДоставка = Ложь;

		Иначе

			// Добавляем новую строку в табличную часть "Запасы".
			НоваяСтрока = ДокументОбъект.Запасы.Добавить();
			НоваяСтрока.ТипНоменклатурыЗапас = НЕ ЭтоУслуга;
			НоваяСтрока.Номенклатура = Номенклатура;
			Если ОбъектXDTOСодержитСвойство(ТоварXDTO, "Ид") И ТоварXDTO.Ид = "ORDER_DELIVERY" Тогда
				ДокументОбъект.НоменклатураДоставки = Номенклатура;
			КонецЕсли;
			НоваяСтрока.ЕдиницаИзмерения = Номенклатура.ЕдиницаИзмерения;
			НоваяСтрока.Характеристика = ХарактеристикаНоменклатуры;
			НоваяСтрока.Спецификация = Спецификация;
			НоваяСтрока.Количество = Количество;
			Если НЕ ЭтоУслуга Тогда
				НоваяСтрока.Резерв = Резерв;
			КонецЕсли;
			НоваяСтрока.СтавкаНДС = СтавкаНДСНоменклатуры;

			НоваяСтрока.Сумма = ?(СуммаСкидок > 0, Сумма - СуммаСкидок, Сумма);
			НоваяСтрока.Цена = ?(ЦенаЗаЕдиницу > 0, ЦенаЗаЕдиницу, НоваяСтрока.Сумма / НоваяСтрока.Количество);

			Если Номенклатура.ЭтоНабор Тогда
				СтруктураДанные = Новый Структура;
				СтруктураДанные.Вставить("Организация", Константы.УчетПоКомпании.Компания(ДокументОбъект.Организация));
				СтруктураДанные.Вставить("Номенклатура", 	НоваяСтрока.Номенклатура);
				СтруктураДанные.Вставить("Характеристика", 	НоваяСтрока.Характеристика);
				СтруктураДанные.Вставить("НалогообложениеНДС", ДокументОбъект.НалогообложениеНДС);
				СтруктураДанные.Вставить("Цена", НоваяСтрока.Цена);
				СтруктураДанные.Вставить("ДатаОбработки", 		ДокументОбъект.Дата);
				СтруктураДанные.Вставить("ВалютаДокумента", 	ДокументОбъект.ВалютаДокумента);
				СтруктураДанные.Вставить("СуммаВключаетНДС",	ДокументОбъект.СуммаВключаетНДС);
				СтруктураДанные.Вставить("СтавкаНДС", 	НоваяСтрока.СтавкаНДС);
				СтруктураДанные.Вставить("ВидЦен", ДокументОбъект.ВидЦен);
				СтруктураДанные.Вставить("ЕдиницаИзмерения", НоваяСтрока.ЕдиницаИзмерения);

				НаборыСервер.ДобавитьИнформациюОНабореПриПолученииДанныхНоменклатуры(СтруктураДанные);
				ЗаменитьСтрокуЗапасовДаннымиНабора(ДокументОбъект, НоваяСтрока, СтруктураДанные);

			Иначе
				ПересчитатьСтрокуТабличнойЧасти(НоваяСтрока, ДокументОбъект);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Если НЕ УстанавливатьСкидкиИзДоговора(Параметры) Тогда

		// Скидка на документ распределяется на строки табличной части пропорционально сумме.
		Если ОбъектXDTOСодержитСвойство(ДокументXDTO, "Скидки")
			И ДокументXDTO.Скидки <> Неопределено
			И ОбъектXDTOСодержитСвойство(ДокументXDTO.Скидки, "Скидка") Тогда

			МассивСкидокXDTO = ПолучитьМассивОбъектовСпискаXDTO(ДокументXDTO.Скидки.Скидка);
			Для Каждого СкидкаXDTO Из МассивСкидокXDTO Цикл

				Если ОбъектXDTOСодержитСвойство(СкидкаXDTO, "Сумма") Тогда

					Если ОбъектXDTOСодержитСвойство(СкидкаXDTO, "Наименование")
						И ОбъектXDTOСодержитСвойство(СкидкаXDTO, "Процент") Тогда

						ПроцентЧисло = ПолучитьЧислоИзСтроки(СкидкаXDTO.Процент);
						Если ПроцентЧисло <> 0 Тогда

							ДокументОбъект.ВидСкидкиНаценки = ИнтеграцияСИнтернетМагазиномПовтИсп.ПолучитьВидСкидкиНаДокумент(СкидкаXDTO.Наименование, СкидкаXDTO.Процент);

						КонецЕсли;

					КонецЕсли;

					Если ОбъектXDTOСодержитСвойство(СкидкаXDTO, "УчтеноВСумме")
						И НЕ НРег(СкидкаXDTO.УчтеноВСумме) = "true" Тогда

						СуммаСкидки = ПолучитьЧислоИзСтроки(СкидкаXDTO.Сумма);
						Если СуммаСкидки <> 0 Тогда

							РаспределитьСуммуПоКолонке(ДокументОбъект, ДокументОбъект.Запасы, -СуммаСкидки);

						КонецЕсли;

					КонецЕсли;

				КонецЕсли;

			КонецЦикла;

		КонецЕсли;
	КонецЕсли;

	ДокументОбъект.СуммаДокумента = ДокументОбъект.Запасы.Итог("Всего");

	Возврат Успешно;

КонецФункции

&ИзменениеИКонтроль("СформироватьЗаказыXDTO")
Функция спСформироватьЗаказыXDTO(Параметры, СтруктураСтатистики)

	ВыборкаДокументов = Параметры.ВыборкаДокументов;
	ДеревоСвойствХарактеристик = Параметры.ДеревоСвойствХарактеристик;
	ВыборкаОтгрузкиОплаты = Параметры.ВыборкаОтгрузкиОплаты;

	URIПространстваИмен = "urn:1C.ru:commerceml_210";
	ПакетCML = ФабрикаXDTO.Пакеты.Получить(URIПространстваИмен);

	КоммерческаяИнформацияТип = ПакетCML.Получить("КоммерческаяИнформация");
	КоммерческаяИнформацияXDTO = ФабрикаXDTO.Создать(КоммерческаяИнформацияТип);

	Если Параметры.ПодчиненныеДокументы Тогда
		КоммерческаяИнформацияXDTO.ВерсияСхемы = "2.10";
	Иначе	
		КоммерческаяИнформацияXDTO.ВерсияСхемы = "2.08";
	КонецЕсли; 

	КоммерческаяИнформацияXDTO.ДатаФормирования = Параметры.ДатаФормирования;

	НомерВПорции = 0;
	Пока НомерВПорции < Параметры.РазмерПорции ИЛИ Параметры.РазмерПорции = 0 Цикл

		Параметры.ВыполнятьОбменЗаказы = Параметры.ВыборкаДокументов.Следующий();
		Если НЕ Параметры.ВыполнятьОбменЗаказы Тогда
			Прервать;
		КонецЕсли;

		Если НЕ ЗначениеЗаполнено(ВыборкаДокументов.НомерЗаказаНаСайте)
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДокументов.ДатаЗаказаНаСайте)
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДокументов.Валюта)
			ИЛИ НЕ ЗначениеЗаполнено(ВыборкаДокументов.Контрагент) Тогда

			Параметры.НомерВВыборке = Параметры.НомерВВыборке - 1;
			Продолжить;
		КонецЕсли;

		СтруктураСтатистики.Выгружено.Добавить(ВыборкаДокументов.ЗаказПокупателя);

		ДокументТип = ПакетCML.Получить("Документ");
		ДокументXDTO = ФабрикаXDTO.Создать(ДокументТип);

		ДокументXDTO.Ид = Строка(ВыборкаДокументов.ЗаказПокупателя.УникальныйИдентификатор());
		#Вставка
		//++ Tnext ivai 22.09.2025 Задача №3366. Проблема синхронизации заказов на сайте и в 1С.
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ВыборкаДокументов, "ИдентификаторЗаказаНаСайте") Тогда
			ДокументXDTO.Ид = ВыборкаДокументов.ИдентификаторЗаказаНаСайте;
		КонецЕсли;
		//-- Tnext ivai
		#КонецВставки
		ДокументXDTO.Номер = ВыборкаДокументов.НомерЗаказаНаСайте;
		ДокументXDTO.Дата = ВыборкаДокументов.ДатаЗаказаНаСайте;
		ДокументXDTO.ХозОперация = "Заказ товара";
		ДокументXDTO.Роль = "Продавец";
		ДокументXDTO.Валюта = ФорматВалютыДляXDTO(ВыборкаДокументов.Валюта);
		ДокументXDTO.Курс = ВыборкаДокументов.Курс;
		ДокументXDTO.Сумма = ВыборкаДокументов.СуммаДокумента;
		ДокументXDTO.Время = ВыборкаДокументов.ДатаЗаказаНаСайте;
		ДокументXDTO.СрокПлатежа = ВыборкаДокументов.ДатаПлатежа;

		Комментарий = Лев(ВыборкаДокументов.Комментарий, 3000);
		Если НЕ ПустаяСтрока(Комментарий) Тогда
			ДокументXDTO.Комментарий = Комментарий;
		КонецЕсли;

		КонтрагентыXDTO = ФабрикаXDTO.Создать(ПолучитьТипСвойстваОтТипаОбъектаXDTO(ДокументТип, "Контрагенты"));

		КонтрагентXDTO = ПолучитьКонтрагентаXDTO(ВыборкаДокументов, ПакетCML);
		КонтрагентыXDTO.Контрагент.Добавить(КонтрагентXDTO);

		ДокументXDTO.Контрагенты = КонтрагентыXDTO;

		//@skip-check query-in-loop
		ДобавитьТоварыЗаказаXDTO(ДокументXDTO, ПакетCML, ВыборкаДокументов, ДеревоСвойствХарактеристик, Параметры);

		ДобавитьЗначенияРеквизитовЗаказаXDTO(ДокументXDTO, ПакетCML, ВыборкаДокументов, Параметры);

		Если Параметры.ПодчиненныеДокументы = Истина Тогда
			ДобавитьПодчиненныеДокументыЗаказаXDTO(ДокументXDTO, ПакетCML, ВыборкаДокументов, ВыборкаОтгрузкиОплаты, Параметры);	
		КонецЕсли;

		КоммерческаяИнформацияXDTO.Документ.Добавить(ДокументXDTO);

		НомерВПорции = НомерВПорции + 1;
		Параметры.НомерВВыборке = Параметры.НомерВВыборке - 1;

	КонецЦикла;

	Возврат КоммерческаяИнформацияXDTO;

КонецФункции

//++ Tnext ivai 25.09.2025 Задача №3388
Функция спУстанавливатьСтавкуНДСНоменклатураПоДанным1С()
	
	Возврат Истина;
	
КонецФункции //-- Tnext ivai

//++ Tnext ivai 23.09.2025 Задача №4394
Функция спВыполнятьПоискПоСоответствиюИдентификаторов()
	
	Возврат Истина;
	
КонецФункции //-- Tnext ivai

//++ Tnext ivai 23.09.2025 Задача №4394
Функция спИмяОбъектаСправочникКонтрагенты()
	
	Возврат "Контрагенты";
	
КонецФункции //-- Tnext ivai

//++ Tnext ivai 23.09.2025 Задача №4394
Функция спНайтиКонтрагентаПоСоответствиюИдентификаторов(ИдКонтрагента, Параметры, ИнформацияПоКонтрагенту)
	
	НастройкаИнтеграции = Параметры.НастройкаИнтеграции;
	ИдентификаторМагазина = спПолучитьИдИзВнешнегоКодаБитрикс(ИдКонтрагента);
	ИмяОбъекта = спИмяОбъектаСправочникКонтрагенты();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спСоответствиеОбъектовИнтернетМагазиновИ1С.НастройкаИнтеграции КАК НастройкаИнтеграции,
		|	спСоответствиеОбъектовИнтернетМагазиновИ1С.ИмяОбъекта КАК ИмяОбъекта,
		|	спСоответствиеОбъектовИнтернетМагазиновИ1С.ИдентификаторМагазина КАК ИдентификаторМагазина,
		|	Контрагенты.Ссылка КАК Ссылка,
		|	спСоответствиеОбъектовИнтернетМагазиновИ1С.ИдентификаторСсылки КАК ИдентификаторСсылки
		|ИЗ
		|	РегистрСведений.спСоответствиеОбъектовИнтернетМагазиновИ1С КАК спСоответствиеОбъектовИнтернетМагазиновИ1С
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
		|		ПО спСоответствиеОбъектовИнтернетМагазиновИ1С.Ссылка = Контрагенты.Ссылка
		|ГДЕ
		|	спСоответствиеОбъектовИнтернетМагазиновИ1С.НастройкаИнтеграции = &НастройкаИнтеграции
		|	И спСоответствиеОбъектовИнтернетМагазиновИ1С.ИмяОбъекта = &ИмяОбъекта
		|	И спСоответствиеОбъектовИнтернетМагазиновИ1С.ИдентификаторМагазина = &ИдентификаторМагазина
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	0 КАК Приоритет
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|	И КонтрагентыКонтактнаяИнформация.НомерТелефона ПОДОБНО &НомерТелефона
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СвязиКонтрагентКонтактСрезПоследних.Контрагент,
		|	1
		|ИЗ
		|	РегистрСведений.СвязиКонтрагентКонтакт.СрезПоследних(
		|			,
		|			Контакт В
		|				(ВЫБРАТЬ
		|					КонтактныеЛицаКонтактнаяИнформация.Ссылка КАК Контакт
		|				ИЗ
		|					Справочник.КонтактныеЛица.КонтактнаяИнформация КАК КонтактныеЛицаКонтактнаяИнформация
		|				ГДЕ
		|					КонтактныеЛицаКонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Телефон)
		|					И КонтактныеЛицаКонтактнаяИнформация.НомерТелефона ПОДОБНО &НомерТелефона
		|				СГРУППИРОВАТЬ ПО
		|					КонтактныеЛицаКонтактнаяИнформация.Ссылка)) КАК СвязиКонтрагентКонтактСрезПоследних
		|ГДЕ
		|	СвязиКонтрагентКонтактСрезПоследних.СвязьНедействительна = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	Запрос.УстановитьПараметр("ИдентификаторМагазина", ИдентификаторМагазина);
	Запрос.УстановитьПараметр("ИмяОбъекта", ИмяОбъекта);
	Запрос.УстановитьПараметр("НастройкаИнтеграции", НастройкаИнтеграции);
	
	НомерТелефона = "";
	СтрТаб = ИнформацияПоКонтрагенту.Найти("Телефон", "Вид");
	Если Не СтрТаб = Неопределено Тогда
		НомерТелефона = СтрТаб.Представление;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(НомерТелефона) Тогда
		мСтр = СтрРазделить(ИдКонтрагента, "#", Ложь);
		Если мСтр.Количество() > 1 Тогда
			НомерТелефона = СокрЛП(мСтр[1]);
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(НомерТелефона) Тогда
		Если СтрДлина(НомерТелефона) > 10 Тогда
			Запрос.УстановитьПараметр("НомерТелефона", "%" + Прав(НомерТелефона, 10));
		Иначе
			Запрос.УстановитьПараметр("НомерТелефона", "%" + НомерТелефона);
		КонецЕсли;
	Иначе
		Запрос.УстановитьПараметр("НомерТелефона", "------------");
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Перезапись = Ложь;
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		//Запись найдена в регистре соответствий.
		Перезапись = Истина;
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			//Контрагент уже назначен иду.
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Выборка = РезультатЗапроса[1].Выбрать();
	Если Выборка.Следующий() Тогда
		//Нашли контрагента по телефону, создаем или перезаписываем запись в регистре соответствий.
		Запись = РегистрыСведений.спСоответствиеОбъектовИнтернетМагазиновИ1С.СоздатьМенеджерЗаписи();
		Запись.НастройкаИнтеграции = НастройкаИнтеграции;
		Запись.ИмяОбъекта = ИмяОбъекта;
		Запись.ИдентификаторМагазина = ИдентификаторМагазина;
		Запись.Ссылка = Выборка.Ссылка;
		Запись.ИдентификаторСсылки = Строка(Выборка.Ссылка.УникальныйИдентификатор());
		Запись.Записать(Перезапись);
		
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // НайтиКонтрагентаПоСоответствиюИдентификаторов //-- Tnext ivai

//++ Tnext ivai 23.09.2025 Задача №4394
Функция спПолучитьИдИзВнешнегоКодаБитрикс(Знач Идентификатор)
	
	ПозицияРазделителя = СтрНайти(Идентификатор, "#");
	Если ПозицияРазделителя > 1 Тогда
		Возврат Лев(Идентификатор, ПозицияРазделителя - 1);
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции //-- Tnext ivai

//++ Tnext ivai 27.10.2025
Функция спПередаватьДляСамовывозаМетодДоставкиВСвойствахЗаказа()
	
	Возврат Истина
	
КонецФункции //-- Tnext ivai

&ИзменениеИКонтроль("НайтиСоздатьКонтрагента")
Функция спНайтиСоздатьКонтрагента(КонтрагентXDTO, ДокументОбъект, ИнформацияПоКонтрагенту, Параметры, ОписаниеОшибки)

	КонтрагентСсылка = Неопределено;
	Если Параметры.СпособИдентификацииКонтрагентов = Перечисления.СпособыИдентификацииКонтрагентов.ПредопределенноеЗначение Тогда

		КонтрагентСсылка = Параметры.КонтрагентДляПодстановкиВЗаказы;

	Иначе
		
		#Вставка
		//++ Tnext ivai 23.09.2025 Задача №4394
		ИдКонтрагента = Неопределено;
		//-- Tnext ivai
		#КонецВставки
		Если ОбъектXDTOСодержитСвойство(КонтрагентXDTO, "Ид") Тогда
			ДобавитьСтрокуИнформацииПоКонтрагенту("Идентификатор", "Идентификатор", КонтрагентXDTO.Ид, ИнформацияПоКонтрагенту);
			#Вставка
			//++ Tnext ivai 23.09.2025 Задача №4394
			ИдКонтрагента = КонтрагентXDTO.Ид;
			//-- Tnext ivai
			#КонецВставки
		КонецЕсли;

		Если ЗначениеЗаполнено(Параметры.НастройкиПоискаКонтрагентов) Тогда
			НастройкиПоиска = ЧтениеJSONВСтруктуру(Параметры.НастройкиПоискаКонтрагентов);
		Иначе
			НастройкиПоиска = ПоляПоискаКонтрагентовПоУмолчанию();
		КонецЕсли;

		ВариантПоиска = НастройкиПоиска.Получить("ВариантПоиска");
		Если ВариантПоиска = Неопределено Тогда
			// Поиск по порядку следования полей
			ВариантПоиска = 0;
		КонецЕсли;
		НастройкиПоиска.Удалить("ВариантПоиска");
		
		#Вставка
		//++ Tnext ivai 23.09.2025 Задача №4394
		Если ЗначениеЗаполнено(ИдКонтрагента) И спВыполнятьПоискПоСоответствиюИдентификаторов() Тогда
			ПокупательСсылка = спНайтиКонтрагентаПоСоответствиюИдентификаторов(ИдКонтрагента, Параметры, ИнформацияПоКонтрагенту);
		Иначе
		//-- Tnext ivai
		#КонецВставки
		ПокупательСсылка = НайтиКонтрагентаПоПолямПоиска(НастройкиПоиска, ИнформацияПоКонтрагенту, ВариантПоиска);
		#Вставка
		//++ Tnext ivai 23.09.2025 Задача №4394
		КонецЕсли;
		//-- Tnext ivai
		#КонецВставки

		Если ЗначениеЗаполнено(ПокупательСсылка) Тогда

			Если ТипЗнч(ПокупательСсылка)= Тип("СправочникСсылка.Контрагенты") Тогда

				КонтрагентСсылка = ПокупательСсылка;
				КонтрагентОбъект = КонтрагентСсылка.ПолучитьОбъект();

				СоздатьЗаполнитьКонтактноеЛицоКонтрагента(КонтрагентОбъект, КонтрагентXDTO, "", Неопределено, Параметры, ОписаниеОшибки);
				ОбновитьКонтактнуюИнформациюКонтрагента(КонтрагентОбъект, КонтрагентXDTO, Ложь, Параметры, ОписаниеОшибки);
				Если КонтрагентОбъект.Модифицированность() Тогда
					КонтрагентОбъект.Записать();
				КонецЕсли;

			ИначеЕсли ТипЗнч(ПокупательСсылка)= Тип("СправочникСсылка.КонтактныеЛица") Тогда

				КонтрагентСсылка = НайтиКонтрагентаПоКонтактномуЛицу(ПокупательСсылка);
				Если КонтрагентСсылка = Неопределено Тогда

					КонтрагентОбъект = СоздатьКонтрагента(ДокументОбъект, КонтрагентXDTO, Параметры, ОписаниеОшибки);
					ЗаполнитьДанныеСправочниковПодчиненныхКонтрагенту(ДокументОбъект, КонтрагентОбъект, КонтрагентXDTO, ПокупательСсылка, Параметры, ОписаниеОшибки);

					КонтрагентСсылка = КонтрагентОбъект.Ссылка;
					РегистрыСведений.СвязиКонтрагентКонтакт.НоваяСвязь(КонтрагентСсылка, ПокупательСсылка);

				Иначе
					КонтрагентОбъект = КонтрагентСсылка.ПолучитьОбъект();	
				КонецЕсли;

				ОбновитьКонтактнуюИнформациюКонтрагента(КонтрагентОбъект, КонтрагентXDTO, Ложь, Параметры, ОписаниеОшибки);
				ОбновитьКонтактнуюИнформациюКонтактногоЛица(ПокупательСсылка, КонтрагентXDTO, Ложь, Параметры, ОписаниеОшибки);

			КонецЕсли;
		Иначе

			КонтрагентОбъект = СоздатьКонтрагента(ДокументОбъект, КонтрагентXDTO, Параметры, ОписаниеОшибки);
			ЗаполнитьДанныеСправочниковПодчиненныхКонтрагенту(ДокументОбъект, КонтрагентОбъект, КонтрагентXDTO, Неопределено, Параметры, ОписаниеОшибки);

			КонтрагентСсылка = КонтрагентОбъект.Ссылка;
		КонецЕсли;

		Если КонтрагентСсылка = Неопределено Тогда
			ДобавитьОписаниеОшибки(ОписаниеОшибки, 
			НСтр("ru = 'Не удалось найти или создать контрагента!'"));
			Возврат Ложь;
		КонецЕсли;

		Если КонтрагентОбъект.Модифицированность() Тогда
			КонтрагентОбъект.Записать();
		КонецЕсли;

	КонецЕсли;	
	Возврат КонтрагентСсылка;

КонецФункции

//<<<--- Tnext Козык К.А. 16.06.2026 - адаптация под новый релиз 3.0.13.357
&ИзменениеИКонтроль("СоздатьКонтрагента")
Функция спСоздатьКонтрагента(ДокументОбъект, КонтрагентXDTO, Параметры, ОписаниеОшибки)

	НовыйКонтрагент = Справочники.Контрагенты.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(НовыйКонтрагент, КонтрагентXDTO);
	
	Если ОбъектXDTOСодержитСвойство(КонтрагентXDTO, "Наименование")
		И СвойствоXDTOЗаполнено(КонтрагентXDTO.Наименование) Тогда
		НовыйКонтрагент.Наименование = СокрЛП(КонтрагентXDTO.Наименование);
	Иначе
		НовыйКонтрагент.Наименование = "<Наименование не указано>";
	КонецЕсли;
	
	Если ОбъектXDTOСодержитСвойство(КонтрагентXDTO, "ОКПО") И СвойствоXDTOЗаполнено(КонтрагентXDTO.ОКПО) Тогда
		НовыйКонтрагент.КодПоОКПО = КонтрагентXDTO.ОКПО;
	КонецЕсли;
	
	Если ОбъектXDTOСодержитСвойство(КонтрагентXDTO, "ПолноеНаименование")
		И СвойствоXDTOЗаполнено(КонтрагентXDTO.ПолноеНаименование)
		Тогда
		НовыйКонтрагент.НаименованиеПолное = СокрЛП(КонтрагентXDTO.ПолноеНаименование);
	КонецЕсли;
	
	НовыйКонтрагент.Родитель = Параметры.ГруппаДляНовыхКонтрагентов;
	НовыйКонтрагент.ГруппаДоступа = Параметры.ГруппаДоступаДляНовыхКонтрагентов;
	
	Если ОбъектXDTOСодержитСвойство(КонтрагентXDTO, "ОфициальноеНаименование") Тогда
		
		Если СвойствоXDTOЗаполнено(КонтрагентXDTO.ОфициальноеНаименование) Тогда
			НовыйКонтрагент.НаименованиеПолное = СокрЛП(КонтрагентXDTO.ОфициальноеНаименование);
		КонецЕсли;
		Если ОбъектXDTOСодержитСвойство(КонтрагентXDTO, "ИНН") И ТипЗнч(КонтрагентXDTO.ИНН) = Тип("Строка")
			И СтрДлина(СокрЛП(КонтрагентXDTO.ИНН))=12 Тогда
			
			НовыйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ИндивидуальныйПредприниматель;
		Иначе
			НовыйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ЮридическоеЛицо;
		КонецЕсли;
	Иначе
		НовыйКонтрагент.ВидКонтрагента = Перечисления.ВидыКонтрагентов.ФизическоеЛицо;
	КонецЕсли;
	
	СтрокаФИО = ПолучитьИзОбъектаXDTOСтрокуСФИО(КонтрагентXDTO);
	Если НЕ ПустаяСтрока(СтрокаФИО) 
		И СтрокаФИО <> НовыйКонтрагент.НаименованиеПолное Тогда
		
		НовыйКонтрагент.НаименованиеПолное = НовыйКонтрагент.НаименованиеПолное + " [" + СтрокаФИО + "]";
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(НовыйКонтрагент.КПП) Тогда
		НовыйКонтрагент.СтранаРегистрации = Справочники.СтраныМира.Россия;
	КонецЕсли;
	
	НовыйКонтрагент.Покупатель = Истина;
	
	НовыйКонтрагент.ВестиРасчетыПоДоговорам = Истина;
	НовыйКонтрагент.ВестиРасчетыПоДокументам = Истина;
	НовыйКонтрагент.ВестиРасчетыПоЗаказам = Истина;
	НовыйКонтрагент.ВестиУчетОплатыПоСчетам = Истина;
	
	// Значения по умолчанию.
	
	НовыйКонтрагент.СчетУчетаРасчетовСПокупателем = ПланыСчетов.Управленческий.РасчетыСПокупателями;
	НовыйКонтрагент.СчетУчетаАвансовПокупателя = ПланыСчетов.Управленческий.РасчетыПоАвансамПолученным;
	НовыйКонтрагент.СчетУчетаРасчетовСПоставщиком = ПланыСчетов.Управленческий.РасчетыСПоставщиками;
	НовыйКонтрагент.СчетУчетаАвансовПоставщику = ПланыСчетов.Управленческий.РасчетыПоАвансамВыданным;
	
	НовыйКонтрагент.Ответственный = ДокументОбъект.Ответственный;
	
	ОбновитьКонтактнуюИнформациюКонтрагента(НовыйКонтрагент, КонтрагентXDTO, Ложь, Параметры, ОписаниеОшибки);
	
	Попытка
		НовыйКонтрагент.Записать();
	Исключение
		КаналыПродажСервер.Пауза_мс( 3000 );
		НовыйКонтрагент.Записать();
	КонецПопытки;
	#Вставка
	//++ Tnext ivai 23.09.2025 Задача №4394
	Если ОбъектXDTOСодержитСвойство(КонтрагентXDTO, "Ид") И спВыполнятьПоискПоСоответствиюИдентификаторов() Тогда
		УстановитьПривилегированныйРежим(Истина);
		ИдентификаторМагазина = спПолучитьИдИзВнешнегоКодаБитрикс(КонтрагентXDTO.Ид);
		ИмяОбъекта = спИмяОбъектаСправочникКонтрагенты();
		Запись = РегистрыСведений.спСоответствиеОбъектовИнтернетМагазиновИ1С.СоздатьМенеджерЗаписи();
		Запись.НастройкаИнтеграции = Параметры.НастройкаИнтеграции;
		Запись.ИмяОбъекта = ИмяОбъекта;
		Запись.ИдентификаторМагазина = ИдентификаторМагазина;
		Перезапись = Запись.Выбран();
		Запись.НастройкаИнтеграции = Параметры.НастройкаИнтеграции;
		Запись.ИмяОбъекта = ИмяОбъекта;
		Запись.ИдентификаторМагазина = ИдентификаторМагазина;
		Запись.Ссылка = НовыйКонтрагент.Ссылка;
		Запись.ИдентификаторСсылки = Строка(НовыйКонтрагент.Ссылка.УникальныйИдентификатор());
		Запись.Записать(Перезапись);
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	//-- Tnext ivai
	#КонецВставки
	Возврат НовыйКонтрагент;

КонецФункции //--->>> Tnext Козык К.А. 16.06.2026

&ИзменениеИКонтроль("ДобавитьПодчиненныеДокументыЗаказаXDTO")
Процедура спДобавитьПодчиненныеДокументыЗаказаXDTO(ДокументXDTO, ПакетCML, ДанныеЗаказа, РезультатЗапросаОтгрузкиОплаты, Параметры)

	Если РезультатЗапросаОтгрузкиОплаты.Пустой() Тогда
		Возврат;
	КонецЕсли;

	ЗаказПокупателя = ДанныеЗаказа.ЗаказПокупателя;
	ВыборкаОтгрузкиОплаты = РезультатЗапросаОтгрузкиОплаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	НайтиДанныеПоЗаказу = ВыборкаОтгрузкиОплаты.НайтиСледующий(Новый Структура("ЗаказПокупателя", ЗаказПокупателя));
	Если НЕ НайтиДанныеПоЗаказу Тогда
		Возврат;
	КонецЕсли;

	ПодчиненныеДокументыТип	= ПолучитьТипСвойстваОтТипаОбъектаXDTO(ДокументXDTO.Тип(), "ПодчиненныеДокументы");
	ПодчиненныйДокументТип	= ПолучитьТипСвойстваОтТипаОбъектаXDTO(ПодчиненныеДокументыТип, "ПодчиненныйДокумент");
	ПодчиненныеДокументыXDTO= ФабрикаXDTO.Создать(ПодчиненныеДокументыТип);

	ВыборкаПодчиненныеДокументы = ВыборкаОтгрузкиОплаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаПодчиненныеДокументы.Следующий() Цикл

		Если ВыборкаПодчиненныеДокументы.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		#Вставка
		//++ Tnext ivai 14.10.2025
		Если Не ЗначениеЗаполнено(ВыборкаПодчиненныеДокументы.ДокументДвижения) Тогда
			Прервать;
		КонецЕсли;
		//-- Tnext ivai
		#КонецВставки
		ПодчиненныйДокументXDTO = ФабрикаXDTO.Создать(ПодчиненныйДокументТип);
		ПодчиненныйДокументXDTO.Ид = Строка(ВыборкаПодчиненныеДокументы.ДокументДвижения.УникальныйИдентификатор());

		// Доп. реквизиты документа
		ЗначенияРеквизитовXDTO = ФабрикаXDTO.Создать(ПодчиненныйДокументXDTO.Свойства().Получить("ЗначенияРеквизитов").Тип);

		Если ВыборкаПодчиненныеДокументы.ВидОперации = "Оплата" ИЛИ ВыборкаПодчиненныеДокументы.ВидОперации = "Зачет аванса" Тогда

			СтруктураПоискаОплат = Новый Структура;

			//оплаты
			ВыборкаОплат = ВыборкаПодчиненныеДокументы.Выбрать();
			Пока ВыборкаОплат.Следующий() Цикл

				Если ВыборкаОплат.Количество() = 0 Тогда
					Прервать;
				КонецЕсли;

				Результат = ХозОперацияПоТипуДокумента(ВыборкаПодчиненныеДокументы.ДокументДвижения, Параметры.ОписаниеОшибки);

				ПодчиненныйДокументXDTO.ХозОперация = Результат.ХозОперация;
				СтруктураПоискаОплат.Вставить("ТипОплатыНаСайте", Результат.ТипОплатыНаСайте);
				СтруктураПоискаОплат.Вставить("АналитикаОплаты", ВыборкаОплат.АналитикаОплаты);

				ПодчиненныйДокументXDTO.СрокПлатежа = ВыборкаОплат.Период;

				Если ЗначениеЗаполнено(ВыборкаОплат.Сумма) Тогда
					ПодчиненныйДокументXDTO.Сумма = ВыборкаОплат.Сумма;
					ПодчиненныйДокументXDTO.Валюта = ФорматВалютыДляXDTO(ДанныеЗаказа.Валюта);
					ПодчиненныйДокументXDTO.Курс = ДанныеЗаказа.Курс;
					Если ЗначениеЗаполнено(ВыборкаОплат.НомерОплатыНаСайте) И ЗначениеЗаполнено(ВыборкаОплат.ДатаОплатыНаСайте) Тогда
						ПодчиненныйДокументXDTO.Номер = ВыборкаОплат.НомерОплатыНаСайте;
						ПодчиненныйДокументXDTO.Дата = ФорматДатыДляXDTO(ВыборкаОплат.ДатаОплатыНаСайте, Истина, Ложь);
					Иначе
						// Если оплата создана в 1С, номер не передаем, сопоставление будет выполняться по Ид
						ПодчиненныйДокументXDTO.Дата = ФорматДатыДляXDTO(?(ЗначениеЗаполнено(ВыборкаОплат.Дата1С), ВыборкаОплат.Дата1С, ВыборкаОплат.Период), Истина, Ложь);
					КонецЕсли;
					Если ЗначениеЗаполнено(ВыборкаОплат.Комментарий) Тогда
						ПодчиненныйДокументXDTO.Комментарий = Лев(ВыборкаОплат.Комментарий, 1000);
					КонецЕсли;

					ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Номер оплаты по 1С", ВыборкаОплат.Номер1С);
					ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Дата оплаты по 1С", ФорматДатыДляXDTO(ВыборкаОплат.Дата1С, Истина, Истина));

					ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Оплачен", Истина);

					ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Номер платежного документа", ВыборкаОплат.НомерПлатежногоДокумента);

					ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Номер чека", 
					?(ЗначениеЗаполнено(ВыборкаОплат.НомерЧекаККМ), Строка(ВыборкаОплат.НомерСменыККМ +"-"+ ВыборкаОплат.НомерЧекаККМ), ""));

					ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Дата оплаты", ФорматДатыДляXDTO(ВыборкаОплат.Период, Истина, Истина));

				КонецЕсли;
			КонецЦикла;

			// соответствие из настроек в узле обмена
			Если Параметры.Свойство("ТаблицаСоответствияВидовОплат")
				И Параметры.ТаблицаСоответствияВидовОплат <> Неопределено Тогда 

				МассивСоответствие = Параметры.ТаблицаСоответствияВидовОплат.НайтиСтроки(СтруктураПоискаОплат);
				Если МассивСоответствие.Количество() > 0 Тогда
					НайденноеСоответствие = МассивСоответствие[0];
					Если ЗначениеЗаполнено(НайденноеСоответствие.ИдСпособаОплатыНаСайте) Тогда
						ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Метод оплаты ИД", НайденноеСоответствие.ИдСпособаОплатыНаСайте);
					КонецЕсли;
					Если ЗначениеЗаполнено(НайденноеСоответствие.СпособОплатыНаСайте) Тогда
						ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Метод оплаты", НайденноеСоответствие.СпособОплатыНаСайте);
					КонецЕсли;
				Иначе
					ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Метод оплаты", ПодчиненныйДокументXDTO.ХозОперация);
				КонецЕсли;
			Иначе
				ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Метод оплаты", ПодчиненныйДокументXDTO.ХозОперация);
			КонецЕсли;

		Иначе //отгрузки и доставки

			ПодчиненныйДокументXDTO.ХозОперация = "Отпуск товара";

			Если ЗначениеЗаполнено(ДанныеЗаказа.СлужбаДоставки) Тогда

				ЗаполнитьСвойстваДоставки(ЗначенияРеквизитовXDTO, ПакетCML, ДанныеЗаказа, Параметры);

			КонецЕсли;

			// Заполним товары по документу
			ТоварыТип = ПолучитьТипСвойстваОтТипаОбъектаXDTO(ПодчиненныйДокументXDTO.Тип(), "Товары");
			ТоварТип = ПолучитьТипСвойстваОтТипаОбъектаXDTO(ТоварыТип, "Товар");
			ТоварыXDTO = ФабрикаXDTO.Создать(ТоварыТип);

			ИскатьДоставкуВТоварах = Истина;

			ВыборкаТоваров = ВыборкаПодчиненныеДокументы.Выбрать();
			Пока ВыборкаТоваров.Следующий() Цикл

				ТоварXDTO = Неопределено;

				Если ВыборкаТоваров.ВидОперации = "Оплата" Тогда
					ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'при выгрузке заказа %1, в документе %2 не разнесена оплата на сумму %3'"),
					ВыборкаТоваров.ЗаказПокупателя,
					ВыборкаТоваров.Регистратор,
					ВыборкаТоваров.Сумма
					);
					Параметры.ОписаниеОшибки = Параметры.ОписаниеОшибки + ТекстОшибки + Символы.ПС; 
					Продолжить; //зачет аванса документом отгрузки
				КонецЕсли;

				Если ЗначениеЗаполнено(ВыборкаТоваров.Комментарий) Тогда
					ПодчиненныйДокументXDTO.Комментарий = Лев(ВыборкаТоваров.Комментарий, 1000);
				КонецЕсли;

				Если ВыборкаТоваров.Количество() = 0 Тогда
					Прервать;
				КонецЕсли;

				Если ЗначениеЗаполнено(ВыборкаТоваров.СтоимостьДоставки) И ЗначениеЗаполнено(ВыборкаТоваров.НоменклатураДоставки) Тогда
					ИскатьДоставкуВТоварах = Ложь;
				КонецЕсли;

				ТоварXDTO = ФабрикаXDTO.Создать(ТоварТип);

				ТоварXDTO.Наименование = ФорматНаименованияДляXDTO(ВыборкаТоваров.Номенклатура);				
				Характеристика = Неопределено;
				Если Параметры.ИспользоватьХарактеристики Тогда
					Характеристика = ВыборкаТоваров.Характеристика;
				КонецЕсли;
				Если ВыборкаТоваров.ВидОперации = "Доставка" Тогда
					ТоварXDTO.Ид = "ORDER_DELIVERY";
					ТоварXDTO.Количество = 1;
					ТоварXDTO.Сумма = ВыборкаТоваров.СтоимостьДоставки;

					ЗначенияРеквизитовXDTOТовара = ФабрикаXDTO.Создать(ПолучитьТипСвойстваОтТипаОбъектаXDTO(ТоварТип, "ЗначенияРеквизитов"));
					//@skip-check query-in-loop
					ДобавитьСвойстваТовараВЗаказе(ЗначенияРеквизитовXDTOТовара, ПакетCML, ВыборкаТоваров, Параметры, ТоварXDTO.Ид);

					ТоварXDTO.ЗначенияРеквизитов = ЗначенияРеквизитовXDTOТовара;

					ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Номер документа отгрузки", ВыборкаТоваров.Номер1С);
					ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Дата документа отгрузки", ФорматДатыДляXDTO(ВыборкаТоваров.Дата1С, Истина, Истина));

					ИскатьДоставкуВТоварах = Ложь;
				Иначе //отгрузка

					Если ИскатьДоставкуВТоварах 
						И Параметры.ПротоколОбменаCMS = Перечисления.ПротоколыОбменаCMS.Битрикс
						И ВыборкаТоваров.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга
						Тогда //для CMS Битрикс выгружаем первую услугу - как доставку, с Ид = "ORDER_DELIVERY"

						ТоварXDTO.Ид = "ORDER_DELIVERY";
						ТоварXDTO.Сумма = ВыборкаТоваров.Сумма;
						ИскатьДоставкуВТоварах = Ложь;
					Иначе	
						//@skip-check query-in-loop
						ЗаполнитьИДСайтаДляОбъектаXDTO(ТоварXDTO, ВыборкаТоваров.Номенклатура, Характеристика, Параметры);
					КонецЕсли;

					ТоварXDTO.Количество = ВыборкаТоваров.Количество;

					// Если отгрузка создана в 1С, номер не передаем, сопоставление будет выполняться по Ид
					ПодчиненныйДокументXDTO.Дата = ФорматДатыДляXDTO(ВыборкаТоваров.Дата1С, Истина, Ложь);

					ЗначенияРеквизитовXDTOТовара = ФабрикаXDTO.Создать(ПолучитьТипСвойстваОтТипаОбъектаXDTO(ТоварТип, "ЗначенияРеквизитов"));
					//@skip-check query-in-loop
					ДобавитьСвойстваТовараВЗаказе(ЗначенияРеквизитовXDTOТовара, ПакетCML, ВыборкаТоваров, Параметры, ТоварXDTO.Ид);

					ТоварXDTO.ЗначенияРеквизитов = ЗначенияРеквизитовXDTOТовара;

				КонецЕсли; 

				Если ТоварXDTO <> Неопределено Тогда
					ТоварыXDTO.Товар.Добавить(ТоварXDTO);
				КонецЕсли;

			КонецЦикла; 

			Если ТоварыXDTO.Товар.Количество()>0 Тогда
				ПодчиненныйДокументXDTO.Товары = ТоварыXDTO;
			КонецЕсли;
			ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Отгружен", Истина);

		КонецЕсли;

		ПодчиненныйДокументXDTO.ЗначенияРеквизитов = ЗначенияРеквизитовXDTO;
		ПодчиненныеДокументыXDTO.ПодчиненныйДокумент.Добавить(ПодчиненныйДокументXDTO);
	КонецЦикла;

	ДокументXDTO.ПодчиненныеДокументы = ПодчиненныеДокументыXDTO;

КонецПроцедуры

&ИзменениеИКонтроль("ДобавитьЗначенияРеквизитовЗаказаXDTO")
Процедура спДобавитьЗначенияРеквизитовЗаказаXDTO(ДокументXDTO, ПакетCML, ДанныеЗаказа, Параметры)

	ЗначенияРеквизитовXDTO = ФабрикаXDTO.Создать(ДокументXDTO.Свойства().Получить("ЗначенияРеквизитов").Тип);

	ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Номер по 1С", ДанныеЗаказа.Номер);
	ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Дата по 1С", ФорматДатыДляXDTO(ДанныеЗаказа.Дата, Истина, Истина));
	ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "ПометкаУдаления", ДанныеЗаказа.ПометкаУдаления);
	ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Проведен", ДанныеЗаказа.Проведен);
	Если ДанныеЗаказа.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Отменен Тогда
		ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Отменен", "true");
	КонецЕсли;

	// ОПЛАТЫ
	ДокументОплачен = ДанныеЗаказа.Проведен И ДанныеЗаказа.КОплатеОстаток <= 0;
	Если ДокументОплачен Тогда

		ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Оплачен", Истина);
		Если НЕ Параметры.ПодчиненныеДокументы = Истина Тогда
			ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Номер оплаты по 1С", ДанныеЗаказа.НомерОплаты);
			ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Дата оплаты по 1С", ФорматДатыДляXDTO(ДанныеЗаказа.ДатаОплаты, Истина, Истина));
		КонецЕсли;
	Иначе
		ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Оплачен", Ложь);
	КонецЕсли;

	Если НЕ Параметры.ПодчиненныеДокументы = Истина 
		И Параметры.Свойство("ТаблицаСоответствияВидовОплат")
		И Параметры.ТаблицаСоответствияВидовОплат <> Неопределено Тогда

		СтруктураПроверки = Новый Структура("ДокументОплаты", Неопределено);
		ЗаполнитьЗначенияСвойств(СтруктураПроверки, ДанныеЗаказа);

		Если СтруктураПроверки.ДокументОплаты <> Неопределено Тогда

			СтруктураПоискаОплат = Новый Структура;
			Если ТипЗнч(ДанныеЗаказа.ДокументОплаты) = Тип("ДокументСсылка.ПоступлениеВКассу") Тогда
				СтруктураПоискаОплат.Вставить("ТипОплатыНаСайте", Перечисления.ТипыОплатНаСайте.Наличные);
				Если ЗначениеЗаполнено(ДанныеЗаказа.ДокументОплаты.КассаККМ) Тогда
					СтруктураПоискаОплат.Вставить("АналитикаОплаты", ДанныеЗаказа.ДокументОплаты.КассаККМ);
				Иначе
					СтруктураПоискаОплат.Вставить("АналитикаОплаты", ДанныеЗаказа.ДокументОплаты.Касса);
				КонецЕсли;
			ИначеЕсли ТипЗнч(ДанныеЗаказа.ДокументОплаты) = Тип("ДокументСсылка.Взаимозачет") Тогда
				СтруктураПоискаОплат.Вставить("ТипОплатыНаСайте", Перечисления.ТипыОплатНаСайте.Безналичные);
				СтруктураПоискаОплат.Вставить("АналитикаОплаты", ДанныеЗаказа.ДокументОплаты.Контрагент);
			ИначеЕсли ТипЗнч(ДанныеЗаказа.ДокументОплаты) = Тип("ДокументСсылка.ПоступлениеНаСчет") Тогда
				СтруктураПоискаОплат.Вставить("ТипОплатыНаСайте", Перечисления.ТипыОплатНаСайте.Безналичные);
				СтруктураПоискаОплат.Вставить("АналитикаОплаты", ДанныеЗаказа.ДокументОплаты.Контрагент);
			ИначеЕсли ТипЗнч(ДанныеЗаказа.ДокументОплаты) = Тип("ДокументСсылка.ОперацияПоПлатежнымКартам") Тогда
				СтруктураПоискаОплат.Вставить("ТипОплатыНаСайте", Перечисления.ТипыОплатНаСайте.Эквайринг);
				СтруктураПоискаОплат.Вставить("АналитикаОплаты", ДанныеЗаказа.ДокументОплаты.ЭквайринговыйТерминал);
			КонецЕсли;

			МассивСоответствие = Параметры.ТаблицаСоответствияВидовОплат.НайтиСтроки(СтруктураПоискаОплат);
			Если МассивСоответствие.Количество() > 0 Тогда
				НайденноеСоответствие = МассивСоответствие[0];
				Если ЗначениеЗаполнено(НайденноеСоответствие.ИдСпособаОплатыНаСайте) Тогда
					ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Метод оплаты ИД", НайденноеСоответствие.ИдСпособаОплатыНаСайте);
				КонецЕсли;
				Если ЗначениеЗаполнено(НайденноеСоответствие.СпособОплатыНаСайте) Тогда
					ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Метод оплаты", НайденноеСоответствие.СпособОплатыНаСайте);
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	// ОТГРУЗКИ
	Если ДанныеЗаказа.Проведен
		И ДанныеЗаказа.КОтгрузкеОстаток <= 0 Тогда

		ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Отгружен", Истина);
		Если НЕ Параметры.ПодчиненныеДокументы = Истина Тогда
			ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Номер отгрузки по 1С", ДанныеЗаказа.НомерОтгрузки);
			ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Дата отгрузки по 1С", ФорматДатыДляXDTO(ДанныеЗаказа.ДатаОтгрузки, Истина, Истина));
		КонецЕсли;
	Иначе
		ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Отгружен", Ложь);
	КонецЕсли;

	// ДОП.ИНФО ПО ДОСТАВКЕ
	#Вставка
	//++ Tnext ivai 27.10.2025
	ФСО = Истина;
	Если ДанныеЗаказа.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз
		И спПередаватьДляСамовывозаМетодДоставкиВСвойствахЗаказа() Тогда
		
		Если Параметры.Свойство("ТаблицаСоответствияСлужбДоставки")
			И Параметры.ТаблицаСоответствияСлужбДоставки <> Неопределено Тогда 
			
			//НайденноеСоответствие = Параметры.ТаблицаСоответствияСлужбДоставки.НайтиСтроки(Новый Структура("СлужбаДоставки, СпособДоставки", ДанныеЗаказа.СлужбаДоставки, ДанныеЗаказа.СпособДоставки));
			НайденноеСоответствие = Параметры.ТаблицаСоответствияСлужбДоставки.НайтиСтроки(Новый Структура("СпособДоставки, СлужбаДоставкиНаСайте", ДанныеЗаказа.СпособДоставки, "Самовывоз"));
			Если НайденноеСоответствие.Количество() > 0 Тогда
				ФСО = Ложь;
				Если ЗначениеЗаполнено(НайденноеСоответствие[0].ИдСлужбыДоставкиНаСайте) Тогда
					ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Метод доставки ИД", НайденноеСоответствие[0].ИдСлужбыДоставкиНаСайте);
				КонецЕсли;
				//Если ЗначениеЗаполнено(НайденноеСоответствие[0].СлужбаДоставкиНаСайте) Тогда
				//	ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Метод доставки", НайденноеСоответствие[0].СлужбаДоставкиНаСайте);
				//КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ФСО Тогда
	//-- Tnext ivai
	#КонецВставки
	Если ЗначениеЗаполнено(ДанныеЗаказа.СлужбаДоставки) И НЕ Параметры.ПодчиненныеДокументы = Истина Тогда

		ЗаполнитьСвойстваДоставки(ЗначенияРеквизитовXDTO, ПакетCML, ДанныеЗаказа, Параметры);

	КонецЕсли;
	#Вставка
	//++ Tnext ivai 27.10.2025
	КонецЕсли;
	//-- Tnext ivai
	#КонецВставки

	// СТАТУС ЗАКАЗА
	Если Параметры.Свойство("ТаблицаСоответствияСтатусовЗаказов")
		И Параметры.ТаблицаСоответствияСтатусовЗаказов <> Неопределено Тогда 

		#Вставка
		//++ Tnext ivai 10.11.2025
		Если ДанныеЗаказа.ВариантЗавершения = Перечисления.ВариантыЗавершенияЗаказа.Отменен Тогда
			НайденноеСоответствие = Параметры.ТаблицаСоответствияСтатусовЗаказов.Найти("Отменен", "СтатусЗаказаНаСайте");
		Иначе
		//-- Tnext ivai
		#КонецВставки
		НайденноеСоответствие = Параметры.ТаблицаСоответствияСтатусовЗаказов.Найти(ДанныеЗаказа.СостояниеЗаказа, "СостояниеЗаказаПокупателя");
		#Вставка
		//++ Tnext ivai 10.11.2025
		КонецЕсли;
		//-- Tnext ivai
		#КонецВставки
		Если НайденноеСоответствие <> Неопределено Тогда

			Если ЗначениеЗаполнено(НайденноеСоответствие.ИДСтатусаЗаказаНаСайте) Тогда
				ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Статуса заказа ИД", НайденноеСоответствие.ИДСтатусаЗаказаНаСайте);
			КонецЕсли;
			Если ЗначениеЗаполнено(НайденноеСоответствие.СтатусЗаказаНаСайте) Тогда
				СтатусНаСайте = НайденноеСоответствие.СтатусЗаказаНаСайте;
				ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Статус заказа", СтатусНаСайте);
			КонецЕсли;
		КонецЕсли;

		Если ПолучитьФункциональнуюОпцию("ИспользоватьВидыЗаказовПокупателей") Тогда
			ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, "Вид заказа", Параметры.ВидЗаказа);
		КонецЕсли;

	КонецЕсли;

	// Выгрузка выбранных в узле обмена доп. реквизитов заказа
	ДопРеквизитыЗаказа = УправлениеСвойствами.ЗначенияСвойств(ДанныеЗаказа.ЗаказПокупателя, Истина, Ложь);
	Если Параметры.Свойство("НастройкиВыгрузкиДопРеквизитовЗаказов") И НЕ ПустаяСтрока(Параметры.НастройкиВыгрузкиДопРеквизитовЗаказов) Тогда

		СоответствиеПолейДопРеквизитов = ЧтениеJSONВСтруктуру(Параметры.НастройкиВыгрузкиДопРеквизитовЗаказов, Истина);
		Для Каждого ДанныеРеквизита Из ДопРеквизитыЗаказа Цикл

			Если ПустаяСтрока(ДанныеРеквизита.Значение) Тогда
				Продолжить;
			КонецЕсли;

			//@skip-check reading-attribute-from-database
			КлючРеквизита = ДанныеРеквизита.Свойство.ИдентификаторДляФормул;
			ИмяВыгрузкиРеквизита = СоответствиеПолейДопРеквизитов.Получить(КлючРеквизита);

			Если ИмяВыгрузкиРеквизита <> Неопределено Тогда
				ДобавитьЗначениеРеквизитаXDTO(ЗначенияРеквизитовXDTO, ПакетCML, ИмяВыгрузкиРеквизита, данныеРеквизита.Значение);
			КонецЕсли;
		КонецЦикла; 

	КонецЕсли; 

	ДокументXDTO.ЗначенияРеквизитов = ЗначенияРеквизитовXDTO;

КонецПроцедуры

//<<<--- Tnext Козык К.А. 16.06.2026 - адаптация под новый релиз 3.0.13.357
&ИзменениеИКонтроль("ВыгрузитьНаСайт")
Функция спВыгрузитьНаСайт(Параметры, МассивПодкаталогов, ОписаниеОшибки, ОжидатьЗавершенияИмпортаФайловСервером, ТипСоединения)

	ОтветСервера = "";
	Соединение = Неопределено;
	НастройкиПодключения = Параметры.НастройкиПодключения;
	
	АдресДляРаботы = НастройкиПодключения.АдресСкрипта + "?type=" + ТипСоединения; 
	
	УчетнаяЗапись = ИнтеграцияСМаркетплейсамиСервер.СтруктураСвойствоЗначениеПолучить( Параметры, "НастройкаИнтеграции", Неопределено );
	
	НастройкиПодключения.Вставить( "УчетнаяЗапись", УчетнаяЗапись );
	ОписаниеОшибки = "";
	Успешно = ВыполнитьАвторизациюДляСоединения(Соединение, НастройкиПодключения, ОтветСервера, ОписаниеОшибки, ТипСоединения, Параметры);
	
	Если НЕ Успешно Тогда
		Параметры.Вставить( "СайтОшибкаАвторизации", Истина );
		ДобавитьОписаниеОшибки(ОписаниеОшибки, НСтр("ru = 'Выгрузка на сайт не выполнена (001).'"));
		Возврат Ложь;
	КонецЕсли;
	
	КукиИмя				= СтрПолучитьСтроку(ОтветСервера, 2);
	КукиЗначение		= СтрПолучитьСтроку(ОтветСервера, 3);
	ЗаголовкиЗапросов	= "Cookie: " + КукиИмя + "=" + КукиЗначение;
	
	Если Параметры.ПротоколОбменаCMS = Перечисления.ПротоколыОбменаCMS.Битрикс Тогда
		
		Если Параметры.ПодчиненныеДокументы Тогда
			ВерсияОбмена = "&cmlVersion=2.10";
			ВерсияСхемы = "&version=2.09";
		Иначе
			ВерсияСхемы = "";
			ВерсияОбмена = "";
		КонецЕсли;
		
		АдресДляРаботы = АдресДляРаботы + ДобавитьТокенБитрикс(ОтветСервера) + ВерсияСхемы + ВерсияОбмена;
	КонецЕсли;
	
	ОписаниеОшибки = "";
	ОтветСервера = ПолучитьДанныеССервера(
	Соединение,
	АдресДляРаботы + НастройкиПодключения.ПараметрЗапросаHTTP_Инициализация,
	ЗаголовкиЗапросов,
	ОписаниеОшибки,
	Параметры
	);
	
	Если ОтветСервера = Неопределено Тогда 
		Параметры.Вставить( "СайтОшибкаАвторизации", Истина );
		ДобавитьОписаниеОшибки(ОписаниеОшибки, НСтр("ru = 'Выгрузка на сайт не выполнена (002).'"));
		Возврат Ложь;
		
	КонецЕсли;
	
	ZIPФайлыРазрешены = Ложь;
	ОграничениеРазмераФрагментаФайлаОбмена = 0;
	
	ЧислоСтрокОтветСервера = СтрЧислоСтрок(ОтветСервера);
	// Некоторые CMS, например Nethouse, не передают параметр file_limit
	
	ZIPФайлыРазрешены = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1))) = НастройкиПодключения.ОтветСервера_ZIPРазрешен;
	
	Если Параметры.ПротоколОбменаCMS = Перечисления.ПротоколыОбменаCMS.Битрикс 
		И ЧислоСтрокОтветСервера < 2 Тогда
		
		ДобавитьОписаниеОшибки(ОписаниеОшибки, НСтр("ru = 'Выгрузка на сайт не выполнена (003).'") + Символы.ПС
		+ НСтр("ru = 'Не удалось прочитать ответ сервера. Параметры обмена не получены.'"));
		ДобавитьОписаниеОшибки(ОписаниеОшибки, Лев(ОтветСервера,512));
		Возврат Ложь;
		
	ИначеЕсли ЧислоСтрокОтветСервера = 1 Тогда
		ОграничениеРазмераФрагментаФайлаОбмена = 0;
	Иначе
		// стандартный ответ в 2 строки:
		// zip=no
		// file_limit=xxx
		Попытка
			
			ОграничениеРазмераФрагментаФайлаОбмена = ПолучитьЧислоИзСтроки(СтрЗаменить(СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 2))),
			НастройкиПодключения.ОтветСервера_ОграничениеРазмераФрагментаФайлаОбмена, ""));
			
			Если ТипЗнч(ОграничениеРазмераФрагментаФайлаОбмена) <> Тип("Число") Тогда
				ОграничениеРазмераФрагментаФайлаОбмена = -1;
			КонецЕсли;
			
		Исключение
			
			ПодробноеПредставлениеОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			
			ДобавитьОписаниеОшибки(ОписаниеОшибки,
			ОписаниеИсключительнойОшибки(ПодробноеПредставлениеОшибки, НСтр("ru = 'Ошибка получения параметров обмена (ограничение размера файла)!'")));
			ДобавитьОписаниеОшибки(ОписаниеОшибки, ОтветСервера);
			
			ОграничениеРазмераФрагментаФайлаОбмена = -1;
		КонецПопытки;
		
	КонецЕсли;
	
	МассивИсходныхXMLФайлов = НайтиФайлы(Параметры.КаталогНаДиске, "*.xml");
	ПоместитьФайлImportВНачалоМассива(МассивИсходныхXMLФайлов);
	СписокФайловДляОтправки = ПолучитьСписокФайловДляОтправки(Параметры.КаталогНаДиске, МассивПодкаталогов);
	
	Если (Параметры.Свойство("ИспользоватьОптимизированныйОбменКартинок")
		И Параметры.ИспользоватьОптимизированныйОбменКартинок = Истина) Тогда
		
		Если Не Параметры.Свойство("СоответствиеФайлов") Тогда
			Параметры.Вставить("СоответствиеФайлов", Новый Соответствие);
		КонецЕсли;
		
		Для Каждого КлючЗначение Из Параметры.СоответствиеФайлов Цикл
			СписокФайловДляОтправки.Добавить(КлючЗначение.Значение.АдресФайла, КлючЗначение.Значение.Представление);
		КонецЦикла;
	КонецЕсли;
	
	СписокФайловДляОтправки.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
	Если ZIPФайлыРазрешены Тогда
		Попытка
			СписокФайловДляОтправкиНовый = ПодготовитьZIPАрхивы(Параметры, ОписаниеОшибки);
			
			Если СписокФайловДляОтправкиНовый.Количество() = 0 Тогда
				Возврат Ложь;
			КонецЕсли;
			
			Если (Параметры.Свойство("ИспользоватьОптимизированныйОбменКартинок")
				И Параметры.ИспользоватьОптимизированныйОбменКартинок = Истина) Тогда
				МассивУдаления = Новый Массив;
				Для Каждого Стр Из СписокФайловДляОтправки Цикл
					Если ЭтоФайлОбмена(Стр) Тогда
						МассивУдаления.Добавить(Стр);
					КонецЕсли;
				КонецЦикла;
				
				Для Каждого Стр Из МассивУдаления Цикл
					СписокФайловДляОтправки.Удалить(Стр);
				КонецЦикла;
				
				Для Каждого Стр Из СписокФайловДляОтправкиНовый Цикл
					СписокФайловДляОтправки.Добавить(Стр.Значение, Стр.Представление);
				КонецЦикла;
				
			Иначе
				СписокФайловДляОтправки = СписокФайловДляОтправкиНовый;
			КонецЕсли;
		Исключение
			ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки( ИнформацияОбОшибке() );
			ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ТекстОшибки, УчетнаяЗапись, Истина );
		КонецПопытки;
	КонецЕсли;
	
	Если ОграничениеРазмераФрагментаФайлаОбмена > 0 Тогда
		
		СписокФайловДляОтправки = РазделитьФайлыНаФрагменты(СписокФайловДляОтправки, ОграничениеРазмераФрагментаФайлаОбмена, Параметры);
		
	КонецЕсли;
	
	Если ОбменСВнешнимиСистемамиЛогированиеПовтИсп.ЛогированиеВключено( УчетнаяЗапись ) Тогда
		ЛогКомментарий = 
		"ВыгрузитьНаСайт: " + Символы.ПС
		+ "ОграничениеРазмераФрагментаФайлаОбмена: " + ОграничениеРазмераФрагментаФайлаОбмена + Символы.ПС
		+ "СписокФайловДляОтправки: " + Символы.ПС
		+ ОбменСВнешнимиСистемамиЛогирование.ОбъектПредставление( СписокФайловДляОтправки );
		
		ОбменСВнешнимиСистемамиЛогирование.ЗаписатьВЛог( ЛогКомментарий, УчетнаяЗапись );
	КонецЕсли;

	
	ЕстьОшибки = Ложь;
	Для Каждого ТекФайл Из СписокФайловДляОтправки Цикл
		
		Если Параметры.ДобавлятьОтносительныеПутиИзображенийБезДвоичныхДанных
			И Не ЭтоФайлОбмена(ТекФайл.Значение) Тогда
			Продолжить;
		КонецЕсли;
		
		ОтветСервераСтруктура = ОтправитьФайлНаСервер(ТекФайл.Значение,
		Соединение,
		АдресДляРаботы + НастройкиПодключения.ПараметрЗапросаHTTP_ПередачаФайла + ТекФайл.Представление,
		ЗаголовкиЗапросов,
		ОписаниеОшибки,
		Параметры
		);
		
		ОтветСервера = ОтветСервераСтруктура.ОтветСервера;

		Если ТипЗнч(ОтветСервера) = Тип("Строка") Тогда
			ОтветСервера = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(ОтветСервера);
		КонецЕсли;
		
		Если ОтветСервера = Неопределено Тогда
			
			ДобавитьОписаниеОшибки(ОписаниеОшибки, 
			НСтр("ru = 'Не удалось получить ответ сервера. Файл не отправлен.'") + " (" + ТекФайл.Значение + ")."
			+ Символы.ПС + "Код состояния: " + ОтветСервераСтруктура.КодСостояния);
			
			Если (Параметры.Свойство("ИспользоватьОптимизированныйОбменКартинок")
				И Параметры.ИспользоватьОптимизированныйОбменКартинок = Истина) Тогда
				Продолжить;
			КонецЕсли;
			
			ЕстьОшибки = Истина;
			Прервать;
			
		КонецЕсли;
		
		СостояниеОбмена = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера,1)));
		
		Если СостояниеОбмена = НастройкиПодключения.ОтветСервера_АварийноеЗавершениеТекущейОперации Тогда
			
			ДобавитьОписаниеОшибки(ОписаниеОшибки,
			НСтр("ru = 'Произошла ошибка на стороне сервера. Файл не отправлен.'") + " (" + ТекФайл.Значение + ")."
			+ Символы.ПС + НСтр("ru = 'Ответ сервера:'") + Символы.ПС + ОтветСервера);
			
			ЕстьОшибки = Истина;
			Прервать;
			
		ИначеЕсли СостояниеОбмена = НастройкиПодключения.ОтветСервера_УспешноеЗавершениеТекущейОперации Тогда
			
			Если СтрЧислоСтрок(ОтветСервера) > 1 Тогда
				
				ДобавитьОписаниеОшибки(ОписаниеОшибки,
				НСтр("ru = 'Получен расширенный статус успешного завершения сеанса.'")
				+ Символы.ПС + НСтр("ru = 'Ответ сервера:'") + Символы.ПС + ОтветСервера);
				
			КонецЕсли;
			
		Иначе
			
			ДобавитьОписаниеОшибки(ОписаниеОшибки,
			НСтр("ru = 'Произошла ошибка на стороне сервера. Не получен статус завершения операции. Файл не отправлен.'")
			+ " (" + ТекФайл.Значение + ")."
			+ Символы.ПС + НСтр("ru = 'Ответ сервера:'") + Символы.ПС + ОтветСервера);
			
			Если (Параметры.Свойство("ИспользоватьОптимизированныйОбменКартинок")
				И Параметры.ИспользоватьОптимизированныйОбменКартинок = Истина) Тогда
				Продолжить;
			КонецЕсли;
			
			ЕстьОшибки = Истина;
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	УдалитьСписокВременныхФайлов(СписокФайловДляОтправки);
	
	Если ЕстьОшибки Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИмпортУспешноЗавершен = Ложь;
	
	Для Каждого ТекФайл Из МассивИсходныхXMLФайлов Цикл
		
		ИмпортПродолжается = Истина;
		
		ИмпортПродолжаетсяПервыйЦикл = Истина;
		Пока ИмпортПродолжается Цикл
			
			Если ИмпортПродолжаетсяПервыйЦикл = Ложь Тогда
				КаналыПродажСервер.Пауза_мс( 5000 );
			КонецЕсли;
			
			ИмпортПродолжается = Ложь;
			
			АдресРесурса = АдресДляРаботы + НастройкиПодключения.ПараметрЗапросаHTTP_ИмпортФайлаСервером + ТекФайл.Имя;
			
			ОписаниеОшибки = "";
			ОтветСервера = ПолучитьДанныеССервера(
			Соединение,
			АдресРесурса,
			ЗаголовкиЗапросов,
			ОписаниеОшибки,
			Параметры
			);
			
			Если ТипЗнч(ОтветСервера) = Тип("Строка") Тогда
				ОтветСервера = ОбщегоНазначенияКлиентСервер.УдалитьНедопустимыеСимволыXML(ОтветСервера);
			КонецЕсли;
			
			Если ОтветСервера = Неопределено Тогда 
				
				Успешно = Ложь;
				
				ДобавитьОписаниеОшибки(ОписаниеОшибки, ТекФайл.Имя + ": "
				+ НСтр("ru = 'Не удалось получить текущее состояние процесса обмена. Данные обмена отправлены, но не загружены.'"));
				
			ИначеЕсли СтрЧислоСтрок(ОтветСервера) = 0 Тогда
				
				Успешно = Ложь;
				ДобавитьОписаниеОшибки(ОписаниеОшибки, ТекФайл.Имя + ": "
				+ НСтр("ru = 'Не удалось прочитать данные о текущем состоянии процесса обмена. Данные обмена отправлены, но не загружены.'"));
				
			Иначе
				
				СостояниеОбмена = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 1)));
				#Вставка
				//++ Tnext ivai 14.11.2025
				Если ПустаяСтрока(СостояниеОбмена) И СтрЧислоСтрок(ОтветСервера) > 1 Тогда
					СостояниеОбмена = СокрЛП(НРег(СтрПолучитьСтроку(ОтветСервера, 2)));
				КонецЕсли;
				//-- Tnext ivai
				#КонецВставки
				
				Если СостояниеОбмена = НастройкиПодключения.ОтветСервера_АварийноеЗавершениеТекущейОперации Тогда
					
					Успешно = Ложь;
					
					ДополнениеОшибки = "Ошибка: Файл " + ТекФайл.Имя + ": "
					+ НСтр("ru = 'Произошла ошибка на стороне сервера'") + " " + Соединение.Сервер + Символы.ПС
					+ НСтр("ru = 'Адрес ресурса'") + ": " + АдресРесурса + Символы.ПС
					+ НСтр("ru = 'Ответ сервера'") + ": " + Символы.ПС
					+ ОтветСервера;
					
					ДобавитьОписаниеОшибки( ОписаниеОшибки, ДополнениеОшибки );
					
				ИначеЕсли СостояниеОбмена = НастройкиПодключения.ОтветСервера_УспешноеЗавершениеТекущейОперации Тогда
					
					ИмпортУспешноЗавершен = Истина;
					
				ИначеЕсли СостояниеОбмена = НастройкиПодключения.ОтветСервера_ВыполнениеТекущейОперации Тогда
					
					Если ОжидатьЗавершенияИмпортаФайловСервером Тогда
						ИмпортПродолжается = Истина;
					КонецЕсли;
					
				Иначе
					
					Успешно = Ложь;
					
					ДобавитьОписаниеОшибки(ОписаниеОшибки, ТекФайл.Имя + ": "
					+ НСтр("ru = 'Произошла ошибка на стороне сервера. Получен неизвестный статус импорта.'")
					+ Символы.ПС + НСтр("ru = 'Ответ сервера'") + ": " + Символы.ПС + ОтветСервера);
					
				КонецЕсли;
				
			КонецЕсли;
			
			ИмпортПродолжаетсяПервыйЦикл = Ложь;
			
		КонецЦикла;
		
		Если НЕ ИмпортУспешноЗавершен Тогда
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Успешно;

КонецФункции //--->>> Tnext Козык К.А. 16.06.2026

#КонецОбласти