
&Вместо("ПодготовитьПараметрыРасчетаСкидок")
Функция maxma_ПодготовитьПараметрыРасчетаСкидок(ПакетЗапросов, ПараметрыРасчета, ВходныеПараметры)
	
	Результат = ПродолжитьВызов(ПакетЗапросов, ПараметрыРасчета, ВходныеПараметры);
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыРасчета, "maxma_СтруктураПолей") Тогда
		Результат.Вставить("maxma_СтруктураПолей", ПараметрыРасчета.maxma_СтруктураПолей);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ПараметрыРасчета, "Кассир") Тогда
		Результат.Вставить("Кассир", ПараметрыРасчета.Кассир);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&Перед("ПрименитьРезультатРасчетаСкидокКОбъекту")
Процедура maxma_ПрименитьРезультатРасчетаСкидокКОбъекту(Объект, ИмяТЧ, РезультатРасчетаСкидокНаценок, РеализацияСверхЗаказа = Ложь,
		ТоварыСверхЗаказа = Неопределено, ИмяТЧ2 = Неопределено, ДеревоСкидок = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Не ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "maxma_СтруктураПолей") Тогда
		Возврат;
	КонецЕсли;
	
	maxma_СтруктураПолей = Объект.maxma_СтруктураПолей;
	
	Если Не maxma_ИнтеграцияССервисомКлиентСервер.ИспользоватьПрограммуЛояльности(maxma_СтруктураПолей) Тогда
		Возврат;
	КонецЕсли;
	
	Если maxma_СтруктураПолей.ПараметрыПродажи.ПродажаПодтверждена Тогда
		Возврат;
	КонецЕсли;
	
	СкидкиРассчитаны = maxma_ИнтеграцияССервисомВызовСервера.ПречекСоздан(maxma_СтруктураПолей, Объект);
	
	Если Не СкидкиРассчитаны Тогда
		Возврат;
	КонецЕсли;
	
	МассивРассчитанныхСкидок = ПолучитьИзВременногоХранилища(maxma_СтруктураПолей.ПараметрыПродажи.АдресРассчитанныхСкидок);
	
	maxma_ОчиститьПараметрыРасчета(maxma_СтруктураПолей.ПараметрыРасчета);
	
	Для сч = 1 По МассивРассчитанныхСкидок.Количество() Цикл
		
		СтрокаМассива = МассивРассчитанныхСкидок[сч - 1];
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("НомерСтроки", сч);
		
		НайденныеСтроки = Объект.Товары.НайтиСтроки(СтруктураПоиска);
		
		maxma_СохранитьРасчеты(maxma_СтруктураПолей.ПараметрыРасчета, НайденныеСтроки[0].Номенклатура, СтрокаМассива);
		
		КлючСвязи = НайденныеСтроки[0].ИдентификаторСтроки;
		
		// Промокод
		Если Не СтрокаМассива.discounts.promocode = 0 Тогда
			maxma_ДобавитьСкидкуНаценку(РезультатРасчетаСкидокНаценок, maxma_СтруктураПолей.СтруктураСкидок.СкидкаПромокод, СтрокаМассива.discounts.promocode, КлючСвязи);
		КонецЕсли;
		
		// Скидка
		Если Не СтрокаМассива.discounts.offer = 0 Тогда
			maxma_ДобавитьСкидкуНаценку(РезультатРасчетаСкидокНаценок, maxma_СтруктураПолей.СтруктураСкидок.СкидкаАвто, СтрокаМассива.discounts.offer, КлючСвязи);
		КонецЕсли;
		
		// Округление
		Если Не СтрокаМассива.discounts.rounding = 0 Тогда
			maxma_ДобавитьСкидкуНаценку(РезультатРасчетаСкидокНаценок, maxma_СтруктураПолей.СтруктураСкидок.СкидкаОкругление, СтрокаМассива.discounts.rounding, КлючСвязи);
		КонецЕсли;
		
		// Бонусы
		Если Не СтрокаМассива.discounts.bonuses = 0 Тогда
			maxma_ДобавитьСкидкуНаценку(РезультатРасчетаСкидокНаценок, maxma_СтруктураПолей.СтруктураСкидок.ОплатаБонусами, СтрокаМассива.discounts.bonuses, КлючСвязи);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура maxma_ДобавитьСкидкуНаценку(ТаблицаСкидок, СкидкаНаценка, Сумма, КлючСвязи)
	
	Отбор = Новый Структура;
	Отбор.Вставить("КлючСвязи", КлючСвязи);
	Отбор.Вставить("СкидкаНаценка", СкидкаНаценка);
	Отбор.Вставить("Сумма", Сумма);
	
	Строки = ТаблицаСкидок.НайтиСтроки(Отбор);
	Если Строки.Количество() > 0 Тогда
		Возврат;
	КонецЕсли;
	
	НоваяСтрока = ТаблицаСкидок.Добавить();
	НоваяСтрока.СкидкаНаценка = СкидкаНаценка;
	НоваяСтрока.КлючСвязи = КлючСвязи;
	НоваяСтрока.Сумма = Сумма;
	НоваяСтрока.ЗначениеСкидкиНаценки = Сумма;
	
КонецПроцедуры

Процедура maxma_ОчиститьПараметрыРасчета(ПараметрыРасчета)
	
	ПараметрыРасчета.Акции.Очистить();
	ПараметрыРасчета.Скидки.Очистить();
	
КонецПроцедуры

Процедура maxma_СохранитьРасчеты(ПараметрыРасчета, Номенклатура, ДанныеРасчета)
	
	Скидка = Новый Структура;
	Скидка.Вставить("Номенклатура", Номенклатура);
	Скидка.Вставить("АвтоСкидка",   ДанныеРасчета.discounts.auto);
	Скидка.Вставить("Бонусы",       ДанныеРасчета.discounts.bonuses);
	Скидка.Вставить("РучнаяСкидка", ДанныеРасчета.discounts.manual);
	Скидка.Вставить("Акция",        ДанныеРасчета.discounts.offer);
	Скидка.Вставить("Промокод",     ДанныеРасчета.discounts.promocode);
	Скидка.Вставить("Округление",   ДанныеРасчета.discounts.rounding);
	
	ПараметрыРасчета.Скидки.Добавить(Скидка);
	
	Если ДанныеРасчета.Свойство("offers") Тогда
		
		Для каждого Стр Из ДанныеРасчета.offers Цикл
			
			Акция = Новый Структура;
			Акция.Вставить("Номенклатура",      Номенклатура);
			Акция.Вставить("НаименованиеАкции", Стр.name);
			Акция.Вставить("Сумма",             Стр.amount);
			
			ПараметрыРасчета.Акции.Добавить(Акция);
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры