#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

&ИзменениеИКонтроль("Печать")
Процедура спВистерияПечать(Знач МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)

РежимПечати = "";
	Если ПараметрыПечати.Свойство("РежимПечати") Тогда
		РежимПечати = ПараметрыПечати.РежимПечати;
	КонецЕсли;

	Если РежимПечати = "ЭтикеткаКодМаркировкиИСМП" Тогда

		ПечатьЭтикетокИСМПУНФ.ПриПечати(КоллекцияПечатныхФорм, ПараметрыПечати, ОбъектыПечати);
		Возврат;

	КонецЕсли;

	// Вытаскиваем данные для печати в массив объектов для совместимости обработки с Розницей 
	//МассивОбъектов = Новый Массив;
	//МассивОбъектов.Добавить(ПараметрыПечати.ДанныеПечати[0]);

	НастройкиПечати = НовыеНастройкиПечати();
	СоответствиеШаблонов = Новый Соответствие;

	НастройкиПечати.ОбязательныеПоля.Добавить("КоличествоЦенниковДляПечати");
	НастройкиПечати.ОбязательныеПоля.Добавить("КоличествоЭтикетокДляПечати");
	НастройкиПечати.ОбязательныеПоля.Добавить("ШаблонЦенникаДляПечати");
	НастройкиПечати.ОбязательныеПоля.Добавить("ШаблонЭтикеткиДляПечати");
	НастройкиПечати.ОбязательныеПоля.Добавить("Номенклатура");

	НастройкиПечати.ИмяМакетаСхемыКомпоновкиДанных = "ПоляШаблона";

	ШаблонТаблицыТоваров = ТаблицаЗначенийТоваров();
	ТаблицаТовары = ПреобразоватьМассивВТаблицуЗначений(ПараметрыПечати.Товары, ШаблонТаблицыТоваров);

	// Собираем используемые поля из шаблонов.
	ТаблицаШаблонов = ТаблицаТовары.Скопировать(Новый Структура("Выбран", Истина), "ШаблонЭтикетки, ШаблонЦенника");
    #Вставка 
		ЗнакиУхода = ПолучитьЗнакиУхода(ТаблицаТовары.ВыгрузитьКолонку("Номенклатура"));
	#КонецВставки
	ПечататьЭтикетки = Истина;
	ПечататьЦенники = Истина;
	Если КоллекцияПечатныхФорм.Количество() > 0 Тогда
		ПечататьЦенники = КоллекцияПечатныхФорм[0].ИмяМакета = "Ценники";
		ПечататьЭтикетки = КоллекцияПечатныхФорм[0].ИмяМакета = "Этикетки";
	КонецЕсли;

	Для Каждого СтрокаТЧ Из ТаблицаШаблонов Цикл

		Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) И ПечататьЭтикетки
			И СтрокаТЧ.ШаблонЭтикетки.ТипШаблона <> Перечисления.ТипыШаблонов.ЭтикеткаЦенникПринтераЭтикеток Тогда
			СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЭтикетки);
		КонецЕсли;

		Если ЗначениеЗаполнено(СтрокаТЧ.ШаблонЦенника) И ПечататьЦенники
			И СтрокаТЧ.ШаблонЦенника.ТипШаблона <> Перечисления.ТипыШаблонов.ЭтикеткаЦенникПринтераЭтикеток Тогда
			СоответствиеШаблонов.Вставить(СтрокаТЧ.ШаблонЦенника);
		КонецЕсли;

	КонецЦикла;

	// Заполняем коллекцию обязательных полей и формируем соответствие шаблонов.
	Для Каждого КлючИЗначение Из СоответствиеШаблонов Цикл
		СтруктураШаблона = КлючИЗначение.Ключ.Шаблон.Получить();

		// Структура шаблонов.
		НастройкиПечати.СоответствиеШаблоновИСтруктурыШаблонов.Вставить(КлючИЗначение.Ключ, СтруктураШаблона);

		// Добавляем в массив обязательных полей поля, присутствующие в печатной форме ценника.
		Если СтруктураШаблона <> Неопределено
			И ТипЗнч(СтруктураШаблона) = Тип("Структура")
			И СтруктураШаблона.Свойство("ПараметрыШаблона") Тогда
			Для Каждого Элемент Из СтруктураШаблона.ПараметрыШаблона Цикл
				НастройкиПечати.ОбязательныеПоля.Добавить(Элемент.Ключ);
			КонецЦикла;
		КонецЕсли;

	КонецЦикла;

	// Подготовка исходных данных.
	ИсходныеДанные = ТаблицаТовары.Скопировать(
	Новый Структура("Выбран", Истина),
	КолонкиИсходныхДанных());
	Для Каждого СтрокаТЧ Из ИсходныеДанные Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) Тогда
			СтрокаТЧ.КоличествоЭтикеток = 0;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШаблонЦенника) Тогда
			СтрокаТЧ.КоличествоЦенников = 0;
		КонецЕсли;
	КонецЦикла;
	Если ПараметрыПечати.Режим = "ПечатьЭтикеток" Тогда
		ИсходныеДанные.ЗаполнитьЗначения(0, "КоличествоЦенников");
	КонецЕсли;
	Если ПараметрыПечати.Режим = "ПечатьЦенников" Тогда
		ИсходныеДанные.ЗаполнитьЗначения(0, "КоличествоЭтикеток");
	КонецЕсли;

	НастройкиПечати.ПараметрыДанных.Вставить("ВидЦен", ПараметрыПечати.ВидЦен);
	НастройкиПечати.ПараметрыДанных.Вставить("Организация", ПараметрыПечати.Организация);
	НастройкиПечати.ПараметрыДанных.Вставить("ЦеныПоВидуЦены", ПараметрыПечати.ЦеныПоВидуЦены);
	НастройкиПечати.ПараметрыДанных.Вставить("ЦеныНаДату", ПараметрыПечати.ЦеныНаДату);
	НастройкиПечати.ПараметрыДанных.Вставить("ЦеныНаДатуАкционные", ПараметрыПечати.ЦеныНаДатуАкционные);
	НастройкиПечати.ПараметрыДанных.Вставить("ВидЦенАкционный", ПараметрыПечати.ВидЦенАкционные);
    #Вставка 
		НастройкиПечати.ПараметрыДанных.Вставить("ЗнакиУхода", ЗнакиУхода);
	#КонецВставки

	НастройкиПечати.ИсходныеДанные = ИсходныеДанные;

	// Вывод табличных документов в коллекцию.
	КоллекцияПечатныхФормВнутренняя = СформироватьПечатныеФормыЭтикетокИЦенников(НастройкиПечати, ПечататьЭтикетки, ПечататьЦенники);
	КоллекцияПечатныхФорм.Очистить();
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФормВнутренняя Цикл

		НоваяФорма = КоллекцияПечатныхФорм.Добавить();
		НоваяФорма.ИмяМакета = ПечатнаяФорма.ИмяМакета;
		НоваяФорма.СинонимМакета = ПечатнаяФорма.ИмяМакета;
		НоваяФорма.ИмяВРЕГ = ВРег(ПечатнаяФорма.ИмяМакета);
		НоваяФорма.ТабличныйДокумент = ПечатнаяФорма.ТабличныйДокумент;
		НоваяФорма.Экземпляров = 1;

	КонецЦикла;

КонецПроцедуры

//<<<--- Tnext Козык К.А. 16.06.2026 - адаптация под новый релиз 3.0.13.357
&ИзменениеИКонтроль("СформироватьПечатныеФормыЭтикетокИЦенников")
Функция спВистерияСформироватьПечатныеФормыЭтикетокИЦенников(НастройкиПечати, ПечататьЭтикетки, ПечататьЦенники)

	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;

	// Подготовка коллекции печатных форм.
	КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяКолонкиКоличество");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяКолонкиШаблон");
	КоллекцияПечатныхФорм.Колонки.Добавить("Шаблон");

	Для Каждого КлючИЗначение Из НастройкиПечати.СоответствиеШаблоновИСтруктурыШаблонов Цикл
		Если ПечататьЭтикетки Тогда
			ПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
			ПечатнаяФорма.ИмяМакета            = "Этикетка"+КлючИЗначение.Ключ;
			ПечатнаяФорма.ИмяКолонкиКоличество = "КоличествоЭтикетокДляПечати";
			ПечатнаяФорма.ИмяКолонкиШаблон     = "ШаблонЭтикеткиДляПечати";
			ПечатнаяФорма.Шаблон = КлючИЗначение.Ключ;
		КонецЕсли;

		Если ПечататьЦенники Тогда
			ПечатнаяФорма = КоллекцияПечатныхФорм.Добавить();
			ПечатнаяФорма.ИмяМакета            = "Ценник" + КлючИЗначение.Ключ;
			ПечатнаяФорма.ИмяКолонкиКоличество = "КоличествоЦенниковДляПечати";
			ПечатнаяФорма.ИмяКолонкиШаблон     = "ШаблонЦенникаДляПечати";
			ПечатнаяФорма.Шаблон = КлючИЗначение.Ключ;
		КонецЕсли;
	КонецЦикла;

	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл

		НомерКолонки = 0;
		НомерРяда = 0;

		ОписаниеШаблона = Новый Структура;
		ОписаниеШаблона.Вставить("Шаблон", ПечатнаяФорма.Шаблон);
		ОписаниеШаблона.Вставить("ИмяКолонкиШаблон", ПечатнаяФорма.ИмяКолонкиШаблон);
		ДанныеДляПечати = ПодготовитьДанныеДляПечати(НастройкиПечати, ОписаниеШаблона);

		ВременныйТабличныйДокумент = Новый ТабличныйДокумент;

		Для Каждого СтрокаТовары Из ДанныеДляПечати.ТаблицаТоваров Цикл
			
			#Вставка
			МассивСтрокКоличество = 0;
			МассивСтрок = Новый Массив;
			Если НастройкиПечати.ПараметрыДанных.Свойство("ЗнакиУхода") И ТипЗнч(НастройкиПечати.ПараметрыДанных.ЗнакиУхода) = тип("ТаблицаЗначений") Тогда 
				ПараметрыПоиска = Новый Структура("Номенклатура", СтрокаТовары.Номенклатура);
				МассивСтрок = НастройкиПечати.ПараметрыДанных.ЗнакиУхода.НайтиСтроки(ПараметрыПоиска);
				МассивСтрокКоличество = МассивСтрок.Количество();  
			КонецЕсли;
			#КонецВставки

			Если СтрокаТовары[ПечатнаяФорма.ИмяКолонкиКоличество] > 0
				И СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон] = ПечатнаяФорма.Шаблон Тогда

				ОписаниеШаблона = НастройкиПечати.СоответствиеШаблоновИСтруктурыШаблонов.Получить(СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон]);

				Если ПечатнаяФорма.ТабличныйДокумент = Неопределено Тогда

					Если СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон].ТипШаблона <> Перечисления.ТипыШаблонов.ЭтикеткаЦенникПринтераЭтикеток Тогда
						ПечатнаяФорма.ТабличныйДокумент = Новый ТабличныйДокумент;
					Иначе
						ПечатнаяФорма.ТабличныйДокумент = Новый Структура;
						ПечатнаяФорма.ТабличныйДокумент.Вставить("XML", ОписаниеШаблона.XMLОписаниеМакета);
						ПечатнаяФорма.ТабличныйДокумент.Вставить("Этикетки", Новый Массив);
					КонецЕсли;

				КонецЕсли;

				Если ОписаниеШаблона <> Неопределено 
					И ТипЗнч(ОписаниеШаблона) = Тип("Структура")
					И СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон].ТипШаблона <> Перечисления.ТипыШаблонов.ЭтикеткаЦенникПринтераЭтикеток Тогда

					Область = ОписаниеШаблона.МакетЭтикетки.ПолучитьОбласть(ОписаниеШаблона.ИмяОбластиПечати);

					ПроверятьВывод = Ложь;

					Для ИндексСтроки = 1 По Область.ВысотаТаблицы Цикл

						Если Область.Область("R" + Формат(ИндексСтроки, "ЧН=0; ЧГ=0")).АвтоВысотаСтроки Тогда
							ПроверятьВывод = Истина;
							Прервать;
						КонецЕсли;

					КонецЦикла;

					// Применение настроек табличного документа.
					ЗаполнитьЗначенияСвойств(ПечатнаяФорма.ТабличныйДокумент, ОписаниеШаблона.МакетЭтикетки, ,
						"ОбластьПечати, ТекущаяОбласть");

					// Установка параметров печати
					ПечатнаяФорма.ТабличныйДокумент.КлючПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Этикетки_и_ценники" + ПечатнаяФорма.ИмяМакета;
					#Вставка 
						Старт = 0;
					#КонецВставки
					Для каждого ПараметрШаблона Из ОписаниеШаблона.ПараметрыШаблона Цикл
						Если ЕстьРеквизитОбъекта(Область.Параметры, ПараметрШаблона.Значение) Тогда
							#Вставка
							Если Лев(ПараметрШаблона.Ключ,10) = "ЗнакиУхода" И Старт < МассивСтрокКоличество Тогда
								Значение = МассивСтрок[Старт].ЗнакиУхода;
								Область.Параметры[ПараметрШаблона.Значение] = Значение.НаименованиеПолное;
								Старт = Старт + 1;	
							Иначе
							#КонецВставки
								НаименованиеКолонки = ДанныеДляПечати.СоответствиеПолейСКДКолонкамТаблицыТоваров.Получить(Справочники.ХранилищеШаблонов.ИмяПоляВШаблоне(ПараметрШаблона.Ключ));
								Если НаименованиеКолонки <> Неопределено Тогда
									// служебные поля
									Область.Параметры[ПараметрШаблона.Значение] = СтрокаТовары[НаименованиеКолонки];
								КонецЕсли; 
							#Вставка
							КонецЕсли;
							#КонецВставки
						КонецЕсли;
						
					КонецЦикла; 
					
					#Вставка 
					Старт = 0;
					
					Для каждого Рисунок Из Область.Рисунки Цикл
						Если Лев(Рисунок.Имя,10) = "ЗнакиУхода" И Старт < МассивСтрокКоличество Тогда
							Значение = МассивСтрок[Старт].ПрисоединенныйФайл;
							Если ТипЗнч(Значение) = Тип("СправочникСсылка.спЗнакиУходаПрисоединенныеФайлы") Тогда
								
								Если Значение.ТипХраненияФайла = ПредопределенноеЗначение("Перечисление.ТипыХраненияФайлов.ВИнформационнойБазе") Тогда
									АдресХранилища = РаботаСФайлами.ДанныеФайла(Значение).СсылкаНаДвоичныеДанныеФайла;
									Значение = ПолучитьИзВременногоХранилища(АдресХранилища);
								КонецЕсли;
								
								Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда	
									Рисунок.Картинка = Новый Картинка(Значение); 
								КонецЕсли; 
							КонецЕсли;
							Старт = Старт + 1; 
						ИначеЕсли Лев(Рисунок.Имя,10) = "ЗнакиУхода" Тогда 
							//Рисунок.ВыводитьНаПечать = Ложь; 
							Рисунок.Картинка = Новый Картинка;
						КонецЕсли;
					КонецЦикла;
					#КонецВставки

                    
					Для каждого Рисунок Из Область.Рисунки Цикл
						Если Лев(Рисунок.Имя,8) = ИмяПараметраШтрихкод() ИЛИ Лев(Рисунок.Имя,13) = ИмяПараметраШтрихкодСправкиБ() Тогда

							Если Лев(Рисунок.Имя,8) = ИмяПараметраШтрихкод() Тогда
								ЗначениеШтрихкода = СтрокаТовары[ДанныеДляПечати.СоответствиеПолейСКДКолонкамТаблицыТоваров.Получить(ИмяПараметраШтрихкод())];
							ИначеЕсли Лев(Рисунок.Имя,13) = ИмяПараметраШтрихкодСправкиБ() Тогда
								ЗначениеШтрихкода = СтрокаТовары[ДанныеДляПечати.СоответствиеПолейСКДКолонкамТаблицыТоваров.Получить(ИмяПараметраШтрихкодСправкиБ())];
							КонецЕсли;

							Если ЗначениеЗаполнено(ЗначениеШтрихкода) Тогда

								ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
								ПараметрыШтрихкода.Ширина = Окр(Рисунок.Ширина / КоличествоМиллиметровВПикселе);
								ПараметрыШтрихкода.Высота = Окр(Рисунок.Высота / КоличествоМиллиметровВПикселе);
								ПараметрыШтрихкода.Масштабировать = Истина;

								Если ОписаниеШаблона.ТипКода = 16 Тогда
									МинСторона = Мин(ПараметрыШтрихкода.Ширина, ПараметрыШтрихкода.Высота);
									ПараметрыШтрихкода.Ширина = МинСторона;
									ПараметрыШтрихкода.Высота = МинСторона;
								КонецЕсли;

								Если ОписаниеШаблона.Свойство("УровеньКоррекцииQR") Тогда
									ПараметрыШтрихкода.УровеньКоррекцииQR = ОписаниеШаблона.УровеньКоррекцииQR;
								Иначе
									ПараметрыШтрихкода.УровеньКоррекцииQR = 0;
								КонецЕсли;

								ПараметрыШтрихкода.Штрихкод = ЗначениеШтрихкода;
								ПараметрыШтрихкода.ТипКода = ОписаниеШаблона.ТипКода;

								Если ОписаниеШаблона.Свойство("ОтображатьТекст") Тогда
									ПараметрыШтрихкода.ОтображатьТекст = ОписаниеШаблона.ОтображатьТекст;
								Иначе
									ПараметрыШтрихкода.ОтображатьТекст = Истина;
								КонецЕсли;

								Если ОписаниеШаблона.Свойство("РазмерШрифта") Тогда
									ПараметрыШтрихкода.РазмерШрифта = ОписаниеШаблона.РазмерШрифта;
								КонецЕсли;

								Если ОписаниеШаблона.Свойство("УголПоворота") Тогда
									ПараметрыШтрихкода.УголПоворота = ОписаниеШаблона.УголПоворота;
								КонецЕсли;

								ПараметрыШтрихкода.ТипВходныхДанных = 0;

								ИзображениеШтрихкода = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
								Если ИзображениеШтрихкода.Картинка <> Неопределено Тогда
									Рисунок.Картинка = ИзображениеШтрихкода.Картинка;
								КонецЕсли;

							КонецЕсли;
							
						КонецЕсли;
					КонецЦикла;

					Для Инд = 1 По СтрокаТовары[ПечатнаяФорма.ИмяКолонкиКоличество] Цикл // Цикл по количеству экземпляров.

						МассивОбластей = Новый Массив;
						МассивОбластей.Добавить(Область);

						НомерКолонки = НомерКолонки + 1;

						Если ПроверятьВывод Тогда

							Если НомерКолонки = 1 Тогда
								Если Не ВременныйТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда
									ПечатнаяФорма.ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
									НомерРяда = 0;
									ВременныйТабличныйДокумент.Очистить();
								КонецЕсли;
							Иначе
								Если Не ВременныйТабличныйДокумент.ПроверитьПрисоединение(МассивОбластей) Тогда
									ПечатнаяФорма.ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
									НомерРяда    = 0;
									ВременныйТабличныйДокумент.Очистить();
								КонецЕсли;
							КонецЕсли;

						КонецЕсли;

						Если НомерКолонки = 1 Тогда

							НомерРяда = НомерРяда + 1;

							ПечатнаяФорма.ТабличныйДокумент.Вывести(Область);
							ВременныйТабличныйДокумент.Вывести(Область);

						Иначе

							ПечатнаяФорма.ТабличныйДокумент.Присоединить(Область);
							ВременныйТабличныйДокумент.Присоединить(Область);

						КонецЕсли;

						Если НомерКолонки = ОписаниеШаблона.КоличествоПоГоризонтали И НомерРяда = ОписаниеШаблона.КоличествоПоВертикали Тогда

							НомерРяда    = 0;
							НомерКолонки = 0;

							ПечатнаяФорма.ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
							ВременныйТабличныйДокумент.Очистить();

						ИначеЕсли НомерКолонки = ОписаниеШаблона.КоличествоПоГоризонтали Тогда

							НомерКолонки = 0;

						КонецЕсли;

					КонецЦикла; // Цикл по количеству экземпляров.

				КонецЕсли;

				Если ОписаниеШаблона <> Неопределено 
					И ТипЗнч(ОписаниеШаблона) = Тип("Структура")
					И СтрокаТовары[ПечатнаяФорма.ИмяКолонкиШаблон].ТипШаблона = Перечисления.ТипыШаблонов.ЭтикеткаЦенникПринтераЭтикеток Тогда
					Поля = Новый Массив;
					Для Каждого ТекПоле Из ОписаниеШаблона.ПоляМакета Цикл			
						Если ТекПоле.ТипЗаполнения = "Parameter" Тогда							
							НовоеПоле = Новый Структура;
							НовоеПоле.Вставить("ИмяПоля", ТекПоле.Наименование);							
							Попытка
								Значение = СтрокаТовары[ТекПоле.Значение];
							Исключение
								Значение = "";
							КонецПопытки;
							Если Значение = "" Тогда
								Попытка
									ИмяКолонки = ДанныеДляПечати.СоответствиеПолейСКДКолонкамТаблицыТоваров.Получить(ТекПоле.Значение);
									Значение = СтрокаТовары[ИмяКолонки];
								Исключение
									Значение = "";
								КонецПопытки;
							КонецЕсли;
							Если ТипЗнч(Значение) = Тип("ХранилищеЗначения") Тогда								
								Значение = Значение.Получить();								
								Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
									Значение = Base64Строка(Значение);
								Иначе
									Значение = Строка(Значение);
								КонецЕсли;								
							ИначеЕсли ТипЗнч(Значение) = Тип("СправочникСсылка.НоменклатураПрисоединенныеФайлы") Тогда

								Если Значение.ТипХраненияФайла = ПредопределенноеЗначение("Перечисление.ТипыХраненияФайлов.ВИнформационнойБазе") Тогда
									АдресХранилища = РаботаСФайлами.ДанныеФайла(Значение).СсылкаНаДвоичныеДанныеФайла;
									Значение = ПолучитьИзВременногоХранилища(АдресХранилища);
								КонецЕсли;

								Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
									Значение = Base64Строка(Значение);
								Иначе
									Значение = Строка(Значение);
								КонецЕсли;

							КонецЕсли;							
							Если ЗначениеЗаполнено(Значение) Тогда
								НовоеПоле.Вставить("Значение", Значение);
							Иначе								
								Если ЗначениеЗаполнено(ТекПоле.ЗначениеПоУмолчанию) Тогда						
									НовоеПоле.Вставить("Значение", ТекПоле.ЗначениеПоУмолчанию);
								Иначе
									НовоеПоле.Вставить("Значение", "");
								КонецЕсли;								
							КонецЕсли;

							Поля.Добавить(НовоеПоле);

						КонецЕсли;

					КонецЦикла;
					НоваяЭтикетка = Новый Структура;
					НоваяЭтикетка.Вставить("Количество", СтрокаТовары[ПечатнаяФорма.ИмяКолонкиКоличество]);
					НоваяЭтикетка.Вставить("ЗначенияПолей", Поля);
					ПечатнаяФорма.ТабличныйДокумент.Этикетки.Добавить(НоваяЭтикетка);
				КонецЕсли;

			КонецЕсли;

		КонецЦикла; // Цикл по строкам таблицы товаров.

	КонецЦикла;

	МассивСтрокДляУдаления = Новый Массив;
	Для Каждого ПечатнаяФорма Из КоллекцияПечатныхФорм Цикл
		Если ПечатнаяФорма.ТабличныйДокумент = Неопределено Тогда
			МассивСтрокДляУдаления.Добавить(ПечатнаяФорма);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ПечатнаяФорма Из МассивСтрокДляУдаления Цикл
		КоллекцияПечатныхФорм.Удалить(ПечатнаяФорма);
	КонецЦикла;

	Возврат КоллекцияПечатныхФорм;

КонецФункции //--->>> Tnext Козык К.А. 16.06.2026

Функция ПолучитьЗнакиУхода(Номенклатура)
	Перем Результат;
	Если Не ТипЗнч(Номенклатура) = Тип("Массив") Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спЗнакиУходаПрисоединенныеФайлы.Ссылка КАК ПрисоединенныйФайл,
		|	спЗнакиУходаПрисоединенныеФайлы.ВладелецФайла КАК ЗнакиУхода
		|ПОМЕСТИТЬ ВТ_ЗначкУхода
		|ИЗ
		|	Справочник.спЗнакиУходаПрисоединенныеФайлы КАК спЗнакиУходаПрисоединенныеФайлы
		|ГДЕ
		|	спЗнакиУходаПрисоединенныеФайлы.ТипХраненияФайла <> ЗНАЧЕНИЕ(Перечисление.ТипыХраненияФайлов.ПустаяСсылка)
		|	И НЕ спЗнакиУходаПрисоединенныеФайлы.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	спЗнакиУходаВНоменклатуре.Номенклатура КАК Номенклатура,
		|	ВТ_ЗначкУхода.ЗнакиУхода КАК ЗнакиУхода,
		|	ВТ_ЗначкУхода.ПрисоединенныйФайл КАК ПрисоединенныйФайл
		|ИЗ
		|	ВТ_ЗначкУхода КАК ВТ_ЗначкУхода
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спЗнакиУходаВНоменклатуре КАК спЗнакиУходаВНоменклатуре
		|		ПО (спЗнакиУходаВНоменклатуре.ЗнакиУхода = ВТ_ЗначкУхода.ЗнакиУхода)
		|ГДЕ
		|	спЗнакиУходаВНоменклатуре.Номенклатура В(&Номенклатура)";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		  Результат = РезультатЗапроса.Выгрузить();
	КонецЕсли;
	
	Возврат Результат;
КонецФункции	

#КонецОбласти

#КонецЕсли
