
#Область ПрограммныйИнтерфейс

Функция ПрочитатьHTTPЗапрос(СтруктураЗапроса) Экспорт
	
	СписокОшибок = Новый Массив;
	НомерПломбы  = Неопределено;
	
	СтруктураЗапроса.Свойство("code", НомерПломбы);
	
	Если НомерПломбы = Неопределено Тогда
		СписокОшибок.Добавить(НСтр("ru = 'Не заполнен номер пломбы.'"));
		СтруктураОтвета = Новый Структура("Error", СтрСоединить(СписокОшибок, ", "));
	    Возврат СтрокаJSON(СтруктураОтвета);
	КонецЕсли;
	
	СтруктураОтвета = ПолучитДанныеПоНомеруПломбы(НомерПломбы);
	
	Возврат СтрокаJSON(СтруктураОтвета);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция JSONВСтруктуру(JSON, СписокОшибок) Экспорт
	
	Попытка
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(JSON);
		ДанныеJSON = ПрочитатьJSON(ЧтениеJSON,, "", ФорматДатыJSON.ISO);
	Исключение
		ДанныеJSON = Неопределено;
		СписокОшибок.Добавить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Возврат ДанныеJSON;
	
КонецФункции

Функция СтрокаJSON(Данные) Экспорт
	
	СериализацияJSON = Новый НастройкиСериализацииJSON;
	СериализацияJSON.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.УниверсальнаяДата;
	СериализацияJSON.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписьJSON  = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные, СериализацияJSON); 
	ЗапросСтрока = ЗаписьJSON.Закрыть();
	
	Возврат ЗапросСтрока;
	
КонецФункции

Функция ПолучитДанныеПоНомеруПломбы(НомерПломбы)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спПломбы.Объект КАК Объект,
		|	спПломбы.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_Пломбы
		|ИЗ
		|	РегистрСведений.спПломбы КАК спПломбы
		|ГДЕ
		|	спПломбы.НомерПломбы = &НомерПломбы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_Пломбы.Объект.ПоложениеЗаказаПокупателя = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
		|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.ЗаказПокупателя
		|		ИНАЧЕ ПеремещениеЗапасовЗапасы.ЗаказПокупателя
		|	КОНЕЦ КАК ЗаказПокупателя,
		|	ПеремещениеЗапасовЗапасы.Ссылка.ДокументОснование КАК ДокументОснование,
		|	ВТ_Пломбы.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_ДокументыОснования
		|ИЗ
		|	ВТ_Пломбы КАК ВТ_Пломбы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПеремещениеЗапасов.Запасы КАК ПеремещениеЗапасовЗапасы
		|		ПО ВТ_Пломбы.Объект = ПеремещениеЗапасовЗапасы.Ссылка
		|			И ВТ_Пломбы.Номенклатура = ПеремещениеЗапасовЗапасы.Номенклатура
		|ГДЕ
		|	ВТ_Пломбы.Объект ССЫЛКА Документ.ПеремещениеЗапасов
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВТ_Пломбы.Объект.ПоложениеЗаказаПокупателя = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
		|			ТОГДА ПеремещениеЗапасовЗапасы.Ссылка.ЗаказПокупателя
		|		ИНАЧЕ ПеремещениеЗапасовЗапасы.ЗаказПокупателя
		|	КОНЕЦ,
		|	ПеремещениеЗапасовЗапасы.Ссылка.ДокументОснование,
		|	ВТ_Пломбы.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_Пломбы.Объект.ПоложениеЗаказаПокупателя = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
		|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Заказ
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Заказ
		|	КОНЕЦ,
		|	РасходнаяНакладнаяЗапасы.Ссылка.ДокументОснование,
		|	ВТ_Пломбы.Номенклатура
		|ИЗ
		|	ВТ_Пломбы КАК ВТ_Пломбы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
		|		ПО ВТ_Пломбы.Объект = РасходнаяНакладнаяЗапасы.Ссылка
		|			И ВТ_Пломбы.Номенклатура = РасходнаяНакладнаяЗапасы.Номенклатура
		|ГДЕ
		|	ВТ_Пломбы.Объект ССЫЛКА Документ.РасходнаяНакладная
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяЗапасы.Ссылка.ДокументОснование,
		|	ВЫБОР
		|		КОГДА ВТ_Пломбы.Объект.ПоложениеЗаказаПокупателя = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
		|			ТОГДА РасходнаяНакладнаяЗапасы.Ссылка.Заказ
		|		ИНАЧЕ РасходнаяНакладнаяЗапасы.Заказ
		|	КОНЕЦ,
		|	ВТ_Пломбы.Номенклатура
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ВТ_Пломбы.Объект.ПоложениеЗаказаПокупателя = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
		|			ТОГДА ЧекККМЗапасы.Ссылка.Заказ
		|		ИНАЧЕ ЧекККМЗапасы.Заказ
		|	КОНЕЦ,
		|	ЧекККМЗапасы.Ссылка.КассоваяСмена,
		|	ВТ_Пломбы.Номенклатура
		|ИЗ
		|	ВТ_Пломбы КАК ВТ_Пломбы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЧекККМ.Запасы КАК ЧекККМЗапасы
		|		ПО ВТ_Пломбы.Объект = ЧекККМЗапасы.Ссылка
		|			И ВТ_Пломбы.Номенклатура = ЧекККМЗапасы.Номенклатура
		|ГДЕ
		|	ВТ_Пломбы.Объект ССЫЛКА Документ.ЧекККМ
		|
		|СГРУППИРОВАТЬ ПО
		|	ВЫБОР
		|		КОГДА ВТ_Пломбы.Объект.ПоложениеЗаказаПокупателя = ЗНАЧЕНИЕ(Перечисление.ПоложениеРеквизитаНаФорме.ВШапке)
		|			ТОГДА ЧекККМЗапасы.Ссылка.Заказ
		|		ИНАЧЕ ЧекККМЗапасы.Заказ
		|	КОНЕЦ,
		|	ЧекККМЗапасы.Ссылка.КассоваяСмена,
		|	ВТ_Пломбы.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДокументыОснования.ЗаказПокупателя КАК ЗаказПокупателя,
		|	ВТ_ДокументыОснования.ЗаказПокупателя.АдресДоставки КАК ЗаказПокупателяАдресДоставки,
		|	ВТ_ДокументыОснования.ДокументОснование КАК ДокументОснование,
		|	ВТ_ДокументыОснования.ДокументОснование.АдресДоставки КАК ДокументОснованиеАдресДоставки,
		|	ВТ_ДокументыОснования.Номенклатура КАК Номенклатура,
		|	ВТ_ДокументыОснования.Номенклатура.Артикул КАК Артикул
		|ИЗ
		|	ВТ_ДокументыОснования КАК ВТ_ДокументыОснования";
	
	Запрос.УстановитьПараметр("НомерПломбы", НомерПломбы);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураОтвета = Новый Структура;
	
	ВыборкаДетали = РезультатЗапроса.Выбрать();
	Если ВыборкаДетали.Следующий() Тогда 
		
		Если ЗначениеЗаполнено(ВыборкаДетали.ЗаказПокупателя) Тогда
			ДокументОснование = ВыборкаДетали.ЗаказПокупателя;
			АдресДоставки = ВыборкаДетали.ЗаказПокупателяАдресДоставки;
		ИначеЕсли ЗначениеЗаполнено(ВыборкаДетали.ДокументОснование) Тогда
			ДокументОснование = ВыборкаДетали.ДокументОснование;
			АдресДоставки = ВыборкаДетали.ДокументОснованиеАдресДоставки;
		Иначе
			СтруктураОтвета.Вставить("Error", СтрШаблон(НСтр("ru = 'Не определен документ основание по номеру пломбы ""%1"".'"), НомерПломбы));
			Возврат СтруктураОтвета;
		КонецЕсли;
		
		СтруктураОтвета.Вставить("type", 	ДокументОснование.Метаданные().Синоним);
		СтруктураОтвета.Вставить("date", 	ДокументОснование.Дата);
		СтруктураОтвета.Вставить("number", 	ДокументОснование.Номер);
		СтруктураОтвета.Вставить("article", ВыборкаДетали.Артикул);
		СтруктураОтвета.Вставить("address", АдресДоставки);
		
	Иначе	
		СтруктураОтвета.Вставить("Error", СтрШаблон(НСтр("ru = 'Данные о пломбе ""%1"" отсутствуют.'"), НомерПломбы));
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ЗначениеКонстанты(ИмяКонстанты) Экспорт
	
	Возврат спУправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты(ИмяКонстанты);
	
КонецФункции

#КонецОбласти