
#Область ПрограммныйИнтерфейс   

// Процедура - Установить состояние сообщения
// 
// Параметры:
//  ИдентификаторСобытия - УникальныйИдентификатор - индентификатор события.
//  НовоеСостояние - ПеречислениеСсылка.спСтатусыСообщений - новое состояние сообщения.
//  Задержка - Число - Секунд задержки
//  ОписаниеОшибки - Строка - Описание ошибки
//  ИндексПотока - Число - индекс потока
//  ЗаписыватьСтатус - Булево - запись статуса в регистр состояние сообщений
//  Направление - ПеречислениеСсылка.спТипыИнтеграции - получение или отправка сообщений
//  КлассИд - Строка - Класс ид
//  ИдентификаторСообщения - УникальныйИдентификатор - Идентификатор сообщения
//  ДопСвойства - Структура - Дополнительные свойства, добавляемые в ACK
Процедура УстановитьСостояниеСообщения(ИдентификаторСобытия, НовоеСостояние, Задержка = 0, ОписаниеДанных = Неопределено, 
										ИндексПотока = 0, ЗаписыватьСтатус = Истина, Направление = Неопределено, 
										КлассИд = "", ИдентификаторСообщения = Неопределено, ДопСвойства = Неопределено) Экспорт
										
	ОписаниеДанных = Новый ХранилищеЗначения(ОписаниеДанных, Новый СжатиеДанных(9));									
	
	ИдСообщения = Неопределено;
	ИдСобытия = ?(ТипЗнч(ИдентификаторСобытия) = Тип("Строка"), Новый УникальныйИдентификатор(ИдентификаторСобытия), ИдентификаторСобытия);

	ИдОтбор = ИдСобытия;

	Если Не ИдентификаторСообщения = Неопределено Тогда
		ИдСообщения = ?(ТипЗнч(ИдентификаторСообщения) = Тип("Строка"), Новый УникальныйИдентификатор(ИдентификаторСообщения), ИдентификаторСообщения);
		ИдОтбор = ИдСообщения;
	КонецЕсли;

	Если ЗаписыватьСтатус Тогда
				
		Набор = РегистрыСведений.спСостояниеСообщений.СоздатьНаборЗаписей();
		Набор.ДополнительныеСвойства.Вставить("СШПНеобрабатывать", Истина);		
		Набор.Очистить();
		
		Если ИдентификаторСообщения = Неопределено Тогда
			Набор.Отбор.ИдентификаторСобытия.Установить(ИдОтбор, Истина);
		Иначе
			Набор.Отбор.ИдентификаторСообщения.Установить(ИдОтбор, Истина);					
		КонецЕсли;
		
		Набор.Прочитать();
		
		Если Набор.Количество() > 0 Тогда
			
			Для Каждого СтрокаНабора Из Набор Цикл
				
				СтрокаНабора.ДатаИзменения = ТекущаяДатаСеанса();
				СтрокаНабора.СтатусСообщения = НовоеСостояние;
				СтрокаНабора.Задержка = Задержка;
				СтрокаНабора.ЗадержкаЧисло = спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(СтрокаНабора.ДатаИзменения, СтрокаНабора.Задержка);
				СтрокаНабора.ИндексПотока = ИндексПотока; 
				
			КонецЦикла;
			
			Набор.Записать(Истина);
			
		Иначе
		
			Набор.Очистить();
		
			ТекЗапись = Набор.Добавить();
			ТекЗапись.ДатаИзменения = ТекущаяДатаСеанса();
			ТекЗапись.ИдентификаторСообщения = ?(ИдентификаторСообщения = Неопределено, ИдСобытия, ИдСообщения);
			ТекЗапись.ИдентификаторСобытия = ИдСобытия;
			ТекЗапись.СтатусСообщения = НовоеСостояние;
			ТекЗапись.Задержка = Задержка;
			ТекЗапись.ЗадержкаЧисло = спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(ТекЗапись.ДатаИзменения, ТекЗапись.Задержка);
			ТекЗапись.ОписаниеДанных = ОписаниеДанных; 
			ТекЗапись.ИндексПотока = ИндексПотока;
			
			Набор.Записать(Истина);	
			
		КонецЕсли;
		
	КонецЕсли;

	Попытка
	
		//сшпСистемныеСообщения.ОтправитьСостояниеСообщения(Строка(ИдОтбор), НовоеСостояние, ОписаниеОшибки, Задержка, Направление, КлассИд, ДопСвойства);
		
	Исключение
		
		ЗаписьЖурналаРегистрации("Отправка состояния сообщения", УровеньЖурналаРегистрации.Ошибка, , , ОбработкаОшибок.КраткоеПредставлениеОшибки(ОписаниеОшибки()));
		
	КонецПопытки;

КонецПроцедуры

// Процедура - Удалить сообщение
//
// Параметры:
//  ТипОчереди - ПеречислениеСсылка.спТипыОчередей - тип очереди, указывает очередь из которой необходимо удалить сообщение. 
//  Идентификатор - УникальныйИдентификатор - индентификатор сообщения.
//
Процедура УдалитьСообщение(ТипОчереди, Идентификатор) Экспорт
	
	Если ТипОчереди = Перечисления.спТипыОчередей.Исходящая Тогда
		
		ТекЗапись = РегистрыСведений.спОчередьИсходящихСообщений.СоздатьМенеджерЗаписи();
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	ТекЗапись.ИдентификаторСобытия = Идентификатор;
	ТекЗапись.Удалить();
	
	текЗапись = спКэшируемыеФункцииВызовСервера.ПолучитьОбъектНабораЗаписейСостоянияСообщений();
	ТекЗапись.Отбор.ИдентификаторСобытия.Установить(Идентификатор);
	
	ТекЗапись.Прочитать();
	
	Если ТекЗапись.Выбран() Тогда
		ТекЗапись.Очистить();
		ТекЗапись.Записать();
	КонецЕсли;
	
КонецПроцедуры	

// Процедура - Поместить в очередь исходящих
// 
// Параметры:
//  ТипОбъекта - Строка - Имя объекта по которому произошло событие
//  ОбъектСобщения - Строка, ДвоичныеДанные - сериализованное представление объекта на момент события
//  Формат - ПеречислениеСсылка.спФорматыСообщений - формат в котором выполняется сериализация сообщения
//  Метод - ПеречислениеСсылка.спМетодХранения - метод сохранения объекта события
//  ПомещатьВХранилищеЗначения - Булево - помещение в хранилище значений
//  ЭтоУдаление - Булево - удаление
//  СсылкаНаОбъект - ЛюбаяСсылка - Ссылка на объект помещаемый в очередь
//Процедура ПоместитьВОчередьИсходящих(ТипОбъекта, ОбъектСобщения, Формат = Неопределено, Метод = Неопределено, СпособПередачи  = Неопределено, 
//													ПомещатьВХранилищеЗначения = Истина, ЭтоУдаление = Ложь, СсылкаНаОбъект = Неопределено, ИнициаторОтправкиСсылкаНаОбъект = Неопределено) Экспорт
Процедура ПоместитьВОчередьИсходящих(ЗаписьВОчередьИсходящих) Экспорт 
	Формат = Неопределено;
	Метод = Неопределено; 
	СпособПередачи = Неопределено;
	ПомещатьВХранилищеЗначения = Истина;
	ЭтоУдаление = Ложь;  
	СсылкаНаОбъект = Неопределено;
	ИдентификаторСообщения = Неопределено;
	ИнициаторОтправкиСсылкаНаОбъект = Неопределено;
	
	ТипОбъекта = Неопределено;
	ОбъектСобщения = Неопределено;
	
	Если ТипЗнч(ЗаписьВОчередьИсходящих) <> Тип("Структура") Тогда  
		Возврат;
	КонецЕсли;  
	
	ЗаписьВОчередьИсходящих.Свойство("ТипОбъекта", ТипОбъекта);
	ЗаписьВОчередьИсходящих.Свойство("ОбъектСобщения", ОбъектСобщения);
	ЗаписьВОчередьИсходящих.Свойство("Формат", Формат);
	ЗаписьВОчередьИсходящих.Свойство("Метод", Метод);
	ЗаписьВОчередьИсходящих.Свойство("СпособПередачи", СпособПередачи);
	ЗаписьВОчередьИсходящих.Свойство("ПомещатьВХранилищеЗначения", ПомещатьВХранилищеЗначения);
	ЗаписьВОчередьИсходящих.Свойство("ЭтоУдаление", ЭтоУдаление);   
	ЗаписьВОчередьИсходящих.Свойство("СсылкаНаОбъект", СсылкаНаОбъект); 
	ЗаписьВОчередьИсходящих.Свойство("ИдентификаторСообщения", ИдентификаторСообщения); 
	ЗаписьВОчередьИсходящих.Свойство("ИнициаторОтправкиСсылкаНаОбъект", ИнициаторОтправкиСсылкаНаОбъект);
	
	Если ТипОбъекта = Неопределено ИЛИ ОбъектСобщения = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторСообщения = Неопределено Тогда 												
		ИдентификаторСообщения = Новый УникальныйИдентификатор();
	КонецЕсли;
	//УстановитьСостояниеСообщения(ИдентификаторСообщения, Перечисления.спСтатусыСообщений.Новое, , , , , Перечисления.спТипыИнтеграции.Исходящая);
	
	Набор = РегистрыСведений.спОчередьИсходящихСообщений.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторСобытия.Установить(ИдентификаторСообщения, Истина);
	Набор.ДополнительныеСвойства.Вставить("СШПНеобрабатывать", Истина);
	
	ТекЗапись = Набор.Добавить();
	ТекЗапись.ИдентификаторСобытия = ИдентификаторСообщения;
	
	Если ПомещатьВХранилищеЗначения Тогда	 
		ТекЗапись.Хранилище = Новый ХранилищеЗначения(ОбъектСобщения);		
	КонецЕсли;
	
	ТекЗапись.МетодХранения = ?(Метод = Неопределено, Перечисления.спМетодХранения.Сериализация, Метод);
	ТекЗапись.ДатаРегистрации = ТекущаяДатаСеанса();
	ТекЗапись.ОбъектСобытия = ТипОбъекта;
	ТекЗапись.ФорматСообщения = ?(Формат = Неопределено, Перечисления.спФорматыСообщений.JSON, Формат);
	ТекЗапись.ЭтоУдаление = ЭтоУдаление;
	ТекЗапись.СсылкаНаОбъект = СсылкаНаОбъект; 
	ТекЗапись.ИнициаторОтправкиСсылкаНаОбъект = ИнициаторОтправкиСсылкаНаОбъект;
	ТекЗапись.СпособПередачи = ?(СпособПередачи = Неопределено, Перечисления.спСпособПередачи.FTP, СпособПередачи);
	
	Если ЭтоУдаление Тогда 
		Набор.ДополнительныеСвойства.Вставить("ЭтоУдаление");	
	КонецЕсли;
	
 	Набор.Записать(Истина);
	
КонецПроцедуры

// Процедура - Поместить в очередь входящихщих
// 
// Параметры: ТипОбъекта - Строка - Имя объекта по которому произошло событие
//  ОбъектСобщения - Строка, ДвоичныеДанные - сериализованное представление объекта на момент события
//  Формат - ПеречислениеСсылка.спФорматыСообщений - формат в котором выполняется сериализация сообщения
//  Метод - ПеречислениеСсылка.спМетодХранения - метод сохранения объекта события
//  ПомещатьВХранилищеЗначения - Булево - помещение в хранилище значений
//  ЭтоУдаление - Булево - удаление
//  СсылкаНаОбъект - ЛюбаяСсылка - Ссылка на объект помещаемый в очередь
Процедура ПоместитьВОчередьВходящихщих(ОбъектСобщения, Формат = Неопределено, Метод = Неопределено, СпособПередачи = Неопределено, ПомещатьВХранилищеЗначения = Истина, ЭтоУдаление = Ложь, СсылкаНаОбъект = Неопределено) Экспорт
		
	Если Перечисления["спТипыОчередей"][ОбъектСобщения.Параметры.Получить("ТипОчереди")] = Перечисления.спТипыОчередей.Отправки Тогда 
		
		
		РазмерСообщения = ОбъектСобщения.Параметры.Получить("РазмерСообщения");    
		Если РазмерСообщения = Неопределено Тогда 
			РазмерБуфера = 1024;
		Иначе
			РазмерБуфера = Число(РазмерСообщения);
		КонецЕсли;
		
		Тело = Новый БуферДвоичныхДанных(0);
		Буфер = Новый БуферДвоичныхДанных(РазмерБуфера);
		Поток = ОбъектСобщения.ПолучитьТелоКакПоток();
		Пока Истина Цикл
			Прочитано = Поток.Прочитать(Буфер, 0, РазмерБуфера);
			Если Прочитано > 0 Тогда
				Тело = Тело.Соединить(Буфер);	
			КонецЕсли;
			Если Прочитано < РазмерБуфера Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ВходящееСообщение = ПолучитьСтрокуИзБуфераДвоичныхДанных(Тело);
		
		ИдентификаторСообщения = Новый УникальныйИдентификатор();
		УстановитьСостояниеСообщения(ИдентификаторСообщения, Перечисления.спСтатусыСообщений.Новое, , , , , Перечисления.спТипыИнтеграции.Входящая);
		
		Набор = РегистрыСведений.спОчередьВходящихСообщений.СоздатьНаборЗаписей();
		Набор.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения, Истина);
		Набор.ДополнительныеСвойства.Вставить("СШПНеобрабатывать", Истина);
		
		ТекЗапись = Набор.Добавить();
		ТекЗапись.ИдентификаторСообщения = ИдентификаторСообщения;
		
		ТекЗапись.Хранилище = Новый ХранилищеЗначения(ВходящееСообщение);
		
		ТекЗапись.МетодХранения = ?(Метод = Неопределено, Перечисления.спМетодХранения.Сериализация, Метод);
		ТекЗапись.ДатаРегистрации = ТекущаяДатаСеанса();
		ТекЗапись.ФорматСообщения = ?(Формат = Неопределено, Перечисления.спФорматыСообщений.JSON, Формат);
		ТекЗапись.СпособПередачи  = ?(СпособПередачи = Неопределено, Перечисления.спСпособПередачи.HTTP, СпособПередачи);
		ТекЗапись.ЭтоУдаление = ЭтоУдаление;
		
		ТекЗапись.ИдентификаторСообщенияБазыОтправителя = Новый УникальныйИдентификатор(ОбъектСобщения.Параметры.Получить("ИдентификаторСообщенияБазыОтправителя")); 
		Попытка
			ТекЗапись.ДатаРегистрацииСообщенияБазыОтправителя = СтроковыеФункцииКлиентСервер.СтрокаВДату(ОбъектСобщения.Параметры.Получить("ДатаРегистрацииСообщенияБазыОтправителя"), ЧастиДаты.ДатаВремя)
		Исключение
			ТекЗапись.ДатаРегистрацииСообщенияБазыОтправителя = СтрокаВДатуВремя(ОбъектСобщения.Параметры.Получить("ДатаРегистрацииСообщенияБазыОтправителя"));
		КонецПопытки;
		
		
		Если ЭтоУдаление Тогда
			
			Набор.ДополнительныеСвойства.Вставить("ЭтоУдаление");
			
		КонецЕсли;
		
		Набор.Записать(Истина);
		
		
		спСервисИнтеграцииВызовСервера.ОтправитьСообщение("", Новый УникальныйИдентификатор(ОбъектСобщения.Параметры.Получить("ИдентификаторСообщенияБазыОтправителя")), 
		ОбъектСобщения.Параметры.Получить("ДатаРегистрацииСообщенияБазыОтправителя"), Перечисления.спТипыОчередей.Системная);
		
	Иначе  
		
		УстановитьСостояниеСообщения(Новый УникальныйИдентификатор(ОбъектСобщения.Параметры.Получить("ИдентификаторСообщенияБазыОтправителя")), Перечисления.спСтатусыСообщений.ОтправкаПодтверждена, , , , , Перечисления.спТипыИнтеграции.Исходящая);		
	КонецЕсли;
	
КонецПроцедуры  

// Поместить ссылка на объект в очередь входящихщих.
// 
// Параметры:
//  ИдентификаторСообщения - Неопределено - Идентификатор сообщения
//  СсылкаНаОбъект - Неопределено - Ссылка на объект
Процедура ПоместитьСсылкаНаОбъектВОчередьВходящихщих(ИдентификаторСообщения = Неопределено, СсылкаНаОбъект = Неопределено) Экспорт
	
	
	Набор = РегистрыСведений.спОчередьВходящихСообщений.СоздатьНаборЗаписей();
	Набор.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения, Истина);
	Набор.ДополнительныеСвойства.Вставить("СШПНеобрабатывать", Истина);
	
	
	
	Если ИдентификаторСообщения <> Неопределено Тогда
		Набор.Отбор.ИдентификаторСообщения.Установить(ИдентификаторСообщения, Истина);
		
		Набор.Прочитать();
		
		Если Набор.Количество() > 0 Тогда
			
			Для Каждого СтрокаНабора Из Набор Цикл	
				СтрокаНабора.СсылкаНаОбъект = СсылкаНаОбъект;
			КонецЦикла;
			
			Набор.Записать(Истина);
			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры 

// Процедура - Поместить в отправленные сообщения
// 
// Параметры:
//  СсылкаНаОбъект - ЛюбаяСсылка - Ссылка на объект помещаемый в очередь
Процедура ПоместитьВОтправленныеСообщения(СсылкаНаОбъект, СпособПередачи) Экспорт

	НаборЗаписей = РегистрыСведений.спОтправленныеСообщения.СоздатьНаборЗаписей();  			
	НаборЗаписей.Отбор.СсылкаНаОбъект.Установить(СсылкаНаОбъект);
	НаборЗаписей.Отбор.СпособПередачи.Установить(СпособПередачи);
	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
		НовыйНабор = НаборЗаписей.Добавить();
		НовыйНабор.СсылкаНаОбъект 		= СсылкаНаОбъект;
		НовыйНабор.СпособПередачи 		= СпособПередачи;
		НовыйНабор.ДатаРегистрации 		= ТекущаяДатаСеанса();
		НовыйНабор.ДатаЧисло 			= спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(НовыйНабор.ДатаРегистрации, 0);
	ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
		НовыйНабор = НаборЗаписей[0];
		НовыйНабор.СсылкаНаОбъект 		= СсылкаНаОбъект;
		НовыйНабор.СпособПередачи 		= СпособПередачи;
		НовыйНабор.ДатаРегистрации 		= ТекущаяДатаСеанса();
		НовыйНабор.ДатаЧисло 			= спОбщегоНазначенияВызовСервера.ПеревестиДатуВЧисло(НовыйНабор.ДатаРегистрации, 0);
	КонецЕсли;
	НаборЗаписей.Записать();	
КонецПроцедуры

Процедура ЗаписьВЖурнал(ЗаписьЖурнала) Экспорт	
	Ошибка   	 				= Ложь;
	Статус 						= Неопределено; 
	Идентификатор 				= Неопределено;
	СпособПередачи 				= Неопределено;  
	Ссылка 						= Неопределено;  
	ИмяФайла 					= Неопределено; 
	ТипИнтеграции				= Перечисления.спТипыИнтеграции.Исходящая; 
	ЗаписатьВОчередьИсходящих   = Истина;
	ОписаниеДанных               = Неопределено;
	
	Если ТипЗнч(ЗаписьЖурнала) <> Тип("Структура") Тогда  
		Возврат;
	КонецЕсли;  
	
	Если ЗаписьЖурнала.Свойство("Ошибка") Тогда 
		 Ошибка = ЗаписьЖурнала.Ошибка;
	КонецЕсли;
	ЗаписьЖурнала.Свойство("СтатусСообщения", Статус);
	ЗаписьЖурнала.Свойство("Идентификатор", Идентификатор);
	ЗаписьЖурнала.Свойство("СпособПередачи", СпособПередачи);
	ЗаписьЖурнала.Свойство("Ссылка", Ссылка);
	ЗаписьЖурнала.Свойство("ИмяФайла", ИмяФайла); 
	ЗаписьЖурнала.Свойство("ТипИнтеграции", ТипИнтеграции);
	Если ЗаписьЖурнала.Свойство("ЗаписатьВОчередьИсходящих") Тогда 
		 ЗаписатьВОчередьИсходящих = ЗаписьЖурнала.ЗаписатьВОчередьИсходящих;
	КонецЕсли;
    ЗаписьЖурнала.Свойство("ОписаниеДанных", ОписаниеДанных);
	
	Если Ошибка Тогда  
		Если НЕ Идентификатор = Неопределено Тогда 
			спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(Идентификатор, 
				?(Статус <> Перечисления.спСтатусыСообщений.ПустаяСсылка(), Статус, Перечисления.спСтатусыСообщений.ОшибкаОтправки)
				, ,ОписаниеДанных , , , Перечисления.спТипыИнтеграции.Исходящая);   
		КонецЕсли;
			
		ИнформацияОбОшибке = ИнформацияОбОшибке(); 
		Если СпособПередачи = Перечисления.спСпособПередачи.FTP Тогда 
		ЗаписьЖурналаРегистрации("Отправка исходящего сообщения по sFTP", УровеньЖурналаРегистрации.Ошибка
									, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));  
		ИначеЕсли СпособПередачи = Перечисления.спСпособПередачи.SOAP Тогда 
		ЗаписьЖурналаРегистрации("Отправка исходящего сообщения Web-серверу", УровеньЖурналаРегистрации.Ошибка
									, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));  
		КонецЕсли;
	Иначе    
		Если НЕ Идентификатор = Неопределено Тогда 
			спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(Идентификатор, Статус
																		, ,ОписаниеДанных , , , ТипИнтеграции);
		КонецЕсли; 
																																
		Если СпособПередачи <> Неопределено И Ссылка <> Неопределено Тогда 	
			// ++ Терлецкий АВ 25.01.15
			Если СпособПередачи = Перечисления.спСпособПередачи.FTP И Статус = Перечисления.спСтатусыСообщений.ОтправкаПодтверждена Тогда  
				спРаботаСДаннымиВызовСервера.ПоместитьВОтправленныеСообщения(Ссылка, СпособПередачи); 
			ИначеЕсли СпособПередачи = Перечисления.спСпособПередачи.SOAP И Статус = Перечисления.спСтатусыСообщений.Отправлено Тогда
				спРаботаСДаннымиВызовСервера.ПоместитьВОтправленныеСообщения(Ссылка, СпособПередачи); 
			КонецЕсли;
			// -- Терлецкий АВ 25.01.15
		КонецЕсли;
		
		Если НЕ Идентификатор = Неопределено И НЕ ИмяФайла = Неопределено И ЗаписатьВОчередьИсходящих Тогда 
			спОбслуживаниеОчередей.ЗаписатьВОчередьИсходящих(Идентификатор, , ИмяФайла);
		КонецЕсли;

	КонецЕсли;	
КонецПроцедуры 
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция СтрокаВДатуВремя(ДатаСтрока, ФорматДаты = "dd.mm.yyyy hh:nn:ss")
   Если ЗначениеЗаполнено(ДатаСтрока) Тогда
       Попытка
           Годы = СтрНайти(ФорматДаты, "yyyy");
           Годы = ?(Годы = 0 , 0, Число(Сред(ДатаСтрока, Годы, 4)));
           Если Годы = 0 Тогда
               Годы = СтрНайти(ФорматДаты, "yy");
               Годы = ?(Годы = 0 , 0, Число("20" + Сред(ДатаСтрока, Годы, 2)));
           КонецЕсли;
           Месяцы     = СтрНайти(ФорматДаты, "mm");
           Дни     = СтрНайти(ФорматДаты, "dd");
           Часы     = СтрНайти(ФорматДаты, "hh");
           Минуты     = СтрНайти(ФорматДаты, "nn");
           Секунды = СтрНайти(ФорматДаты, "ss");

           Возврат Дата(
               ?(Годы         = 0, 1, Годы),
               ?(Месяцы     = 0, 1, Число(Сред(ДатаСтрока, Месяцы, 2))),
               ?(Дни         = 0, 1, Число(Сред(ДатаСтрока, Дни, 2))),
               ?(Часы         = 0, 0, Число(Сред(ДатаСтрока, Часы, 2))),
               ?(Минуты     = 0, 0, Число(Сред(ДатаСтрока, Минуты, 2))),
               ?(Секунды     = 0, 0, Число(Сред(ДатаСтрока, Секунды, 2)))
           )
	   Исключение
		   ТекстСообщения = СтрШаблон("Ошибка преобразования строки: %1 в дату по формату %2", ДатаСтрока, ФорматДаты);
		   ВызватьИсключение ТекстСообщения;

       КонецПопытки;
   Иначе
       Возврат Дата(1,1,1);
   КонецЕсли;

КонецФункции

#КонецОбласти

