
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьОбъектыПечати();
	
	// ПодключаемоеОборудование
	ИспользоватьПодключаемоеОборудование = УправлениеНебольшойФирмойПовтИсп.ИспользоватьПодключаемоеОборудование();
	Если ИспользоватьПодключаемоеОборудование Тогда
		ТипыОборудования = МенеджерОборудованияКлиентСервер.ПараметрыТипыОборудования();
		ТипыОборудования.СканерШтрихкода = Истина;
		МенеджерОборудования.ПриСозданииНаСервере(ЭтотОбъект, ТипыОборудования);
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
	ЗаголовокКнопкиПечать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// ПодключаемоеОборудование
	Если Источник = "ПодключаемоеОборудование" И ВводДоступен() Тогда
		
		Если ИмяСобытия = "ScanData" Тогда  
			
			Если ТипЗнч(Параметр) <> Тип("Массив") Тогда
				Параметр = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Параметр);
			КонецЕсли;
			
			Данные = МенеджерОборудованияУНФКлиент.ПреобразоватьДанныеСоСканераВМассив(Параметр);
			ПолученШтрихкод(Данные); 
			
		КонецЕсли;  
		
	КонецЕсли;
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ШтрихкодыУпаковокПометкаПриИзменении(Элемент)
	
	ЗаголовокКнопкиПечать();
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ПомеченныеСтроки = ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("Пометка", Истина));
	
	Если ПомеченныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Нет данных для печати кодов маркировки'"));
		Возврат;
	КонецЕсли;
	
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка"));
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("КоличествоЭкземпеляров", 1);
	ПараметрыПечати.Вставить("СтруктураДанных", ДанныеПечатиСЗаполненнымШаблоном());
	ПараметрыПечати.Вставить("АдресВХранилище", "");
	ПараметрыПечати.Вставить("КаждаяЭтикеткаНаНовомЛисте", Истина);
	ПараметрыПечати.Вставить("СразуНаПринтер", СразуНаПринтер);
	ПараметрыПечати.Вставить("РежимПечати", "ЭтикеткаКодМаркировкиИСМП");
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ПечатьЭтикетокИЦенников",
		"ЭтикеткаКодМаркировкиИСМП",
		ПараметрКоманды,
		ВладелецФормы,
		ПараметрыПечати);
	
	Если ЗакрыватьПослеПечати Тогда
		Закрыть();
	КонецЕсли;
		
КонецПроцедуры

// Процедура - обработчик команды командной панели формы.
&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	ОчиститьСообщения();
	ТекШтрихкод = "";
	
	ОбработкаЗавершения = Новый ОписаниеОповещения(
		"ПоискПоШтрихкодуЗавершение",
		ЭтотОбъект, 
		Новый Структура("ТекШтрихкод", ТекШтрихкод));

	#Если МобильныйКлиент Тогда
	ОткрытьФорму("ОбщаяФорма.ФормаПоискаПоШтрихкоду", , , , , , ОбработкаЗавершения);
	#Иначе
	ПоказатьВводЗначения(ОбработкаЗавершения, ТекШтрихкод, НСтр("ru = 'Введите штрихкод'"));
	#КонецЕсли
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область УправлениеФормой

&НаКлиенте
Процедура ЗаголовокКнопкиПечать()
	
	Шаблон = НСтр("ru = 'Печать (%1)'");
	ПомеченныеСтроки = ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("Пометка", Истина));
	Элементы.ФормаПечать.Заголовок = СтрШаблон(Шаблон, ПомеченныеСтроки.Количество());
	
КонецПроцедуры

#КонецОбласти

#Область Печать

&НаСервере
Процедура ИнициализироватьОбъектыПечати()
	
	ОбъектыПечати = ?(Параметры.Свойство("ОбъектыПечати") = Истина, Параметры.ОбъектыПечати, Новый Массив);
	// ПечатьВыбранных = ОбъектыПечати.Количество() > 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ШтрихкодыУпаковокТоваров.Ссылка КАК ШтрихкодУпаковки,
		|	ШтрихкодыУпаковокТоваров.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	ШтрихкодыУпаковокТоваров.Номенклатура КАК Номенклатура,
		|	ИСТИНА КАК Пометка
		|ПОМЕСТИТЬ ВТ_ДанныеПечати
		|ИЗ
		|	Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
		|ГДЕ
		|	ШтрихкодыУпаковокТоваров.Ссылка В(&ОбъектыПечати)
		|	И &ПечатьВыбранных
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМАкцизныеМарки.ШтрихкодУпаковки,
		|	ЧекККМАкцизныеМарки.ШтрихкодУпаковки.ЗначениеШтрихкода,
		|	ЧекККМАкцизныеМарки.ШтрихкодУпаковки.Номенклатура,
		|	ИСТИНА
		|ИЗ
		|	Документ.ЧекККМ.АкцизныеМарки КАК ЧекККМАкцизныеМарки
		|ГДЕ
		|	ЧекККМАкцизныеМарки.Ссылка В(&ОбъектыПечати)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМВозвратАкцизныеМарки.ШтрихкодУпаковки,
		|	ЧекККМВозвратАкцизныеМарки.ШтрихкодУпаковки.ЗначениеШтрихкода,
		|	ЧекККМВозвратАкцизныеМарки.ШтрихкодУпаковки.Номенклатура,
		|	ИСТИНА
		|ИЗ
		|	Документ.ЧекККМВозврат.АкцизныеМарки КАК ЧекККМВозвратАкцизныеМарки
		|ГДЕ
		|	ЧекККМВозвратАкцизныеМарки.Ссылка В(&ОбъектыПечати)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеПечати.ШтрихкодУпаковки КАК ШтрихкодУпаковки,
		|	ВТ_ДанныеПечати.ЗначениеШтрихкода КАК ЗначениеШтрихкода,
		|	ВТ_ДанныеПечати.Номенклатура КАК Номенклатура,
		|	ВТ_ДанныеПечати.Пометка КАК Пометка,
		|	МАКСИМУМ(ЕСТЬNULL(ПулКодовМаркировкиСУЗ.ПолныйКодМаркировки, """")) КАК ПолныйКодМаркировки
		|ИЗ
		|	ВТ_ДанныеПечати КАК ВТ_ДанныеПечати
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПулКодовМаркировкиСУЗ КАК ПулКодовМаркировкиСУЗ
		|		ПО ВТ_ДанныеПечати.ЗначениеШтрихкода = ПулКодовМаркировкиСУЗ.КодМаркировки
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_ДанныеПечати.Пометка,
		|	ВТ_ДанныеПечати.ЗначениеШтрихкода,
		|	ВТ_ДанныеПечати.ШтрихкодУпаковки,
		|	ВТ_ДанныеПечати.Номенклатура";
	
	Запрос.УстановитьПараметр("ОбъектыПечати", ОбъектыПечати);
	Запрос.УстановитьПараметр("ПечатьВыбранных", ПечатьВыбранных);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаРезультат = РезультатЗапроса.Выгрузить(); 
	
	Для каждого СтрокаРезультат Из ТаблицаРезультат Цикл
		
		Если СтрокаРезультат.ПолныйКодМаркировки <> "" Тогда
			
			НайденныеСтроки = ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", СтрокаРезультат.ШтрихкодУпаковки));
			
			Если НайденныеСтроки.Количество() = 0 Тогда
				
				НоваяСтрока = ШтрихкодыУпаковок.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультат);
				
			КонецЕсли;
			
		Иначе
			
			Шаблон = НСтр("ru = 'Код маркировки ""%1"" не записан в пул'");
			ТекстСообщения = СтрШаблон(Шаблон, СтрокаРезультат.ЗначениеШтрихкода);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЗакрыватьПослеПечати = ШтрихкодыУпаковок.Количество() > 0;
	
	Элементы.ШтрихкодыУпаковок.Видимость = ЗакрыватьПослеПечати;
	
КонецПроцедуры

&НаСервере
Функция ДанныеПечатиСЗаполненнымШаблоном()
	
	МассивКодовМаркировки = Новый Массив;
	
	ПомеченныеСтроки = ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("Пометка", Истина));
	
	Для каждого ПомеченнаяСтрока Из ПомеченныеСтроки Цикл
		
		МассивКодовМаркировки.Добавить(ПомеченнаяСтрока.ШтрихкодУпаковки);
		
	КонецЦикла;

	ОбъектыПечати = ПечатьЭтикетокИСМПВызовСервера.ДанныеДляПечатиШтрихкодовУпаковокИСМП(
		УникальныйИдентификатор,
		МассивКодовМаркировки,
		Новый Массив());
		
	Для Каждого СтрокаПечати Из ОбъектыПечати Цикл
		СтрокаПечати.ШаблонЭтикетки = ШаблонЭтикетки;
	КонецЦикла;

	ДанныеПечати = Новый Структура("РежимПечати, ОбъектыПечати", "Выборочно", ОбъектыПечати);
	
	Возврат ДанныеПечати;
	
КонецФункции

#КонецОбласти

#Область ПоискПоШтрихкоду

// Процедура обрабатывает полученные штрихкоды.
//
&НаКлиенте
Процедура ПолученШтрихкод(ДанныеШтрихкодов) Экспорт
	
	Для каждого ДанныеШтрихкода Из ДанныеШтрихкодов Цикл
		
		ДополнительныеДанныеПоШтрихкоду = ШтрихкодированиеУНФКлиент.ДополнительныеДанныеПоШтрихкоду(ДанныеШтрихкода.Штрихкод, "");
		Если ДополнительныеДанныеПоШтрихкоду.ЭтоКодМаркировки Тогда
			ОбработатьКодМаркировки(ДанныеШтрихкода);
		Иначе 
			ПоказатьПредупреждение(, НСтр("ru = 'Отсканированный штрихкод не является кодом маркировки.'"));
		КонецЕсли;
		
		Прервать;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьКодМаркировки(ИсходныеДанные)
	
	КодМаркировки 	= ИсходныеДанные.Штрихкод;
	Результат 		= НоваяСтруктураОбработки(КодМаркировки);
	
	ОбработатьКодМаркировкиНаСервере(Результат);
	
	Если Результат.ЕстьВПулеКодовМаркировки Тогда
		
		НайденныеСтроки = ШтрихкодыУпаковок.НайтиСтроки(Новый Структура("ШтрихкодУпаковки", Результат.ШтрихкодУпаковки));
		 
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			НоваяСтрока = ШтрихкодыУпаковок.Добавить();
			НоваяСтрока.ШтрихкодУпаковки = Результат.ШтрихкодУпаковки;
			НоваяСтрока.ЗначениеШтрихкода = Результат.КодМаркировки;
			НоваяСтрока.Номенклатура = Результат.Номенклатура;
			НоваяСтрока.Пометка = Истина;
			
		Иначе
			ПоказатьПредупреждение(, НСтр("ru = 'Код маркировки уже отсканирован.'"));
		КонецЕсли;
		
	ИначеЕсли ЗначениеЗаполнено(Результат.ШтрихкодУпаковки) Тогда
		
		Шаблон = НСтр("ru = 'Код маркировки ""%1"" не записан в пул'");
		ТекстСообщения = СтрШаблон(Шаблон, КодМаркировки);
		ПоказатьПредупреждение(, ТекстСообщения);
		
	Иначе
		
		Шаблон = НСтр("ru = 'Код маркировки ""%1"" не найден в информацонной базе.'");
		ТекстСообщения = СтрШаблон(Шаблон, КодМаркировки);
		ПоказатьПредупреждение(, ТекстСообщения);
		
	КонецЕсли;
	
	ЗаголовокКнопкиПечать();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НоваяСтруктураОбработки(КодМаркировки) 
	
	ШтрихкодBase64 = ШтрихкодированиеОбщегоНазначенияИСКлиентСервер.ШтрихкодВBase64(КодМаркировки);
	КодМаркировки = ОбщегоНазначенияКлиентСервер.ЗаменитьНедопустимыеСимволыXML(КодМаркировки, "");
	
	СтруктураОбработки = Новый Структура;
	СтруктураОбработки.Вставить("КодМаркировки", КодМаркировки); 
	СтруктураОбработки.Вставить("ШтрихкодBase64", ШтрихкодBase64); 
	СтруктураОбработки.Вставить("Организация", ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка"));
	СтруктураОбработки.Вставить("ПроверятьДублиКодовМаркировки", "НеПроверять");
	СтруктураОбработки.Вставить("ЕстьВПулеКодовМаркировки", Ложь);
	СтруктураОбработки.Вставить("ШтрихкодУпаковки", ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка"));
	СтруктураОбработки.Вставить("Номенклатура", ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	
	Возврат СтруктураОбработки;
	
КонецФункции

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ТекШтрихкод = ?(Результат = Неопределено, СокрЛП(ДополнительныеПараметры.ТекШтрихкод), СокрЛП(Результат));
	
	Если НЕ ПустаяСтрока(ТекШтрихкод) Тогда 
		ДанныеШтрихкода = Новый Структура("Штрихкод, Количество", ТекШтрихкод, 1);
		ПолученШтрихкод(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеШтрихкода));
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ОбработатьКодМаркировкиНаСервере(РезультатОбработки)
	
	КодМаркировки 				= РезультатОбработки.КодМаркировки; 
	ДанныеРазбора 				= ДанныеРазбораКодаМаркировки(КодМаркировки);
	ДанныеУпаковки 				= Справочники.ШтрихкодыУпаковокТоваров.ПолучитьДанныеУпаковкиПоЗначениюШтрихкода(ДанныеРазбора.НормализованныйКодМаркировки);
	
	Если ДанныеУпаковки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеВПулеСУЗ 				= РегистрыСведений.ПулКодовМаркировкиСУЗ.ДанныеКодовМаркировки(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеРазбора.НормализованныйКодМаркировки)); 
    ЕстьВПулеКодовМаркировки 	= ДанныеВПулеСУЗ.Количество() > 0;
	ДанныеШтрихкода 			= ШтрихкодированиеОбщегоНазначенияИС.НоваяСтруктураОбработкиШтрихкода(ДанныеРазбора.НормализованныйКодМаркировки);
	
	ДанныеШтрихкода.Вставить("ШтрихкодBase64", РезультатОбработки.ШтрихкодBase64);
	ДанныеШтрихкода.Вставить("ШтрихкодУпаковки", ?(ДанныеУпаковки = Неопределено, Справочники.ШтрихкодыУпаковокТоваров.ПустаяСсылка(),ДанныеУпаковки.Ссылка));
	ДанныеШтрихкода.Вставить("ЕстьВПулеКодовМаркировки", ЕстьВПулеКодовМаркировки);
	ДанныеШтрихкода.Вставить("ПолныйКодМаркировки", "");
	ДанныеШтрихкода.Вставить("ВидУпаковки", ?(ЗначениеЗаполнено(ДанныеРазбора.ВидУпаковки), ДанныеРазбора.ВидУпаковки, Перечисления.ВидыУпаковокИС.Потребительская)); //  
	
	РезультатОбработки.Организация = Справочники.Организации.ОрганизацияПоУмолчанию();
	РезультатОбработки.ПроверятьДублиКодовМаркировки = "Проверять";
	
	ДанныеЗаписи = СтруктураЗаписиВПул();
	ЗаполнитьЗначенияСвойств(ДанныеЗаписи, ДанныеУпаковки); 
	ДанныеЗаписи.Вставить("ВидПродукции", ?(ЗначениеЗаполнено(ДанныеРазбора.ВидыПродукции),
		ДанныеРазбора.ВидыПродукции[0], ИнтеграцияИСПовтИсп.ВидПродукцииПоНоменклатуре(ДанныеУпаковки.Номенклатура)));
	
	Если ДанныеРазбора.НормализованныйКодМаркировки = ДанныеРазбора.КодМаркировки Тогда
		РезультатОбработки.ЕстьВПулеКодовМаркировки = ДанныеШтрихкода.ЕстьВПулеКодовМаркировки;
		РезультатОбработки.ШтрихкодУпаковки = ДанныеШтрихкода.ШтрихкодУпаковки;
		Возврат;
	КонецЕсли;
	
	Если Не (ЕстьВПулеКодовМаркировки И ДанныеВПулеСУЗ[0].ПолныйКодМаркировки = РезультатОбработки.ШтрихкодBase64) Тогда
		
		РегистрыСведений.ПулКодовМаркировкиСУЗ.ЗаписатьДанныеКодаМаркировки(ДанныеШтрихкода, РезультатОбработки, ДанныеЗаписи);
		
	КонецЕсли;
	
	РезультатОбработки.ЕстьВПулеКодовМаркировки = ДанныеШтрихкода.ЕстьВПулеКодовМаркировки;
	РезультатОбработки.ШтрихкодУпаковки = ДанныеШтрихкода.ШтрихкодУпаковки;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеРазбораКодаМаркировки(КодМаркировки)

	ПримечаниеКРазборуШтрихкода                    = Неопределено;
	ПользовательскиеПараметрыРазбораКодаМаркировки = РазборКодаМаркировкиИССлужебныйКлиентСервер.ПользовательскиеПараметрыРазбораКодаМаркировки();
	ПользовательскиеПараметрыРазбораКодаМаркировки.ВалидироватьШтрихкодЛогистическойУпаковкиGS1128СОшибками = Истина;
	
	ДанныеРазбора = РазборКодаМаркировкиИССлужебный.РазобратьКодМаркировки(
	КодМаркировки, Неопределено, ПримечаниеКРазборуШтрихкода,, ПользовательскиеПараметрыРазбораКодаМаркировки);
	
	Возврат ДанныеРазбора;

КонецФункции

&НаСервереБезКонтекста
Функция СтруктураЗаписиВПул()
	
	ПоляЗаполнения = "Номенклатура, Характеристика, ВидПродукции";
	СтруктураЗаписиВПул = Новый Структура(ПоляЗаполнения);
	
	Возврат СтруктураЗаписиВПул;
	
КонецФункции

#КонецОбласти //ПоискПоШтрихкоду

#КонецОбласти