Функция ДобавитьЗаказССайтаPOST(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();
	
	Контекст = APIW_ОбщийМодульСервер.УведомитьОНачалеЗапроса(Запрос, "Заказ с сайта", СтрокаJSON);
	
	Попытка
		РезультатОперации = APIW_ОбщийМодульСервер.ЗагрузитьЗаказJSON(СтрокаJSON);
		Ответ.УстановитьТелоИзСтроки(РезультатОперации);
	Исключение
		APIW_ОбщийМодульСервер.УведомитьОбОшибкеЗапроса(Контекст, ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	APIW_ОбщийМодульСервер.УведомитьОбУспешномЗапросе(Контекст, РезультатОперации);
	
	Возврат Ответ;
	
КонецФункции

Функция ОбновитьТрекНомерЗаказаPOST(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();
	
	Контекст = APIW_ОбщийМодульСервер.УведомитьОНачалеЗапроса(Запрос, "Трек-номер заказа", СтрокаJSON);
	
	Попытка
		РезультатОперации = APIW_ОбщийМодульСервер.ДобавитьТрекНомерВЗаказ(СтрокаJSON);
		Ответ.УстановитьТелоИзСтроки(РезультатОперации);
	Исключение
		APIW_ОбщийМодульСервер.УведомитьОбОшибкеЗапроса(Контекст, ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	APIW_ОбщийМодульСервер.УведомитьОбУспешномЗапросе(Контекст, РезультатОперации);
	
	Возврат Ответ;
	
КонецФункции

Функция ОбновитьДанныеКлиентаPOST(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();
	
	Контекст = APIW_ОбщийМодульСервер.УведомитьОНачалеЗапроса(Запрос, "Данные клиента", СтрокаJSON);
	
	Попытка
		РезультатОперации = APIW_ОбщийМодульСервер.ОбновитьДанныеКлиента(СтрокаJSON);
		Ответ.УстановитьТелоИзСтроки(РезультатОперации);
	Исключение
		APIW_ОбщийМодульСервер.УведомитьОбОшибкеЗапроса(Контекст, ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	APIW_ОбщийМодульСервер.УведомитьОбУспешномЗапросе(Контекст, РезультатОперации);
	
	Возврат Ответ;
	
КонецФункции

Функция ДобавитьДокументОплатыPOST(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();
	
	Контекст = APIW_ОбщийМодульСервер.УведомитьОНачалеЗапроса(Запрос, "Оплата заказа", СтрокаJSON);
	
	Попытка
		РезультатОперации = APIW_ОбщийМодульСервер.ДобавитьДокументОплаты(СтрокаJSON);
		Ответ.УстановитьТелоИзСтроки(РезультатОперации);
	Исключение
		APIW_ОбщийМодульСервер.УведомитьОбОшибкеЗапроса(Контекст, ОписаниеОшибки());
		ВызватьИсключение;
	КонецПопытки;
	
	APIW_ОбщийМодульСервер.УведомитьОбУспешномЗапросе(Контекст, РезультатОперации);
	
	Возврат Ответ;
	
КонецФункции
