#Область ОбработчикиСобытийФормы

&НаСервере
Процедура спПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	спВидимостьЯчейкиВТЧ();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиЭлементовШапкиФормы

&НаКлиенте
Процедура спСтруктурнаяЕдиницаПриИзмененииПосле(Элемент)
	
	// { Иванов С.С. (TNext) - 05.03.2025 - Задача №1000 
	спВидимостьЯчейкиВТЧ();
	// }
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура спВидимостьЯчейкиВТЧ()
	
	Если спРаботаСЯчейкамиВызовСервера.ЕстьЯчейки(Объект.СтруктурнаяЕдиница) Тогда
		
		Элементы.Ячейка.Видимость = Ложь;
		Элементы.ЗапасыЯчейка.Видимость = Истина;
		
	Иначе
		
		Элементы.Ячейка.Видимость = Ложь;
		Элементы.ЗапасыЯчейка.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

#Область СканированиеШтрихкодов

&НаКлиенте
&Вместо("ПолученыШтрихкоды")
Процедура спПолученыШтрихкоды(ДанныеШтрихкодов)
	
	Модифицированность = Истина;
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли;
	
	Результат = спОбработатьШтрихкодыЯчеек(МассивШтрихкодов);
	
	Если Не Результат Тогда
		ПродолжитьВызов(ДанныеШтрихкодов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция спОбработатьШтрихкодыЯчеек(Штрихкоды) 
	
	ЭтоШтрихкодЯчейки = Ложь;
	ПрефиксЯчейки = спРаботаСЯчейкамиВызовСервера.ПрефиксШтрихкодаЯчейки();
	
	Для каждого СтрокаШтрихкода Из Штрихкоды Цикл
		
		Если СтрНачинаетсяС(СтрокаШтрихкода.Штрихкод, ПрефиксЯчейки) Тогда
			
			ЭтоШтрихкодЯчейки = Истина;
			
			АдресныйОтправитель = спРаботаСЯчейкамиВызовСервера.ЕстьЯчейки(Объект.СтруктурнаяЕдиница);
			
			Если АдресныйОтправитель Тогда
				
				Склад = Объект.СтруктурнаяЕдиница;
				ИмяКолонки = "Ячейка";
				
				спВыполнитьДействие(ИмяКолонки, Склад, СтрокаШтрихкода.Штрихкод);
			
			Иначе
				
				ТекстСообщения = НСтр("ru = 'Отсканирован штрихкод ячейки, но выбранный склад не является адресным.'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				Продолжить;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЭтоШтрихкодЯчейки;
	
КонецФункции

&НаКлиенте
Процедура спВыполнитьДействие(ИмяКолонки, Склад, Штрихкод)
	
	ДанныеСтроки = Элементы.Запасы.ТекущиеДанные;
	
	Если ДанныеСтроки = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки[ИмяКолонки] = спЯчейкаПоШтрихкоду(Штрихкод, Склад);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция спЯчейкаПоШтрихкоду(Штрихкод, Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	спШтрихкодыЯчеек.Ячейка КАК Ячейка
		|ИЗ
		|	РегистрСведений.спШтрихкодыЯчеек КАК спШтрихкодыЯчеек
		|ГДЕ
		|	спШтрихкодыЯчеек.Штрихкод = &Штрихкод
		|	И спШтрихкодыЯчеек.Ячейка.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("Владелец", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Ячейка;
		
	Иначе
		
		Возврат Справочники.Ячейки.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти