#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.ЗначениеКопирования.ИдентификаторЗаписи = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда
		Запись.ИдентификаторЗаписи = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Запись.НастройкаИнтеграции) Тогда
		СписокВыбора = Справочники.НастройкиИнтеграцииСИнтернетМагазином.ПолучитьДанныеВыбора(Новый Структура("СтрокаПоиска"));
		Запись.НастройкаИнтеграции = ?(СписокВыбора.Количество() = 0, Неопределено, СписокВыбора[0].Значение);
	КонецЕсли;
	
	Выборка = РегистрыСведений.СтруктураКаталогаИнтернетМагазина.Выбрать(Новый Структура("НастройкаИнтеграции", Запись.НастройкаИнтеграции));
	
	ТаблицаПредставлений = Новый ТаблицаЗначений;
	ТаблицаПредставлений.Колонки.Добавить("Идентификатор");
	ТаблицаПредставлений.Колонки.Добавить("РодительИдентификатор");
	ТаблицаПредставлений.Колонки.Добавить("ГруппаКаталога");
	
	Пока Выборка.Следующий() Цикл 
		Если Выборка.ЭтоГруппа = Ложь Тогда
			Продолжить;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Выборка.РодительИдентификатор) 
			И Элементы.ИдентификаторКаталога.СписокВыбора.НайтиПоЗначению(Выборка.ИдентификаторКаталога) = Неопределено Тогда 
			Элементы.ИдентификаторКаталога.СписокВыбора.Добавить(Выборка.ИдентификаторКаталога, Выборка.ГруппаКаталога); 
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.РодительИдентификатор) 
			И Элементы.ИдентификаторГруппыСайта.СписокВыбора.НайтиПоЗначению(Выборка.Идентификатор) = Неопределено Тогда 
			Строка = ТаблицаПредставлений.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, Выборка);
		КонецЕсли;
	КонецЦикла;
	
	Для каждого Строка Из ТаблицаПредставлений Цикл
		
		Группы = ТаблицаПредставлений.НайтиСтроки(Новый Структура("Идентификатор", Строка.РодительИдентификатор));  
		ЭлементыДерева = Новый Массив;
		Если Группы.Количество() > 0 Тогда
			ЭлементыДерева.Добавить(Группы[0].ГруппаКаталога);
		КонецЕсли;            
		ЭлементыДерева.Добавить(Строка.ГруппаКаталога);
		Представление = СтрСоединить(ЭлементыДерева, " // ");
		Элементы.ИдентификаторГруппыСайта.СписокВыбора.Добавить(Строка.Идентификатор, Представление);
		
	КонецЦикла;
	Элементы.ИдентификаторГруппыСайта.СписокВыбора.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
	
	Если Элементы.ИдентификаторКаталога.СписокВыбора.Количество() = 1 Тогда
		Запись.ИдентификаторКаталога = Элементы.ИдентификаторКаталога.СписокВыбора[0].Значение;
		Запись.ИмяКаталогаСайта = Элементы.ИдентификаторКаталога.СписокВыбора[0].Представление; 
	КонецЕсли;
	
	Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	МетаданныеНоменклатуры = Номенклатура.Метаданные();
	СтРеквизиты = МетаданныеНоменклатуры.СтандартныеРеквизиты;
	Для каждого Реквизит Из СтРеквизиты Цикл
		Элементы.ИмяРеквизита.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	Реквизиты = МетаданныеНоменклатуры.Реквизиты;
	Для каждого Реквизит Из Реквизиты Цикл
		Элементы.ИмяРеквизита.СписокВыбора.Добавить(Реквизит.Имя, Реквизит.Синоним);
	КонецЦикла;
	
	СписокДопРеквизитов = УправлениеСвойствами.ПолучитьСписокСвойств(Номенклатура, Истина);
	Для каждого ДопРеквизит Из СписокДопРеквизитов Цикл
		Элементы.ИмяДопРеквизита.СписокВыбора.Добавить(ДопРеквизит); 
		Если Строка(ДопРеквизит) = Запись.ИмяДопРеквизита Тогда
			Свойство = ДопРеквизит;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДоступностьВидимостьЭлементов();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Запись.ИдентификаторЗаписи = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000") Тогда
		Запись.ИдентификаторЗаписи = Новый УникальныйИдентификатор;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяРеквизитаПриИзменении(Элемент)    
	Если ЗначениеЗаполнено(Запись.ИмяРеквизита) Тогда
		Запись.ЗначениеРеквизита = ПустоеЗначение(Запись.ИмяРеквизита);
	Иначе
		Запись.ЗначениеРеквизита = Неопределено;
	КонецЕсли;
	ДоступностьВидимостьЭлементов(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяДопРеквизитаПриИзменении(Элемент)
	Запись.ИмяДопРеквизита = Свойство;
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторГруппыСайтаПриИзменении(Элемент) 
	Представление = Элементы.ИдентификаторГруппыСайта.СписокВыбора.НайтиПоЗначению(Запись.ИдентификаторГруппыСайта).Представление;
	Запись.ИмяГруппыСайта = Представление;
КонецПроцедуры

&НаКлиенте
Процедура ИдентификаторКаталогаПриИзменении(Элемент)
	Представление = Элементы.ИдентификаторКаталога.СписокВыбора.НайтиПоЗначению(Запись.ИдентификаторКаталога).Представление;
	Запись.ИмяКаталогаСайта = Представление;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ДоступностьВидимостьЭлементов()
	
	Элементы.МаксимальныйРост.Доступность 	= (Запись.ИмяРеквизита = "спРазмер");
	Элементы.МинимальныйРост.Доступность 	= (Запись.ИмяРеквизита = "спРазмер");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПустоеЗначение(ИмяРеквизита)
	
	Номенклатура = Справочники.Номенклатура.ПустаяСсылка();
	
	Возврат Номенклатура[ИмяРеквизита];
	
КонецФункции

#КонецОбласти
