#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Параметры.ЗначениеКопирования.Порядок = 0 Тогда
		
		Запись.Порядок = 0;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ТекущийОбъект.Порядок = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(спНастройкиАвтоподсортаТоваров.Порядок) КАК Порядок
		|ИЗ
		|	РегистрСведений.спНастройкиАвтоподсортаТоваров КАК спНастройкиАвтоподсортаТоваров
		|ГДЕ
		|	спНастройкиАвтоподсортаТоваров.Склад = &Склад";
		
		Запрос.УстановитьПараметр("Склад", ТекущийОбъект.Склад);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Порядок = ВыборкаДетальныеЗаписи.Порядок + 1;
		Иначе
			Порядок = 1;
		КонецЕсли;
		
		ТекущийОбъект.Порядок = Порядок;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

