// Формирует таблицу номенклатуры, работ, услуг и их характеристик и свойств по данным электронного документа 
// 
// Параметры:
//  ТЗ - см. НоваяТаблицаТоваров - Таблица значений, содержит результат вызова
//  НаборДанных - ОбъектXDTO - Источник данных
//  ДопПараметры - Структура -  с полями:
//   * ДеревоДопДанных - см. ДеревоДопДанных - Дерево содержащее дополнительные данные;
//   * ИмяТЧ - Строка - Имя табличной части для чтения доп данных;
//   * НомерСтроки - Число - Номер строки для чтения доп данных;
//   * ЕстьСвойствоИдФайл - Булево - Признак наличия ИдФайл в источнике данных;
//   * ИменаДопКолонок - Строка - Имена колонок через запятую;
//   * ВидСчетаФактуры - Строка - Признак авансовой счет фактору, проверяется только значение "Авансовый";
//   * ВерсПрог - Строка - Версия программы для для сравнения с реквизитом Файл.ВерсПрог;
//   * ЭтоГосЗакКазн - Булево - Признак государственного заказа.
//<<<--- Tnext Козык К.А. 15.08.2026 - адаптация под УНФ 3.0.14.115
&ИзменениеИКонтроль("СформироватьТЗПоНаборуДанныхXDTO")
Процедура T_СформироватьТЗПоНаборуДанныхXDTO(ТаблицаТоваров, НаборДанных, ДопПараметры = Неопределено) 
	
	ДеревоДопДанных = Неопределено;
	ЕстьСвойствоИдФайл = Ложь;
	ИмяТЧ = Неопределено;
	НомерСтроки = Неопределено;
	ИменаДопКолонок = "";
	ЭтоСчетФактураНаАванс = Ложь;
	ВерсПрог = "";
	ВерсПрог1С = ВерсияПрограммы();
	ЭтоГосЗакКазн = Ложь;
	
	Если ТипЗнч(ДопПараметры) = Тип("Структура") Тогда 
		
		ДопПараметры.Свойство("ДеревоДопДанных", ДеревоДопДанных);
		ДопПараметры.Свойство("ИмяТЧ",           ИмяТЧ);
		ДопПараметры.Свойство("НомерСтроки",     НомерСтроки);
		
		Если ДопПараметры.Свойство("ЕстьСвойствоИдФайл") Тогда 
			ЕстьСвойствоИдФайл = ДопПараметры.ЕстьСвойствоИдФайл;
		КонецЕсли;
		Если ДопПараметры.Свойство("ИменаДопКолонок") Тогда 
			ИменаДопКолонок = ДопПараметры.ИменаДопКолонок;
		КонецЕсли;
		Если ДопПараметры.Свойство("ВидСчетаФактуры") Тогда
			ЭтоСчетФактураНаАванс = (ВРег(ДопПараметры.ВидСчетаФактуры) = ВРег("Авансовый"));
		КонецЕсли;
		Если ДопПараметры.Свойство("ВерсПрог") Тогда
			ВерсПрог = ДопПараметры.ВерсПрог;
		КонецЕсли;
		
		Если ДопПараметры.Свойство("ЭтоГосЗакКазн") Тогда
			ЭтоГосЗакКазн = ДопПараметры.ЭтоГосЗакКазн;
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаТоваров = НоваяТаблицаТоваров();
	
	СвойстваНоменклатурыЭталон = Новый Структура;
	Для Каждого Колонка Из ТаблицаТоваров.Колонки Цикл
		СвойстваНоменклатурыЭталон.Вставить(Колонка.Имя, Неопределено);
	КонецЦикла;
	
	СодержитИзменяемыеДанные = Ложь;
	
	Для Каждого ТекЭлемент Из НаборДанных Цикл
		
		СвойстваНоменклатуры = ОбщегоНазначения.СкопироватьРекурсивно(СвойстваНоменклатурыЭталон);
		
		ДопСведТов = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ТекЭлемент, "ДопСведТов");
		Если ДопСведТов <> Неопределено Тогда
			ПрТовРаб = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ДопСведТов, "ПрТовРаб",, "Строка");
			Если ПрТовРаб = "2" ИЛИ ПрТовРаб = "3" Тогда // Это работа или услуга.
				СодержитИзменяемыеДанные = Истина;
			КонецЕсли;
			СвойстваНоменклатуры.ТипНоменклатурыФНС = ТипНоменклатурыФНС(ПрТовРаб);
			НаимЕдИзм = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ДопСведТов, "НаимЕдИзм",, "Строка");
			Если ЗначениеЗаполнено(НаимЕдИзм) Тогда
				СвойстваНоменклатуры.БазоваяЕдиницаНаименование = НаимЕдИзм;
			КонецЕсли;
			ХарактерТов = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ДопСведТов, "ХарактерТов",, "Строка");
			Если ЗначениеЗаполнено(ХарактерТов) Тогда
				СвойстваНоменклатуры.НаименованиеХарактеристики = ХарактерТов;
			КонецЕсли;
			АртикулТов = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ДопСведТов, "АртикулТов",, "Строка");
			Если ЗначениеЗаполнено(АртикулТов) Тогда
				СвойстваНоменклатуры.Артикул = АртикулТов;
			КонецЕсли;
			КодТов = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ДопСведТов, "КодТов",, "Строка");
			Если ЭтоГосЗакКазн Тогда
				СвойстваНоменклатуры.КодПоКТРУ = КодТов;
			Иначе
				СвойстваНоменклатуры.КодТовара = КодТов;
			КонецЕсли;
			ГТИН = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ДопСведТов, "ГТИН",, "Строка");
			Если ЗначениеЗаполнено(ГТИН) Тогда
				СвойстваНоменклатуры.Штрихкод = ГТИН;
			КонецЕсли;
			СвойстваНоменклатуры.КодТНВЭД = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ДопСведТов, "КодВидТов",, "Строка");
			СведПрослеж = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ДопСведТов, "СведПрослеж");
			СвойстваНоменклатуры.ПрослеживаемыйТовар = (СведПрослеж <> Неопределено);
			НомСредИдентТов = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ДопСведТов, "НомСредИдентТов");
			СвойстваНоменклатуры.МаркируемыйТовар = (НомСредИдентТов <> Неопределено);
		КонецЕсли;
		
		СвДТ = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ТекЭлемент, "СвДТ");
		Если СвДТ <> Неопределено Тогда
			СвойстваНоменклатуры.СтранаПроисхожденияКод = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(СвДТ,
				"КодПроисх", , "Строка");
		КонецЕсли;
		
		Элемент = ТекЭлемент;
		НаименованиеРаботыДопДанные = "";
		Если ЕстьСвойствоИдФайл
			И ЕстьСвойствоXDTO(ТекЭлемент, "ИнфПолСтр")
			И (ЗначениеЗаполнено(ТекЭлемент.ИнфПолСтр) ИЛИ Не ДеревоДопДанных = Неопределено) Тогда
			
			Если СтрНайти(ТекЭлемент.ИнфПолСтр, "xml") = 0 Тогда
				СвойстваТекЭлемента = ТекЭлемент.Свойства();
				Если СвойстваТекЭлемента.Получить("НомТов") <> Неопределено Тогда
					НомСтр = Строка(ТекЭлемент.НомТов);
				ИначеЕсли СвойстваТекЭлемента.Получить("НомСтр") <> Неопределено Тогда
					НомСтр = Строка(ТекЭлемент.НомСтр);
				ИначеЕсли СвойстваТекЭлемента.Получить("Номер") <> Неопределено Тогда
					НомСтр = Строка(НомерСтроки) + "." + ТекЭлемент.Номер;
				Иначе
					Продолжить;
				КонецЕсли;
				
				// Зачитаем параметры строки ТЧ из доп. данных.
				ПрочитатьИнфПол(ТекЭлемент.ИнфПолСтр, ДеревоДопДанных, ИмяТЧ, НомСтр);
				Если ДеревоДопДанных <> Неопределено И ДеревоДопДанных.Строки.Количество() > 0 Тогда
					СтруктураПоиска = Новый Структура("ИмяРеквизита, ЗначениеРеквизита", "Список", ИмяТЧ);
					СтрокиДерева = ДеревоДопДанных.Строки.НайтиСтроки(СтруктураПоиска, Истина);
					Если СтрокиДерева.Количество() > 0 Тогда
						СтруктураПоиска = Новый Структура("ИмяРеквизита, ЗначениеРеквизита", "Нпп", НомСтр);
						СтрокиДерева = СтрокиДерева[0].Строки.НайтиСтроки(СтруктураПоиска);
						Если СтрокиДерева.Количество() > 0 Тогда
							СтрокаВладелец = СтрокиДерева[0];
							СтрокаИД = СтрокаВладелец.Строки.Найти("ИД", "ИмяРеквизита");
							СтрокаБЕНаименованиеПолное  = СтрокаВладелец.Строки.Найти("БазоваяЕдиницаНаименованиеПолное"     , "ИмяРеквизита");
							СтрокаБЕНаименованиеКраткое = СтрокаВладелец.Строки.Найти("БазоваяЕдиницаНаименованиеКраткое"    , "ИмяРеквизита");
							СтрокаБЕМСокращение         = СтрокаВладелец.Строки.Найти("БазоваяЕдиницаМеждународноеСокращение", "ИмяРеквизита");
							СтрокаБЕНаименование        = СтрокаВладелец.Строки.Найти("БазоваяЕдиницаНаименование"           , "ИмяРеквизита");
							СтрокаБЕКод                 = СтрокаВладелец.Строки.Найти("БазоваяЕдиницаКод"                    , "ИмяРеквизита");
							Если СтрокаИД <> Неопределено Тогда
								СвойстваНоменклатуры.ИД = СтрокаИД.ЗначениеРеквизита;
							КонецЕсли;
							Если СтрокаБЕНаименованиеПолное <> Неопределено Тогда
								СвойстваНоменклатуры.БазоваяЕдиницаНаименованиеПолное = СтрокаБЕНаименованиеПолное.ЗначениеРеквизита;
							КонецЕсли;
							Если СтрокаБЕНаименованиеКраткое <> Неопределено Тогда
								СвойстваНоменклатуры.БазоваяЕдиницаНаименованиеКраткое = СтрокаБЕНаименованиеКраткое.ЗначениеРеквизита;
							КонецЕсли;
							Если СтрокаБЕМСокращение <> Неопределено Тогда
								СвойстваНоменклатуры.БазоваяЕдиницаМеждународноеСокращение = СтрокаБЕМСокращение.ЗначениеРеквизита;
							КонецЕсли;
							Если СтрокаБЕНаименование <> Неопределено Тогда
								СвойстваНоменклатуры.БазоваяЕдиницаНаименование = СтрокаБЕНаименование.ЗначениеРеквизита;
							КонецЕсли;
							Если СтрокаБЕКод <> Неопределено Тогда
								СвойстваНоменклатуры.БазоваяЕдиницаКод = СтрокаБЕКод.ЗначениеРеквизита;
							КонецЕсли;
							// В некоторых случаях наименование работы может передаваться через доп данные.
							СтрокаНаименованиеРаботы = СтрокаВладелец.Строки.Найти("Наименование", "ИмяРеквизита");
							Если Не СтрокаНаименованиеРаботы = Неопределено Тогда
								 НаименованиеРаботыДопДанные = СтрокаНаименованиеРаботы.ЗначениеРеквизита;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Элемент.Свойства().Получить("Наименование") = Неопределено Тогда
			СвойстваНоменклатуры.Наименование = Элемент.Наименование;
		КонецЕсли;
		Если НЕ ТекЭлемент.Свойства().Получить("НаимРабот") = Неопределено Тогда
			СвойстваНоменклатуры.Наименование = ТекЭлемент.НаимРабот;
			
			Если Не ЗначениеЗаполнено(СвойстваНоменклатуры.Наименование)
				И НЕ ТекЭлемент.Свойства().Получить("Описание") = Неопределено Тогда
				СвойстваНоменклатуры.Наименование = ТекЭлемент.Описание;
			КонецЕсли;
		КонецЕсли;
		Если НЕ ТекЭлемент.Свойства().Получить("НаимТов") = Неопределено Тогда
			СвойстваНоменклатуры.Наименование = ТекЭлемент.НаимТов;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СвойстваНоменклатуры.Наименование) Тогда
			СвойстваНоменклатуры.Наименование = НаименованиеРаботыДопДанные;
		КонецЕсли;
		
		НовЗапись = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НовЗапись, СвойстваНоменклатуры);
		
		Если НЕ Элемент.Свойства().Получить("ИД") = Неопределено Тогда
			НовЗапись.ИД = Элемент.ИД;
		КонецЕсли;
		
		ИнфПолФХЖ2 = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(Элемент, "ИнфПолФХЖ2",,, Истина);
		Если ИнфПолФХЖ2 = Неопределено Тогда
			ИнфПолФХЖ2 = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(Элемент, "ИнфПол", , , Истина);
		КонецЕсли;
		Если ИнфПолФХЖ2 <> Неопределено Тогда
			Если ВерсПрог = ВерсПрог1С Тогда
				НовЗапись.ИД = ЗначениеДопРеквизита(ИнфПолФХЖ2, "ИД");
			КонецЕсли;
			Сопоставление = Новый Структура;
			Префикс = ПрефиксДополнительныхДанныхЭлектронныхДокументов();
			ДлинаПрефикса = СтрДлина(Префикс);
			Для Каждого ДопИнформация Из ИнфПолФХЖ2 Цикл
				// В пространствах имен "ON_CHETOP_1_998_01_01_01" и "ON_CHETOP_1_998_01_05_01_01" тип "ИнфПолТип"
				// содержит доп. реквизиты в списке элементов "ТекстИнф" типа "ТекстИнфТип".
				ТекстИнф = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ДопИнформация, "ТекстИнф",,, Истина);
				Если ТекстИнф <> Неопределено Тогда 
					ИмяПоляЗначения = "";
					Для Каждого ЭлементСписка Из ТекстИнф Цикл
						Если ИмяПоляЗначения = "" Тогда
							ЗначениеЭлемента = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ЭлементСписка, "Значение");
							ИмяПоляЗначения = ?(ЗначениеЭлемента = Неопределено, "Значен", "Значение");
						КонецЕсли;
						Если Лев(ЭлементСписка.Идентиф, ДлинаПрефикса) = Префикс Тогда
							ИмяСвойства = Сред(ЭлементСписка.Идентиф, ДлинаПрефикса + 1);
							Сопоставление.Вставить(ИмяСвойства, ЭлементСписка[ИмяПоляЗначения]);
						КонецЕсли;
					КонецЦикла;
				Иначе	
				    Если Лев(ДопИнформация.Идентиф, ДлинаПрефикса) = Префикс Тогда
						ИмяСвойства = Сред(ДопИнформация.Идентиф, ДлинаПрефикса + 1);
						Сопоставление.Вставить(ИмяСвойства, ДопИнформация.Значен);
						#Вставка
						//<<<--- Tnext Козык К.А. 15.08.2026
						Если НРег(ДопИнформация.Идентиф) = "штрихкод" Тогда
							НовЗапись.Штрихкод = ДопИнформация.Значен;
						КонецЕсли;
						//--->>> Tnext Козык К.А. 15.08.2026
						#КонецВставки
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если ЗначениеЗаполнено(Сопоставление) Тогда
				НовЗапись.Сопоставление = Сопоставление;
			КонецЕсли;
		КонецЕсли;
		
		ОписанияРабот = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(Элемент, "ИнфПолеОписРабот",,, Истина);
		Если ОписанияРабот <> Неопределено И ВерсПрог = ВерсПрог1С Тогда 
			НовЗапись.ИД = ЗначениеДопРеквизита(ОписанияРабот, "ИД");
		КонецЕсли;
		
		// В CML документах Ид товара передается через доп данные, которые находятся в значении реквизитов.
		Если Не ЗначениеЗаполнено(НовЗапись.ИД) Тогда
			Ид = ЗначениеСвойстваДопДанныхСтроки(Элемент, "Ид");
			НовЗапись.ИД = Ид;
		КонецЕсли;                                         
	
		Если НЕ ТекЭлемент.Свойства().Получить("КодТов") = Неопределено Тогда
			НовЗапись.КодТовара = ТекЭлемент.КодТов;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НовЗапись.КодТовара) Тогда
			ДопСведТовКодТовара = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ТекЭлемент, "ДопСведТов.КодТов",, "Строка");
			Если ЗначениеЗаполнено(ДопСведТовКодТовара) Тогда
				НовЗапись.КодТовара = ДопСведТовКодТовара;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ТекЭлемент.Свойства().Получить("ХарактерТов") = Неопределено Тогда
			НовЗапись.НаименованиеХарактеристики = ТекЭлемент.ХарактерТов;
		КонецЕсли;
		Если НЕ ТекЭлемент.Свойства().Получить("ОКЕИ_Тов") = Неопределено Тогда
			НовЗапись.БазоваяЕдиницаКод = ТекЭлемент.ОКЕИ_Тов;
		КонецЕсли;
		Если НЕ ТекЭлемент.Свойства().Получить("ОКЕИТов") = Неопределено Тогда
			НовЗапись.БазоваяЕдиницаКод = ТекЭлемент.ОКЕИТов;
		КонецЕсли;
		Если НЕ ТекЭлемент.Свойства().Получить("ОКЕИ") = Неопределено Тогда
			НовЗапись.БазоваяЕдиницаКод = ТекЭлемент.ОКЕИ;
		КонецЕсли;
		Если НЕ ТекЭлемент.Свойства().Получить("ОКЕИ_ТовДо") = Неопределено Тогда
			НовЗапись.БазоваяЕдиницаКод = ТекЭлемент.ОКЕИ_ТовДо;
		КонецЕсли;	
		Если НЕ ТекЭлемент.Свойства().Получить("НаимЕдИзм") = Неопределено Тогда
			НовЗапись.БазоваяЕдиницаНаименование = ТекЭлемент.НаимЕдИзм;
		КонецЕсли;
		Если НЕ ТекЭлемент.Свойства().Получить("НаимЕдИзмДо") = Неопределено Тогда
			НовЗапись.БазоваяЕдиницаНаименование = ТекЭлемент.НаимЕдИзмДо;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НовЗапись.БазоваяЕдиницаНаименование) Тогда
			БазоваяЕдиницаНаименование = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ТекЭлемент, "ДопСведТов.НаимЕдИзмДо",, "Строка");
			Если ЗначениеЗаполнено(БазоваяЕдиницаНаименование) Тогда
				НовЗапись.БазоваяЕдиницаНаименование = БазоваяЕдиницаНаименование;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Элемент.Свойства().Получить("БазоваяЕдиница") = Неопределено Тогда
			Если НЕ Элемент.БазоваяЕдиница.Свойства().Получить("Код") = Неопределено Тогда
				НовЗапись.БазоваяЕдиницаКод = Элемент.БазоваяЕдиница.Код;
			КонецЕсли;
			Если НЕ Элемент.БазоваяЕдиница.Свойства().Получить("Наименование") = Неопределено Тогда
				НовЗапись.БазоваяЕдиницаНаименование = Элемент.БазоваяЕдиница.Наименование;
			КонецЕсли;
			Если НЕ Элемент.БазоваяЕдиница.Свойства().Получить("НаименованиеПолное") = Неопределено Тогда
				НовЗапись.БазоваяЕдиницаНаименованиеПолное = Элемент.БазоваяЕдиница.НаименованиеПолное;
			КонецЕсли;
			Если НЕ Элемент.БазоваяЕдиница.Свойства().Получить("НаименованиеКраткое") = Неопределено Тогда
				НовЗапись.БазоваяЕдиницаНаименованиеКраткое = Элемент.БазоваяЕдиница.НаименованиеКраткое;
			КонецЕсли;
			Если НЕ Элемент.БазоваяЕдиница.Свойства().Получить("МеждународноеСокращение") = Неопределено Тогда
				НовЗапись.БазоваяЕдиницаМеждународноеСокращение = Элемент.БазоваяЕдиница.МеждународноеСокращение;
			КонецЕсли;
		КонецЕсли;
		Если НЕ Элемент.Свойства().Получить("Артикул") = Неопределено Тогда
			НовЗапись.Артикул = Элемент.Артикул;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(НовЗапись.Артикул) Тогда
			ДопСведТовАртикул = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(ТекЭлемент, "ДопСведТов.АртикулТовара",, "Строка");
			Если ЗначениеЗаполнено(ДопСведТовАртикул) Тогда
				НовЗапись.Артикул = ДопСведТовАртикул;
			КонецЕсли;
		КонецЕсли;
				
		Если НЕ Элемент.Свойства().Получить("АртикулТов") = Неопределено Тогда
			НовЗапись.Артикул = Элемент.АртикулТов;
		КонецЕсли;
		Если НЕ Элемент.Свойства().Получить("Описание") = Неопределено Тогда
			НовЗапись.Описание = Элемент.Описание;
		КонецЕсли;
		
		Если НЕ Элемент.Свойства().Получить("НалСт") = Неопределено Тогда
			НовЗапись.СтавкаНДС = Элемент.НалСт;
		КонецЕсли;
		
		Если Элемент.Свойства().Получить("СтавкаНДС") <> Неопределено Тогда
			Если ТипЗнч(Элемент.СтавкаНДС) = Тип("Число") Тогда
				НовЗапись.СтавкаНДС = Формат(Элемент.СтавкаНДС, "ЧГ=0");
			Иначе
				НовЗапись.СтавкаНДС = Строка(Элемент.СтавкаНДС);
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ Элемент.Свойства().Получить("Штрихкод") = Неопределено Тогда
			НовЗапись.Штрихкод = Элемент.Штрихкод;
		КонецЕсли;
		
		ДополнительныеРеквизиты = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(Элемент, "ДополнительныеРеквизиты",,, Истина);
		Если ДополнительныеРеквизиты <> Неопределено Тогда
			Для Каждого ЭлементДанных Из ДополнительныеРеквизиты Цикл
				Если ТаблицаТоваров.Колонки.Найти("Доп_" + ЭлементДанных.Наименование) = Неопределено Тогда
					ТаблицаТоваров.Колонки.Добавить("Доп_" + ЭлементДанных.Наименование, ОбщегоНазначения.ОписаниеТипаСтрока(300));
					ИменаДопКолонок = ИменаДопКолонок + ", "+ "Доп_" + ЭлементДанных.Наименование;
				КонецЕсли;
				Для Каждого ЭлементЗначения Из ЭлементДанных.Значение Цикл
					НовЗапись["Доп_" + ЭлементДанных.Наименование] = ЭлементЗначения;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
		НаборЗначенийРеквизитов = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(Элемент, "ЗначенияРеквизитов.ЗначениеРеквизита",,, Истина);
		Если НаборЗначенийРеквизитов <> Неопределено
			И НовЗапись.Сопоставление = Неопределено Тогда
			
			Сопоставление = Новый Структура;
			Префикс = ПрефиксДополнительныхДанныхЭлектронныхДокументов();
			ДлинаПрефикса = СтрДлина(Префикс);
			Для Каждого ЗначениеРеквизита Из НаборЗначенийРеквизитов Цикл
				Если Лев(ЗначениеРеквизита.Наименование, ДлинаПрефикса) = Префикс Тогда
					ИмяСвойства = Сред(ЗначениеРеквизита.Наименование, ДлинаПрефикса + 1);
					Если ТипЗнч(ЗначениеРеквизита.Значение) = Тип("Массив") ИЛИ ТипЗнч(ЗначениеРеквизита.Значение) = Тип("СписокXDTO") Тогда
						Сопоставление.Вставить(ИмяСвойства, ЗначениеРеквизита.Значение[0]);
					Иначе
						Сопоставление.Вставить(ИмяСвойства, ЗначениеРеквизита.Значение);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если ЗначениеЗаполнено(Сопоставление) Тогда
				НовЗапись.Сопоставление = Сопоставление;
			КонецЕсли;
			
		КонецЕсли;
		
		ОписанияРабот = РаботаСФайламиБЭД.ЗначениеСвойстваXDTO(Элемент, "ИнфПолеОписРабот",,, Истина);
		Если ОписанияРабот <> Неопределено
			И НовЗапись.Сопоставление = Неопределено Тогда
			
			Сопоставление = Новый Структура;
			Префикс = ПрефиксДополнительныхДанныхЭлектронныхДокументов();
			ДлинаПрефикса = СтрДлина(Префикс);
			Для Каждого ДопДанные Из ОписанияРабот Цикл
				Если Лев(ДопДанные.Идентиф, ДлинаПрефикса) = Префикс Тогда
					ИмяСвойства = Сред(ДопДанные.Идентиф, ДлинаПрефикса + 1);
					Сопоставление.Вставить(ИмяСвойства, ДопДанные.Значен);
				КонецЕсли;
			КонецЦикла;
			Если ЗначениеЗаполнено(Сопоставление) Тогда
				НовЗапись.Сопоставление = Сопоставление;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Элемент.Свойства().Получить("product") <> Неопределено
			И НовЗапись.Сопоставление = Неопределено Тогда
			
			ФорматыЭДОСобытия.ЗаполнитьДанныеНоменклатурыДляСопоставленияКоммерческихПредложений(Элемент, НовЗапись);
			
		КонецЕсли;
		
		// По услугам может быть заполнено описание, но не заполнено наименование. В этом случае будем
		// использовать описание как наименование.
		Если Не ЗначениеЗаполнено(НовЗапись.Наименование) И ЗначениеЗаполнено(НовЗапись.Описание) Тогда
			НовЗапись.Наименование = НовЗапись.Описание;
		КонецЕсли;
		
		Для каждого КлючЗначение Из СвойстваНоменклатуры Цикл
			
			ЗначениеСвойства = КлючЗначение.Значение;
			ЗначениеЗаписи = НовЗапись[КлючЗначение.Ключ];
			Если Не ЗначениеЗаполнено(ЗначениеСвойства)
				И ЗначениеЗаполнено(ЗначениеЗаписи) Тогда
				
				СвойстваНоменклатуры[КлючЗначение.Ключ] = ЗначениеЗаписи;
			КонецЕсли;
			
		КонецЦикла;
		
		// Если пришел пустой ИД, используем вместо него наименование товара.
		// Актуально для входящих ЭД из учетных систем отличных от 1С.
		Если Не ЗначениеЗаполнено(НовЗапись.ИД) Тогда
			СопоставлениеПоУмолчанию = НовыеДанныеДляСопоставленияТоваровПоДаннымНоменклатуры(
				"", СвойстваНоменклатуры.Наименование, СвойстваНоменклатуры.НаименованиеХарактеристики, СвойстваНоменклатуры.БазоваяЕдиницаНаименование);
			НовЗапись.ИД = СопоставлениеПоУмолчанию.Идентификатор;
			
			СтарыйИД = СопоставлениеНоменклатурыКонтрагентов.ИдентификаторТовараПоСтроке(ВРег(СтрЗаменить(НовЗапись.Наименование, " ", ""))
																					+ "#" + ВРег(СтрЗаменить(НовЗапись.НаименованиеХарактеристики, " ", ""))
																					+ "#" + ВРег(СтрЗаменить(НовЗапись.КодТовара, " ", ""))
																					+ "#" + ВРег(СтрЗаменить(НовЗапись.Артикул, " ", "")));;
			НовЗапись.ИсторияИдентификаторов = Новый Массив;
			НовЗапись.ИсторияИдентификаторов.Добавить(СтарыйИД);
		КонецЕсли;
		
	КонецЦикла;
	
	ДополнитьИнформациюОТовареДаннымиДляСопоставления(ТаблицаТоваров, ЭтоСчетФактураНаАванс, СодержитИзменяемыеДанные);
	
	// Удаляем переносы строки из идентификатора.
	Для Каждого СтрокаТовара Из ТаблицаТоваров Цикл
		Если СтрокаТовара.Сопоставление = Неопределено
			Или Не СтрокаТовара.Сопоставление.Свойство("Идентификатор") Тогда
			Продолжить;
		КонецЕсли;
		СтрокаТовара.Сопоставление.Идентификатор = СтрЗаменить(СтрокаТовара.Сопоставление.Идентификатор, Символы.ПС, "");
	КонецЦикла;
	
КонецПроцедуры
//--->>> Tnext Козык К.А. 15.08.2026 - адаптация под УНФ 3.0.14.115
