
#Область СлужебныеПрограммныйИнтерфейс

&НаКлиенте
Процедура maxma_НазначитьАвтоматическиеСкидкиКлиент() Экспорт
	
	Если Не maxma_ИнтеграцияССервисомКлиентСервер.ИспользоватьПрограммуЛояльности(Объект.maxma_СтруктураПолей) Тогда
		Возврат;
	КонецЕсли;
	
	РассчитатьСкидкиКлиент();
	
	maxma_ИнтеграцияССервисомКлиент.ВывестиСообщения(Объект.maxma_СтруктураПолей.СообщенияПользователю);
	
	maxma_ИнтеграцияССервисомКлиент.ОбработатьКодыОшибок(ЭтаФорма);
	
	maxma_ИнтеграцияССервисомКлиентСервер.ОбновитьФорму(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
&После("ПриСозданииНаСервере")
Процедура maxma_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	maxma_ПриСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
&После("ОбработкаОповещения")
Процедура maxma_ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	maxma_ИнтеграцияССервисомКлиент.ОбработкаОповещения(ЭтаФорма, ИмяСобытия, Параметр, Источник);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура maxma_КомандаБонуснаяКарта(Команда)
	
	maxma_ИнтеграцияССервисомКлиент.БонуснаяКартаНажатие(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура maxma_КомандаЗаменаКарты(Команда)
	
	maxma_ИнтеграцияССервисомКлиент.ЗаменаКартыНажатие(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура maxma_КомандаПромокод(Команда)
	
	maxma_ИнтеграцияССервисомКлиент.ПромокодНажатие(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура maxma_КомандаБонусы(Команда)
	
	maxma_ИнтеграцияССервисомКлиент.БонусыНажатие(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура maxma_КомандаПодарочныеКарты(Команда)
	
	maxma_ИнтеграцияССервисомКлиент.ПодарочныеКартыНажатие(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура maxma_КомандаФормулаРасчета(Команда)
	
	maxma_ИнтеграцияССервисомКлиент.ФормулаРасчетаНажатие(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура maxma_ПриСозданииНаСервере()
	
	maxma_ИнтеграцияССервисомВызовСервера.ПриСозданииНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
&После("СоздатьНовыйНабор")
Процедура maxma_СоздатьНовыйНабор(ПараметрыЗавершения)
	
	Объект.maxma_СтруктураПолей = Неопределено;
	
	maxma_ИнтеграцияССервисомВызовСервера.ИнициализироватьПоля(Объект.maxma_СтруктураПолей, Объект.ТорговыйОбъект);
	
	maxma_ИнтеграцияССервисомКлиентСервер.ОбновитьФорму(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура maxma_ИнициализироватьЧек()
	
	Объект.maxma_СтруктураПолей = Неопределено;
	
	Объект.ДисконтнаяКарта = "";
	
	maxma_ИнтеграцияССервисомВызовСервера.ИнициализироватьПоля(Объект.maxma_СтруктураПолей, Объект.ТорговыйОбъект, ЧекККМПродажа);
	
	maxma_ИнтеграцияССервисомКлиентСервер.ОбновитьФорму(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
&После("ПробитьЧекНаКлиентеЗавершение")
Процедура maxma_ПробитьЧекНаКлиентеЗавершение(РезультатВыполнения, Параметры)
	
	maxma_ИнициализироватьЧек();
	
КонецПроцедуры

&НаКлиенте
&После("ВыборЧекаЗавершение")
Процедура maxma_ВыборЧекаЗавершение(Результат, ДополнительныеПараметры)
	
	maxma_ИнициализироватьЧек();
	
КонецПроцедуры

&НаКлиенте
&После("УдалитьЧекКлиент")
Процедура maxma_УдалитьЧекКлиент(ОтменитьРежимПлитки = Ложь)
	
	maxma_ИнициализироватьЧек();
	
КонецПроцедуры

&НаКлиенте
&После("ОтложитьЧекКлиент")
Процедура maxma_ОтложитьЧекКлиент()
	
	maxma_ИнициализироватьЧек();
	
КонецПроцедуры

&НаКлиенте
&После("ЦенаИзКарточкиПриИзмененииПродолжение")
Процедура maxma_ЦенаИзКарточкиПриИзмененииПродолжение(ОбнулитьПодарочныеСертификаты = Истина)
	
	maxma_НазначитьАвтоматическиеСкидкиКлиент();
	
КонецПроцедуры

&НаКлиенте
&После("ПересчитатьДанныеПриИзмененииКоличества")
Процедура maxma_ПересчитатьДанныеПриИзмененииКоличества(УвеличитьКоличество)
	
	maxma_НазначитьАвтоматическиеСкидкиКлиент();
	
КонецПроцедуры

&НаКлиенте
&После("ПересчитатьДанныеПриИзмененииКоличестваЗавершение")
Процедура maxma_ПересчитатьДанныеПриИзмененииКоличестваЗавершение(Результат, ДополнительныеПараметры)
	
	maxma_НазначитьАвтоматическиеСкидкиКлиент();
	
КонецПроцедуры

&НаКлиенте
&После("ОбработатьИзменениеКоличестваТовара")
Процедура maxma_ОбработатьИзменениеКоличестваТовара(ТекущаяСтрокаРедактирования)
	
	maxma_НазначитьАвтоматическиеСкидкиКлиент();
	
КонецПроцедуры

&НаКлиенте
&Перед("ОткрытьКаталогЗавершение")
Процедура maxma_ОткрытьКаталогЗавершение(Результат, ДополнительныеПараметры)
	
	Если Не maxma_ИнтеграцияССервисомКлиентСервер.ИспользоватьПрограммуЛояльности(Объект.maxma_СтруктураПолей) Тогда
		maxma_ИнициализироватьЧек();
	Иначе
		maxma_ИнтеграцияССервисомКлиентСервер.ОбновитьФорму(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
&После("ФискализироватьЧек")
Процедура maxma_ФискализироватьЧек(Контекст, ДополнительныеДанные, ОповещениеПриЗавершении, СистемаНалогообложения)
	
	Если Не ДополнительныеДанные.Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДополнительныеДанные.РеквизитыФормы.Объект, "maxma_СтруктураПолей") Тогда
		maxma_ИнтеграцияССервисомКлиент.ВывестиСообщения(ДополнительныеДанные.РеквизитыФормы.Объект.maxma_СтруктураПолей.СообщенияПользователю);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
