#Область ОбработчикиСобытийФормы

&НаСервере
Процедура спПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	ИмяКоманды = "спПодобратьЯчейкиПоОстаткам";
	ЗаголовокКоманды = НСтр("ru = 'Подбор ячеек'");
	
	КомандаПодобратьЯчейки = Команды.Добавить(ИмяКоманды);
	КомандаПодобратьЯчейки.Действие = "спПодобратьЯчейкиПоОстаткам";
	КомандаПодобратьЯчейки.Заголовок = ЗаголовокКоманды;
	КомандаПодобратьЯчейки.ИзменяетСохраняемыеДанные = Истина;
	
	ЭлементПеред = Элементы.Найти("ЗапасыКомандаЗаполнитьПоОстаткамНаСкладе");
	Родитель = Элементы.Запасы.КоманднаяПанель;
	
	КнопкаПодобратьЯчейки = Элементы.Вставить(ИмяКоманды, Тип("КнопкаФормы"), Родитель, ЭлементПеред);
	КнопкаПодобратьЯчейки.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	КнопкаПодобратьЯчейки.ИмяКоманды = ИмяКоманды;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура спПодобратьЯчейкиПоОстаткам(Команда)
	
	спПодобратьЯчейкиПоОстаткамНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура спПодобратьЯчейкиПоОстаткамНаСервере()
	
	ТаблицаЗапасы = Объект.Запасы.Выгрузить();
	спРаботаСЯчейкамиВызовСервера.ЗаполнитьЯчейкиВТЧПоОстаткам(ТаблицаЗапасы, Объект.Организация, Объект.СтруктурнаяЕдиница, ТипЗнч(Объект.Ссылка));
	Объект.Запасы.Загрузить(ТаблицаЗапасы);
	
КонецПроцедуры

#Область СканированиеШтрихкодов

&НаКлиенте
&Вместо("ПолученыШтрихкоды")
Процедура спПолученыШтрихкоды(ДанныеШтрихкодов)
	
	Модифицированность = Истина;
	
	Если ТипЗнч(ДанныеШтрихкодов) = Тип("Массив") Тогда
		МассивШтрихкодов = ДанныеШтрихкодов;
	Иначе
		МассивШтрихкодов = Новый Массив;
		МассивШтрихкодов.Добавить(ДанныеШтрихкодов);
	КонецЕсли;
	
	Результат = спОбработатьШтрихкодыЯчеек(МассивШтрихкодов);
	
	Если Не Результат Тогда
		ПродолжитьВызов(ДанныеШтрихкодов);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция спОбработатьШтрихкодыЯчеек(Штрихкоды) 
	
	ЭтоШтрихкодЯчейки = Ложь;
	ПрефиксЯчейки = спРаботаСЯчейкамиВызовСервера.ПрефиксШтрихкодаЯчейки();
	
	Для каждого СтрокаШтрихкода Из Штрихкоды Цикл
		
		Если СтрНачинаетсяС(СтрокаШтрихкода.Штрихкод, ПрефиксЯчейки) Тогда
			
			ЭтоШтрихкодЯчейки = Истина;
			
			АдресныйОтправитель = спРаботаСЯчейкамиВызовСервера.ЕстьЯчейки(Объект.СтруктурнаяЕдиница);
			
			Если АдресныйОтправитель Тогда
				
				ДанныеСтроки = Элементы.Запасы.ТекущиеДанные;
				
				Если ДанныеСтроки = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ДанныеСтроки.Ячейка = спЯчейкаПоШтрихкоду(СтрокаШтрихкода.Штрихкод, Объект.СтруктурнаяЕдиница);
				
			Иначе
				
				ТекстСообщения = НСтр("ru = 'Отсканирован штрихкод ячейки, но выбранный склад не является адресным.'");
				ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ЭтоШтрихкодЯчейки;
	
КонецФункции

&НаСервереБезКонтекста
Функция спЯчейкаПоШтрихкоду(Штрихкод, Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	спШтрихкодыЯчеек.Ячейка КАК Ячейка
		|ИЗ
		|	РегистрСведений.спШтрихкодыЯчеек КАК спШтрихкодыЯчеек
		|ГДЕ
		|	спШтрихкодыЯчеек.Штрихкод = &Штрихкод
		|	И спШтрихкодыЯчеек.Ячейка.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	Запрос.УстановитьПараметр("Владелец", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи.Ячейка;
		
	Иначе
		
		Возврат Справочники.Ячейки.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецОбласти