
#Область ОбработчикиМетодовHTTP

Функция plombGet(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Accept-Charset", "utf-8");
	Ответ.Заголовки.Вставить("Content-type", "application/json");
	
	code = Запрос.ПараметрыЗапроса.Получить("code");
	СтруктураЗапроса = Новый Структура("code", code);
	
	Попытка
		ТекстОтвета = спПломбыСервер.ПрочитатьHTTPЗапрос(СтруктураЗапроса);
	Исключение
		ЗаписьЖурналаРегистрации("GET-Ответ:Проверка пломб", 
			УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	Ответ.УстановитьТелоИзСтроки(ТекстОтвета);
	
	Возврат Ответ;
	
КонецФункции

#КонецОбласти
