//<<<--- Tnext Козык К.А. 16.06.2026 - адаптация под новый релиз 3.0.13.357
&После("ОтразитьРезультатыСканированияВДокументе")
Процедура спОтразитьРезультатыСканированияВДокументеПосле(ПараметрыОкончанияСканирования)
	
	ТипПроверяемогоДокумента = ТипЗнч(ПараметрыОкончанияСканирования.ПроверяемыйДокумент);
	
	Если ТипПроверяемогоДокумента = Тип("ДокументСсылка.спПриемкаТовара") Тогда
		
		ОтразитьРезультатыПроверкиИПодбораВДокументеПоступления(ПараметрыОкончанияСканирования);
		
	КонецЕсли;
	
КонецПроцедуры //--->>> Tnext Козык К.А. 16.06.2026