
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Оприходовать(Команда)
	
	СсылкаНаДокумент = ОприходоватьНаСервере();
	ПоказатьЗначение(,СсылкаНаДокумент);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеОбработчики

&НаСервере
Функция ОприходоватьНаСервере()
	
	НовыйДокумент = Документы.ПеремещениеЗапасов.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(НовыйДокумент, Объект.ПеремещениеЗапасов,, "Номер, Дата, ЗаказНаПеремещение, ДокументОснование");
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	
	Для Каждого Строка Из Объект.Товары Цикл
			
		НоваяСтрока = НовыйДокумент.Запасы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		
		Если Строка.Недостача > 0 Тогда
			
			НоваяСтрока.Количество = Строка.Недостача;
			
		ИначеЕсли Строка.Излишек > 0 Тогда
			
			НоваяСтрока.Количество = Строка.Излишек;
			
		КонецЕсли;
			
	КонецЦикла;  
	
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
	Объект.Оприходован = Истина;
	ЭтотОбъект.Записать();
	
	Возврат НовыйДокумент.Ссылка;
	
КонецФункции 

#КонецОбласти

