
&Вместо("ПолучитьПараметрыРасчетаСкидок")
Функция maxma_ПолучитьПараметрыРасчетаСкидок(ФормаРМК)
	
	ПараметрыРасчета = ПродолжитьВызов(ФормаРМК);
	
	Объект = ФормаРМК.Объект;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "maxma_СтруктураПолей") Тогда
		ПараметрыРасчета.Вставить("maxma_СтруктураПолей", Объект.maxma_СтруктураПолей);
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "Кассир") Тогда
		ПараметрыРасчета.Вставить("Кассир", Объект.Кассир);
	КонецЕсли;
	
	Возврат ПараметрыРасчета;
	
КонецФункции

&Вместо("УчестьРанееВыданныеПодарки")
Процедура maxma_УчестьРанееВыданныеПодарки(ФормаРМК, ТабличнаяЧасть, СтруктураСкидок, ПараметрыРасчета, ДополнительныеПараметры = Неопределено)
	Возврат;
КонецПроцедуры
