
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Если ЗначениеЗаполнено(Запись.ИдентификаторСобытия) Тогда
		
			ТекЗапрос = Новый Запрос("ВЫБРАТЬ
		                         |	тбСостояние.СтатусСообщения КАК СтатусСообщения,
		                         |	тбСостояние.ДатаИзменения КАК ДатаИзменения,
		                         |	тбОчередь.tl_ХранилищеСообщения КАК Хранилище
								 |ИЗ
		                         |	РегистрСведений.спОчередьИсходящихСообщений КАК тбОчередь
		                         |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спСостояниеСообщений КАК тбСостояние
		                         |		ПО тбОчередь.ИдентификаторСобытия = тбСостояние.ИдентификаторСообщения
		                         |ГДЕ
		                         |	тбОчередь.ИдентификаторСобытия = &ИдентификаторСообщения");
								 ТекЗапрос.УстановитьПараметр("ИдентификаторСообщения", Запись.ИдентификаторСобытия);
								 ТекВыборка = текЗапрос.Выполнить().Выбрать();
								 ТекВыборка.Следующий();
								 			
		ТекВыборка = текЗапрос.Выполнить().Выбрать();
		
		ТекВыборка.Следующий();
								 
		Статус = ТекВыборка.СтатусСообщения;
		ДатаИзменения = ТекВыборка.ДатаИзменения;  

		Если Статус = ПредопределенноеЗначение("Перечисление.спСтатусыСообщений.Отправлено") Тогда 
			 tl_ТекстСообщения = ТекВыборка.Хранилище.Получить();  
			 Элементы.tl_ТекстСообщения.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Элементы.СсылкаНаОбъект.Видимость = ЗначениеЗаполнено(Запись.СсылкаНаОбъект); 

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	спРаботаСДаннымиВызовСервера.УстановитьСостояниеСообщения(Запись.ИдентификаторСобытия, Статус, , , , , Перечисления.спТипыИнтеграции.Исходящая);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	ДатаИзменения = ПолучитьДатуСеанса();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуСеанса()	
	Возврат  ТекущаяДатаСеанса();	
КонецФункции 
	
#КонецОбласти
