
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Заголовок = "Настройки модуля MAXMA";
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	
	Отказ = Ложь;
	
	Если ИспользоватьПрограммыЛояльности Тогда
		
		Если Не ЗначениеЗаполнено(Магазин) Тогда
			СтрокаСобщения = НСтр("ru = 'Не указан магазин'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСобщения,,,, Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(АдресСервера) Тогда
			СтрокаСобщения = НСтр("ru = 'Не заполнен адрес сервера'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСобщения,,,, Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(XProcessingKey) Тогда
			СтрокаСобщения = НСтр("ru = 'Не заполнен ключ доступа к серверу'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСобщения,,,, Отказ);
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ДисконтнаяКартаИдентификатор)
			Или ДисконтнаяКартаИдентификатор = "00000000-0000-0000-0000-000000000000" Тогда
			СтрокаСобщения = НСтр("ru = 'Не указана дисконтная карта'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСобщения,,,, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		СохранитьИзмененияНаСервере();
		
		СтрокаСобщения = НСтр("ru = 'Настройки сохранены'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСобщения);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНовуюКарту(Команда)
	
	СоздатьНовуюКартуНаСервере();
	
	ДисконтнаяКартаПриИзменении("");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ИспользоватьПрограммыЛояльностиПриИзменении(Элемент)
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура МагазинПриИзменении(Элемент)
	
	ЗаполнитьНастройкиМодуля();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ДисконтнаяКартаПриИзменении(Элемент)
	
	ДисконтнаяКартаИдентификатор = ДисконтнаяКарта.УникальныйИдентификатор();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаНастройкиГоризонтальная.Видимость = ИспользоватьПрограммыЛояльности;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройкиМодуля()
	
	НастройкиМодуля = maxma_ИнтеграцияССервисомВызовСервера.ПолучитьНастройкиМодуля(Магазин);
	
	НенайденныеНастройки = maxma_ИнтеграцияССервисомВызовСервера.ПроверитьНаличиеНастроек(НастройкиМодуля);
	
	maxma_ИнтеграцияССервисомВызовСервера.СоздатьНастройки(НенайденныеНастройки);
	
	ВыдачаЗаменаКарты_ОбязательныеПоля.Очистить();
	ВыдачаЗаменаКарты_ОбязательныеПоля.Добавить("НомерКарты", "Номер карты", Истина);
	ВыдачаЗаменаКарты_ОбязательныеПоля.Добавить("МобильныйТелефон", "Мобильный телефон", Истина);
	ВыдачаЗаменаКарты_ОбязательныеПоля.Добавить("Имя", "Имя", Истина);
	ВыдачаЗаменаКарты_ОбязательныеПоля.Добавить("Фамилия", "Фамилия", Истина);
	ВыдачаЗаменаКарты_ОбязательныеПоля.Добавить("Отчество", "Отчество", Истина);
	ВыдачаЗаменаКарты_ОбязательныеПоля.Добавить("ДатаРождения", "Дата рождения", Истина);
	ВыдачаЗаменаКарты_ОбязательныеПоля.Добавить("Пол", "Пол", Истина);
	ВыдачаЗаменаКарты_ОбязательныеПоля.Добавить("Email", "Email", Истина);
	ВыдачаЗаменаКарты_ОбязательныеПоля.Добавить("ПодтверждениеПоСМС", "Подтверждение по СМС при выдаче карты", Истина);
	
	Для Каждого КлючИЗначение Из НастройкиМодуля Цикл
		
		Если КлючИЗначение.Ключ = "ВыдачаЗаменаКарты_ОбязательныеПоляХранилище" Тогда
			
			Если ЗначениеЗаполнено(КлючИЗначение.Значение) Тогда
				
				ВыдачаЗаменаКарты_ОбязательныеПоляИсточник = СтрРазделить(КлючИЗначение.Значение, ",");
				
				Если ВыдачаЗаменаКарты_ОбязательныеПоляИсточник.Количество() Тогда
					
					ВыдачаЗаменаКарты_ОбязательныеПоля.ЗаполнитьПометки(Ложь);
					
					Для Каждого ЭлементМассива Из ВыдачаЗаменаКарты_ОбязательныеПоляИсточник Цикл
						
						НайденноеЗначение = ВыдачаЗаменаКарты_ОбязательныеПоля.НайтиПоЗначению(ЭлементМассива);
						
						Если Не НайденноеЗначение = Неопределено Тогда
							НайденноеЗначение.Пометка = Истина;
						КонецЕсли;
						
					КонецЦикла;
					
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			ЭтотОбъект[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ДисконтнаяКартаИдентификатор) Тогда
		ДисконтнаяКарта = Справочники.ДисконтныеКарты.ПолучитьСсылку(Новый УникальныйИдентификатор(ДисконтнаяКартаИдентификатор));
	Иначе
		ДисконтнаяКарта = Справочники.ДисконтныеКарты.ПустаяСсылка();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьИзмененияНаСервере()
	
	Для Каждого КлючИЗначение Из НастройкиМодуля Цикл
		
		Если КлючИЗначение.Ключ = "ВыдачаЗаменаКарты_ОбязательныеПоляХранилище" Тогда
			
			СписокЭлементов          = ЭтотОбъект["ВыдачаЗаменаКарты_ОбязательныеПоля"];
			СписокЭлементовВыбранные = Новый СписокЗначений;
			
			Для Каждого ЭлементСписка Из СписокЭлементов Цикл
				
				Если НЕ ЭлементСписка.Пометка Тогда
					Продолжить;
				КонецЕсли;
				
				СписокЭлементовВыбранные.Добавить(ЭлементСписка.Значение);
				
			КонецЦикла;
			
			СоединеннаяСтрока = СтрСоединить(СписокЭлементовВыбранные.ВыгрузитьЗначения(), ",");
			
			maxma_ИнтеграцияССервисомВызовСервера.УстановитьЗначениеНастройки(Магазин, КлючИЗначение.Ключ, СоединеннаяСтрока)
		Иначе
			maxma_ИнтеграцияССервисомВызовСервера.УстановитьЗначениеНастройки(Магазин, КлючИЗначение.Ключ, ЭтотОбъект[КлючИЗначение.Ключ]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьНовуюКартуНаСервере()
	
	ДисконтнаяКарта = maxma_ИнтеграцияССервисомВызовСервера.ДисконтнаяКарта();
	
КонецПроцедуры

#КонецОбласти
