
#Область ПрограммныйИнтерфейс

#Область ПрикладныеТипыЭлектронныхДокументов

// Предназначена для распределения объектов, к которым подключаются команды ЭДО, по группам.
// 
// Параметры:
//  СоставКомандЭДО - Структура - структура состава команд ЭДО. Для каждого из ключей указывается массив полных имен 
//                    объектов метаданных, к которым подключаются команды ЭДО.
//    Исходящие    - Массив Из Строка - объекты для команд работы с исходящими документами.
//    Входящие     - Массив Из Строка - объекты для команд работы со входящими документами.
//    БезПодписи   - Массив Из Строка - объекты для команд выполнения ЭДО без подписи.
//    Интеркампани - Массив Из Строка - объекты для команд обмена между организациями в рамках одной базы.
//
// Пример:
//  СоставКомандЭДО.Исходящие.Добавить("Документ.ТранспортнаяНакладная");
//	СоставКомандЭДО.Исходящие.Добавить("Документ.Извещение");
//
&После("ПриОпределенииСоставаКомандЭДООснованияПрикладногоЭлектронногоДокумента")
Процедура T_ПриОпределенииСоставаКомандЭДООснованияПрикладногоЭлектронногоДокумента(СоставКомандЭДО)
	
	СоставКомандЭДО.Исходящие.Добавить("Документ.ПриходнаяНакладная");
	СоставКомандЭДО.Исходящие.Добавить("Документ.ПеремещениеЗапасов");
	
КонецПроцедуры

// Предназначена для получения параметров ЭДО по ссылке на объект учета.
// По одному источнику может быть несколько параметров, для каждого нужно добавить строку в таблицу значений.
//
// Параметры:
//  Источник                       - Объект, ЛюбаяСсылка - документ или справочник источника.
//  ПараметрыЭлектронногоДокумента - ТаблицаЗначений - параметры источника, необходимые для определения настроек обмена
//    электронными документами:
//    * Тип                - Произвольный - значение элемента структуры возвращаемой
//                           см. ОбменСКонтрагентами.ТипыДокументов. Используются все ключи, кроме УПД, УКД. Обязательный.
//                           Необходимость формирования УПД, УКД определяется на основании нескольких критериев
//                           (указанный тип, вариант формирования универсальных документов, настройки отправки
//                           электронных документов). 
//    * ФормированиеУниверсальногоДокумента - Произвольный - значение элемента структуры, возвращаемой
//                           см. ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов. Обязательный при
//                           указании типов: - ТоварнаяНакладная
//                            - АктВыполненныхРабот
//                            - АктНаПередачуПрав
//                            - СоглашениеОбИзмененииСтоимости
//                            - СчетФактура
//                            - КорректировочныйСчетФактура
//    * Направление        - Произвольный - значение элемента структуры возвращаемой
//                           см. ОбменСКонтрагентами.НаправленияДокументов(). Обязательный.
//    * Организация        - ОпределяемыйТип.Организация - организация документа.
//    * Контрагент         - ОпределяемыйТип.КонтрагентБЭД - контрагент документа.
//    * ДоговорКонтрагента - ОпределяемыйТип.ДоговорСКонтрагентомЭДО - договор контрагента.
//
&ИзменениеИКонтроль("ЗаполнитьПараметрыЭДПоИсточнику")
Процедура спЗаполнитьПараметрыЭДПоИсточнику(Источник, ПараметрыЭлектронногоДокумента)

	ТипИсточника = ТипЗнч(Источник);
	НаправленияДокументов = ОбменСКонтрагентами.НаправленияДокументов();
	ПараметрыЭД = ПараметрыЭлектронногоДокумента.Добавить();

	Если ТипИсточника = Тип("ДокументСсылка.РасходнаяНакладная") 
		#Вставка
		ИЛИ ТипИсточника = Тип("ДокументСсылка.ПриходнаяНакладная")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ПриходнаяНакладная")
		#КонецВставки
		ИЛИ ТипИсточника = Тип("ДокументОбъект.РасходнаяНакладная") Тогда

		ПараметрыЭД.Тип = УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ВидЭлектронногоДокументаРеализации(Источник);

		Если УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ТребуетсяСформироватьУниверсальныйДокумент(Источник) Тогда
			Если УправлениеНебольшойФирмойЭлектронныеДокументыСервер.СчетФактураНеТребуется(Источник.Ссылка)
				ИЛИ НЕ УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЕстьСчетФактура(Источник.Ссылка) Тогда
				ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
			Иначе
				ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Обязательно;
			КонецЕсли;
		Иначе
			ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
			ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
		КонецЕсли;

		ПараметрыЭД.Направление = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;
		#Вставка 
		Если ТипИсточника = Тип("ДокументСсылка.ПриходнаяНакладная")
			ИЛИ ТипИсточника = Тип("ДокументОбъект.ПриходнаяНакладная") Тогда
			
			ПараметрыОтправки = УправлениеНебольшойФирмойЭлектронныеДокументыСервер.Т_ПараметрыОтправкиПриходнойЭДО();
			
			Если ПараметрыОтправки.Свойство("Организация") И ЗначениеЗаполнено(ПараметрыОтправки.Организация) Тогда
				ЗаполнитьЗначенияСвойств(ПараметрыЭД, ПараметрыОтправки, "Организация, Контрагент, ДоговорКонтрагента");
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ПеремещениеЗапасов")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ПеремещениеЗапасов") Тогда	
		
		ПараметрыОтправки = УправлениеНебольшойФирмойЭлектронныеДокументыСервер.Т_ПараметрыОтправкиПриходнойЭДО();
		
		Если ПараметрыОтправки.Свойство("Организация") И ЗначениеЗаполнено(ПараметрыОтправки.Организация) Тогда
			ЗаполнитьЗначенияСвойств(ПараметрыЭД, ПараметрыОтправки, "Организация, Контрагент, ДоговорКонтрагента");
		КонецЕсли;  
		
		ПараметрыЭД.Направление = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
		ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
		ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
		
		#КонецВставки  
		
	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ПриходнаяНакладная")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ПриходнаяНакладная") Тогда

		Если НЕ ЗначениеЗаполнено(ПараметрыЭД.Тип) Тогда
			Если Источник.Запасы.Количество() > 0 Тогда
				ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
			Иначе
				ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот;
			КонецЕсли;
		КонецЕсли;

		ПараметрыЭД.Направление = НаправленияДокументов.Входящий;

		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.КорректировкаРеализации")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.КорректировкаРеализации") Тогда

		ПараметрыЭД.Тип = УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ВидЭлектронногоДокументаКорректировки(Источник);

		Если УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ТребуетсяСформироватьУниверсальныйДокумент(Источник) Тогда
			Если УправлениеНебольшойФирмойЭлектронныеДокументыСервер.СчетФактураНеТребуется(Источник.Ссылка)
				ИЛИ НЕ УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЕстьСчетФактура(Источник.Ссылка) Тогда
				ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
			Иначе
				ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Обязательно;
			КонецЕсли;
		Иначе
			ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
			ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
		КонецЕсли;

		ПараметрыЭД.Направление = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.КорректировкаПоступления") 
		ИЛИ ТипИсточника = Тип("ДокументОбъект.КорректировкаПоступления") Тогда

		ПараметрыЭД.Тип			= Перечисления.ТипыДокументовЭДО.СоглашениеОбИзмененииСтоимости;
		ПараметрыЭД.Направление = НаправленияДокументов.Входящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СчетНаОплату")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.СчетНаОплату") Тогда

		ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.СчетНаОплату;
		ПараметрыЭД.Направление = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СчетНаОплатуПоставщика")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.СчетНаОплатуПоставщика") Тогда

		ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.СчетНаОплату;
		ПараметрыЭД.Направление = НаправленияДокументов.Входящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ЗаказПоставщику")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ЗаказПоставщику") Тогда 

		ПараметрыЭД.Тип =  Перечисления.ТипыДокументовЭДО.ЗаказТовара;
		ПараметрыЭД.Направление = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ЗаказПокупателя")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ЗаказПокупателя") Тогда

		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ВидОперации");
		Если ВидОперации = Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд Тогда
			ВидЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ВидЭлектронногоДокумента");
			Если Не ЗначениеЗаполнено(ВидЭД) Тогда
				ВидЭД = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
			КонецЕсли;
			ПараметрыЭД.Тип = ВидЭД;

			Если УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ТребуетсяСформироватьУниверсальныйДокумент(Источник) Тогда
				Если УправлениеНебольшойФирмойЭлектронныеДокументыСервер.СчетФактураНеТребуется(Источник.Ссылка)
					ИЛИ НЕ УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЕстьСчетФактура(Источник.Ссылка) Тогда
					ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
					ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
				Иначе
					ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
					ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Обязательно;
				КонецЕсли;
			Иначе
				ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
			КонецЕсли;

		Иначе
			ВидЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "ВидЭлектронногоДокумента");
			Если Не ЗначениеЗаполнено(ВидЭД) Тогда
				ВидЭД = Перечисления.ТипыДокументовЭДО.ОтветНаЗаказ;
			КонецЕсли;
			ПараметрыЭД.Тип = ВидЭД;
		КонецЕсли;
		ПараметрыЭД.Направление = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СчетФактура") 
		ИЛИ ТипИсточника = Тип("ДокументОбъект.СчетФактура") Тогда

		Если УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЭтоКорректировочныйДокумент(Источник) Тогда
			ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура;
		Иначе
			ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.СчетФактура;
		КонецЕсли;

		ДокументОснование = Неопределено;
		Если Источник.ДокументыОснования.Количество() > 0 Тогда
			ДокументОснование = Источник.ДокументыОснования[0].ДокументОснование;
		КонецЕсли;

		Если НЕ (ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетОПереработке") 
			ИЛИ ТипЗнч(ДокументОснование) = Тип("ДокументОбъект.ОтчетОПереработке")) Тогда

			Если УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ТребуетсяСформироватьУниверсальныйДокумент(ДокументОснование)
				И Не УправлениеНебольшойФирмойЭлектронныеДокументыСервер.НеобходимоСформироватьЭлектронныйДокументСчетФактура(Источник) Тогда
				ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Обязательно;
			Иначе
				ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
			КонецЕсли;

		КонецЕсли;

		ПараметрыЭД.Направление = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СчетФактураПолученный") 
		ИЛИ ТипИсточника = Тип("ДокументОбъект.СчетФактураПолученный") Тогда

		Если УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЭтоКорректировочныйДокумент(Источник) Тогда
			ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.КорректировочныйСчетФактура;
		Иначе
			ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.СчетФактура;
		КонецЕсли;

		ПараметрыЭД.Направление = НаправленияДокументов.Входящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.АктВыполненныхРабот") 
		ИЛИ ТипИсточника = Тип("ДокументОбъект.АктВыполненныхРабот") Тогда

		ПараметрыЭД.Тип =  Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот;

		Если УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ТребуетсяСформироватьУниверсальныйДокумент(Источник) Тогда
			Если УправлениеНебольшойФирмойЭлектронныеДокументыСервер.СчетФактураНеТребуется(Источник.Ссылка)
				ИЛИ НЕ УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЕстьСчетФактура(Источник.Ссылка) Тогда
				ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
			Иначе
				ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
				ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Обязательно;
			КонецЕсли;
		Иначе
			ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
			ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
		КонецЕсли;

		ПараметрыЭД.Направление = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ДополнительныеРасходы") 
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ДополнительныеРасходы") Тогда

		ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.АктВыполненныхРабот;
		ПараметрыЭД.Направление = НаправленияДокументов.Входящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ПередачаТоваровМеждуОрганизациями")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ПередачаТоваровМеждуОрганизациями") Тогда

		Если УправлениеНебольшойФирмойЭлектронныеДокументыСервер.СчетФактураНеТребуется(Источник.Ссылка)
			ИЛИ НЕ УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЕстьСчетФактура(Источник.Ссылка) Тогда
			ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
			ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
		КонецЕсли;			

		ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
		ПараметрыЭД.Направление = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.КонтрагентПолучатель;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.АктОРасхождениях")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.АктОРасхождениях") Тогда

		ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.АктОРасхождениях;
		ПараметрыЭД.Направление = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.АктОРасхожденияхПолученный")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.АктОРасхожденияхПолученный") Тогда

		ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.АктОРасхождениях;
		ПараметрыЭД.Направление = НаправленияДокументов.Входящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ОтчетОПереработке") 
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ОтчетОПереработке") Тогда

		ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;

		Если УправлениеНебольшойФирмойЭлектронныеДокументыСервер.СчетФактураНеТребуется(Источник.Ссылка)
			ИЛИ НЕ УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЕстьСчетФактура(Источник.Ссылка) Тогда
			ПараметрыЭД.ФормированиеУниверсальногоДокумента = 
			ОбменСКонтрагентами.ВариантыФормированияУниверсальныхДокументов().Запрещено;
		КонецЕсли;

		ПараметрыЭД.Направление = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ОтчетПереработчика")
		ИЛИ ТипИсточника = Тип("ДокументОбъект.ОтчетПереработчика") Тогда

		ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
		ПараметрыЭД.Направление = НаправленияДокументов.Входящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Контрагент;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Договор;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.СверкаВзаиморасчетов") Тогда

		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Источник,
		"Организация, Контрагент");

		ПараметрыЭД.Тип                = Перечисления.ТипыДокументовЭДО.АктСверкиВзаиморасчетов;
		ПараметрыЭД.Направление        = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Организация        = ЗначенияРеквизитов.Организация;
		ПараметрыЭД.Контрагент         = ЗначенияРеквизитов.Контрагент;

		Если Источник.ДанныеОрганизации.Количество() > 0 Тогда
			ПараметрыЭД.ДоговорКонтрагента = Источник.ДанныеОрганизации[0].Договор;
		КонецЕсли;

	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.СверкаВзаиморасчетов") Тогда

		ПараметрыЭД.Тип                = Перечисления.ТипыДокументовЭДО.АктСверкиВзаиморасчетов;
		ПараметрыЭД.Направление        = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Организация        = Источник.Организация;
		ПараметрыЭД.Контрагент         = Источник.Контрагент;

		Если Источник.ДанныеОрганизации.Количество() > 0 Тогда
			ПараметрыЭД.ДоговорКонтрагента = Источник.ДанныеОрганизации[0].Договор;
		КонецЕсли; 

	ИначеЕсли ТипИсточника = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда

		ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Источник, 
		"Организация, Владелец, Ссылка");

		ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.ДоговорныйДокумент;
		ПараметрыЭД.Направление = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Организация = ЗначенияРеквизитов.Организация;
		ПараметрыЭД.Контрагент  = ЗначенияРеквизитов.Владелец;
		ПараметрыЭД.ДоговорКонтрагента = ЗначенияРеквизитов.Ссылка;

	ИначеЕсли ТипИсточника = Тип("СправочникОбъект.ДоговорыКонтрагентов") Тогда

		ПараметрыЭД.Тип = Перечисления.ТипыДокументовЭДО.ДоговорныйДокумент;
		ПараметрыЭД.Направление = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Организация = Источник.Организация;
		ПараметрыЭД.Контрагент  = Источник.Владелец;
		ПараметрыЭД.ДоговорКонтрагента = Источник.Ссылка;

	ИначеЕсли ТипИсточника = Тип("ДокументСсылка.ПеремещениеМеждуМОДИСМП")
		Или ТипИсточника = Тип("ДокументОбъект.ПеремещениеМеждуМОДИСМП") Тогда

		Реквизиты = "Организация";

		Если ТипИсточника = Тип("ДокументСсылка.ПеремещениеМеждуМОДИСМП") Тогда
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник, Реквизиты);
		Иначе
			ЗначенияРеквизитов = Новый Структура(Реквизиты);
			ЗаполнитьЗначенияСвойств(ЗначенияРеквизитов, Источник);
		КонецЕсли;

		ПараметрыЭД.Тип         = Перечисления.ТипыДокументовЭДО.ТоварнаяНакладная;
		ПараметрыЭД.Направление = НаправленияДокументов.Исходящий;
		ПараметрыЭД.Организация = ЗначенияРеквизитов.Организация;
		ПараметрыЭД.Контрагент  = ЗначенияРеквизитов.Организация;
		ПараметрыЭД.ДоговорКонтрагента = ОбщегоНазначенияИС.ПустоеЗначениеОпределяемогоТипа(Метаданные.ОпределяемыеТипы.ДоговорКонтрагентаИС);

	ИначеЕсли ТипИсточника = Тип("Структура") Тогда

		// Бизнес-сеть.
		ЗаполнитьЗначенияСвойств(ПараметрыЭД, Источник);

	КонецЕсли;

КонецПроцедуры

// Возвращает идентификаторы способов отражения в учете, доступных при загрузке электронного документа.
//
// Параметры:
//  ТипДокумента   - см. ОбменСКонтрагентами.ТипыДокументов   - тип элекронного документа.
//  СпособыОтраженияВУчете - СписокЗначений - список способов отражения в учете. В качестве значения задается строковый
//                           идентификатор, который будет передан в переопределяемый методы создания учетных документов
//                           по данным электронных. В качестве представления - представление способа отражения, которое
//                           может быть отображено пользователю.
//                           Выходной параметр.
//
&ИзменениеИКонтроль("СпособыОтраженияВУчетеТипаЭлектронногоДокумента")
Процедура T_СпособыОтраженияВУчетеТипаЭлектронногоДокумента(ТипДокумента, СпособыОтраженияВУчете) Экспорт

	ТипыДокументов = ОбменСКонтрагентами.ТипыДокументов();
	Если ТипДокумента = ТипыДокументов.АктВыполненныхРабот  Тогда

		СпособыОтраженияВУчете.Добавить("ПриходнаяНакладная", НСтр("ru = 'Приходная накладная'"), Истина);
		СпособыОтраженияВУчете.Добавить("ДополнительныеРасходы", НСтр("ru = 'Дополнительные расходы'"), Ложь);
		СпособыОтраженияВУчете.Добавить("ПоступлениеИзПереработки", НСтр("ru = 'Отчет переработчика'"), Ложь);

	ИначеЕсли ТипДокумента = ТипыДокументов.ТоварнаяНакладная Тогда

		СпособыОтраженияВУчете.Добавить("ПриходнаяНакладная", НСтр("ru = 'Приходная накладная'"), Истина);
        #Вставка
		СпособыОтраженияВУчете.Добавить("ПеремещениеЗапасов", НСтр("ru = 'Перемещение запасов'"), Истина);
		#КонецВставки
		
	ИначеЕсли ТипДокумента = ТипыДокументов.СоглашениеОбИзмененииСтоимости Тогда

		СпособыОтраженияВУчете.Добавить("ОпределяетсяПрограммой", НСтр("ru = 'Определяется программой'"), Истина);
		СпособыОтраженияВУчете.Добавить("КорректировкаПоступления", НСтр("ru = 'Корректировка поступления'"), Истина);

	ИначеЕсли ТипДокумента = ТипыДокументов.АктНаПередачуПрав Тогда

		СпособыОтраженияВУчете.Добавить("ПриходнаяНакладная", НСтр("ru = 'Приходная накладная'"), Истина);

	ИначеЕсли ТипДокумента = ТипыДокументов.КаталогТоваров Тогда

		СпособыОтраженияВУчете.Добавить("НоменклатураПоставщиков", НСтр("ru = 'Номенклатура поставщиков'"), Истина);

	ИначеЕсли ТипДокумента = ТипыДокументов.ПрайсЛист Тогда
	ИначеЕсли ТипДокумента = ТипыДокументов.ОтветНаЗаказ Тогда

		СпособыОтраженияВУчете.Добавить("ЗаказПоставщику", НСтр("ru = 'Заказ поставщику'"), Истина);

	ИначеЕсли ТипДокумента = ТипыДокументов.ПередачаТоваровМеждуОрганизациями Тогда	

	ИначеЕсли ТипДокумента = ТипыДокументов.ЗаказТовара Тогда

		СпособыОтраженияВУчете.Добавить("ЗаказПокупателя", НСтр("ru = 'Заказ покупателя'"),Истина);

	ИначеЕсли ТипДокумента = ТипыДокументов.КорректировочныйСчетФактура Тогда

		СпособыОтраженияВУчете.Добавить("СчетФактураПолученный", НСтр("ru = 'Счет-фактура (полученный)'"),Истина);

	ИначеЕсли ТипДокумента = ТипыДокументов.СчетФактура Тогда

		СпособыОтраженияВУчете.Добавить("СчетФактураПолученный", НСтр("ru = 'Счет-фактура (полученный)'"), Истина);

	ИначеЕсли ТипДокумента = ТипыДокументов.СчетНаОплату Тогда

		СпособыОтраженияВУчете.Добавить("СчетНаОплатуПоставщика", НСтр("ru = 'Счет на оплату (полученный)'"), Истина);

	ИначеЕсли ТипДокумента = ТипыДокументов.ОтчетОПродажахКомиссионногоТовара Тогда
	ИначеЕсли ТипДокумента = ТипыДокументов.ТоварнаяНакладная Тогда

		СпособыОтраженияВУчете.Добавить("ПриходнаяНакладная", НСтр("ru = 'Приходная накладная'"), Истина);

	ИначеЕсли ТипДокумента = ТипыДокументов.АктОРасхождениях Тогда

		СпособыОтраженияВУчете.Добавить("АктОРасхожденияхПолученный", НСтр("ru = 'Акт о расхождениях (полученный)'"), Истина);

	ИначеЕсли ТипДокумента = ТипыДокументов.АктСверкиВзаиморасчетов Тогда

		СпособыОтраженияВУчете.Добавить("АктСверкиВзаиморасчетов", НСтр("ru = 'Акт сверки взаиморасчетов'"), Истина);

	КонецЕсли;

КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьДанныеПередачаТоваров_ИнформацияПродавца")
Процедура спЗаполнитьДанныеПередачаТоваров_ИнформацияПродавца(Знач Основание, Знач Настройки, Данные, Описание, Отказ)  // { Разумов А.А. (TNEXT) 30.08.2025 Задача № 3950 Передача документов на склад Простор
    
    #Удаление
	УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЗаполнитьДанныеПередачаТоваров_ИнформацияПродавца(Основание, Настройки, Данные, Описание, Отказ);
    #КонецУдаления
	#Вставка	
	Если НЕ (ТипЗнч(Основание) = Тип("ДокументСсылка.ПриходнаяНакладная")
			И Основание.ВидОперации = Перечисления.ВидыОперацийПриходнаяНакладная.ПоступлениеОтПоставщика) Тогда
		УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЗаполнитьДанныеПередачаТоваров_ИнформацияПродавца(Основание, Настройки, Данные, Описание, Отказ);
		Возврат;	
	КонецЕсли;	
	НачатьТранзакцию();
	
	Попытка
		
		// Создаем на основании Приходной Расходную
		РасходнаяНакладная = Документы.РасходнаяНакладная.СоздатьДокумент();
		
		// Заполняем Расходную
		//РасходнаяНакладная.Заполнить(СсылкаНаОбъект); 
		УправлениеНебольшойФирмойЭлектронныеДокументыСервер.Т_ЗаполнитьОбязательныеРеквизиты(РасходнаяНакладная, Основание);
		РасходнаяНакладная.ВидОперации = Перечисления.ВидыОперацийРасходнаяНакладная.ПродажаПокупателю;
		РасходнаяНакладная.ОснованиеПечати = "Договор № ПФС-012/2024 от 18.09.2024";
		// При эмуляции учет остатков не нужен.	Возврат контроля произойдет при отмене транзации.
		Константы.КонтролироватьОстаткиПриПроведении.Установить(Ложь);
		
		// Записываем Расходную накладную
		РасходнаяНакладная.Записать(РежимЗаписиДокумента.Проведение); 
		
		// Создаем счет-фактуру 
		ДанныеСчетФактуры = СчетаФактурыУНФ.СоздатьСчетФактуру(РасходнаяНакладная.Ссылка, РасходнаяНакладная.Дата);
		//
		
		// Вызывываем исключение
		ВызватьИсключение "Эмуляция прошла успешно."; 
		
		// До этого места не дойдет никогда, но фиксирующая скобка нужна
		ЗафиксироватьТранзакцию();
		
	Исключение     
		
		Если ЗначениеЗаполнено(РасходнаяНакладная.Ссылка) Тогда
			
			// Если эмуляция прошла успешно.
			//ДанныеДляФормированияЭД = ПолучитьДанныеРеализацииТоваровИУслуг(РасходнаяНакладная.Ссылка);
			УправлениеНебольшойФирмойЭлектронныеДокументыСервер.ЗаполнитьДанныеПередачаТоваров_ИнформацияПродавца(РасходнаяНакладная.Ссылка, Настройки, Данные, Описание, Отказ);
			//Т_РедактироватьДанные(ДанныеДляФормированияЭД, Настройки);
			ОтменитьТранзакцию();
			
		Иначе                           
			
			// Если при эмуляции возникли ошибки
			ОтменитьТранзакцию();         
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			ВызватьИсключение ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке); 
			
		КонецЕсли;

	КонецПопытки;
	#КонецВставки
	
КонецПроцедуры // } Разумов А.А. (TNEXT) 30.08.2025

#КонецОбласти

#КонецОбласти