
#Область ПрограммныйИнтерфейс

Функция ОповещенияОЗаказахНаПеремещение() Экспорт

     МассивОповещений = ДанныеОповещенийОЗаказахНаПеремещение();
	 
	 Возврат МассивОповещений;
	 
КонецФункции

Процедура спОповещениеОЗаказеНаПеремещениеПриЗаписи(Источник, Отказ) Экспорт
	
	Если Источник.ОбменДанными.Загрузка = Истина Или Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Объект 			= Источник.Ссылка;
	ПустаяСсылка 	= ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект).ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	&Объект КАК Объект,
		|	спПравилаОповещенияОЗаписиОбъектовАдресаты.Пользователь КАК Пользователь,
		|	ЛОЖЬ КАК Оповещен
		|ИЗ
		|	Справочник.спПравилаОповещенияОЗаписиОбъектов.КонтролируемыеОбъекты КАК спПравилаОповещенияОЗаписиОбъектовКонтролируемыеОбъекты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.спПравилаОповещенияОЗаписиОбъектов.Адресаты КАК спПравилаОповещенияОЗаписиОбъектовАдресаты
		|		ПО спПравилаОповещенияОЗаписиОбъектовКонтролируемыеОбъекты.Ссылка = спПравилаОповещенияОЗаписиОбъектовАдресаты.Ссылка
		|ГДЕ
		|	спПравилаОповещенияОЗаписиОбъектовКонтролируемыеОбъекты.Объект.ЗначениеПустойСсылки = &ПустаяСсылка
		|
		|СГРУППИРОВАТЬ ПО
		|	спПравилаОповещенияОЗаписиОбъектовАдресаты.Пользователь";
	
	Запрос.УстановитьПараметр("Объект", 		Объект);
	Запрос.УстановитьПараметр("ПустаяСсылка", 	ПустаяСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		УстановитьПривилегированныйРежим(Истина);
		ЗаписатьИзмененияПоОповещениям(ВыборкаДетальныеЗаписи);
		УстановитьПривилегированныйРежим(Ложь);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДанныеОповещенийОЗаказахНаПеремещение()
	
	УстановитьПривилегированныйРежим(Истина);
	
    Пользователь = Пользователи.ТекущийПользователь();
	
	МассивОповещений = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	спОповещенияПользователейОбИзмененииОбъектов.Объект КАК Объект,
		|	ПРЕДСТАВЛЕНИЕ(спОповещенияПользователейОбИзмененииОбъектов.Объект) КАК ОбъектПредставление,
		|	спОповещенияПользователейОбИзмененииОбъектов.Пользователь КАК Пользователь,
		|	ИСТИНА КАК Оповещен
		|ИЗ
		|	РегистрСведений.спОповещенияПользователейОбИзмененииОбъектов КАК спОповещенияПользователейОбИзмененииОбъектов
		|ГДЕ
		|	спОповещенияПользователейОбИзмененииОбъектов.Пользователь = &Пользователь
		|	И НЕ спОповещенияПользователейОбИзмененииОбъектов.Оповещен";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДанныеОповещения = Новый Структура;
		
		Шаблон = НСтр("ru = 'Получен %1'");
		ТекстОповещения = СтрШаблон(Шаблон, ВыборкаДетальныеЗаписи.ОбъектПредставление);
		
		ДанныеОповещения.Вставить("Текст", ТекстОповещения);
		ДанныеОповещения.Вставить("Ссылка", ВыборкаДетальныеЗаписи.Объект);
		
		МассивОповещений.Добавить(ДанныеОповещения);
		
		ЗаписатьИзмененияПоОповещениям(ВыборкаДетальныеЗаписи, Истина);
		
	КонецЦикла;
	
	Возврат МассивОповещений;
	
КонецФункции

Процедура ЗаписатьИзмененияПоОповещениям(ДанныеОбОповещении, Удалить = Ложь)

    МенеджерЗаписи = РегистрыСведений.спОповещенияПользователейОбИзмененииОбъектов.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ДанныеОбОповещении);
	Если Удалить Тогда
		МенеджерЗаписи.Удалить();	
	Иначе
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти