
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СхемаКД    = Справочники.APIW_НастройкиОбменаAPI.ПолучитьМакет("СхемаОтбораНоменклатуры");
	АдресСхемы = ПоместитьВоВременноеХранилище(СхемаКД, УникальныйИдентификатор);
	
	Компоновщик.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	Компоновщик.ЗагрузитьНастройки(СхемаКД.НастройкиПоУмолчанию);
	
	ТекущийОбъект   = РеквизитФормыВЗначение("Объект");
	НастройкиОтбора = ТекущийОбъект.ДополнительныеУсловияОстатков.Получить();
	
	Если НастройкиОтбора <> Неопределено Тогда
		Компоновщик.ЗагрузитьНастройки(НастройкиОтбора);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	НастройкиОтбора = ТекущийОбъект.ДополнительныеУсловияОстатков.Получить();
	
	Если НастройкиОтбора <> Неопределено Тогда
		Попытка
			Компоновщик.ЗагрузитьНастройки(НастройкиОтбора);
		Исключение
			Сообщить("Не удалось загрузить сохранённые условия: " + КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.ДополнительныеУсловияОстатков = Новый ХранилищеЗначения(Компоновщик.ПолучитьНастройки());
	
КонецПроцедуры
