
#Область ПрограммныйИнтерфейс 

#Область КонтрольПродаж

//<<<--- Tnext Козык К.А. 16.06.2026 - адаптация под новый релиз 3.0.13.357
&ИзменениеИКонтроль("НастроитьЗапросСписокЧеков")
Процедура спНастроитьЗапросСписокЧеков(Форма, ДобавлятьЧекиНаВозврат, ДобавлятьОтложенныеЧекиВозврата, ДобавлятьЧекиКоррекции)

	Форма.Элементы.ПоВсемМагазинам.Видимость = Истина;

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад,
	|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы
	|ПОМЕСТИТЬ ДанныеТорговогоОбъекта
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
	|	И СтруктурныеЕдиницы.Ссылка = &ТорговыйОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтруктурныеЕдиницы.Ссылка КАК Склад
	|ПОМЕСТИТЬ ТаблицаСклады
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Родитель
	|ГДЕ
	|	ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка
	|ИЗ
	|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Ссылка
	|ГДЕ
	|	(ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
	|			ИЛИ ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДокументЧекККМ.Ссылка КАК Ссылка,
	|	ДокументЧекККМ.Номер КАК Номер,
	|	ДокументЧекККМ.НомерЧекаККМ КАК НомерККМ,
	#Вставка
	|	ДокументЧекККМ.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДокументЧекККМ.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПустаяСсылка)
	|				И ВЗБезналичнаяОплата.ОплатыБезналичная
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|		ИНАЧЕ ДокументЧекККМ.ФормаОплаты
	|	КОНЕЦ КАК ФормаОплаты,
	#КонецВставки
	|	ДокументЧекККМ.Дата КАК Дата,
	|	ДокументЧекККМ.КассаККМ КАК КассаККМ,
	|	ДокументЧекККМ.КассоваяСмена КАК КассоваяСмена,	
	|	ЕСТЬNULL(ДокументЧекККМ.КассоваяСмена.СтатусКассовойСмены, НЕОПРЕДЕЛЕНО) В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Перечисление.СтатусыОтчетаОРозничныхПродажах.Открыта)) КАК ВозможноПродолжитьЧек,
	|	ДокументЧекККМ.КассоваяСмена <> Значение(Документ.ОтчетОРозничныхПродажах.ПустаяСсылка) КАК СменаЗаполнена,
	|	ДокументЧекККМ.КассаККМ В (&МассивКассККМ) КАК ЭтоТекущаяКассаККМ,
	|	ДокументЧекККМ.Статус КАК Статус,
	|	ДокументЧекККМ.СуммаДокумента КАК СуммаДокумента,
	|	ДокументЧекККМ.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДокументЧекККМ.Проведен КАК Проведен,
	|	ДокументЧекККМ.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ДокументЧекККМ.Комментарий КАК Комментарий	
	#Вставка
	|ПОМЕСТИТЬ ВТДокументыЧекККМ
	#КонецВставки
	|ИЗ
	|	Документ.ЧекККМ КАК ДокументЧекККМ
	#Вставка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ЧекККМВозвратБезналичнаяОплата.Ссылка КАК Ссылка,
	|			ИСТИНА КАК ОплатыБезналичная
	|		ИЗ
	|			Документ.ЧекККМ.БезналичнаяОплата КАК ЧекККМВозвратБезналичнаяОплата
	|		ГДЕ
	|			ЧекККМВозвратБезналичнаяОплата.Ссылка.СтруктурнаяЕдиница В
	|					(ВЫБРАТЬ
	|						ТаблицаСклады.Склад КАК Склад
	|					ИЗ
	|						ТаблицаСклады КАК ТаблицаСклады)
	|			И НЕ ЧекККМВозвратБезналичнаяОплата.Ссылка.ПометкаУдаления
	|			И ЧекККМВозвратБезналичнаяОплата.Ссылка.Организация В(&МассивОрганизаций)) КАК ВЗБезналичнаяОплата
	|		ПО ДокументЧекККМ.Ссылка = ВЗБезналичнаяОплата.Ссылка
	#КонецВставки
	|ГДЕ
	|	НЕ ДокументЧекККМ.ПометкаУдаления
	|	И ДокументЧекККМ.СтруктурнаяЕдиница В
	|			(ВЫБРАТЬ
	|				ТаблицаСклады.Склад КАК Склад
	|			ИЗ
	|				ТаблицаСклады КАК ТаблицаСклады)
	|	И &ПоВсемМагазинам = ЛОЖЬ
	|	И ДокументЧекККМ.Организация В(&МассивОрганизаций)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументЧекККМ.Ссылка КАК Ссылка,
	|	ДокументЧекККМ.Номер КАК Номер,
	|	ДокументЧекККМ.НомерЧекаККМ КАК НомерККМ,
	#Вставка
	|	ДокументЧекККМ.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ДокументЧекККМ.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.ПустаяСсылка)
	|				И ВЗБезналичнаяОплата.ОплатыБезналичная
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
	|		ИНАЧЕ ДокументЧекККМ.ФормаОплаты
	|	КОНЕЦ КАК ФормаОплаты,
	#КонецВставки
	|	ДокументЧекККМ.Дата КАК Дата,
	|	ДокументЧекККМ.КассаККМ КАК КассаККМ,
	|	ДокументЧекККМ.КассоваяСмена КАК КассоваяСмена,	
	|	ЕСТЬNULL(ДокументЧекККМ.КассоваяСмена.СтатусКассовойСмены, НЕОПРЕДЕЛЕНО) В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Перечисление.СтатусыОтчетаОРозничныхПродажах.Открыта)) КАК ВозможноПродолжитьЧек,
	|	ДокументЧекККМ.КассоваяСмена <> Значение(Документ.ОтчетОРозничныхПродажах.ПустаяСсылка) КАК СменаЗаполнена,
	|	ДокументЧекККМ.КассаККМ В (&МассивКассККМ) КАК ЭтоТекущаяКассаККМ,
	|	ДокументЧекККМ.Статус КАК Статус,
	|	ДокументЧекККМ.СуммаДокумента КАК СуммаДокумента,
	|	ДокументЧекККМ.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ДокументЧекККМ.Проведен КАК Проведен,
	|	ДокументЧекККМ.ДисконтнаяКарта КАК ДисконтнаяКарта,
	|	ДокументЧекККМ.Комментарий КАК Комментарий	
	|ИЗ
	|	Документ.ЧекККМ КАК ДокументЧекККМ
	#Вставка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			ЧекККМВозвратБезналичнаяОплата.Ссылка КАК Ссылка,
	|			ИСТИНА КАК ОплатыБезналичная
	|		ИЗ
	|			Документ.ЧекККМ.БезналичнаяОплата КАК ЧекККМВозвратБезналичнаяОплата
	|		ГДЕ
	|			ЧекККМВозвратБезналичнаяОплата.Ссылка.СтруктурнаяЕдиница В
	|					(ВЫБРАТЬ
	|						ТаблицаСклады.Склад КАК Склад
	|					ИЗ
	|						ТаблицаСклады КАК ТаблицаСклады)
	|			И НЕ ЧекККМВозвратБезналичнаяОплата.Ссылка.ПометкаУдаления
	|			И ЧекККМВозвратБезналичнаяОплата.Ссылка.Организация В(&МассивОрганизаций)) КАК ВЗБезналичнаяОплата
	|		ПО ДокументЧекККМ.Ссылка = ВЗБезналичнаяОплата.Ссылка
	#КонецВставки
	|ГДЕ
	|	НЕ ДокументЧекККМ.ПометкаУдаления
	|	И &ПоВсемМагазинам = ИСТИНА
	|	И ДокументЧекККМ.Организация В(&МассивОрганизаций)
	|";

	Если ДобавлятьЧекиНаВозврат Тогда

		ТекстЗапроса = ТекстЗапроса +
		"
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМВозврат.Ссылка,
		|	ЧекККМВозврат.Номер,
		|	ЧекККМВозврат.НомерЧекаККМ,
		#Вставка
		|	ЧекККМВозврат.Контрагент,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВЗБезналичнаяОплата.ОплатыБезналичная, ЛОЖЬ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|	КОНЕЦ,
		#КонецВставки
		|	ЧекККМВозврат.Дата,
		|	ЧекККМВозврат.КассаККМ,
		|	ЧекККМВозврат.КассоваяСмена,
		|	ЕСТЬNULL(ЧекККМВозврат.КассоваяСмена.СтатусКассовойСмены, НЕОПРЕДЕЛЕНО) В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Перечисление.СтатусыОтчетаОРозничныхПродажах.Открыта)),
		|	ЧекККМВозврат.КассоваяСмена <> Значение(Документ.ОтчетОРозничныхПродажах.ПустаяСсылка),
		|	ЧекККМВозврат.КассаККМ В(&МассивКассККМ),	
		|	ЗНАЧЕНИЕ (Перечисление.СтатусыЧековККМ.Пробит),
		|	ЧекККМВозврат.СуммаДокумента,
		|	ЧекККМВозврат.ХозяйственнаяОперация,
		|	ЧекККМВозврат.Проведен,
		|	ЧекККМВозврат.ДисконтнаяКарта КАК ДисконтнаяКарта,
		|	ЧекККМВозврат.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
		#Вставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЧекККМВозвратБезналичнаяОплата.Ссылка КАК Ссылка,
		|			ИСТИНА КАК ОплатыБезналичная
		|		ИЗ
		|			Документ.ЧекККМВозврат.БезналичнаяОплата КАК ЧекККМВозвратБезналичнаяОплата
		|		ГДЕ
		|			ЧекККМВозвратБезналичнаяОплата.Ссылка.СтруктурнаяЕдиница В
		|					(ВЫБРАТЬ
		|						ТаблицаСклады.Склад КАК Склад
		|					ИЗ
		|						ТаблицаСклады КАК ТаблицаСклады)
		|			И НЕ ЧекККМВозвратБезналичнаяОплата.Ссылка.ПометкаУдаления
		|			И ЧекККМВозвратБезналичнаяОплата.Ссылка.Организация В(&МассивОрганизаций)) КАК ВЗБезналичнаяОплата
		|		ПО ЧекККМВозврат.Ссылка = ВЗБезналичнаяОплата.Ссылка
		#КонецВставки
		|ГДЕ
		|	НЕ ЧекККМВозврат.ПометкаУдаления
		|	И ЧекККМВозврат.СтруктурнаяЕдиница В
		|			(ВЫБРАТЬ
		|				ТаблицаСклады.Склад КАК Склад
		|			ИЗ
		|				ТаблицаСклады КАК ТаблицаСклады)
		|	И &ПоВсемМагазинам = ЛОЖЬ
		|	И ЧекККМВозврат.Организация В(&МассивОрганизаций)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМВозврат.Ссылка,
		|	ЧекККМВозврат.Номер,
		|	ЧекККМВозврат.НомерЧекаККМ,
		#Вставка
		|	ЧекККМВозврат.Контрагент,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВЗБезналичнаяОплата.ОплатыБезналичная, ЛОЖЬ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|	КОНЕЦ,
		#КонецВставки
		|	ЧекККМВозврат.Дата,
		|	ЧекККМВозврат.КассаККМ,
		|	ЧекККМВозврат.КассоваяСмена,
		|	ЕСТЬNULL(ЧекККМВозврат.КассоваяСмена.СтатусКассовойСмены, НЕОПРЕДЕЛЕНО) В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Перечисление.СтатусыОтчетаОРозничныхПродажах.Открыта)),
		|	ЧекККМВозврат.КассоваяСмена <> Значение(Документ.ОтчетОРозничныхПродажах.ПустаяСсылка),
		|	ЧекККМВозврат.КассаККМ В(&МассивКассККМ),	
		|	ЗНАЧЕНИЕ (Перечисление.СтатусыЧековККМ.Пробит),
		|	ЧекККМВозврат.СуммаДокумента,
		|	ЧекККМВозврат.ХозяйственнаяОперация,
		|	ЧекККМВозврат.Проведен,
		|	ЧекККМВозврат.ДисконтнаяКарта КАК ДисконтнаяКарта,
		|	ЧекККМВозврат.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
		#Вставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЧекККМВозвратБезналичнаяОплата.Ссылка КАК Ссылка,
		|			ИСТИНА КАК ОплатыБезналичная
		|		ИЗ
		|			Документ.ЧекККМВозврат.БезналичнаяОплата КАК ЧекККМВозвратБезналичнаяОплата
		|		ГДЕ
		|			ЧекККМВозвратБезналичнаяОплата.Ссылка.СтруктурнаяЕдиница В
		|					(ВЫБРАТЬ
		|						ТаблицаСклады.Склад КАК Склад
		|					ИЗ
		|						ТаблицаСклады КАК ТаблицаСклады)
		|			И НЕ ЧекККМВозвратБезналичнаяОплата.Ссылка.ПометкаУдаления
		|			И ЧекККМВозвратБезналичнаяОплата.Ссылка.Организация В(&МассивОрганизаций)) КАК ВЗБезналичнаяОплата
		|		ПО ЧекККМВозврат.Ссылка = ВЗБезналичнаяОплата.Ссылка
		#КонецВставки
		|ГДЕ
		|	НЕ ЧекККМВозврат.ПометкаУдаления
		|	И &ПоВсемМагазинам = ИСТИНА
		|	И ЧекККМВозврат.Организация В(&МассивОрганизаций)
		|";

	КонецЕсли;

	Если ДобавлятьОтложенныеЧекиВозврата Тогда

		ТекстЗапроса = ТекстЗапроса +
		"
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМВозврат.Ссылка,
		|	ЧекККМВозврат.Номер,
		|	ЧекККМВозврат.НомерЧекаККМ,
		#Вставка
		|	ЧекККМВозврат.Контрагент,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВЗБезналичнаяОплата.ОплатыБезналичная, ЛОЖЬ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|	КОНЕЦ,
		#КонецВставки
		|	ЧекККМВозврат.Дата,
		|	ЧекККМВозврат.КассаККМ,
		|	ЧекККМВозврат.КассоваяСмена,
		|	ЕСТЬNULL(ЧекККМВозврат.КассоваяСмена.СтатусКассовойСмены, НЕОПРЕДЕЛЕНО) В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Перечисление.СтатусыОтчетаОРозничныхПродажах.Открыта)),
		|	ЧекККМВозврат.КассоваяСмена <> Значение(Документ.ОтчетОРозничныхПродажах.ПустаяСсылка),
		|	ЧекККМВозврат.КассаККМ В (&МассивКассККМ),
		|	ВЫБОР
		|		КОГДА ЧекККМВозврат.НомерЧекаККМ = 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.ПустаяСсылка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|	КОНЕЦ,
		|	ЧекККМВозврат.СуммаДокумента,
		|	ЧекККМВозврат.ХозяйственнаяОперация,
		|	ЧекККМВозврат.Проведен,
		|	ЧекККМВозврат.ДисконтнаяКарта,
		|	ЧекККМВозврат.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
		#Вставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЧекККМВозвратБезналичнаяОплата.Ссылка КАК Ссылка,
		|			ИСТИНА КАК ОплатыБезналичная
		|		ИЗ
		|			Документ.ЧекККМВозврат.БезналичнаяОплата КАК ЧекККМВозвратБезналичнаяОплата
		|		ГДЕ
		|			ЧекККМВозвратБезналичнаяОплата.Ссылка.СтруктурнаяЕдиница В
		|					(ВЫБРАТЬ
		|						ТаблицаСклады.Склад КАК Склад
		|					ИЗ
		|						ТаблицаСклады КАК ТаблицаСклады)
		|			И НЕ ЧекККМВозвратБезналичнаяОплата.Ссылка.ПометкаУдаления
		|			И ЧекККМВозвратБезналичнаяОплата.Ссылка.Организация В(&МассивОрганизаций)) КАК ВЗБезналичнаяОплата
		|		ПО ЧекККМВозврат.Ссылка = ВЗБезналичнаяОплата.Ссылка
		#КонецВставки
		|ГДЕ
		|	НЕ ЧекККМВозврат.ПометкаУдаления
		|	И ЧекККМВозврат.НомерЧекаККМ = 0
		|	И ЧекККМВозврат.СтруктурнаяЕдиница В
		|			(ВЫБРАТЬ
		|				ТаблицаСклады.Склад КАК Склад
		|			ИЗ
		|				ТаблицаСклады КАК ТаблицаСклады)
		|	И &ПоВсемМагазинам = ЛОЖЬ
		|	И ЧекККМВозврат.Организация В(&МассивОрганизаций)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМВозврат.Ссылка,
		|	ЧекККМВозврат.Номер,
		|	ЧекККМВозврат.НомерЧекаККМ,
		#Вставка
		|	ЧекККМВозврат.Контрагент,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВЗБезналичнаяОплата.ОплатыБезналичная, ЛОЖЬ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|	КОНЕЦ,
		#КонецВставки
		|	ЧекККМВозврат.Дата,
		|	ЧекККМВозврат.КассаККМ,
		|	ЧекККМВозврат.КассоваяСмена,
		|	ЕСТЬNULL(ЧекККМВозврат.КассоваяСмена.СтатусКассовойСмены, НЕОПРЕДЕЛЕНО) В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Перечисление.СтатусыОтчетаОРозничныхПродажах.Открыта)),
		|	ЧекККМВозврат.КассоваяСмена <> Значение(Документ.ОтчетОРозничныхПродажах.ПустаяСсылка),
		|	ЧекККМВозврат.КассаККМ В (&МассивКассККМ),
		|	ВЫБОР
		|		КОГДА ЧекККМВозврат.НомерЧекаККМ = 0
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.ПустаяСсылка)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|	КОНЕЦ,
		|	ЧекККМВозврат.СуммаДокумента,
		|	ЧекККМВозврат.ХозяйственнаяОперация,
		|	ЧекККМВозврат.Проведен,
		|	ЧекККМВозврат.ДисконтнаяКарта,
		|	ЧекККМВозврат.Комментарий КАК Комментарий
		|ИЗ
		|	Документ.ЧекККМВозврат КАК ЧекККМВозврат
		#Вставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЧекККМВозвратБезналичнаяОплата.Ссылка КАК Ссылка,
		|			ИСТИНА КАК ОплатыБезналичная
		|		ИЗ
		|			Документ.ЧекККМВозврат.БезналичнаяОплата КАК ЧекККМВозвратБезналичнаяОплата
		|		ГДЕ
		|			ЧекККМВозвратБезналичнаяОплата.Ссылка.СтруктурнаяЕдиница В
		|					(ВЫБРАТЬ
		|						ТаблицаСклады.Склад КАК Склад
		|					ИЗ
		|						ТаблицаСклады КАК ТаблицаСклады)
		|			И НЕ ЧекККМВозвратБезналичнаяОплата.Ссылка.ПометкаУдаления
		|			И ЧекККМВозвратБезналичнаяОплата.Ссылка.Организация В(&МассивОрганизаций)) КАК ВЗБезналичнаяОплата
		|		ПО ЧекККМВозврат.Ссылка = ВЗБезналичнаяОплата.Ссылка
		#КонецВставки
		|ГДЕ
		|	НЕ ЧекККМВозврат.ПометкаУдаления
		|	И ЧекККМВозврат.НомерЧекаККМ = 0
		|	И &ПоВсемМагазинам = ИСТИНА
		|	И ЧекККМВозврат.Организация В(&МассивОрганизаций)
		|";

	КонецЕсли;

	Если ДобавлятьЧекиКоррекции Тогда

		ТекстЗапроса = ТекстЗапроса +
		"
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМКоррекции.Ссылка,
		|	ЧекККМКоррекции.Номер,
		|	ЧекККМКоррекции.НомерЧека,
		#Вставка
		|	ЧекККМКоррекции.Контрагент,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВЗБезналичнаяОплата.ОплатыБезналичная, ЛОЖЬ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|	КОНЕЦ,
		#КонецВставки
		|	ЧекККМКоррекции.Дата,
		|	ЧекККМКоррекции.КассаККМ,
		|	ЗНАЧЕНИЕ(Документ.ОтчетОРозничныхПродажах.ПустаяСсылка),
		|	НЕОПРЕДЕЛЕНО,
		|	ИСТИНА,
		|	ЧекККМКоррекции.КассаККМ В (&МассивКассККМ),
		|	ВЫБОР
		|		КОГДА ЧекККМКоррекции.ПробитЧек
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.ПустаяСсылка)
		|	КОНЕЦ,
		|	ОплатаЧекаКоррекции.Сумма,
		|	ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.ПустаяСсылка),
		|	ЧекККМКоррекции.Проведен,
		|	ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка),
		|	ЧекККМКоррекции.Комментарий
		|ИЗ
		|	Документ.ЧекККМКоррекции КАК ЧекККМКоррекции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМКоррекции.Оплата КАК ОплатаЧекаКоррекции
		|		ПО ОплатаЧекаКоррекции.Ссылка = ЧекККМКоррекции.Ссылка
		#Вставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЧекККМВозвратБезналичнаяОплата.Ссылка КАК Ссылка,
		|			ИСТИНА КАК ОплатыБезналичная
		|		ИЗ
		|			Документ.ЧекККМКоррекции.Оплата КАК ЧекККМВозвратБезналичнаяОплата
		|		ГДЕ
		|			НЕ ЧекККМВозвратБезналичнаяОплата.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.Наличные)
		|			И ЧекККМВозвратБезналичнаяОплата.Ссылка.СтруктурнаяЕдиница В
		|					(ВЫБРАТЬ
		|						ТаблицаСклады.Склад КАК Склад
		|					ИЗ
		|						ТаблицаСклады КАК ТаблицаСклады)
		|			И НЕ ЧекККМВозвратБезналичнаяОплата.Ссылка.ПометкаУдаления
		|			И ЧекККМВозвратБезналичнаяОплата.Ссылка.НомерЧека = 0
		|			И ЧекККМВозвратБезналичнаяОплата.Ссылка.Организация В(&МассивОрганизаций)) КАК ВЗБезналичнаяОплата
		|		ПО ЧекККМВозврат.Ссылка = ВЗБезналичнаяОплата.Ссылка
		#КонецВставки
		|ГДЕ
		|	НЕ ЧекККМКоррекции.ПометкаУдаления
		|	И &ПоВсемМагазинам = ЛОЖЬ
		|	И ЧекККМКоррекции.Организация В (&МассивОрганизаций)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЧекККМКоррекции.Ссылка,
		|	ЧекККМКоррекции.Номер,
		|	ЧекККМКоррекции.НомерЧека,
		#Вставка
		|	ЧекККМКоррекции.Контрагент,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ВЗБезналичнаяОплата.ОплатыБезналичная, ЛОЖЬ)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Безналичные)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыДенежныхСредств.Наличные)
		|	КОНЕЦ,
		#КонецВставки
		|	ЧекККМКоррекции.Дата,
		|	ЧекККМКоррекции.КассаККМ,
		|	ЗНАЧЕНИЕ(Документ.ОтчетОРозничныхПродажах.ПустаяСсылка),
		|	НЕОПРЕДЕЛЕНО,
		|	ИСТИНА,
		|	ЧекККМКоррекции.КассаККМ В (&МассивКассККМ),
		|	ВЫБОР
		|		КОГДА ЧекККМКоррекции.ПробитЧек
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.Пробит)
		|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыЧековККМ.ПустаяСсылка)
		|	КОНЕЦ,
		|	ОплатаЧекаКоррекции.Сумма,
		|	ЗНАЧЕНИЕ(Справочник.ХозяйственныеОперации.ПустаяСсылка),
		|	ЧекККМКоррекции.Проведен,
		|	ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка),
		|	ЧекККМКоррекции.Комментарий
		|ИЗ
		|	Документ.ЧекККМКоррекции КАК ЧекККМКоррекции
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЧекККМКоррекции.Оплата КАК ОплатаЧекаКоррекции
		|		ПО ОплатаЧекаКоррекции.Ссылка = ЧекККМКоррекции.Ссылка
		#Вставка
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		|			ЧекККМВозвратБезналичнаяОплата.Ссылка КАК Ссылка,
		|			ИСТИНА КАК ОплатыБезналичная
		|		ИЗ
		|			Документ.ЧекККМКоррекции.Оплата КАК ЧекККМВозвратБезналичнаяОплата
		|		ГДЕ
		|			НЕ ЧекККМВозвратБезналичнаяОплата.ТипОплаты = ЗНАЧЕНИЕ(Перечисление.ТипыОплатыККТ.Наличные)
		|			И ЧекККМВозвратБезналичнаяОплата.Ссылка.СтруктурнаяЕдиница В
		|					(ВЫБРАТЬ
		|						ТаблицаСклады.Склад КАК Склад
		|					ИЗ
		|						ТаблицаСклады КАК ТаблицаСклады)
		|			И НЕ ЧекККМВозвратБезналичнаяОплата.Ссылка.ПометкаУдаления
		|			И ЧекККМВозвратБезналичнаяОплата.Ссылка.НомерЧека = 0
		|			И ЧекККМВозвратБезналичнаяОплата.Ссылка.Организация В(&МассивОрганизаций)) КАК ВЗБезналичнаяОплата
		|		ПО ЧекККМВозврат.Ссылка = ВЗБезналичнаяОплата.Ссылка
		#КонецВставки
		|ГДЕ
		|	НЕ ЧекККМКоррекции.ПометкаУдаления
		|	И &ПоВсемМагазинам = ИСТИНА
		|	И ЧекККМКоррекции.Организация В (&МассивОрганизаций)";

	КонецЕсли;
    #Вставка
	ТекстЗапроса = ТекстЗапроса +
		"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КонтрагентыКонтактнаяИнформация.Ссылка КАК Ссылка,
		|	МАКСИМУМ(КонтрагентыКонтактнаяИнформация.НомерТелефона) КАК НомерТелефона
		|ПОМЕСТИТЬ ВТКонтрагентыКонтактнаяИнформация
		|ИЗ
		|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
		|ГДЕ
		|	КонтрагентыКонтактнаяИнформация.Ссылка В
		|			(ВЫБРАТЬ
		|				ВТДокументыЧекККМ.Контрагент КАК Контрагент
		|			ИЗ
		|				ВТДокументыЧекККМ КАК ВТДокументыЧекККМ)
		|
		|
		|СГРУППИРОВАТЬ ПО
		|	КонтрагентыКонтактнаяИнформация.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТДокументыЧекККМ.Ссылка КАК Ссылка,
		|	ВТДокументыЧекККМ.Номер КАК Номер,
		|	ВТДокументыЧекККМ.НомерККМ КАК НомерККМ,
		|	ВТДокументыЧекККМ.Контрагент КАК Контрагент,
		|	ВТКонтрагентыКонтактнаяИнформация.НомерТелефона КАК НомерТелефона,
		|	ВТДокументыЧекККМ.ФормаОплаты КАК ФормаОплаты,
		|	ВТДокументыЧекККМ.Дата КАК Дата,
		|	ВТДокументыЧекККМ.КассаККМ КАК КассаККМ,
		|	ВТДокументыЧекККМ.КассоваяСмена КАК КассоваяСмена,
		|	ВТДокументыЧекККМ.ВозможноПродолжитьЧек КАК ВозможноПродолжитьЧек,
		|	ВТДокументыЧекККМ.СменаЗаполнена КАК СменаЗаполнена,
		|	ВТДокументыЧекККМ.ЭтоТекущаяКассаККМ КАК ЭтоТекущаяКассаККМ,
		|	ВТДокументыЧекККМ.Статус КАК Статус,
		|	ВТДокументыЧекККМ.СуммаДокумента КАК СуммаДокумента,
		|	ВТДокументыЧекККМ.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
		|	ВТДокументыЧекККМ.Проведен КАК Проведен,
		|	ВТДокументыЧекККМ.ДисконтнаяКарта КАК ДисконтнаяКарта,
		|	ВТДокументыЧекККМ.Комментарий КАК Комментарий
		|ИЗ
		|	ВТДокументыЧекККМ КАК ВТДокументыЧекККМ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТКонтрагентыКонтактнаяИнформация КАК ВТКонтрагентыКонтактнаяИнформация
		|		ПО ВТДокументыЧекККМ.Контрагент = ВТКонтрагентыКонтактнаяИнформация.Ссылка";
	#КонецВставки
	
	ТаблицаЧековККМ = Форма.ТаблицаЧековККМ;

	ТаблицаЧековККМ.ПроизвольныйЗапрос = Истина;
	ТаблицаЧековККМ.ТекстЗапроса = ТекстЗапроса;

КонецПроцедуры

#КонецОбласти  

&После("ЗаполнитьТабличныеЧастиЧекККМ")
Процедура спЗаполнитьТабличныеЧастиЧекККМ(Форма, Источник, ТекущийЧек)
	
	Контрагент = ТекущийЧек.Контрагент;
	
	ИсточникРекламы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Контрагент, "ИсточникПривлеченияПокупателя");
		
	// Дозаполним комментарий источником привлечения клиента
	Если ЗначениеЗаполнено(ИсточникРекламы) Тогда
		ТекущийЧек.Комментарий = ИсточникРекламы;		
	КонецЕсли;
	
КонецПроцедуры

Процедура спЗаписатьИсточникВКонтрагента(Контрагент, ИсточникРекламыВистерия) 
	
	КонтрагентОбъект = Контрагент.ПолучитьОбъект();
	КонтрагентОбъект.ИсточникПривлеченияПокупателя = ИсточникРекламыВистерия;
	КонтрагентОбъект.ОбменДанными.Загрузка = Истина;
	КонтрагентОбъект.Записать();

КонецПроцедуры 

&ИзменениеИКонтроль("НастроитьДинамическийСписокТоваров")
Процедура спНастроитьДинамическийСписокТоваров(Форма)
	
	ИспользоватьАгентскиеПлатежиИРазделениеВыручки
		= ПолучитьФункциональнуюОпцию("ИспользоватьАгентскиеПлатежиИРазделениеВыручки");
	ИспользоватьХарактеристикиНоменклатуры = ИспользоватьХарактеристикиНоменклатуры();
	
	Если ИспользоватьХарактеристикиНоменклатуры Тогда
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТипыНоменклатуры.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТипыНоменклатуры
		|ИЗ
		|	Перечисление.ТипыНоменклатуры КАК ТипыНоменклатуры
		|ГДЕ
		|	ТипыНоменклатуры.Ссылка В (&МассивТиповНоменклатуры)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпрНоменклатура.Ссылка КАК Номенклатура,
		|	СпрНоменклатура.Наименование КАК Наименование,
		|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(100)) КАК НоменклатураНаименованиеДляПечати,
		|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СпрНоменклатура.Код КАК Код,
		|	СпрНоменклатура.Артикул КАК Артикул,
		|	СпрНоменклатура.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
		|	ВЫБОР
		|		КОГДА НЕ СпрНоменклатура.ВидАлкогольнойПродукции = ЗНАЧЕНИЕ(Справочник.ВидыАлкогольнойПродукции.ПустаяСсылка)
		|		И СпрНоменклатура.УдалитьВидПродукцииИС = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Алкогольная)
		|		ИНАЧЕ СпрНоменклатура.УдалитьВидПродукцииИС
		|	КОНЕЦ КАК ОсобенностьУчета,
		|	СпрНоменклатура.ЭтоНабор
		|	ИЛИ СпрНоменклатура.ЭтоАгентскаяУслуга
		|	И НЕ СпрДоговорыКонтрагентов.Ссылка ЕСТЬ NULL КАК ЭтоНабор,
		|	СпрНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	СпрНоменклатура.Номинал КАК Номинал,
		|	ЕСТЬNULL(ОписаниеНоменклатурыИС.КлючВидовПродукции, ЗНАЧЕНИЕ(Справочник.КлючиВидовПродукцииИС.ПустаяСсылка)) КАК
		|		КлючВидовПродукцииИС
		#Вставка
		|	, СпрНоменклатура.спБренд КАК Бренд
		#КонецВставки
		|ПОМЕСТИТЬ ТаблицаНоменклатура
		|ИЗ
		|	ТипыНоменклатуры КАК ТипыНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО ТипыНоменклатуры.Ссылка = СпрНоменклатура.ТипНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК СпрДоговорыКонтрагентов
		|		ПО СпрНоменклатура.Договор = СпрДоговорыКонтрагентов.Ссылка
		|		И СпрНоменклатура.ЭтоАгентскаяУслуга
		|		И СпрДоговорыКонтрагентов.АвтоматическиВыделятьВознаграждениеВЧеке
		|		И СпрДоговорыКонтрагентов.ПризнакАгента В (&ПризнакиПлатежногоАгента)
		|		И &ИспользоватьРазделениеВыручки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|		ПО СпрНоменклатура.Ссылка = ОписаниеНоменклатурыИС.Номенклатура
		|ГДЕ
		|	(НЕ СпрНоменклатура.ПометкаУдаления
		|	И НЕ СпрНоменклатура.Недействителен
		|	ИЛИ &ВключаяНеактуальные)
		|	И НЕ СпрНоменклатура.ЭтоГруппа
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
		|	ТаблицаНоменклатура.Наименование КАК Наименование,
		|	ТаблицаНоменклатура.НоменклатураНаименованиеДляПечати КАК НоменклатураНаименованиеДляПечати,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)) КАК
		|		Характеристика,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения,
		|			ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ТаблицаНоменклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
		|	КОНЕЦ КАК Упаковка,
		|	МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатуры.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК Период,
		|	ЕСТЬNULL(ЦеныНоменклатуры.ВидЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидЦен,
		|	ТаблицаНоменклатура.Код КАК Код,
		|	ТаблицаНоменклатура.Артикул КАК Артикул,
		|	ТаблицаНоменклатура.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
		|	ТаблицаНоменклатура.ОсобенностьУчета КАК ОсобенностьУчета,
		|	0 КАК Номинал,
		|	ТаблицаНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	ТаблицаНоменклатура.КлючВидовПродукцииИС КАК КлючВидовПродукцииИС
		#Вставка
		|	, ТаблицаНоменклатура.Бренд КАК Бренд
		#КонецВставки
		|ПОМЕСТИТЬ ТаблицаМаксПериодЦен
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|ГДЕ
		|	ЦеныНоменклатуры.Период <= &Дата
		|	И ЦеныНоменклатуры.ВидЦен = &ВидЦены
		|	И ЦеныНоменклатуры.Актуальность
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНоменклатура.Код,
		|	ТаблицаНоменклатура.Артикул,
		|	ТаблицаНоменклатура.КатегорияНоменклатуры,
		|	ТаблицаНоменклатура.ОсобенностьУчета,
		|	ТаблицаНоменклатура.КлючВидовПродукцииИС,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
		|	ЕСТЬNULL(ЦеныНоменклатуры.Характеристика, ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения,
		|			ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ТаблицаНоменклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
		|	КОНЕЦ,
		|	ЕСТЬNULL(ЦеныНоменклатуры.ВидЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)),
		|	ТаблицаНоменклатура.ТипНоменклатуры,
		|	ТаблицаНоменклатура.НоменклатураНаименованиеДляПечати,
		|	ТаблицаНоменклатура.Наименование
		#Вставка
		|	, ТаблицаНоменклатура.Бренд
		#КонецВставки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	ТаблицаНоменклатура.Наименование,
		|	ТаблицаНоменклатура.НоменклатураНаименованиеДляПечати,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	ТаблицаНоменклатура.ЕдиницаИзмерения,
		|	&Дата,
		|	&ВидЦены,
		|	ТаблицаНоменклатура.Код,
		|	ТаблицаНоменклатура.Артикул,
		|	ТаблицаНоменклатура.КатегорияНоменклатуры,
		|	ТаблицаНоменклатура.ОсобенностьУчета,
		|	0,
		|	ТаблицаНоменклатура.ТипНоменклатуры,
		|	ТаблицаНоменклатура.КлючВидовПродукцииИС
		#Вставка
		|	, ТаблицаНоменклатура.Бренд
		#КонецВставки
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ВидЦен = &ВидЦены) КАК ЦеныНоменклатуры
		|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|ГДЕ
		|	(ТаблицаНоменклатура.ЭтоНабор
		|	ИЛИ &ВключаяБезЦен)
		|	И ЦеныНоменклатуры.Номенклатура ЕСТЬ NULL
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНоменклатура.Код,
		|	ТаблицаНоменклатура.Артикул,
		|	ТаблицаНоменклатура.КатегорияНоменклатуры,
		|	ТаблицаНоменклатура.ОсобенностьУчета,
		|	ТаблицаНоменклатура.КлючВидовПродукцииИС,
		|	ТаблицаНоменклатура.Номенклатура,
		|	ТаблицаНоменклатура.ЕдиницаИзмерения,
		|	ТаблицаНоменклатура.ТипНоменклатуры,
		|	ТаблицаНоменклатура.НоменклатураНаименованиеДляПечати,
		|	ТаблицаНоменклатура.Наименование,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		#Вставка
		|	, ТаблицаНоменклатура.Бренд
		#КонецВставки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	ТаблицаНоменклатура.Наименование,
		|	ТаблицаНоменклатура.НоменклатураНаименованиеДляПечати,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка),
		|	ТаблицаНоменклатура.ЕдиницаИзмерения,
		|	&Дата,
		|	&ВидЦены,
		|	ТаблицаНоменклатура.Код,
		|	ТаблицаНоменклатура.Артикул,
		|	ТаблицаНоменклатура.КатегорияНоменклатуры,
		|	ТаблицаНоменклатура.ОсобенностьУчета,
		|	ТаблицаНоменклатура.Номинал,
		|	ТаблицаНоменклатура.ТипНоменклатуры,
		|	ТаблицаНоменклатура.КлючВидовПродукцииИС
		#Вставка
		|	, ТаблицаНоменклатура.Бренд
		#КонецВставки
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|ГДЕ
		|	ТаблицаНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНоменклатура.Код,
		|	ТаблицаНоменклатура.Артикул,
		|	ТаблицаНоменклатура.КатегорияНоменклатуры,
		|	ТаблицаНоменклатура.ОсобенностьУчета,
		|	ТаблицаНоменклатура.КлючВидовПродукцииИС,
		|	ТаблицаНоменклатура.Номенклатура,
		|	ТаблицаНоменклатура.ЕдиницаИзмерения,
		|	ТаблицаНоменклатура.Номинал,
		|	ТаблицаНоменклатура.ТипНоменклатуры,
		|	ТаблицаНоменклатура.НоменклатураНаименованиеДляПечати,
		|	ТаблицаНоменклатура.Наименование,
		|	ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		#Вставка
		|	, ТаблицаНоменклатура.Бренд
		#КонецВставки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	ВидЦен,
		|	Номенклатура,
		|	Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаМаксПериодЦен.Номенклатура КАК Номенклатура,
		|	ТаблицаМаксПериодЦен.Наименование КАК Наименование,
		|	ТаблицаМаксПериодЦен.НоменклатураНаименованиеДляПечати КАК НоменклатураНаименованиеДляПечати,
		|	ТаблицаМаксПериодЦен.Характеристика КАК Характеристика,
		|	ТаблицаМаксПериодЦен.Упаковка КАК Упаковка,
		|	ТаблицаМаксПериодЦен.Период КАК Период,
		|	ТаблицаМаксПериодЦен.ВидЦен КАК ВидЦен,
		|	ТаблицаМаксПериодЦен.Код КАК Код,
		|	ТаблицаМаксПериодЦен.Артикул КАК Артикул,
		|	ТаблицаМаксПериодЦен.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
		|	ТаблицаМаксПериодЦен.ОсобенностьУчета КАК ОсобенностьУчета,
		|	ТаблицаМаксПериодЦен.КлючВидовПродукцииИС КАК КлючВидовПродукцииИС,
		|	ВЫБОР
		|		КОГДА ТаблицаМаксПериодЦен.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
		|			ТОГДА ТаблицаМаксПериодЦен.Номинал
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
		|	КОНЕЦ КАК Цена,
		|	ВЫБОР
		|		КОГДА ЦеныНоменклатуры.ВалютаЦены <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|			ТОГДА ЦеныНоменклатуры.ВалютаЦены
		|		ИНАЧЕ ЦеныНоменклатуры.ВидЦен.ВалютаЦены
		|	КОНЕЦ КАК ВалютаЦены
		#Вставка
		|	, ТаблицаМаксПериодЦен.Бренд КАК Бренд
		#КонецВставки
		|ПОМЕСТИТЬ ТаблицаИтоговыхЦен
		|ИЗ
		|	ТаблицаМаксПериодЦен КАК ТаблицаМаксПериодЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаМаксПериодЦен.Период = ЦеныНоменклатуры.Период
		|		И ТаблицаМаксПериодЦен.ВидЦен = ЦеныНоменклатуры.ВидЦен
		|		И ТаблицаМаксПериодЦен.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|		И ТаблицаМаксПериодЦен.Характеристика = ЦеныНоменклатуры.Характеристика
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Упаковка,
		|	ВалютаЦены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Курсы.Валюта КАК Валюта,
		|	Курсы.Курс КАК Курс,
		|	Курсы.Кратность КАК Кратность
		|ПОМЕСТИТЬ КурсыВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта В
		|		(ВЫБРАТЬ
		|			Таблица.ВалютаЦены
		|		ИЗ
		|			ТаблицаИтоговыхЦен КАК Таблица)) КАК Курсы
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаИтоговыхЦен.Номенклатура КАК Номенклатура,
		|	ТаблицаИтоговыхЦен.Наименование КАК Наименование,
		|	ТаблицаИтоговыхЦен.НоменклатураНаименованиеДляПечати КАК НоменклатураНаименованиеДляПечати,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(СпрХарактеристикиНоменклатуры.НаименованиеДляПечати КАК СТРОКА(150)), """") КАК
		|		ХарактеристикаНаименованиеДляПечати,
		|	ТаблицаИтоговыхЦен.Характеристика КАК Характеристика,
		|	ТаблицаИтоговыхЦен.Упаковка КАК Упаковка,
		|	ТаблицаИтоговыхЦен.Период КАК Период,
		|	ТаблицаИтоговыхЦен.ВидЦен КАК ВидЦен,
		|	ТаблицаИтоговыхЦен.Код КАК Код,
		|	ТаблицаИтоговыхЦен.Артикул КАК Артикул,
		|	ТаблицаИтоговыхЦен.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
		|	ТаблицаИтоговыхЦен.ОсобенностьУчета КАК ОсобенностьУчета,
		|	ТаблицаИтоговыхЦен.КлючВидовПродукцииИС КАК КлючВидовПродукцииИС,
		|	ТаблицаИтоговыхЦен.Цена * ЕСТЬNULL(КурсыВалют.Курс, 1) * ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК Цена,
		|	ВЫБОР
		|		КОГДА ТаблицаИтоговыхЦен.Упаковка ССЫЛКА Справочник.ЕдиницыИзмерения
		|			ТОГДА ЕСТЬNULL(ЕдиницыИзмерения.Коэффициент, 1)
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентУпаковки
		#Вставка
		|	, ТаблицаИтоговыхЦен.Бренд КАК Бренд
		#КонецВставки
		|ПОМЕСТИТЬ ТаблицаКоэффициентыУпаковок
		|ИЗ
		|	ТаблицаИтоговыхЦен КАК ТаблицаИтоговыхЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|		ПО ТаблицаИтоговыхЦен.Упаковка = ЕдиницыИзмерения.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
		|		ПО ТаблицаИтоговыхЦен.ВалютаЦены = КурсыВалют.Валюта
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ХарактеристикиНоменклатуры КАК СпрХарактеристикиНоменклатуры
		|		ПО ТаблицаИтоговыхЦен.Характеристика = СпрХарактеристикиНоменклатуры.Ссылка
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка КАК Склад,
		|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы
		|ПОМЕСТИТЬ ДанныеТорговогоОбъекта
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|ГДЕ
		|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
		|	И СтруктурныеЕдиницы.Ссылка = &ТорговыйОбъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка КАК Склад
		|ПОМЕСТИТЬ ТаблицаСклады
		|ИЗ
		|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Родитель
		|ГДЕ
		|	ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка
		|ИЗ
		|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Ссылка
		|ГДЕ
		|	ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|	ИЛИ ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ОстаткиТоваров.Количество) КАК Количество,
		|	СУММА(ОстаткиТоваров.Резерв) КАК Резерв,
		|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваров.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ТаблицаОстатки
		|ИЗ
		|	РегистрСведений.ОстаткиТоваров КАК ОстаткиТоваров
		|ГДЕ
		|	ОстаткиТоваров.СтруктурнаяЕдиница В
		|		(ВЫБРАТЬ
		|			ТаблицаСклады.Склад КАК Склад
		|		ИЗ
		|			ТаблицаСклады КАК ТаблицаСклады)
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваров.Номенклатура,
		|	ОстаткиТоваров.Характеристика
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Характеристика
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(КодыТоваровSKU.SKU) КАК SKU,
		|	КодыТоваровSKU.Номенклатура КАК Номенклатура,
		|	КодыТоваровSKU.Характеристика КАК Характеристика,
		|	КодыТоваровSKU.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ КодыSKU
		|ИЗ
		|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|ГДЕ
		|	КодыТоваровSKU.Партия = ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
		|СГРУППИРОВАТЬ ПО
		|	КодыТоваровSKU.Номенклатура,
		|	КодыТоваровSKU.Характеристика,
		|	КодыТоваровSKU.ЕдиницаИзмерения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаКоэффициентыУпаковок.Номенклатура КАК Номенклатура,
		|	ТаблицаКоэффициентыУпаковок.Наименование КАК Наименование,
		|	ТаблицаКоэффициентыУпаковок.НоменклатураНаименованиеДляПечати КАК НоменклатураНаименованиеДляПечати,
		|	ТаблицаКоэффициентыУпаковок.ХарактеристикаНаименованиеДляПечати КАК ХарактеристикаНаименованиеДляПечати,
		|	ТаблицаКоэффициентыУпаковок.Характеристика КАК Характеристика,
		|	ТаблицаКоэффициентыУпаковок.Упаковка КАК Упаковка,
		|	ТаблицаКоэффициентыУпаковок.Период КАК Период,
		|	ТаблицаКоэффициентыУпаковок.Цена КАК Цена,
		|	ТаблицаКоэффициентыУпаковок.Код КАК Код,
		|	ТаблицаКоэффициентыУпаковок.Артикул КАК Артикул,
		|	ТаблицаКоэффициентыУпаковок.КатегорияНоменклатуры КАК ВидНоменклатуры,
		|	ТаблицаКоэффициентыУпаковок.ОсобенностьУчета КАК ОсобенностьУчета,
		|	ТаблицаКоэффициентыУпаковок.КлючВидовПродукцииИС КАК КлючВидовПродукцииИС,
		|	ЕСТЬNULL(ТаблицаОстатки.Резерв, 0) / ТаблицаКоэффициентыУпаковок.КоэффициентУпаковки КАК ВРезерве,
		|	ЕСТЬNULL(ТаблицаОстатки.Количество, 0) / ТаблицаКоэффициентыУпаковок.КоэффициентУпаковки КАК Доступно,
		|	ТаблицаКоэффициентыУпаковок.Номенклатура.Родитель КАК Группа,
		|	КодыSKU.SKU КАК SKU
		#Вставка
		|	, ТаблицаКоэффициентыУпаковок.Бренд КАК Бренд
		#КонецВставки
		|ПОМЕСТИТЬ ДоРазвертки
		|ИЗ
		|	ТаблицаКоэффициентыУпаковок КАК ТаблицаКоэффициентыУпаковок
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатки КАК ТаблицаОстатки
		|		ПО ТаблицаКоэффициентыУпаковок.Номенклатура = ТаблицаОстатки.Номенклатура
		|		И ТаблицаКоэффициентыУпаковок.Характеристика = ТаблицаОстатки.Характеристика
		|		ЛЕВОЕ СОЕДИНЕНИЕ КодыSKU КАК КодыSKU
		|		ПО ТаблицаКоэффициентыУпаковок.Номенклатура = КодыSKU.Номенклатура
		|		И ТаблицаКоэффициентыУпаковок.Характеристика = КодыSKU.Характеристика
		|		И ВЫБОР
		|			КОГДА ТаблицаКоэффициентыУпаковок.Упаковка ССЫЛКА Справочник.ЕдиницыИзмерения
		|				ТОГДА ТаблицаКоэффициентыУпаковок.Упаковка = КодыSKU.ЕдиницаИзмерения
		|			ИНАЧЕ КодыSKU.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоРазвертки.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДоРазвертки.Характеристика) КАК КоличествоХарактеристик,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДоРазвертки.Упаковка) КАК КоличествоУпаковок
		#Вставка
		|	, ДоРазвертки.Бренд КАК Бренд
		#КонецВставки
		|ПОМЕСТИТЬ СтрокиПоНоменклатурам
		|ИЗ
		|	ДоРазвертки КАК ДоРазвертки
		|СГРУППИРОВАТЬ ПО
		|	ДоРазвертки.Номенклатура
		#Вставка
		|	, ДоРазвертки.Бренд
		#КонецВставки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрокиПоНоменклатурам.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ НоменклатураДляРазвертки
		|ИЗ
		|	СтрокиПоНоменклатурам КАК СтрокиПоНоменклатурам
		|ГДЕ
		|	СтрокиПоНоменклатурам.КоличествоХарактеристик > 1
		|	ИЛИ СтрокиПоНоменклатурам.КоличествоУпаковок > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоРазвертки.Номенклатура КАК Номенклатура,
		|	ДоРазвертки.Наименование КАК Наименование,
		|	ДоРазвертки.НоменклатураНаименованиеДляПечати КАК НоменклатураНаименованиеДляПечати,
		|	ДоРазвертки.Код КАК Код,
		|	ДоРазвертки.Артикул КАК Артикул,
		|	ДоРазвертки.ОсобенностьУчета КАК ОсобенностьУчета,
		|	ДоРазвертки.КлючВидовПродукцииИС КАК КлючВидовПродукцииИС,
		|	ДоРазвертки.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ДоРазвертки.Группа КАК Группа
		#Вставка
		|	, ДоРазвертки.Бренд КАК Бренд
		#КонецВставки
		|ПОМЕСТИТЬ СтрокиДляРазвертки
		|ИЗ
		|	НоменклатураДляРазвертки КАК НоменклатураДляРазвертки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДоРазвертки КАК ДоРазвертки
		|		ПО НоменклатураДляРазвертки.Номенклатура = ДоРазвертки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпрНоменклатура.Ссылка КАК Номенклатура,
		|	СпрНоменклатура.Наименование КАК Наименование,
		|	СпрНоменклатура.Наименование КАК НоменклатураНаименованиеДляПечати,
		|	NULL КАК ХарактеристикаНаименованиеДляПечати,
		|	NULL КАК Характеристика,
		|	NULL КАК Упаковка,
		|	NULL КАК Период,
		|	NULL КАК Цена,
		|	СпрНоменклатура.Код КАК Код,
		|	NULL КАК Артикул,
		|	NULL КАК ОсобенностьУчета,
		|	NULL КАК КлючВидовПродукцииИС,
		|	NULL КАК ВидНоменклатуры,
		|	NULL КАК ВРезерве,
		|	NULL КАК Доступно,
		|	СпрНоменклатура.Родитель КАК Родитель,
		|	0 КАК ВидСтроки,
		|	NULL КАК SKU
		#Вставка
		|	, NULL КАК Бренд
		#КонецВставки
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ГДЕ
		|	СпрНоменклатура.ЭтоГруппа = ИСТИНА
		|	И ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СпрНоменклатура.Ссылка,
		|	СтрокиДляРазвертки.Наименование,
		|	СтрокиДляРазвертки.НоменклатураНаименованиеДляПечати,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	NULL,
		|	СтрокиДляРазвертки.Код,
		|	СтрокиДляРазвертки.Артикул,
		|	СтрокиДляРазвертки.ОсобенностьУчета,
		|	СтрокиДляРазвертки.КлючВидовПродукцииИС,
		|	СтрокиДляРазвертки.ВидНоменклатуры,
		|	NULL,
		|	NULL,
		|	СтрокиДляРазвертки.Группа,
		|	1,
		|	NULL
		#Вставка
		|	, СтрокиДляРазвертки.Бренд
		#КонецВставки
		|ИЗ
		|	СтрокиДляРазвертки КАК СтрокиДляРазвертки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО СтрокиДляРазвертки.Номенклатура = СпрНоменклатура.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СпрНоменклатура.Ссылка,
		|	ДоРазвертки.Наименование,
		|	ДоРазвертки.НоменклатураНаименованиеДляПечати,
		|	ДоРазвертки.ХарактеристикаНаименованиеДляПечати,
		|	ДоРазвертки.Характеристика,
		|	ДоРазвертки.Упаковка,
		|	ДоРазвертки.Период,
		|	ДоРазвертки.Цена,
		|	ДоРазвертки.Код,
		|	ДоРазвертки.Артикул,
		|	ДоРазвертки.ОсобенностьУчета,
		|	ДоРазвертки.КлючВидовПродукцииИС,
		|	ДоРазвертки.ВидНоменклатуры,
		|	ДоРазвертки.ВРезерве,
		|	ДоРазвертки.Доступно,
		|	ДоРазвертки.Группа,
		|	2,
		|	ДоРазвертки.SKU
		#Вставка
		|	, ДоРазвертки.Бренд
		#КонецВставки
		|ИЗ
		|	ДоРазвертки КАК ДоРазвертки
		|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураДляРазвертки КАК НоменклатураДляРазвертки
		|		ПО ДоРазвертки.Номенклатура = НоменклатураДляРазвертки.Номенклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО ДоРазвертки.Номенклатура = СпрНоменклатура.Ссылка
		|ГДЕ
		|	НоменклатураДляРазвертки.Номенклатура ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СпрНоменклатура.Ссылка,
		|	ДоРазвертки.Наименование,
		|	ДоРазвертки.НоменклатураНаименованиеДляПечати,
		|	ДоРазвертки.ХарактеристикаНаименованиеДляПечати,
		|	ДоРазвертки.Характеристика,
		|	ДоРазвертки.Упаковка,
		|	ДоРазвертки.Период,
		|	ДоРазвертки.Цена,
		|	ДоРазвертки.Код,
		|	ДоРазвертки.Артикул,
		|	ДоРазвертки.ОсобенностьУчета,
		|	ДоРазвертки.КлючВидовПродукцииИС,
		|	ДоРазвертки.ВидНоменклатуры,
		|	ДоРазвертки.ВРезерве,
		|	ДоРазвертки.Доступно,
		|	ДоРазвертки.Группа,
		|	3,
		|	ДоРазвертки.SKU
		#Вставка
		|	, ДоРазвертки.Бренд
		#КонецВставки
		|ИЗ
		|	ДоРазвертки КАК ДоРазвертки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО ДоРазвертки.Номенклатура = СпрНоменклатура.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НоменклатураДляРазвертки КАК НоменклатураДляРазвертки
		|		ПО ДоРазвертки.Номенклатура = НоменклатураДляРазвертки.Номенклатура";
		
	Иначе
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ТипыНоменклатуры.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТипыНоменклатуры
		|ИЗ
		|	Перечисление.ТипыНоменклатуры КАК ТипыНоменклатуры
		|ГДЕ
		|	ТипыНоменклатуры.Ссылка В (&МассивТиповНоменклатуры)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпрНоменклатура.Ссылка КАК Номенклатура,
		|	СпрНоменклатура.Наименование КАК Наименование,
		|	ВЫРАЗИТЬ(СпрНоменклатура.НаименованиеПолное КАК СТРОКА(100)) КАК НоменклатураНаименованиеДляПечати,
		|	СпрНоменклатура.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	СпрНоменклатура.Код КАК Код,
		|	СпрНоменклатура.Артикул КАК Артикул,
		|	СпрНоменклатура.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
		|	ВЫБОР
		|		КОГДА НЕ СпрНоменклатура.ВидАлкогольнойПродукции = ЗНАЧЕНИЕ(Справочник.ВидыАлкогольнойПродукции.ПустаяСсылка)
		|		И СпрНоменклатура.УдалитьВидПродукцииИС = ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.ПустаяСсылка)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ВидыПродукцииИС.Алкогольная)
		|		ИНАЧЕ СпрНоменклатура.УдалитьВидПродукцииИС
		|	КОНЕЦ КАК ОсобенностьУчета,
		|	ЕСТЬNULL(ОписаниеНоменклатурыИС.КлючВидовПродукции, ЗНАЧЕНИЕ(Справочник.КлючиВидовПродукцииИС.ПустаяСсылка)) КАК
		|		КлючВидовПродукцииИС,
		|	СпрНоменклатура.ЭтоНабор
		|	ИЛИ СпрНоменклатура.ЭтоАгентскаяУслуга
		|	И НЕ СпрДоговорыКонтрагентов.Ссылка ЕСТЬ NULL КАК ЭтоНабор,
		|	СпрНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры,
		|	СпрНоменклатура.Номинал КАК Номинал
		#Вставка
		|	, СпрНоменклатура.спБренд КАК Бренд
		#КонецВставки
		|ПОМЕСТИТЬ ТаблицаНоменклатура
		|ИЗ
		|	ТипыНоменклатуры КАК ТипыНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК СпрДоговорыКонтрагентов
		|			ПО СпрНоменклатура.Договор = СпрДоговорыКонтрагентов.Ссылка
		|			И СпрНоменклатура.ЭтоАгентскаяУслуга
		|			И СпрДоговорыКонтрагентов.АвтоматическиВыделятьВознаграждениеВЧеке
		|			И СпрДоговорыКонтрагентов.ПризнакАгента В (&ПризнакиПлатежногоАгента)
		|			И &ИспользоватьРазделениеВыручки
		|		ПО ТипыНоменклатуры.Ссылка = СпрНоменклатура.ТипНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОписаниеНоменклатурыИС КАК ОписаниеНоменклатурыИС
		|		ПО СпрНоменклатура.Ссылка = ОписаниеНоменклатурыИС.Номенклатура
		|ГДЕ
		|	(НЕ СпрНоменклатура.ПометкаУдаления
		|	И НЕ СпрНоменклатура.Недействителен
		|	ИЛИ &ВключаяНеактуальные)
		|	И НЕ СпрНоменклатура.ЭтоГруппа
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ЦеныНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)) КАК Номенклатура,
		|	ТаблицаНоменклатура.Наименование КАК Наименование,
		|	ТаблицаНоменклатура.НоменклатураНаименованиеДляПечати КАК НоменклатураНаименованиеДляПечати,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения,
		|			ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ТаблицаНоменклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
		|	КОНЕЦ КАК Упаковка,
		|	МАКСИМУМ(ЕСТЬNULL(ЦеныНоменклатуры.Период, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))) КАК Период,
		|	ЕСТЬNULL(ЦеныНоменклатуры.ВидЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)) КАК ВидЦен,
		|	ТаблицаНоменклатура.Код КАК Код,
		|	ТаблицаНоменклатура.Артикул КАК Артикул,
		|	ТаблицаНоменклатура.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
		|	ТаблицаНоменклатура.ОсобенностьУчета КАК ОсобенностьУчета,
		|	ТаблицаНоменклатура.КлючВидовПродукцииИС КАК КлючВидовПродукцииИС,
		|	0 КАК Номинал,
		|	ТаблицаНоменклатура.ТипНоменклатуры КАК ТипНоменклатуры
		#Вставка
		|	, ТаблицаНоменклатура.Бренд КАК Бренд
		#КонецВставки
		|ПОМЕСТИТЬ ТаблицаМаксПериодЦен
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|ГДЕ
		|	ЦеныНоменклатуры.Период <= &Дата
		|	И ЦеныНоменклатуры.ВидЦен = &ВидЦены
		|	И ЦеныНоменклатуры.Актуальность
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНоменклатура.Код,
		|	ТаблицаНоменклатура.Артикул,
		|	ТаблицаНоменклатура.КатегорияНоменклатуры,
		|	ТаблицаНоменклатура.ОсобенностьУчета,
		|	ТаблицаНоменклатура.КлючВидовПродукцииИС,
		|	ЕСТЬNULL(ЦеныНоменклатуры.Номенклатура, ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)),
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения,
		|			ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|			ТОГДА ТаблицаНоменклатура.ЕдиницаИзмерения
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.ЕдиницаИзмерения, ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка))
		|	КОНЕЦ,
		|	ЕСТЬNULL(ЦеныНоменклатуры.ВидЦен, ЗНАЧЕНИЕ(Справочник.ВидыЦен.ПустаяСсылка)),
		|	ТаблицаНоменклатура.ТипНоменклатуры,
		|	ТаблицаНоменклатура.НоменклатураНаименованиеДляПечати,
		|	ТаблицаНоменклатура.Наименование
		#Вставка
		|	, ТаблицаНоменклатура.Бренд
		#КонецВставки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	ТаблицаНоменклатура.Наименование,
		|	ТаблицаНоменклатура.НоменклатураНаименованиеДляПечати,
		|	ТаблицаНоменклатура.ЕдиницаИзмерения,
		|	&Дата,
		|	&ВидЦены,
		|	ТаблицаНоменклатура.Код,
		|	ТаблицаНоменклатура.Артикул,
		|	ТаблицаНоменклатура.КатегорияНоменклатуры,
		|	ТаблицаНоменклатура.ОсобенностьУчета,
		|	ТаблицаНоменклатура.КлючВидовПродукцииИС,
		|	0,
		|	ТаблицаНоменклатура.ТипНоменклатуры
		#Вставка
		|	, ТаблицаНоменклатура.Бренд
		#КонецВставки
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ВидЦен = &ВидЦены) КАК ЦеныНоменклатуры
		|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|ГДЕ
		|	(ТаблицаНоменклатура.ЭтоНабор
		|	ИЛИ &ВключаяБезЦен)
		|	И ЦеныНоменклатуры.Номенклатура ЕСТЬ NULL
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНоменклатура.Код,
		|	ТаблицаНоменклатура.Артикул,
		|	ТаблицаНоменклатура.КатегорияНоменклатуры,
		|	ТаблицаНоменклатура.ОсобенностьУчета,
		|	ТаблицаНоменклатура.КлючВидовПродукцииИС,
		|	ТаблицаНоменклатура.Номенклатура,
		|	ТаблицаНоменклатура.ЕдиницаИзмерения,
		|	ТаблицаНоменклатура.ТипНоменклатуры,
		|	ТаблицаНоменклатура.НоменклатураНаименованиеДляПечати,
		|	ТаблицаНоменклатура.Наименование
		#Вставка
		|	, ТаблицаНоменклатура.Бренд
		#КонецВставки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ТаблицаНоменклатура.Номенклатура,
		|	ТаблицаНоменклатура.Наименование,
		|	ТаблицаНоменклатура.НоменклатураНаименованиеДляПечати,
		|	ТаблицаНоменклатура.ЕдиницаИзмерения,
		|	&Дата,
		|	&ВидЦены,
		|	ТаблицаНоменклатура.Код,
		|	ТаблицаНоменклатура.Артикул,
		|	ТаблицаНоменклатура.КатегорияНоменклатуры,
		|	ТаблицаНоменклатура.ОсобенностьУчета,
		|	ТаблицаНоменклатура.КлючВидовПродукцииИС,
		|	ТаблицаНоменклатура.Номинал,
		|	ТаблицаНоменклатура.ТипНоменклатуры
		#Вставка
		|	, ТаблицаНоменклатура.Бренд
		#КонецВставки
		|ИЗ
		|	ТаблицаНоменклатура КАК ТаблицаНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаНоменклатура.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|ГДЕ
		|	ТаблицаНоменклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
		|СГРУППИРОВАТЬ ПО
		|	ТаблицаНоменклатура.Код,
		|	ТаблицаНоменклатура.Артикул,
		|	ТаблицаНоменклатура.КатегорияНоменклатуры,
		|	ТаблицаНоменклатура.ОсобенностьУчета,
		|	ТаблицаНоменклатура.КлючВидовПродукцииИС,
		|	ТаблицаНоменклатура.Номенклатура,
		|	ТаблицаНоменклатура.ЕдиницаИзмерения,
		|	ТаблицаНоменклатура.Номинал,
		|	ТаблицаНоменклатура.ТипНоменклатуры,
		|	ТаблицаНоменклатура.НоменклатураНаименованиеДляПечати,
		|	ТаблицаНоменклатура.Наименование
		#Вставка
		|	, ТаблицаНоменклатура.Бренд
		#КонецВставки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Период,
		|	ВидЦен,
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаМаксПериодЦен.Номенклатура КАК Номенклатура,
		|	ТаблицаМаксПериодЦен.Наименование КАК Наименование,
		|	ТаблицаМаксПериодЦен.НоменклатураНаименованиеДляПечати КАК НоменклатураНаименованиеДляПечати,
		|	ТаблицаМаксПериодЦен.Упаковка КАК Упаковка,
		|	ТаблицаМаксПериодЦен.Период КАК Период,
		|	ТаблицаМаксПериодЦен.ВидЦен КАК ВидЦен,
		|	ТаблицаМаксПериодЦен.Код КАК Код,
		|	ТаблицаМаксПериодЦен.Артикул КАК Артикул,
		|	ТаблицаМаксПериодЦен.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
		|	ТаблицаМаксПериодЦен.ОсобенностьУчета КАК ОсобенностьУчета,
		|	ТаблицаМаксПериодЦен.КлючВидовПродукцииИС КАК КлючВидовПродукцииИС,
		|	ВЫБОР
		|		КОГДА ТаблицаМаксПериодЦен.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.ПодарочныйСертификат)
		|			ТОГДА ТаблицаМаксПериодЦен.Номинал
		|		ИНАЧЕ ЕСТЬNULL(ЦеныНоменклатуры.Цена, 0)
		|	КОНЕЦ КАК Цена,
		|	ВЫБОР
		|		КОГДА ЦеныНоменклатуры.ВалютаЦены <> ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|			ТОГДА ЦеныНоменклатуры.ВалютаЦены
		|		ИНАЧЕ ЦеныНоменклатуры.ВидЦен.ВалютаЦены
		|	КОНЕЦ КАК ВалютаЦены
		#Вставка
		|	, ТаблицаМаксПериодЦен.Бренд КАК Бренд
		#КонецВставки
		|ПОМЕСТИТЬ ТаблицаИтоговыхЦен
		|ИЗ
		|	ТаблицаМаксПериодЦен КАК ТаблицаМаксПериодЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры КАК ЦеныНоменклатуры
		|		ПО ТаблицаМаксПериодЦен.Период = ЦеныНоменклатуры.Период
		|		И ТаблицаМаксПериодЦен.ВидЦен = ЦеныНоменклатуры.ВидЦен
		|		И ТаблицаМаксПериодЦен.Номенклатура = ЦеныНоменклатуры.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Упаковка,
		|	ВалютаЦены
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Курсы.Валюта КАК Валюта,
		|	Курсы.Курс КАК Курс,
		|	Курсы.Кратность КАК Кратность
		|ПОМЕСТИТЬ КурсыВалют
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Дата, Валюта В
		|		(ВЫБРАТЬ
		|			Таблица.ВалютаЦены
		|		ИЗ
		|			ТаблицаИтоговыхЦен КАК Таблица)) КАК Курсы
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Валюта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаИтоговыхЦен.Номенклатура КАК Номенклатура,
		|	ТаблицаИтоговыхЦен.Наименование КАК Наименование,
		|	ТаблицаИтоговыхЦен.НоменклатураНаименованиеДляПечати КАК НоменклатураНаименованиеДляПечати,
		|	ТаблицаИтоговыхЦен.Упаковка КАК Упаковка,
		|	ТаблицаИтоговыхЦен.Период КАК Период,
		|	ТаблицаИтоговыхЦен.ВидЦен КАК ВидЦен,
		|	ТаблицаИтоговыхЦен.Код КАК Код,
		|	ТаблицаИтоговыхЦен.Артикул КАК Артикул,
		|	ТаблицаИтоговыхЦен.КатегорияНоменклатуры КАК КатегорияНоменклатуры,
		|	ТаблицаИтоговыхЦен.ОсобенностьУчета КАК ОсобенностьУчета,
		|	ТаблицаИтоговыхЦен.КлючВидовПродукцииИС КАК КлючВидовПродукцииИС,
		|	ТаблицаИтоговыхЦен.Цена * ЕСТЬNULL(КурсыВалют.Курс, 1) * ЕСТЬNULL(КурсыВалют.Кратность, 1) КАК Цена,
		|	ВЫБОР
		|		КОГДА ТаблицаИтоговыхЦен.Упаковка ССЫЛКА Справочник.ЕдиницыИзмерения
		|			ТОГДА ЕСТЬNULL(ЕдиницыИзмерения.Коэффициент, 1)
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК КоэффициентУпаковки
		#Вставка
		|	, ТаблицаИтоговыхЦен.Бренд КАК Бренд
		#КонецВставки
		|ПОМЕСТИТЬ ТаблицаКоэффициентыУпаковок
		|ИЗ
		|	ТаблицаИтоговыхЦен КАК ТаблицаИтоговыхЦен
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|		ПО ТаблицаИтоговыхЦен.Упаковка = ЕдиницыИзмерения.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют КАК КурсыВалют
		|		ПО ТаблицаИтоговыхЦен.ВалютаЦены = КурсыВалют.Валюта
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка КАК Склад,
		|	СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы КАК ТипСтруктурнойЕдиницы
		|ПОМЕСТИТЬ ДанныеТорговогоОбъекта
		|ИЗ
		|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|ГДЕ
		|	НЕ СтруктурныеЕдиницы.ПометкаУдаления
		|	И СтруктурныеЕдиницы.Ссылка = &ТорговыйОбъект
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка КАК Склад
		|ПОМЕСТИТЬ ТаблицаСклады
		|ИЗ
		|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Родитель
		|ГДЕ
		|	ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.МагазинГруппаСкладов)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтруктурныеЕдиницы.Ссылка
		|ИЗ
		|	ДанныеТорговогоОбъекта КАК ДанныеТорговогоОбъекта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
		|		ПО ДанныеТорговогоОбъекта.Склад = СтруктурныеЕдиницы.Ссылка
		|ГДЕ
		|	ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад)
		|	ИЛИ ДанныеТорговогоОбъекта.ТипСтруктурнойЕдиницы = ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ОстаткиТоваров.Количество) КАК Количество,
		|	СУММА(ОстаткиТоваров.Резерв) КАК Резерв,
		|	ОстаткиТоваров.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ТаблицаОстатки
		|ИЗ
		|	РегистрСведений.ОстаткиТоваров КАК ОстаткиТоваров
		|ГДЕ
		|	ОстаткиТоваров.СтруктурнаяЕдиница В
		|		(ВЫБРАТЬ
		|			ТаблицаСклады.Склад КАК Склад
		|		ИЗ
		|			ТаблицаСклады КАК ТаблицаСклады)
		|СГРУППИРОВАТЬ ПО
		|	ОстаткиТоваров.Номенклатура
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(КодыТоваровSKU.SKU) КАК SKU,
		|	КодыТоваровSKU.Номенклатура КАК Номенклатура,
		|	КодыТоваровSKU.ЕдиницаИзмерения КАК ЕдиницаИзмерения
		|ПОМЕСТИТЬ КодыSKU
		|ИЗ
		|	РегистрСведений.КодыТоваровSKU КАК КодыТоваровSKU
		|ГДЕ
		|	КодыТоваровSKU.Партия = ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
		|СГРУППИРОВАТЬ ПО
		|	КодыТоваровSKU.Номенклатура,
		|	КодыТоваровSKU.ЕдиницаИзмерения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаКоэффициентыУпаковок.Номенклатура КАК Номенклатура,
		|	ТаблицаКоэффициентыУпаковок.Наименование КАК Наименование,
		|	ТаблицаКоэффициентыУпаковок.НоменклатураНаименованиеДляПечати КАК НоменклатураНаименованиеДляПечати,
		|	ТаблицаКоэффициентыУпаковок.Упаковка КАК Упаковка,
		|	ТаблицаКоэффициентыУпаковок.Период КАК Период,
		|	ТаблицаКоэффициентыУпаковок.Код КАК Код,
		|	ТаблицаКоэффициентыУпаковок.Артикул КАК Артикул,
		|	ТаблицаКоэффициентыУпаковок.КатегорияНоменклатуры КАК ВидНоменклатуры,
		|	ТаблицаКоэффициентыУпаковок.ОсобенностьУчета КАК ОсобенностьУчета,
		|	ТаблицаКоэффициентыУпаковок.КлючВидовПродукцииИС КАК КлючВидовПродукцииИС,
		|	ТаблицаКоэффициентыУпаковок.Цена КАК Цена,
		|	ЕСТЬNULL(ТаблицаОстатки.Резерв, 0) / ТаблицаКоэффициентыУпаковок.КоэффициентУпаковки КАК ВРезерве,
		|	ЕСТЬNULL(ТаблицаОстатки.Количество, 0) / ТаблицаКоэффициентыУпаковок.КоэффициентУпаковки КАК Доступно,
		|	ТаблицаКоэффициентыУпаковок.Номенклатура.Родитель КАК Группа,
		|	КодыSKU.SKU КАК SKU
		#Вставка
		|	, ТаблицаКоэффициентыУпаковок.Бренд КАК Бренд
		#КонецВставки
		|ПОМЕСТИТЬ ДоРазвертки
		|ИЗ
		|	ТаблицаКоэффициентыУпаковок КАК ТаблицаКоэффициентыУпаковок
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатки КАК ТаблицаОстатки
		|		ПО ТаблицаКоэффициентыУпаковок.Номенклатура = ТаблицаОстатки.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ КодыSKU КАК КодыSKU
		|		ПО ТаблицаКоэффициентыУпаковок.Номенклатура = КодыSKU.Номенклатура
		|		И ВЫБОР
		|			КОГДА ТаблицаКоэффициентыУпаковок.Упаковка ССЫЛКА Справочник.ЕдиницыИзмерения
		|				ТОГДА ТаблицаКоэффициентыУпаковок.Упаковка = КодыSKU.ЕдиницаИзмерения
		|			ИНАЧЕ КодыSKU.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка)
		|		КОНЕЦ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоРазвертки.Номенклатура КАК Номенклатура,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ДоРазвертки.Упаковка) КАК КоличествоУпаковок
		|ПОМЕСТИТЬ СтрокиПоНоменклатурам
		|ИЗ
		|	ДоРазвертки КАК ДоРазвертки
		|СГРУППИРОВАТЬ ПО
		|	ДоРазвертки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СтрокиПоНоменклатурам.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ НоменклатураДляРазвертки
		|ИЗ
		|	СтрокиПоНоменклатурам КАК СтрокиПоНоменклатурам
		|ГДЕ
		|	СтрокиПоНоменклатурам.КоличествоУпаковок > 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ДоРазвертки.Номенклатура КАК Номенклатура,
		|	ДоРазвертки.Наименование КАК Наименование,
		|	ДоРазвертки.НоменклатураНаименованиеДляПечати КАК НоменклатураНаименованиеДляПечати,
		|	ДоРазвертки.Код КАК Код,
		|	ДоРазвертки.Артикул КАК Артикул,
		|	ДоРазвертки.ОсобенностьУчета КАК ОсобенностьУчета,
		|	ДоРазвертки.КлючВидовПродукцииИС КАК КлючВидовПродукцииИС,
		|	ДоРазвертки.ВидНоменклатуры КАК ВидНоменклатуры,
		|	ДоРазвертки.Группа КАК Группа
		#Вставка
		|	, ДоРазвертки.Бренд КАК Бренд
		#КонецВставки
		|ПОМЕСТИТЬ СтрокиДляРазвертки
		|ИЗ
		|	НоменклатураДляРазвертки КАК НоменклатураДляРазвертки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДоРазвертки КАК ДоРазвертки
		|		ПО НоменклатураДляРазвертки.Номенклатура = ДоРазвертки.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СпрНоменклатура.Ссылка КАК Номенклатура,
		|	СпрНоменклатура.Наименование КАК Наименование,
		|	СпрНоменклатура.Наименование КАК НоменклатураНаименованиеДляПечати,
		|	NULL КАК Упаковка,
		|	NULL КАК Период,
		|	NULL КАК Цена,
		|	СпрНоменклатура.Код КАК Код,
		|	NULL КАК Артикул,
		|	NULL КАК ОсобенностьУчета,
		|	NULL КАК КлючВидовПродукцииИС,
		|	NULL КАК ВидНоменклатуры,
		|	NULL КАК ВРезерве,
		|	NULL КАК Доступно,
		|	СпрНоменклатура.Родитель КАК Родитель,
		|	0 КАК ВидСтроки,
		|	NULL КАК SKU
		#Вставка
		|	, NULL КАК Бренд
		#КонецВставки
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|ГДЕ
		|	СпрНоменклатура.ЭтоГруппа = ИСТИНА
		|	И ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СпрНоменклатура.Ссылка,
		|	СтрокиДляРазвертки.Наименование,
		|	СтрокиДляРазвертки.НоменклатураНаименованиеДляПечати,
		|	NULL,
		|	NULL,
		|	NULL,
		|	СтрокиДляРазвертки.Код,
		|	СтрокиДляРазвертки.Артикул,
		|	СтрокиДляРазвертки.ОсобенностьУчета,
		|	СтрокиДляРазвертки.КлючВидовПродукцииИС,
		|	СтрокиДляРазвертки.ВидНоменклатуры,
		|	NULL,
		|	NULL,
		|	СтрокиДляРазвертки.Группа,
		|	1,
		|	NULL
		#Вставка
		|	, СтрокиДляРазвертки.Бренд
		#КонецВставки
		|ИЗ
		|	СтрокиДляРазвертки КАК СтрокиДляРазвертки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО СтрокиДляРазвертки.Номенклатура = СпрНоменклатура.Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СпрНоменклатура.Ссылка,
		|	ДоРазвертки.Наименование,
		|	ДоРазвертки.НоменклатураНаименованиеДляПечати,
		|	ДоРазвертки.Упаковка,
		|	ДоРазвертки.Период,
		|	ДоРазвертки.Цена,
		|	ДоРазвертки.Код,
		|	ДоРазвертки.Артикул,
		|	ДоРазвертки.ОсобенностьУчета,
		|	ДоРазвертки.КлючВидовПродукцииИС,
		|	ДоРазвертки.ВидНоменклатуры,
		|	ДоРазвертки.ВРезерве,
		|	ДоРазвертки.Доступно,
		|	ДоРазвертки.Группа,
		|	2,
		|	ДоРазвертки.SKU
		#Вставка
		|	, ДоРазвертки.Бренд
		#КонецВставки
		|ИЗ
		|	ДоРазвертки КАК ДоРазвертки
		|		ЛЕВОЕ СОЕДИНЕНИЕ НоменклатураДляРазвертки КАК НоменклатураДляРазвертки
		|		ПО ДоРазвертки.Номенклатура = НоменклатураДляРазвертки.Номенклатура
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО ДоРазвертки.Номенклатура = СпрНоменклатура.Ссылка
		|ГДЕ
		|	НоменклатураДляРазвертки.Номенклатура ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СпрНоменклатура.Ссылка,
		|	ДоРазвертки.Наименование,
		|	ДоРазвертки.НоменклатураНаименованиеДляПечати,
		|	ДоРазвертки.Упаковка,
		|	ДоРазвертки.Период,
		|	ДоРазвертки.Цена,
		|	ДоРазвертки.Код,
		|	ДоРазвертки.Артикул,
		|	ДоРазвертки.ОсобенностьУчета,
		|	ДоРазвертки.КлючВидовПродукцииИС,
		|	ДоРазвертки.ВидНоменклатуры,
		|	ДоРазвертки.ВРезерве,
		|	ДоРазвертки.Доступно,
		|	ДоРазвертки.Группа,
		|	3,
		|	ДоРазвертки.SKU
		#Вставка
		|	, ДоРазвертки.Бренд
		#КонецВставки
		|ИЗ
		|	ДоРазвертки КАК ДоРазвертки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО ДоРазвертки.Номенклатура = СпрНоменклатура.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ НоменклатураДляРазвертки КАК НоменклатураДляРазвертки
		|		ПО ДоРазвертки.Номенклатура = НоменклатураДляРазвертки.Номенклатура";
		
	КонецЕсли;
	
	СписокТоваров = Форма.СписокТоваров;
	СписокТоваров.ТекстЗапроса = ТекстЗапроса;
	ПараметрыЗапроса = СписокТоваров.Параметры;
	ПараметрыЗапроса.УстановитьЗначениеПараметра("ВидЦены", Форма.РозничныйВидЦены);
	ПараметрыЗапроса.УстановитьЗначениеПараметра("ТорговыйОбъект", Форма.Объект.ТорговыйОбъект);
	ПараметрыЗапроса.УстановитьЗначениеПараметра("Дата", ТекущаяДатаСеанса());
	ПараметрыЗапроса.УстановитьЗначениеПараметра("ВключаяБезЦен", Форма.НастройкаКаталогаПоказыватьПозицииБезЦен);
	ПараметрыЗапроса.УстановитьЗначениеПараметра("ВключаяНеактуальные", Форма.НастройкаКаталогаПоказыватьНеактуальные);
	ПараметрыЗапроса.УстановитьЗначениеПараметра("ПризнакиПлатежногоАгента",
		АгентскиеПлатежиУНФ.ПризнакиПлатежногоАгента());
	ПараметрыЗапроса.УстановитьЗначениеПараметра("ИспользоватьРазделениеВыручки",
		ИспользоватьАгентскиеПлатежиИРазделениеВыручки);
	
	МассивТиповНоменклатуры = Новый Массив;
	МассивТиповНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Запас);
	МассивТиповНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.Услуга);
	МассивТиповНоменклатуры.Добавить(Перечисления.ТипыНоменклатуры.ПодарочныйСертификат);
	ПараметрыЗапроса.УстановитьЗначениеПараметра("МассивТиповНоменклатуры", МассивТиповНоменклатуры);
	
	Элементы = Форма.Элементы;
	СписокТоваровЭлемент = Элементы.СписокТоваров;
	
	Если Элементы.Найти("СписокТоваровДоступно") = Неопределено Тогда 
		НоваяКолонка = Элементы.Добавить("СписокТоваровДоступно", Тип("ПолеФормы"), СписокТоваровЭлемент);
		НоваяКолонка.Вид = ВидПоляФормы.ПолеНадписи;
		НоваяКолонка.ПутьКДанным = "СписокТоваров.Доступно";
		НоваяКолонка.Заголовок = НСтр("ru = 'Доступно'");
		НоваяКолонка.ШрифтЗаголовка = ШрифтыСтиля.КрупныйШрифтТекста;
		НоваяКолонка.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
		НоваяКолонка.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Лево;
		НоваяКолонка.Формат = "ЧДЦ=3";
		
		НовоеПолеСКД = СписокТоваров.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПолеСКД.Поле = "Доступно";
		НовоеПолеСКД.Заголовок = "Доступно";
		НовоеПолеСКД.ПутьКДанным = "Доступно";
	КонецЕсли;
	
	Если Элементы.Найти("СписокТоваровВРезерве") = Неопределено Тогда 
		НоваяКолонка = Элементы.Добавить("СписокТоваровВРезерве", Тип("ПолеФормы"), СписокТоваровЭлемент);
		НоваяКолонка.Вид = ВидПоляФормы.ПолеНадписи;
		НоваяКолонка.ПутьКДанным = "СписокТоваров.ВРезерве";
		НоваяКолонка.Заголовок = НСтр("ru = 'В резерве'");
		НоваяКолонка.ШрифтЗаголовка = ШрифтыСтиля.КрупныйШрифтТекста;
		НоваяКолонка.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
		НоваяКолонка.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Лево;
		НоваяКолонка.Формат = "ЧДЦ=3";
		
		НовоеПолеСКД = СписокТоваров.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПолеСКД.Поле = "ВРезерве";
		НовоеПолеСКД.Заголовок = "ВРезерве";
		НовоеПолеСКД.ПутьКДанным = "ВРезерве";
	КонецЕсли;
	
	Если Элементы.Найти("СписокТоваровSKU") = Неопределено Тогда
		НоваяКолонка = Элементы.Добавить("СписокТоваровSKU", Тип("ПолеФормы"), СписокТоваровЭлемент);
		НоваяКолонка.Вид = ВидПоляФормы.ПолеНадписи;
		НоваяКолонка.ПутьКДанным = "СписокТоваров.SKU";
		НоваяКолонка.Заголовок = НСтр("ru = 'SKU'");
		НоваяКолонка.ШрифтЗаголовка = ШрифтыСтиля.КрупныйШрифтТекста;
		НоваяКолонка.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
		НоваяКолонка.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Лево;
		НоваяКолонка.АвтоМаксимальнаяШирина = Ложь;
		НоваяКолонка.МаксимальнаяШирина = 7;
		
		НовоеПолеСКД = СписокТоваров.Поля.Добавить(Тип("ПолеНабораДанныхСхемыКомпоновкиДанных"));
		НовоеПолеСКД.Поле = "SKU";
		НовоеПолеСКД.Заголовок = "SKU";
		НовоеПолеСКД.ПутьКДанным = "SKU";
	КонецЕсли;
	
	Если Элементы.Найти("ДополнительныйСписокТоваровДоступно") = Неопределено Тогда
		НоваяКолонка = Элементы.Добавить("ДополнительныйСписокТоваровДоступно", Тип("ПолеФормы"), Элементы.ДополнительныйСписокТоваров);
		НоваяКолонка.Вид = ВидПоляФормы.ПолеНадписи;
		НоваяКолонка.ПутьКДанным = "СписокТоваров.Доступно";
		НоваяКолонка.Заголовок = НСтр("ru = 'Доступно'");
		НоваяКолонка.ШрифтЗаголовка = ШрифтыСтиля.КрупныйШрифтТекста;
		НоваяКолонка.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
		НоваяКолонка.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Лево;
		НоваяКолонка.Формат = "ЧДЦ=3";
	КонецЕсли;
	
	Если Элементы.Найти("ДополнительныйСписокТоваровВРезерве") = Неопределено Тогда
		НоваяКолонка = Элементы.Добавить("ДополнительныйСписокТоваровВРезерве", Тип("ПолеФормы"), Элементы.ДополнительныйСписокТоваров);
		НоваяКолонка.Вид = ВидПоляФормы.ПолеНадписи;
		НоваяКолонка.ПутьКДанным = "СписокТоваров.ВРезерве";
		НоваяКолонка.Заголовок = НСтр("ru = 'В резерве'");
		НоваяКолонка.ШрифтЗаголовка = ШрифтыСтиля.КрупныйШрифтТекста;
		НоваяКолонка.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
		НоваяКолонка.ГоризонтальноеПоложениеВШапке = ГоризонтальноеПоложениеЭлемента.Лево;
		НоваяКолонка.Формат = "ЧДЦ=3";
	КонецЕсли;
	
	НастроитьДинамическиеСпискиОтборовПоГруппе(Форма);
	
КонецПроцедуры //--->>> Tnext Козык К.А. 16.06.2026

#КонецОбласти