
#Область ОбработчикиСобытийФормы

&НаКлиенте
Асинх Процедура ПриОткрытии(Отказ)
	
	Строки = ТекстИзБуфераОбмена();
    Результат = Ждать Строки;
	МассивШК = СтрРазделить(Результат, Символы.ПС);
	ОбработатьШКНаСервере(МассивШК);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте                                                      
Асинх Функция ТекстИзБуфераОбмена()
	
    Если СредстваБуфераОбмена.ИспользованиеДоступно() Тогда
        ФорматДанных = СтандартныйФорматДанныхБуфераОбмена.Текст;
        Если Ждать СредстваБуфераОбмена.СодержитДанныеАсинх(ФорматДанных) Тогда
            Возврат Ждать СредстваБуфераОбмена.ПолучитьДанныеАсинх(ФорматДанных);
        КонецЕсли;
    КонецЕсли;
	
    Возврат Неопределено;
		
КонецФункции

&НаСервере
Процедура ОбработатьШКНаСервере(МассивШК)
		
	Для Каждого Строка Из МассивШК Цикл
		
		ИндексНазвание = СтрНайти(Строка, "Идентификационный знак");
		Название = СокрЛП(Лев(Строка, ИндексНазвание - 1));
		ЧислоСимволов = СтрДлина(Строка);
		ИндексШтрихКода = СтрНайти(Строка, "	010");
		ШтрихКод = Лев(Прав(Строка, ЧислоСимволов - ИндексШтрихКода - 3), 13);
		
		НоменклатураКонтрагентов = НайтиНоменклатураКонтрагентов(Название);
		ШКНоменклатуры = НайтиШКНоменклатуры(ШтрихКод, Строка);
		
		Если Не НоменклатураКонтрагентов = Неопределено Тогда
			
			СтрокаНайденные = Найденные.Добавить();
			
			Для Каждого Строка Из НоменклатураКонтрагентов Цикл
				
				СправочникОбъект = Строка.Ссылка.ПолучитьОбъект();
				СправочникОбъект.ШтрихКод = ШтрихКод;
				
			
				Если Не ШКНоменклатуры = Неопределено Тогда
					
					СправочникОбъект.Номенклатура = ШКНоменклатуры.Номенклатура;
					СправочникОбъект.Характеристика = ШКНоменклатуры.Характеристика;
					
				КонецЕсли;
				
				СправочникОбъект.Записать();
				
			КонецЦикла;
			
			Если Не ШКНоменклатуры = Неопределено Тогда
				
				СтрокаНайденные.Номенклатура = ШКНоменклатуры.Номенклатура;
				СтрокаНайденные.Характеристика = ШКНоменклатуры.Характеристика;
				
			КонецЕсли;
			
			СтрокаНайденные.НоменклатураКонтрагента = СправочникОбъект.Ссылка;
			СтрокаНайденные.ШтрихКод = ШтрихКод;
			

		Иначе
			
			СтрокаНеНайденные = НеНайденные.Добавить();
			СтрокаНеНайденные.ШтрихКод = ШтрихКод;
			СтрокаНеНайденные.СтрокаУПД = Строка;
			СтрокаНеНайденные.Наименование = Название;
			
		КонецЕсли;	
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция НайтиШКНоменклатуры(ШтрихКод, Строка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
	               |	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
	               |	ШтрихкодыНоменклатуры.Характеристика КАК Характеристика
	               |ИЗ
	               |	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
	               |ГДЕ
	               |	СОКРЛП(ШтрихкодыНоменклатуры.Штрихкод) = &Штрихкод";
	Запрос.УстановитьПараметр("Штрихкод", Штрихкод);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Неопределено;
		
	Иначе	

		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Возврат Выборка; 
		
	КонецЕсли;	
	
КонецФункции

&НаСервере
Функция НайтиНоменклатураКонтрагентов(Название)
	
	Если Название = "" Тогда
		
		Возврат Неопределено;
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	НоменклатураКонтрагентов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|ГДЕ
		|	НЕ НоменклатураКонтрагентов.ПометкаУдаления
		|	И СОКРЛП(НоменклатураКонтрагентов.НаименованиеНоменклатуры) ПОДОБНО &Наименование";

	Запрос.УстановитьПараметр("Наименование", Название);
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить();
	
	
КонецФункции

#КонецОбласти


