
#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиКоманд

Процедура БонуснаяКартаНажатие(Форма) Экспорт
	
	Если Не maxma_ИнтеграцияССервисомКлиентСервер.ИспользоватьПрограммуЛояльности(Форма.Объект.maxma_СтруктураПолей) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Форма.Объект.maxma_СтруктураПолей.ПараметрыПродажи.КодКартыНомерТелефона) Тогда
		
		РезультатПоискаКарты = Новый Структура("ДисконтнаяКарта", ПредопределенноеЗначение("Справочник.ДисконтныеКарты.ПустаяСсылка"));
		
		ОбработатьСчитываниеКарты(РезультатПоискаКарты, Форма);
		maxma_ИнтеграцияССервисомКлиентСервер.ОбновитьФорму(Форма);
		
	Иначе
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("НастройкиМодуля",       Форма.Объект.maxma_СтруктураПолей.НастройкиМодуля);
		ДополнительныеПараметры.Вставить("СообщенияПользователю", Форма.Объект.maxma_СтруктураПолей.СообщенияПользователю);
		ДополнительныеПараметры.Вставить("Ссылка",                Форма.Объект);
		ДополнительныеПараметры.Вставить("ИмяФормы",              Форма.ИмяФормы);
		
		ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуПоискаДисконтнойКарты", ЭтотОбъект, ДополнительныеПараметры);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок",     "Поиск дисконтной карты");
		ПараметрыФормы.Вставить("Отрицательное", Ложь);
		
		ОткрытьФорму("Обработка.maxma_ИнтеграцияССервисом.Форма.ФормаПоискаДисконтнойКарты", 
			ПараметрыФормы, Форма,,,, ОбработчикОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаменаКартыНажатие(Форма) Экспорт
	
	Если Не maxma_ИнтеграцияССервисомКлиентСервер.ИспользоватьПрограммуЛояльности(Форма.Объект.maxma_СтруктураПолей) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыПродажи = Форма.Объект.maxma_СтруктураПолей.ПараметрыПродажи;
	
	Если ЗначениеЗаполнено(ПараметрыПродажи.РежимПоискаКарты) Тогда
		
		ДанныеКлиента = maxma_ИнтеграцияССервисомВызовСервера.ДанныеКлиента(ПараметрыПродажи.РежимПоискаКарты,
			ПараметрыПродажи.КодКартыНомерТелефона,
			ПараметрыПродажи.СтруктураНомераТелефона.КодСтраны,
			Форма.Объект.maxma_СтруктураПолей.НастройкиМодуля,
			Форма.Объект.maxma_СтруктураПолей.СообщенияПользователю);
		
		Если ДанныеКлиента.КартаНайдена Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("ВведенноеЧисло",        ПараметрыПродажи.КодКартыНомерТелефона);
			ПараметрыФормы.Вставить("МобильныйТелефон",      ДанныеКлиента.Клиент.phoneNumber);
			ПараметрыФормы.Вставить("КодСтраны",             ПараметрыПродажи.СтруктураНомераТелефона.КодСтраны);
			ПараметрыФормы.Вставить("РежимПоискаКарты",      ПараметрыПродажи.РежимПоискаКарты);
			ПараметрыФормы.Вставить("Операция",              "РедактированиеКарты");
			ПараметрыФормы.Вставить("НастройкиМодуля",       Форма.Объект.maxma_СтруктураПолей.НастройкиМодуля);
			ПараметрыФормы.Вставить("СообщенияПользователю", Форма.Объект.maxma_СтруктураПолей.СообщенияПользователю);
			
			Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
			ОткрытьФорму("Обработка.maxma_ИнтеграцияССервисом.Форма.ФормаВыдачиРедактированияДисконтнойКарты", ПараметрыФормы,,,,,, Режим);
			
		Иначе
			ОткрытьФормуИнформации(Форма.Объект.maxma_СтруктураПолей.СообщенияПользователю);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура БонусыНажатие(Форма) Экспорт
	
	Если Не maxma_ИнтеграцияССервисомКлиентСервер.ИспользоватьПрограммуЛояльности(Форма.Объект.maxma_СтруктураПолей) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.Объект.Товары.Количество() Тогда
		ПараметрыСообщения = Новый Структура;
		ПараметрыСообщения.Вставить("ЗаголовокИнформации", НСтр("ru = 'Не удалось ввести оплату бонусами.'"));
		ПараметрыСообщения.Вставить("ТекстИнформации", 	   НСтр("ru = 'Не введено ни одного товара.'"));
		ОткрытьФормуИнформации(ПараметрыСообщения);
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Форма.Объект.ДисконтнаяКарта) Тогда
		ПараметрыСообщения = Новый Структура;
		ПараметрыСообщения.Вставить("ЗаголовокИнформации", НСтр("ru = 'Не удалось ввести оплату бонусами.'"));
		ПараметрыСообщения.Вставить("ТекстИнформации", 	   НСтр("ru = 'Не указана бонусная карта.'"));
		ОткрытьФормуИнформации(ПараметрыСообщения);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВвестиБонусыЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("МаксимальнаяСуммаОплаты", Форма.Объект.maxma_СтруктураПолей.СтруктураБаллов.ДоступноДляОплаты);
	
	ОткрытьФорму("Обработка.maxma_ИнтеграцияССервисом.Форма.ФормаОплатыБонуснымиБаллами",
		ПараметрыОткрытияФормы, Форма,,,, ОбработчикОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

Процедура ПромокодНажатие(Форма) Экспорт
	
	Если Не maxma_ИнтеграцияССервисомКлиентСервер.ИспользоватьПрограммуЛояльности(Форма.Объект.maxma_СтруктураПолей) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Форма.Объект.Товары.Количество() Тогда
		ПараметрыСообщения = Новый Структура;
		ПараметрыСообщения.Вставить("ЗаголовокИнформации", НСтр("ru = 'Не удалось ввести промокод.'"));
		ПараметрыСообщения.Вставить("ТекстИнформации", 	   НСтр("ru = 'Не введено ни одного товара.'"));
		ОткрытьФормуИнформации(ПараметрыСообщения);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеВвестиПромокодЗавершение", ЭтотОбъект, ДополнительныеПараметры);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Введите промокод.'"));
	
	Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("Обработка.maxma_ИнтеграцияССервисом.Форма.ФормаВводаПромокода", ПараметрыФормы,,,,, ОбработчикОповещения, Режим);
	
КонецПроцедуры

Процедура ПодарочныеКартыНажатие(Форма) Экспорт
	
	Если Не maxma_ИнтеграцияССервисомКлиентСервер.ИспользоватьПрограммуЛояльности(Форма.Объект.maxma_СтруктураПолей) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Форма", Форма);
	
	ДополнитьСписокПодарочныхКарт(Форма.maxma_ПодарочныеКарты, Форма.Объект.Товары, Форма.Объект.maxma_СтруктураПолей);

	ОткрытьФорму("Обработка.maxma_ИнтеграцияССервисом.Форма.ФормаСписокПодарочныхКарт",,
	Форма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура ФормулаРасчетаНажатие(Форма) Экспорт
	
	Если Не maxma_ИнтеграцияССервисомКлиентСервер.ИспользоватьПрограммуЛояльности(Форма.Объект.maxma_СтруктураПолей) Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Обработка.maxma_ИнтеграцияССервисом.Форма.ФормаРасчета",, Форма,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

#КонецОбласти

Процедура ОбработкаОповещения(Форма, ИмяСобытия, Параметр, Источник) Экспорт
	
	Если Не maxma_ИнтеграцияССервисомКлиентСервер.ИспользоватьПрограммуЛояльности(Форма.Объект.maxma_СтруктураПолей) Тогда
		Возврат;
	КонецЕсли;
	
	Если ИмяСобытия = "ПоискКартыЛояльности" Тогда
		
		ОбработатьПоискКарты(Форма, Параметр);
		maxma_ИнтеграцияССервисомКлиентСервер.ОбновитьФорму(Форма);
		
	ИначеЕсли ИмяСобытия = "ВыданаКартаЛояльности"
		Или ИмяСобытия = "ОтредактированаКартаЛояльности" Тогда
		
		ОбработатьСчитываниеКарты(Параметр, Форма);
		maxma_ИнтеграцияССервисомКлиентСервер.ОбновитьФорму(Форма);
		
	ИначеЕсли ИмяСобытия = "ОплатаБонуснымиБаллами"
		Или ИмяСобытия = "ВыбранБыстрыйТовар" Тогда
		
		Форма.maxma_НазначитьАвтоматическиеСкидкиКлиент();
		maxma_ИнтеграцияССервисомКлиентСервер.ОбновитьФорму(Форма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповещениеОткрытьФормуПоискаДисконтнойКарты(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если РезультатОткрытияФормы <> Неопределено Тогда
		Оповестить("ПоискКартыЛояльности", РезультатОткрытияФормы, ДополнительныеПараметры);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповещениеОткрытьФормуВыдачиДисконтнойКарты(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если НЕ РезультатОткрытияФормы = Неопределено Тогда
		
		Если ВРЕГ(РезультатОткрытияФормы) = "ДА" Тогда
			Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
			ОткрытьФорму("Обработка.maxma_ИнтеграцияССервисом.Форма.ФормаВыдачиРедактированияДисконтнойКарты", ДополнительныеПараметры,,,,,, Режим);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповещениеВвестиПромокодЗавершение(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если РезультатОткрытияФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Форма.Объект.maxma_СтруктураПолей.ПараметрыПродажи.Промокод = РезультатОткрытияФормы.ВведенноеЧисло;
	
	ДополнительныеПараметры.Форма.maxma_НазначитьАвтоматическиеСкидкиКлиент();
	
	Если ДополнительныеПараметры.Форма.Объект.maxma_СтруктураПолей.ПараметрыПродажи.ОшибкаПримененияБонусов Тогда
		
		ДополнительныеПараметры.Форма.Объект.maxma_СтруктураПолей.ПараметрыПродажи.БонусовСписано = 0;
		ДополнительныеПараметры.Форма.Объект.maxma_СтруктураПолей.СтруктураБаллов.Списано = 0;
		
		ДополнительныеПараметры.Форма.maxma_НазначитьАвтоматическиеСкидкиКлиент();
		
	КонецЕсли;
	
	maxma_ИнтеграцияССервисомКлиентСервер.ОбновитьФорму(ДополнительныеПараметры.Форма);
	
КонецПроцедуры

Процедура ОповещениеВвестиБонусыЗавершение(РезультатОткрытияФормы, ДополнительныеПараметры) Экспорт
	
	Если РезультатОткрытияФормы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.Форма.Объект.maxma_СтруктураПолей.ПараметрыПродажи.БонусовСписано = РезультатОткрытияФормы.СуммаОплатыБонусами;
	
КонецПроцедуры

Функция ОткрытьФормуИнформации(ПараметрыИнформации, ОбработчикОповещения = Неопределено, ВладелецФормы = Неопределено) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗаголовокИнформации", ПараметрыИнформации.ЗаголовокИнформации);
	
	Если ПараметрыИнформации.Свойство("ТекстИнформации") Тогда
		ПараметрыФормы.Вставить("ТекстИнформации", ПараметрыИнформации.ТекстИнформации);
	КонецЕсли;
	
	Если ПараметрыИнформации.Свойство("ТипОтвета") И ЗначениеЗаполнено(ПараметрыИнформации.ТипОтвета) Тогда
		ПараметрыФормы.Вставить("ТипОтвета", ПараметрыИнформации.ТипОтвета);
	КонецЕсли;
	
	Если ПараметрыИнформации.Свойство("ОтветПоУмолчанию") И ЗначениеЗаполнено(ПараметрыИнформации.ОтветПоУмолчанию) Тогда
		ПараметрыФормы.Вставить("ОтветПоУмолчанию", ПараметрыИнформации.ОтветПоУмолчанию);
	КонецЕсли;
	
	Если ПараметрыИнформации.Свойство("ПоказатьПодсказку") И ПараметрыИнформации.ПоказатьПодсказку Тогда
		ПараметрыФормы.Вставить("Подсказка", ПараметрыИнформации.Подсказка);
	КонецЕсли;
	
	ИмяФормы = "Обработка.maxma_ИнтеграцияССервисом.Форма.ФормаИнформацииОбОшибке";
	Если ВладелецФормы = Неопределено Тогда
		ОткрытьФорму(ИмяФормы, ПараметрыФормы,,,,, ОбработчикОповещения, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	Иначе
		ОткрытьФорму(ИмяФормы, ПараметрыФормы, ВладелецФормы,,,, ОбработчикОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецФункции

Процедура УстановитьМаскуНомераТелефона(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	СтруктураМаски = maxma_ИнтеграцияССервисомВызовСервера.ПолучитьМаскуНомераТелефона(Форма.КодСтраны);
	
	Элементы.КодТелефона.Маска         = СтруктураМаски.КодТелефона;
	Элементы.НомерТелефонаЧасть1.Маска = СтруктураМаски.НомерТелефонаЧасть1;
	Элементы.НомерТелефонаЧасть2.Маска = СтруктураМаски.НомерТелефонаЧасть2;
	Элементы.НомерТелефонаЧасть3.Маска = СтруктураМаски.НомерТелефонаЧасть3;
	
	Форма.СтруктураМаски = СтруктураМаски;
	
КонецПроцедуры

Процедура ОбработатьКодыОшибок(Форма) Экспорт
	
	Если Форма.Объект.maxma_СтруктураПолей.ПараметрыПродажи.КодОшибки = 7 Тогда
		
		maxma_ИнтеграцияССервисомВызовСервера.ОбработатьСчитываниеКарты(, Форма.Объект.maxma_СтруктураПолей);
		
		Форма.Объект.ДисконтнаяКарта = ПредопределенноеЗначение("Справочник.ДисконтныеКарты.ПустаяСсылка");
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьПоискКарты(Форма, ПараметрыПоискаКарты)
	
	Если ПараметрыПоискаКарты = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеКлиента = maxma_ИнтеграцияССервисомВызовСервера.ДанныеКлиента(ПараметрыПоискаКарты.РежимПоискаКарты,
		ПараметрыПоискаКарты.ВведенноеЧисло,
		ПараметрыПоискаКарты.КодСтраны,
		Форма.Объект.maxma_СтруктураПолей.НастройкиМодуля,
		Форма.Объект.maxma_СтруктураПолей.СообщенияПользователю);
	
	Если ЗначениеЗаполнено(ДанныеКлиента.ТекстОшибки) И ДанныеКлиента.КодОшибки <> 3 Тогда
		ВывестиИнформациюРМКУправляемой(НСтр("ru = 'Ошибка ввода карты покупателя:'"), ДанныеКлиента.ТекстОшибки);
		Возврат;
	КонецЕсли;
	
	Если ДанныеКлиента.КартаНайдена Тогда
		
		Если ЗначениеЗаполнено(ДанныеКлиента.Клиент.phoneNumber) Тогда
			
			НомерТелефона = maxma_ИнтеграцияССервисомВызовСервера.РаспарситьНомерТелефона(
				ДанныеКлиента.Клиент.phoneNumber,
				ПараметрыПоискаКарты.КодСтраны);
				
			Форма.Объект.maxma_СтруктураПолей.ПараметрыПродажи.СтруктураНомераТелефона = НомерТелефона;
			
		КонецЕсли;
		
		РезультатПоискаКарты = Новый Структура;
		РезультатПоискаКарты.Вставить("НомерКартыТелефон", ПараметрыПоискаКарты.ВведенноеЧисло);
		РезультатПоискаКарты.Вставить("РежимПоиска",       ПараметрыПоискаКарты.РежимПоискаКарты);
		РезультатПоискаКарты.Вставить("Клиент",            ДанныеКлиента.Клиент);
		РезультатПоискаКарты.Вставить("ДисконтнаяКарта",   ДанныеКлиента.ДисконтнаяКарта);
		РезультатПоискаКарты.Вставить("КодСтраны",         ПараметрыПоискаКарты.КодСтраны);
		
		ОбработатьСчитываниеКарты(РезультатПоискаКарты, Форма);
		
	Иначе
		
		Если ДанныеКлиента.СетеваяОшибка Тогда
			
			СтруктураСообщения = Новый Структура;
			СтруктураСообщения.Вставить("ЗаголовокИнформации", НСтр("ru = 'Проблемы с интернет-соединением.'"));
			СтруктураСообщения.Вставить("ТекстИнформации",     НСтр("ru = 'Проблемы с интернет-соединением, повторите операцию позже.'"));
			
			ОткрытьФормуИнформации(СтруктураСообщения);
			
		Иначе
			
			ТекстВопроса = НСтр("ru = 'Карта лояльности не обнаружена. Выдать карту лояльности?'");
			
			ДополнительныеПараметры = Новый Структура;
			ДополнительныеПараметры.Вставить("ВведенноеЧисло",        ПараметрыПоискаКарты.ВведенноеЧисло);
			ДополнительныеПараметры.Вставить("МобильныйТелефон",      "");
			ДополнительныеПараметры.Вставить("РежимПоискаКарты",      ПараметрыПоискаКарты.РежимПоискаКарты);
			ДополнительныеПараметры.Вставить("КодСтраны",             ПараметрыПоискаКарты.КодСтраны);
			ДополнительныеПараметры.Вставить("Операция",              "ВыдачаКарты");
			ДополнительныеПараметры.Вставить("НастройкиМодуля",       Форма.Объект.maxma_СтруктураПолей.НастройкиМодуля);
			ДополнительныеПараметры.Вставить("СообщенияПользователю", Форма.Объект.maxma_СтруктураПолей.СообщенияПользователю);
			
			ОбработчикОповещения = Новый ОписаниеОповещения("ОповещениеОткрытьФормуВыдачиДисконтнойКарты", ЭтотОбъект, ДополнительныеПараметры);
			
			ВывестиВопросДляРМКУправляемой(
				НСтр("ru = 'Карта лояльности не обнаружена.'"),
				НСтр("ru = 'Выдать карту лояльности?'"),,
				ОбработчикОповещения);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьСчитываниеКарты(РезультатПоискаКарты, Форма)
	
	Если РезультатПоискаКарты.Свойство("Клиент") Тогда
		maxma_ИнтеграцияССервисомВызовСервера.ОбработатьСчитываниеКарты(РезультатПоискаКарты, Форма.Объект.maxma_СтруктураПолей);
	Иначе
		maxma_ИнтеграцияССервисомВызовСервера.ОбработатьСчитываниеКарты(, Форма.Объект.maxma_СтруктураПолей);
	КонецЕсли;
	
	Форма.Объект.ДисконтнаяКарта = РезультатПоискаКарты.ДисконтнаяКарта;
	
	Форма.maxma_НазначитьАвтоматическиеСкидкиКлиент();
	
КонецПроцедуры

#КонецОбласти 

#Область ВыводСообщений

Процедура ВывестиСообщения(ПараметрыСообщения, ДополнительноеОписаниеОшибки = "") Экспорт
	
	Если ЗначениеЗаполнено(ПараметрыСообщения) 
		И ПараметрыСообщения.Свойство("ЗаголовокИнформации")
		И ПараметрыСообщения.Свойство("ТекстИнформации") 
		И ЗначениеЗаполнено(ПараметрыСообщения.ТекстИнформации) Тогда
		
		ШаблонСообщения = Нстр("ru = '%1
		|%2'");
		
		ПараметрыСообщения.ТекстИнформации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, 
		ПараметрыСообщения.ТекстИнформации, ДополнительноеОписаниеОшибки);
		
		ОткрытьФормуИнформации(ПараметрыСообщения);
		
		ПараметрыСообщения = maxma_ИнтеграцияССервисомВызовСервера.ПолучитьСтруктуруВыводимойВРМКИнформации();
		
	КонецЕсли;
	
КонецПроцедуры

Функция ВывестиИнформациюРМКУправляемой(ЗаголовокИнформации, 
									   ТекстИнформации = Неопределено, 
									   ОбработчикОповещения = Неопределено,
									   ВладелецФормы = Неопределено) Экспорт

	ПараметрыИнформации = maxma_ИнтеграцияССервисомВызовСервера.ПолучитьСтруктуруВыводимойВРМКИнформации();
	ПараметрыИнформации.ЗаголовокИнформации = ЗаголовокИнформации;
	Если ТекстИнформации = Неопределено Тогда
		ПараметрыИнформации.ТекстИнформации = Символы.Таб;
	Иначе
		ПараметрыИнформации.ТекстИнформации = ТекстИнформации;
	КонецЕсли;
	
	ОткрытьФормуИнформации(ПараметрыИнформации, ОбработчикОповещения, ВладелецФормы);
	
КонецФункции

Функция ВывестиВопросДляРМКУправляемой(ЗаголовокИнформации, 
									   ТекстИнформации = Неопределено, 
									   ОтветПоУмолчанию = "Нет", 
									   ОбработчикОповещения = Неопределено,
									   ВладелецФормы = Неопределено) Экспорт

	ПараметрыИнформации = maxma_ИнтеграцияССервисомВызовСервера.ПолучитьСтруктуруВыводимойВРМКИнформации();
	ПараметрыИнформации.ЗаголовокИнформации = ЗаголовокИнформации;
	Если ТекстИнформации = Неопределено Тогда
		ПараметрыИнформации.ТекстИнформации = Символы.Таб;
	Иначе
		ПараметрыИнформации.ТекстИнформации = ТекстИнформации;
	КонецЕсли;
	ПараметрыИнформации.ТипОтвета           = "Вопрос";
	ПараметрыИнформации.ОтветПоУмолчанию    = ОтветПоУмолчанию;
	
	ОткрытьФормуИнформации(ПараметрыИнформации, ОбработчикОповещения, ВладелецФормы);
	
КонецФункции

Процедура СообщитьПользователю(Знач ТекстСообщенияПользователю,	Знач КлючДанных = Неопределено,
	Знач Поле = "", Знач ПутьКДанным = "", Отказ = Ложь) Экспорт
	
	Сообщение = СообщениеПользователю(ТекстСообщенияПользователю,
		КлючДанных, Поле, ПутьКДанным, Отказ);
	
	Сообщение.Сообщить()
	
КонецПроцедуры

Функция СообщениеПользователю(
		Знач ТекстСообщенияПользователю,
		Знач КлючДанных,
		Знач Поле,
		Знач ПутьКДанным = "",
		Отказ = Ложь,
		ЭтоОбъект = Ложь) Экспорт
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = ТекстСообщенияПользователю;
	Сообщение.Поле = Поле;
	
	Если ЭтоОбъект Тогда
		Сообщение.УстановитьДанные(КлючДанных);
	Иначе
		Сообщение.КлючДанных = КлючДанных;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ПутьКДанным) Тогда
		Сообщение.ПутьКДанным = ПутьКДанным;
	КонецЕсли;
	
	Отказ = Истина;
	
	Возврат Сообщение;
	
КонецФункции

#КонецОбласти 

#Область ПодарочныеКарты

Процедура АктивацияПодарочнойКартыЗавершение(РезультатАктивации, ДополнительныеПараметры) Экспорт
	
	Если РезультатАктивации <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Форма.maxma_ПодарочныеКарты.Добавить(), РезультатАктивации);
	Иначе
		
		ЕстьИзменения = УдалитьНеАктивированныеСертификатыИзТЧТовары(ДополнительныеПараметры.Форма);
		
		Если ЕстьИзменения Тогда	
			//ОбщегоНазначенияРМККлиентСервер.СуммаДокумента(Объект);
			//ПересчитатьИтогиТабличнойЧастиТовары(Ложь);	
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

Функция УдалитьНеАктивированныеСертификатыИзТЧТовары(Форма)
	
	ЕстьИзменения = Ложь;
	МассивСтрокДляУдаления = Новый Массив;
	Для Каждого СтрокаТЧ Из Форма.Объект.Товары Цикл
		
		Если Не maxma_ИнтеграцияССервисомВызовСервера.ЭтоПодарочнаяКарта(СтрокаТЧ.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		МассивПодарочныхКарт 	 = Форма.maxma_ПодарочныеКарты.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТЧ.Номенклатура));
		АктивированоСертификатов = МассивПодарочныхКарт.Количество();
			
		Если АктивированоСертификатов Тогда
			
			Разница = СтрокаТЧ.КоличествоУпаковок - АктивированоСертификатов;
			
			Если Разница>0 Тогда
				СтрокаТЧ.КоличествоУпаковок = СтрокаТЧ.КоличествоУпаковок - Разница;
				Форма.ТоварыПриИзмененииКоличестваУпаковок(СтрокаТЧ, СтрокаТЧ.КоличествоУпаковок + Разница); 
				ЕстьИзменения = Истина;
			КонецЕсли;
			
		Иначе
			МассивСтрокДляУдаления.Добавить(СтрокаТЧ);
		КонецЕсли;
	
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из МассивСтрокДляУдаления Цикл
		Форма.Объект.Товары.Удалить(СтрокаТЧ);
		ЕстьИзменения = Истина;
	КонецЦикла;
	
	Возврат ЕстьИзменения;
	
КонецФункции

Процедура ДополнитьСписокПодарочныхКарт(ТаблицаПодарочныеКарты, ТЧТовары, Знач maxma_СтруктураПолей)
	
	Номенклатура_ПодарочныеКарты = maxma_ИнтеграцияССервисомВызовСервера.ПолучитьМассивПодарочныхКарт();
	
	СоответствиеПодарочныеКарты = Новый Соответствие;
			
	// Удалили все подарочные карты из товаров,
	// сначала пытаемся деактивироавть, затем удаляем
	Для Каждого СтрокаТЗ Из ТаблицаПодарочныеКарты Цикл
		
		НайденныеСтроки = ТЧТовары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТЗ.Номенклатура));
		
		Если НайденныеСтроки.Количество() Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТЗ.СекретныйКод) Тогда
			
			ВходящиеПараметры = Новый Структура();
			ВходящиеПараметры.Вставить("Номенклатура", 		   СтрокаТЗ.Номенклатура);
			ВходящиеПараметры.Вставить("КодКарты", 	   		   СтрокаТЗ.СекретныйКод);
			ВходящиеПараметры.Вставить("ИдентификаторПродажи", maxma_СтруктураПолей.ПараметрыПродажи.ИдентификаторПродажи);
			
			maxma_ИнтеграцияССервисомВызовСервера.ДеактивироватьПодарочнуюКартуНаСервере(ВходящиеПараметры, maxma_СтруктураПолей.НастройкиМодуля);
			
		КонецЕсли;
		
		ТаблицаПодарочныеКарты.Удалить(СтрокаТЗ);
		
	КонецЦикла;
	
	Для Каждого СтрокаТоваров Из ТЧТовары Цикл	
		
		Если Номенклатура_ПодарочныеКарты.Найти(СтрокаТоваров.Номенклатура) <> Неопределено Тогда
			
			КоличествоПодарочныхКарт = СоответствиеПодарочныеКарты.Получить(СтрокаТоваров.Номенклатура);
			Если КоличествоПодарочныхКарт = Неопределено Тогда
				СоответствиеПодарочныеКарты.Вставить(СтрокаТоваров.Номенклатура, СтрокаТоваров.КоличествоУпаковок);
			Иначе
				СоответствиеПодарочныеКарты.Вставить(СтрокаТоваров.Номенклатура, КоличествоПодарочныхКарт + СтрокаТоваров.КоличествоУпаковок);
			КонецЕсли;
			
		КонецЕсли;	
		
	КонецЦикла;
	
	Для Каждого КлючИЗначение Из СоответствиеПодарочныеКарты Цикл
		
		НайденныеСтроки = ТаблицаПодарочныеКарты.НайтиСтроки(Новый Структура("Номенклатура", КлючИЗначение.Ключ));
		НайденныеСтрокиНеактивированныеКарты = ТаблицаПодарочныеКарты.НайтиСтроки(Новый Структура("Номенклатура, СекретныйКод", КлючИЗначение.Ключ, ""));
		
		КоличествоПодарочныхКарт 				 = НайденныеСтроки.Количество();
		КоличествоНеактивированныхПодарочныхКарт = НайденныеСтрокиНеактивированныеКарты.Количество();
		
		Если КоличествоПодарочныхКарт < КлючИЗначение.Значение Тогда // Увеличили количество в строке товаров
			
			Разница = КлючИЗначение.Значение - КоличествоПодарочныхКарт;
			
			Для сч = 1 По Разница Цикл
				НоваяСтрока 			 = ТаблицаПодарочныеКарты.Добавить();
				НоваяСтрока.Номенклатура = КлючИЗначение.Ключ;
			КонецЦикла;
			
		ИначеЕсли КоличествоПодарочныхКарт > КлючИЗначение.Значение Тогда 
			
			// Уменьшили количество в строке товаров
			// Удалять можем только неактивированные подарочные карты,
			// если карту уже активировали, а после этого уменьшили количество в строке товаров,
			// необходимо сообщить, что карту нужно деактивировать
			
			Разница = КоличествоПодарочныхКарт - КлючИЗначение.Значение;
			
			Если Разница > КоличествоНеактивированныхПодарочныхКарт Тогда
				Разница = КоличествоНеактивированныхПодарочныхКарт;
			КонецЕсли;
			
			Если Разница = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			УдаленоКарт = 0;
			Для Каждого СтрокаМассива Из НайденныеСтрокиНеактивированныеКарты Цикл
				
				ТаблицаПодарочныеКарты.Удалить(СтрокаМассива);
				
				УдаленоКарт = УдаленоКарт +1;
				
				Если УдаленоКарт = Разница Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
			Разница = Разница - УдаленоКарт;
			
			Если Разница = 0 Тогда	
				Продолжить;	
			КонецЕсли;
			
			УдаленоКарт = 0;
			
			// Уменьшили количество в строке товаров
			// Остались только активированные подарочные карты, сначала пытаемся деактивироавть, затем удаляем
			Для Каждого СтрокаМассива Из НайденныеСтроки Цикл
				
				Если ЗначениеЗаполнено(СтрокаМассива.СекретныйКод) Тогда
					
					ВходящиеПараметры = Новый Структура();
					ВходящиеПараметры.Вставить("Номенклатура", 		   СтрокаМассива.Номенклатура);
					ВходящиеПараметры.Вставить("КодКарты", 	   		   СтрокаМассива.СекретныйКод);
					ВходящиеПараметры.Вставить("ИдентификаторПродажи", maxma_СтруктураПолей.ПараметрыПродажи.ИдентификаторПродажи);
					
					maxma_ИнтеграцияССервисомВызовСервера.ДеактивироватьПодарочнуюКартуНаСервере(ВходящиеПараметры, maxma_СтруктураПолей.НастройкиМодуля);
					
				КонецЕсли;
				
				ТаблицаПодарочныеКарты.Удалить(СтрокаМассива);
				
				УдаленоКарт = УдаленоКарт +1;
				
				Если УдаленоКарт = Разница Тогда
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьПодарочныеКартыПередОплатой(Форма, Отказ) Экспорт
	
	Если Не maxma_ИнтеграцияССервисомКлиентСервер.ИспользоватьПрограммуЛояльности(Форма.Объект.maxma_СтруктураПолей) Тогда
		Возврат;
	КонецЕсли;
	
	ДополнитьСписокПодарочныхКарт(Форма.maxma_ПодарочныеКарты, Форма.Объект.Товары, Форма.Объект.maxma_СтруктураПолей);
	
	Если Форма.maxma_ПодарочныеКарты.НайтиСтроки(Новый Структура("СекретныйКод", "")).Количество() Тогда
		
		ПараметрыИнформации 					= Новый Структура("ЗаголовокИнформации, ТекстИнформации");
		ПараметрыИнформации.ЗаголовокИнформации = НСтр("ru = 'Подарочные карты'");
		ПараметрыИнформации.ТекстИнформации 	= НСтр("ru = 'Есть неактивированные подарочные карты.
		|Для проведения операции их необходимо активировать или удалить из списка товаров.
		|Активация доступна по кнопке ""Подарочные карты"".'");
		
		maxma_ИнтеграцияССервисомКлиент.ОткрытьФормуИнформации(ПараметрыИнформации);
		
		Отказ = Истина;
		
		Если Не Форма.Доступность Тогда
			Форма.Доступность = Истина;
		КонецЕсли;

	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
