
&После("ФормаПечатьЭтикетокИЦенниковПриСозданииНаСервере")
Процедура спФормаПечатьЭтикетокИЦенниковПриСозданииНаСервере(Форма)
	
	Параметры = Форма.Параметры;
	
	Если Параметры.Свойство("ПечатьИзДокументаПриемки") Тогда
		
		Объект = Форма.Объект;
		ДокументПриемки = Параметры.ДокументПриемки;
		РежимПечати = Параметры.РежимПечати;
		ШаблонЦенникаПоУмолчанию = спУправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("спШаблонЦенникаПоУмолчанию");
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	спПриемкаТовара.СтруктурнаяЕдиницаПолучатель КАК ТорговыйОбъектБПО,
		|	спПриемкаТовара.ВидЦены КАК ВидЦены,
		|	спПриемкаТовараЗапасы.Номенклатура КАК НоменклатураБПО,
		|	спПриемкаТовараЗапасы.ЕдиницаИзмерения КАК УпаковкаБПО,
		|	СУММА(спПриемкаТовараЗапасы.КоличествоФакт) КАК Количество,
		|	спПриемкаТовара.ШаблонЦенникаЭтикетки КАК ШаблонЦенникаЭтикетки
		|ПОМЕСТИТЬ ВТ_ДанныеДокумента
		|ИЗ
		|	Документ.спПриемкаТовара КАК спПриемкаТовара
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.спПриемкаТовара.Запасы КАК спПриемкаТовараЗапасы
		|		ПО спПриемкаТовара.Ссылка = спПриемкаТовараЗапасы.Ссылка
		|ГДЕ
		|	спПриемкаТовара.Ссылка = &ДокументПриемки
		|
		|СГРУППИРОВАТЬ ПО
		|	спПриемкаТовара.СтруктурнаяЕдиницаПолучатель,
		|	спПриемкаТовара.ВидЦены,
		|	спПриемкаТовараЗапасы.Номенклатура,
		|	спПриемкаТовараЗапасы.ЕдиницаИзмерения,
		|	спПриемкаТовара.ШаблонЦенникаЭтикетки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЦеныНоменклатурыСрезПоследних.ВидЦен КАК ВидЦен,
		|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
		|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена,
		|	ЦеныНоменклатурыСрезПоследних.ВалютаЦены КАК ВалютаЦены
		|ПОМЕСТИТЬ ВТ_Цены
		|ИЗ
		|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|			&ДатаПолученияЦен,
		|			(ВидЦен, Номенклатура) В
		|				(ВЫБРАТЬ
		|					ВТ_ДанныеДокумента.ВидЦены КАК ВидЦены,
		|					ВТ_ДанныеДокумента.НоменклатураБПО КАК НоменклатураБПО
		|				ИЗ
		|					ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК ЦеныНоменклатурыСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеДокумента.ТорговыйОбъектБПО КАК ТорговыйОбъектБПО,
		|	ВТ_ДанныеДокумента.ВидЦены КАК ВидЦены,
		|	ИСТИНА КАК Выбран,
		|	ВТ_ДанныеДокумента.НоменклатураБПО КАК НоменклатураБПО,
		|	ВТ_ДанныеДокумента.УпаковкаБПО КАК УпаковкаБПО,
		|	&ОрганизацияБПО КАК ОрганизацияБПО,
		|	ЕСТЬNULL(ВТ_Цены.Цена, 0) КАК Цена,
		|	ЕСТЬNULL(ВТ_Цены.ВалютаЦены, НЕОПРЕДЕЛЕНО) КАК Валюта,
		|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Штрихкод, """") КАК Штрихкод,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеДокумента.ШаблонЦенникаЭтикетки = ЗНАЧЕНИЕ(Справочник.ШаблоныЭтикетокИЦенниковБПО.ПустаяСсылка)
		|			ТОГДА &ШаблонЦенникаПоУмолчанию
		|		ИНАЧЕ ВТ_ДанныеДокумента.ШаблонЦенникаЭтикетки
		|	КОНЕЦ КАК ШаблонЦенникаЭтикетки,
		|	ВТ_ДанныеДокумента.Количество КАК Количество,
		|	&РежимПечати КАК РежимПечати
		|ИЗ
		|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
		|		ПО ВТ_ДанныеДокумента.ВидЦены = ВТ_Цены.ВидЦен
		|			И ВТ_ДанныеДокумента.НоменклатураБПО = ВТ_Цены.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО ВТ_ДанныеДокумента.НоменклатураБПО = ШтрихкодыНоменклатуры.Номенклатура
		|			И НЕ (НЕ ШтрихкодыНоменклатуры.ЕдиницаИзмерения = ЗНАЧЕНИЕ(Справочник.ЕдиницыИзмерения.ПустаяСсылка) 
		|			И НЕ ВТ_ДанныеДокумента.УпаковкаБПО = ШтрихкодыНоменклатуры.ЕдиницаИзмерения)
		|ИТОГИ
		|	МАКСИМУМ(ВидЦены),
		|	МАКСИМУМ(РежимПечати)
		|ПО
		|	ТорговыйОбъектБПО";
		
		Форма.ЦеныНаДату = НачалоДня(ТекущаяДатаСеанса() + 86400);
		 
		Запрос.УстановитьПараметр("ДатаПолученияЦен", Форма.ЦеныНаДату);
		Запрос.УстановитьПараметр("ДокументПриемки", ДокументПриемки);
		Запрос.УстановитьПараметр("ОрганизацияБПО", Справочники.Организации.ОрганизацияПоУмолчанию());
		Запрос.УстановитьПараметр("РежимПечати", РежимПечати);
		Запрос.УстановитьПараметр("ШаблонЦенникаПоУмолчанию", ШаблонЦенникаПоУмолчанию);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Шапка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Шапка.Следующий() Цикл
			
			ЗаполнитьЗначенияСвойств(Объект, Шапка);
			
			Товар = Шапка.Выбрать();
			
			Объект.Товары.Очистить();
			
			Пока Товар.Следующий() Цикл
				
				НоваяСтрока = Объект.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Товар);	
				
			КонецЦикла; 
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
