#Область ПрограммныйИнтерфейс

// Функция - Подключить коннектор
// 
// Возвращаемое значение:
//  WSПрокси, HTTPСоединение - объект соединения с web-сервисом.
//
Функция ПодключитьКоннектор(Сессия) Экспорт
	Если ТипЗнч(Сессия) = Тип("COMОбъект") Тогда	
		ПодключитьCOMОбъект(Сессия);
	КонецЕсли;			

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - Подключить COMОбъект
//
// Параметры: 
// 
// Возвращаемое значение:
// COMОбъект - сформированный объект COMОбъект.
//
Функция ПодключитьCOMОбъект(Сессия)
	ПодключениеsFTP = спФункцииРаботыXMLВызовСервера.ПолучитьЗначенияКонстант();
	
	//Создаем объект SessionOptions
	Настройки = Новый COMОбъект("WinSCP.SessionOptions");   
	Настройки.HostName = ПодключениеsFTP.sFTPСервер;
	Настройки.UserName = ПодключениеsFTP.sFTPЛогин;
	Настройки.Password = ПодключениеsFTP.sFTPПароль;
	Настройки.PortNumber = ПодключениеsFTP.sFTPПорт; 
	Настройки.SshHostKeyFingerprint = ПодключениеsFTP.спsFTPSHHКлюч; 
	
	// Подключаемся 
	Сессия.Open(Настройки);
КонецФункции

#КонецОбласти