#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СформироватьДеревоСайта() Экспорт
	
	Запрос = Новый Запрос;
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтруктураКаталогаИнтернетМагазина.НастройкаИнтеграции КАК НастройкаИнтеграции,
		|	СтруктураКаталогаИнтернетМагазина.ИдентификаторКаталога КАК ИдентификаторКаталога,
		|	СтруктураКаталогаИнтернетМагазина.Идентификатор КАК Идентификатор
		|ПОМЕСТИТЬ ВТ_ГруппыДереваСайта
		|ИЗ
		|	РегистрСведений.СтруктураКаталогаИнтернетМагазина КАК СтруктураКаталогаИнтернетМагазина
		|ГДЕ
		|	СтруктураКаталогаИнтернетМагазина.ЭтоГруппа
		|
		|СГРУППИРОВАТЬ ПО
		|	СтруктураКаталогаИнтернетМагазина.НастройкаИнтеграции,
		|	СтруктураКаталогаИнтернетМагазина.Идентификатор,
		|	СтруктураКаталогаИнтернетМагазина.ИдентификаторКаталога
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ГруппыДереваСайта.НастройкаИнтеграции КАК НастройкаИнтеграции,
		|	ВТ_ГруппыДереваСайта.ИдентификаторКаталога КАК ИдентификаторКаталога,
		|	ВТ_ГруппыДереваСайта.Идентификатор КАК РодительИдентификатор,
		|	спНастройкиФормированияДереваСайта.Группа1С КАК Группа1С,
		|	спНастройкиФормированияДереваСайта.ИмяРеквизита КАК ИмяРеквизита,
		|	спНастройкиФормированияДереваСайта.ИмяДопРеквизита КАК ИмяДопРеквизита,
		|	спНастройкиФормированияДереваСайта.ЗначениеРеквизита КАК ЗначениеРеквизита,
		|	спНастройкиФормированияДереваСайта.ЗначениеДопРеквизита КАК ЗначениеДопРеквизита,
		|	спНастройкиФормированияДереваСайта.МаксимальныйРост КАК МаксимальныйРост,
		|	спНастройкиФормированияДереваСайта.МинимальныйРост КАК МинимальныйРост
		|ПОМЕСТИТЬ ВТ_НастройкиДереваСайта
		|ИЗ
		|	ВТ_ГруппыДереваСайта КАК ВТ_ГруппыДереваСайта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.спНастройкиФормированияДереваСайта КАК спНастройкиФормированияДереваСайта
		|		ПО ВТ_ГруппыДереваСайта.НастройкаИнтеграции = спНастройкиФормированияДереваСайта.НастройкаИнтеграции
		|			И ВТ_ГруппыДереваСайта.ИдентификаторКаталога = спНастройкиФормированияДереваСайта.ИдентификаторКаталога
		|			И ВТ_ГруппыДереваСайта.Идентификатор = спНастройкиФормированияДереваСайта.ИдентификаторГруппыСайта
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НастройкиДереваСайта.Группа1С КАК Группа1С,
		|	ВТ_НастройкиДереваСайта.ИмяРеквизита КАК ИмяРеквизита
		|ИЗ
		|	ВТ_НастройкиДереваСайта КАК ВТ_НастройкиДереваСайта
		|ГДЕ
		|	ВТ_НастройкиДереваСайта.ИмяРеквизита <> """"
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НастройкиДереваСайта.ИмяРеквизита,
		|	ВТ_НастройкиДереваСайта.Группа1С";
		
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
    
	МассивЗапросов = Новый Массив;

	МассивЗапросовТовара = Новый Массив;
	
	Индекс = 0;
	
	МассивЗапросовТовара.Добавить(
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	НЕОПРЕДЕЛЕНО КАК ЗначениеРеквизита,
		|	"""" КАК ИмяРеквизита
		|ПОМЕСТИТЬ ВТ_Товары
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ
		|			(ВЫБРАТЬ
		|            Т.Группа1С КАК Группа1С
		|            ИЗ 
		|               ВТ_НастройкиДереваСайта КАК Т)
		|	И НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления");
		
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрГруппы = СтрШаблон("Группа1С%1", Индекс);
		
		Текст = СтрШаблон(
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.%1 КАК ЗначениеРеквизита,
		|	""%1"" КАК ИмяРеквизита
		|
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ
		|			(&%2)
		|	И НЕ Номенклатура.ЭтоГруппа
		|	И НЕ Номенклатура.ПометкаУдаления", Выборка.ИмяРеквизита, ПараметрГруппы);
		
		Запрос.УстановитьПараметр(ПараметрГруппы, Выборка.Группа1С);
		
		МассивЗапросовТовара.Добавить(Текст);
		
		Индекс = Индекс + 1; 
		
	КонецЦикла;
	
	Разделитель = "
	|
	|ОБЪЕДИНИТЬ
	|";
	
	МассивЗапросов.Добавить(СтрСоединить(МассивЗапросовТовара, Разделитель)); 
	МассивЗапросов.Добавить(
		"ВЫБРАТЬ
		|	НоменклатураДополнительныеРеквизиты.Ссылка КАК Номенклатура,
		|	НоменклатураДополнительныеРеквизиты.Значение КАК ЗначениеДопРеквизита,
		|	НоменклатураДополнительныеРеквизиты.Свойство.Наименование + ""%"" КАК ИмяДопРеквизита,
		|	НоменклатураДополнительныеРеквизиты.Ссылка.Родитель КАК Группа,
		|	НоменклатураДополнительныеРеквизиты.Ссылка.Родитель.Родитель КАК Группа1,
		|	НоменклатураДополнительныеРеквизиты.Ссылка.Родитель.Родитель.Родитель КАК Группа2,
		|	НоменклатураДополнительныеРеквизиты.Ссылка.Родитель.Родитель.Родитель.Родитель КАК Группа3,
		|	ВЫБОР
		|		КОГДА НоменклатураДополнительныеРеквизиты.Ссылка.спРазмер.Рост <> 0
		|			ТОГДА НоменклатураДополнительныеРеквизиты.Ссылка.спРазмер.Рост
		|		КОГДА НоменклатураДополнительныеРеквизиты.Ссылка.спРазмер.Сантиметры <> 0
		|			ТОГДА НоменклатураДополнительныеРеквизиты.Ссылка.спРазмер.Сантиметры
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Рост,
		|	ВТ_Товары.ИмяРеквизита КАК ИмяРеквизита,
		|	ВТ_Товары.ЗначениеРеквизита КАК ЗначениеРеквизита
		|ПОМЕСТИТЬ ВТ_ТоварыГрупп
		|ИЗ
		|	ВТ_Товары КАК ВТ_Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО ВТ_Товары.Номенклатура = НоменклатураДополнительныеРеквизиты.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НастройкиДереваСайта.НастройкаИнтеграции КАК НастройкаИнтеграции,
		|	ВТ_НастройкиДереваСайта.ИдентификаторКаталога КАК ИдентификаторКаталога,
		|	ВТ_НастройкиДереваСайта.РодительИдентификатор КАК РодительИдентификатор,
		|	ВТ_ТоварыГрупп.Номенклатура КАК Номенклатура,
		|	ВТ_ТоварыГрупп.Номенклатура.Наименование КАК ГруппаКаталога
		|ПОМЕСТИТЬ ВТ_НовыеНастройкиДереваСайта
		|ИЗ
		|	ВТ_НастройкиДереваСайта КАК ВТ_НастройкиДереваСайта
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТоварыГрупп КАК ВТ_ТоварыГрупп
		|		ПО (НЕ(НЕ ВТ_НастройкиДереваСайта.Группа1С = ВТ_ТоварыГрупп.Группа
		|					И НЕ ВТ_НастройкиДереваСайта.Группа1С = ВТ_ТоварыГрупп.Группа1
		|					И НЕ ВТ_НастройкиДереваСайта.Группа1С = ВТ_ТоварыГрупп.Группа2
		|					И НЕ ВТ_НастройкиДереваСайта.Группа1С = ВТ_ТоварыГрупп.Группа3))
		|			И (ВЫБОР
		|				КОГДА ВТ_НастройкиДереваСайта.ИмяРеквизита = """"
		|						ИЛИ ВТ_НастройкиДереваСайта.ИмяРеквизита = ""спРазмер""
		|					ТОГДА ИСТИНА
		|				КОГДА ВТ_НастройкиДереваСайта.ИмяРеквизита = ВТ_ТоварыГрупп.ИмяРеквизита
		|					ТОГДА ВТ_НастройкиДереваСайта.ЗначениеРеквизита = ВТ_ТоварыГрупп.ЗначениеРеквизита
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА ВТ_НастройкиДереваСайта.ИмяДопРеквизита = """"
		|					ТОГДА ИСТИНА
		|				КОГДА ВТ_НастройкиДереваСайта.ИмяДопРеквизита ПОДОБНО ВТ_ТоварыГрупп.ИмяДопРеквизита
		|					ТОГДА ВТ_НастройкиДереваСайта.ЗначениеДопРеквизита = ВТ_ТоварыГрупп.ЗначениеДопРеквизита
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|			И (ВЫБОР
		|				КОГДА ВТ_НастройкиДереваСайта.ИмяРеквизита = ""спРазмер""
		|					ТОГДА ВЫБОР
		|								КОГДА ВТ_НастройкиДереваСайта.МаксимальныйРост = 0
		|									ТОГДА ВТ_НастройкиДереваСайта.ЗначениеРеквизита = ВТ_ТоварыГрупп.Номенклатура.спРазмер
		|								ИНАЧЕ ВТ_НастройкиДереваСайта.МаксимальныйРост >= ВТ_ТоварыГрупп.Рост
		|							КОНЕЦ
		|							И ВЫБОР
		|								КОГДА ВТ_НастройкиДереваСайта.МинимальныйРост = 0
		|									ТОГДА ИСТИНА
		|								ИНАЧЕ ВТ_НастройкиДереваСайта.МинимальныйРост <= ВТ_ТоварыГрупп.Рост
		|							КОНЕЦ
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НовыеНастройкиДереваСайта.НастройкаИнтеграции КАК НастройкаИнтеграции,
		|	ВТ_НовыеНастройкиДереваСайта.ИдентификаторКаталога КАК ИдентификаторКаталога,
		|	ВТ_НовыеНастройкиДереваСайта.РодительИдентификатор КАК РодительИдентификатор,
		|	ВТ_НовыеНастройкиДереваСайта.Номенклатура КАК Номенклатура,
		|	ВТ_НовыеНастройкиДереваСайта.ГруппаКаталога КАК ГруппаКаталога,
		|	МАКСИМУМ(ЕСТЬNULL(СтруктураКаталогаИнтернетМагазина.Идентификатор, НЕОПРЕДЕЛЕНО)) КАК Идентификатор,
		|	ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) КАК РодительГруппа,
		|	ЗНАЧЕНИЕ(Справочник.КатегорииНоменклатуры.ПустаяСсылка) КАК РодительКатегория,
		|	ЛОЖЬ КАК ЭтоГруппа
		|ИЗ
		|	ВТ_НовыеНастройкиДереваСайта КАК ВТ_НовыеНастройкиДереваСайта
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураКаталогаИнтернетМагазина КАК СтруктураКаталогаИнтернетМагазина
		|		ПО ВТ_НовыеНастройкиДереваСайта.НастройкаИнтеграции = СтруктураКаталогаИнтернетМагазина.НастройкаИнтеграции
		|			И ВТ_НовыеНастройкиДереваСайта.ИдентификаторКаталога = СтруктураКаталогаИнтернетМагазина.ИдентификаторКаталога
		|			И ВТ_НовыеНастройкиДереваСайта.РодительИдентификатор = СтруктураКаталогаИнтернетМагазина.РодительИдентификатор
		|			И ВТ_НовыеНастройкиДереваСайта.Номенклатура = СтруктураКаталогаИнтернетМагазина.Номенклатура
		|			И ВТ_НовыеНастройкиДереваСайта.ГруппаКаталога = СтруктураКаталогаИнтернетМагазина.ГруппаКаталога
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_НовыеНастройкиДереваСайта.НастройкаИнтеграции,
		|	ВТ_НовыеНастройкиДереваСайта.ИдентификаторКаталога,
		|	ВТ_НовыеНастройкиДереваСайта.РодительИдентификатор,
		|	ВТ_НовыеНастройкиДереваСайта.Номенклатура,
		|	ВТ_НовыеНастройкиДереваСайта.ГруппаКаталога
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтруктураКаталогаИнтернетМагазина.НастройкаИнтеграции,
		|	СтруктураКаталогаИнтернетМагазина.ИдентификаторКаталога,
		|	СтруктураКаталогаИнтернетМагазина.РодительИдентификатор,
		|	СтруктураКаталогаИнтернетМагазина.Номенклатура,
		|	СтруктураКаталогаИнтернетМагазина.ГруппаКаталога,
		|	СтруктураКаталогаИнтернетМагазина.Идентификатор,
		|	СтруктураКаталогаИнтернетМагазина.РодительГруппа,
		|	СтруктураКаталогаИнтернетМагазина.РодительКатегория,
		|	СтруктураКаталогаИнтернетМагазина.ЭтоГруппа
		|ИЗ
		|	РегистрСведений.СтруктураКаталогаИнтернетМагазина КАК СтруктураКаталогаИнтернетМагазина
		|ГДЕ
		|	СтруктураКаталогаИнтернетМагазина.ЭтоГруппа");
	
	Разделитель = "
	|;
	|///////////////////////////////////////////////////////////////////
	|";
	
	Запрос.Текст = СтрСоединить(МассивЗапросов, Разделитель);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	НаборЗаписей = РегистрыСведений.СтруктураКаталогаИнтернетМагазина.СоздатьНаборЗаписей();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		
		Если Не ЗначениеЗаполнено(Запись.Идентификатор) Тогда
			Запись.Идентификатор = Новый УникальныйИдентификатор;
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина); 
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
