
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Текст = НСтр("ru = 'Считайте подарочную карту при помощи сканера
		                   |штрихкода или введите штрихкод вручную'");
	Иначе
		Текст = НСтр("ru = 'Считайте подарочную карту при помощи сканера
		                   |штрихкода'");
	КонецЕсли;
	
	Параметры.Свойство("Номенклатура",         Номенклатура);
	Параметры.Свойство("ИдентификаторПродажи", ИдентификаторПродажи);
	Параметры.Свойство("НастройкиМодуля",      НастройкиМодуля);
	
	НадписьСчитываниеПодарочнойКарты = Текст;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Готово(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(КодКарты) Тогда
		
		ТекстСообщения = НСтр("ru = 'Штрихкод не заполнен.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			,
			"КодКарты");
		
		Возврат;
		
	КонецЕсли;
	
	ОбработатьПолученныйКодНаКлиенте(КодКарты);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбработатьПолученныйКодНаКлиенте(Данные)
	
	КодКарты = Данные;
	
	ВходящиеПараметры = Новый Структура("Номенклатура, КодКарты, ИдентификаторПродажи", Номенклатура, КодКарты, ИдентификаторПродажи);
	
	Результат = ОбработатьКодПодарочнойКартыНаСервере(ВходящиеПараметры, НастройкиМодуля);
	
	Если Результат.ЕстьОшибки Тогда
		
		ТекстСообщения = НСтр("ru = 'При активации подарочной карты с кодом ""%1"" произошла ошибка: %2.'");
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, КодКарты, Результат.ОписаниеОшибки),
		, "КодКарты");
		
		Возврат;
		
	КонецЕсли;
	
	Закрыть(Результат.ДанныеКарты);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьКодПодарочнойКартыНаСервере(ВходящиеПараметры, НастройкиОбмена)
	
	Возврат maxma_ИнтеграцияССервисомВызовСервера.ОбработатьКодПодарочнойКартыНаСервере(ВходящиеПараметры, НастройкиОбмена);
	
КонецФункции

#КонецОбласти
